; ModuleID = '<stdin>'
source_filename = "./dijkstra.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._QITEM = type { i32, i32, i32, %struct._QITEM* }
%struct._NODE = type { i32, i32 }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !2, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !15, nameTableKind: None)
!3 = !DIFile(filename: "dijkstra.c", directory: "/home/newton/cfiles/xmark")
!4 = !{}
!5 = !{!6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !9)
!8 = !DIFile(filename: "./dijkstra.c", directory: "/home/newton/cfiles/xmark")
!9 = !{!10, !12, !13, !14}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !7, file: !8, line: 40, baseType: !11, size: 32)
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !7, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !7, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !7, file: !8, line: 43, baseType: !6, size: 64, offset: 128)
!15 = !{!0, !16, !18, !27, !29, !31, !33}
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !2, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !2, file: !8, line: 49, type: !20, isLocal: false, isDefinition: true)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 2560, elements: !25)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !22)
!22 = !{!23, !24}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !21, file: !8, line: 35, baseType: !11, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !21, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!25 = !{!26}
!26 = !DISubrange(count: 40)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !2, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !2, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !2, file: !8, line: 53, type: !6, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !2, file: !8, line: 54, type: !35, isLocal: false, isDefinition: true)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192000, elements: !36)
!36 = !{!37}
!37 = !DISubrange(count: 1000)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 12800, elements: !40)
!39 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!40 = !{!26, !26}
!41 = !{i32 2, !"Dwarf Version", i32 4}
!42 = !{i32 2, !"Debug Info Version", i32 3}
!43 = !{i32 1, !"wchar_size", i32 4}
!44 = !{!"clang version 9.0.1-12 "}
!45 = distinct !DISubprogram(name: "dijkstra_init", scope: !8, file: !8, line: 70, type: !46, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !48)
!46 = !DISubroutineType(types: !47)
!47 = !{null}
!48 = !{!49, !50, !51}
!49 = !DILocalVariable(name: "i", scope: !45, file: !8, line: 72, type: !11)
!50 = !DILocalVariable(name: "k", scope: !45, file: !8, line: 72, type: !11)
!51 = !DILocalVariable(name: "x", scope: !45, file: !8, line: 73, type: !52)
!52 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !11)
!53 = !DILocation(line: 73, column: 3, scope: !45)
!54 = !DILocation(line: 73, column: 16, scope: !45)
!55 = !{!56, !56, i64 0}
!56 = !{!"int", !57, i64 0}
!57 = !{!"omnipotent char", !58, i64 0}
!58 = !{!"Simple C/C++ TBAA"}
!59 = !DILocation(line: 0, scope: !45)
!60 = !DILocation(line: 75, column: 3, scope: !61)
!61 = distinct !DILexicalBlock(scope: !45, file: !8, line: 75, column: 3)
!62 = !DILocation(line: 78, column: 39, scope: !63)
!63 = distinct !DILexicalBlock(scope: !64, file: !8, line: 77, column: 5)
!64 = distinct !DILexicalBlock(scope: !65, file: !8, line: 77, column: 5)
!65 = distinct !DILexicalBlock(scope: !66, file: !8, line: 75, column: 37)
!66 = distinct !DILexicalBlock(scope: !61, file: !8, line: 75, column: 3)
!67 = !DILocation(line: 78, column: 7, scope: !63)
!68 = !DILocation(line: 78, column: 36, scope: !63)
!69 = !{!57, !57, i64 0}
!70 = !DILocation(line: 75, column: 32, scope: !66)
!71 = !DILocation(line: 75, column: 18, scope: !66)
!72 = distinct !{!72, !60, !73}
!73 = !DILocation(line: 79, column: 3, scope: !61)
!74 = !DILocation(line: 81, column: 23, scope: !45)
!75 = !DILocation(line: 82, column: 22, scope: !45)
!76 = !DILocation(line: 83, column: 22, scope: !45)
!77 = !{!78, !78, i64 0}
!78 = !{!"any pointer", !57, i64 0}
!79 = !DILocation(line: 85, column: 21, scope: !45)
!80 = !DILocation(line: 86, column: 1, scope: !45)
!81 = distinct !DISubprogram(name: "dijkstra_return", scope: !8, file: !8, line: 88, type: !82, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!82 = !DISubroutineType(types: !83)
!83 = !{!11}
!84 = !DILocation(line: 90, column: 14, scope: !81)
!85 = !DILocation(line: 90, column: 32, scope: !81)
!86 = !DILocation(line: 90, column: 12, scope: !81)
!87 = !DILocation(line: 90, column: 3, scope: !81)
!88 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !89, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !91)
!89 = !DISubroutineType(types: !90)
!90 = !{!11, !11, !11, !11}
!91 = !{!92, !93, !94, !95, !96}
!92 = !DILocalVariable(name: "node", arg: 1, scope: !88, file: !8, line: 93, type: !11)
!93 = !DILocalVariable(name: "dist", arg: 2, scope: !88, file: !8, line: 93, type: !11)
!94 = !DILocalVariable(name: "prev", arg: 3, scope: !88, file: !8, line: 93, type: !11)
!95 = !DILocalVariable(name: "newItem", scope: !88, file: !8, line: 95, type: !6)
!96 = !DILocalVariable(name: "last", scope: !88, file: !8, line: 96, type: !6)
!97 = !DILocation(line: 0, scope: !88)
!98 = !DILocation(line: 95, column: 50, scope: !88)
!99 = !DILocation(line: 95, column: 29, scope: !88)
!100 = !DILocation(line: 96, column: 25, scope: !88)
!101 = !DILocation(line: 98, column: 8, scope: !102)
!102 = distinct !DILexicalBlock(scope: !88, file: !8, line: 98, column: 8)
!103 = !DILocation(line: 98, column: 29, scope: !102)
!104 = !DILocation(line: 98, column: 8, scope: !88)
!105 = !DILocation(line: 100, column: 12, scope: !88)
!106 = !DILocation(line: 100, column: 17, scope: !88)
!107 = !{!108, !56, i64 0}
!108 = !{!"_QITEM", !56, i64 0, !56, i64 4, !56, i64 8, !78, i64 16}
!109 = !DILocation(line: 101, column: 12, scope: !88)
!110 = !DILocation(line: 101, column: 17, scope: !88)
!111 = !{!108, !56, i64 4}
!112 = !DILocation(line: 102, column: 12, scope: !88)
!113 = !DILocation(line: 102, column: 17, scope: !88)
!114 = !{!108, !56, i64 8}
!115 = !DILocation(line: 103, column: 12, scope: !88)
!116 = !DILocation(line: 103, column: 17, scope: !88)
!117 = !{!108, !78, i64 16}
!118 = !DILocation(line: 105, column: 9, scope: !119)
!119 = distinct !DILexicalBlock(scope: !88, file: !8, line: 105, column: 8)
!120 = !DILocation(line: 105, column: 8, scope: !88)
!121 = !DILocation(line: 110, column: 19, scope: !122)
!122 = distinct !DILexicalBlock(scope: !119, file: !8, line: 107, column: 8)
!123 = !DILocation(line: 110, column: 5, scope: !122)
!124 = distinct !{!124, !123, !125}
!125 = !DILocation(line: 111, column: 20, scope: !122)
!126 = !DILocation(line: 0, scope: !119)
!127 = !DILocation(line: 114, column: 22, scope: !88)
!128 = !DILocation(line: 115, column: 3, scope: !88)
!129 = !DILocation(line: 116, column: 1, scope: !88)
!130 = !DILocalVariable(name: "newItem", scope: !131, file: !8, line: 95, type: !134)
!131 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !89, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !132, retainedNodes: !162)
!132 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !133, globals: !141, nameTableKind: None)
!133 = !{!134}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !136)
!136 = !{!137, !138, !139, !140}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !135, file: !8, line: 40, baseType: !11, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !135, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !135, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !135, file: !8, line: 43, baseType: !134, size: 64, offset: 128)
!141 = !{!142, !144, !146, !153, !155, !157, !159}
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !132, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !132, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !132, file: !8, line: 49, type: !148, isLocal: false, isDefinition: true)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 2560, elements: !25)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !150)
!150 = !{!151, !152}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !149, file: !8, line: 35, baseType: !11, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !149, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !132, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !132, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !132, file: !8, line: 53, type: !134, isLocal: false, isDefinition: true)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !132, file: !8, line: 54, type: !161, isLocal: false, isDefinition: true)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 192000, elements: !36)
!162 = !{!163, !164, !165, !130, !166}
!163 = !DILocalVariable(name: "node", arg: 1, scope: !131, file: !8, line: 93, type: !11)
!164 = !DILocalVariable(name: "dist", arg: 2, scope: !131, file: !8, line: 93, type: !11)
!165 = !DILocalVariable(name: "prev", arg: 3, scope: !131, file: !8, line: 93, type: !11)
!166 = !DILocalVariable(name: "last", scope: !131, file: !8, line: 96, type: !134)
!167 = distinct !DISubprogram(name: "dijkstra_dequeue", scope: !8, file: !8, line: 118, type: !168, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !171)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !170, !170, !170}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!171 = !{!172, !173, !174}
!172 = !DILocalVariable(name: "node", arg: 1, scope: !167, file: !8, line: 118, type: !170)
!173 = !DILocalVariable(name: "dist", arg: 2, scope: !167, file: !8, line: 118, type: !170)
!174 = !DILocalVariable(name: "prev", arg: 3, scope: !167, file: !8, line: 118, type: !170)
!175 = !DILocation(line: 0, scope: !167)
!176 = !DILocation(line: 120, column: 8, scope: !177)
!177 = distinct !DILexicalBlock(scope: !167, file: !8, line: 120, column: 8)
!178 = !DILocation(line: 120, column: 8, scope: !167)
!179 = !DILocation(line: 121, column: 33, scope: !180)
!180 = distinct !DILexicalBlock(scope: !177, file: !8, line: 120, column: 29)
!181 = !DILocation(line: 121, column: 11, scope: !180)
!182 = !DILocation(line: 122, column: 33, scope: !180)
!183 = !DILocation(line: 122, column: 11, scope: !180)
!184 = !DILocation(line: 123, column: 33, scope: !180)
!185 = !DILocation(line: 123, column: 11, scope: !180)
!186 = !DILocation(line: 124, column: 46, scope: !180)
!187 = !DILocation(line: 124, column: 24, scope: !180)
!188 = !DILocation(line: 125, column: 24, scope: !180)
!189 = !DILocation(line: 126, column: 3, scope: !180)
!190 = !DILocation(line: 127, column: 1, scope: !167)
!191 = distinct !DISubprogram(name: "dijkstra_qcount", scope: !8, file: !8, line: 129, type: !82, scopeLine: 130, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!192 = !DILocation(line: 131, column: 12, scope: !191)
!193 = !DILocation(line: 131, column: 3, scope: !191)
!194 = distinct !DISubprogram(name: "dijkstra_find", scope: !8, file: !8, line: 134, type: !195, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !197)
!195 = !DISubroutineType(types: !196)
!196 = !{!11, !11, !11}
!197 = !{!198, !199, !200, !201, !202, !203, !204, !205}
!198 = !DILocalVariable(name: "chStart", arg: 1, scope: !194, file: !8, line: 134, type: !11)
!199 = !DILocalVariable(name: "chEnd", arg: 2, scope: !194, file: !8, line: 134, type: !11)
!200 = !DILocalVariable(name: "ch", scope: !194, file: !8, line: 136, type: !11)
!201 = !DILocalVariable(name: "prev", scope: !194, file: !8, line: 137, type: !11)
!202 = !DILocalVariable(name: "node", scope: !194, file: !8, line: 137, type: !11)
!203 = !DILocalVariable(name: "cost", scope: !194, file: !8, line: 138, type: !11)
!204 = !DILocalVariable(name: "dist", scope: !194, file: !8, line: 138, type: !11)
!205 = !DILocalVariable(name: "i", scope: !194, file: !8, line: 139, type: !11)
!206 = !DILocation(line: 0, scope: !194)
!207 = !DILocation(line: 143, column: 34, scope: !208)
!208 = distinct !DILexicalBlock(scope: !209, file: !8, line: 142, column: 40)
!209 = distinct !DILexicalBlock(scope: !210, file: !8, line: 142, column: 3)
!210 = distinct !DILexicalBlock(scope: !194, file: !8, line: 142, column: 3)
!211 = !DILocation(line: 147, column: 16, scope: !212)
!212 = distinct !DILexicalBlock(scope: !194, file: !8, line: 147, column: 8)
!213 = !DILocation(line: 147, column: 8, scope: !194)
!214 = !DILocation(line: 149, column: 5, scope: !215)
!215 = distinct !DILexicalBlock(scope: !212, file: !8, line: 148, column: 10)
!216 = !DILocation(line: 149, column: 34, scope: !215)
!217 = !DILocation(line: 149, column: 39, scope: !215)
!218 = !{!219, !56, i64 0}
!219 = !{!"_NODE", !56, i64 0, !56, i64 4}
!220 = !DILocation(line: 150, column: 34, scope: !215)
!221 = !DILocation(line: 150, column: 39, scope: !215)
!222 = !{!219, !56, i64 4}
!223 = !DILocation(line: 0, scope: !88, inlinedAt: !224)
!224 = distinct !DILocation(line: 152, column: 10, scope: !225)
!225 = distinct !DILexicalBlock(scope: !215, file: !8, line: 152, column: 10)
!226 = !DILocation(line: 95, column: 50, scope: !88, inlinedAt: !224)
!227 = !DILocation(line: 95, column: 29, scope: !88, inlinedAt: !224)
!228 = !DILocation(line: 96, column: 25, scope: !88, inlinedAt: !224)
!229 = !DILocation(line: 98, column: 8, scope: !102, inlinedAt: !224)
!230 = !DILocation(line: 98, column: 29, scope: !102, inlinedAt: !224)
!231 = !DILocation(line: 98, column: 8, scope: !88, inlinedAt: !224)
!232 = !DILocation(line: 100, column: 12, scope: !88, inlinedAt: !224)
!233 = !DILocation(line: 100, column: 17, scope: !88, inlinedAt: !224)
!234 = !DILocation(line: 101, column: 12, scope: !88, inlinedAt: !224)
!235 = !DILocation(line: 101, column: 17, scope: !88, inlinedAt: !224)
!236 = !DILocation(line: 102, column: 12, scope: !88, inlinedAt: !224)
!237 = !DILocation(line: 102, column: 17, scope: !88, inlinedAt: !224)
!238 = !DILocation(line: 103, column: 12, scope: !88, inlinedAt: !224)
!239 = !DILocation(line: 103, column: 17, scope: !88, inlinedAt: !224)
!240 = !DILocation(line: 105, column: 9, scope: !119, inlinedAt: !224)
!241 = !DILocation(line: 105, column: 8, scope: !88, inlinedAt: !224)
!242 = !DILocation(line: 110, column: 19, scope: !122, inlinedAt: !224)
!243 = !DILocation(line: 110, column: 5, scope: !122, inlinedAt: !224)
!244 = distinct !{!244, !243, !245}
!245 = !DILocation(line: 111, column: 20, scope: !122, inlinedAt: !224)
!246 = !DILocation(line: 0, scope: !119, inlinedAt: !224)
!247 = !DILocation(line: 114, column: 22, scope: !88, inlinedAt: !224)
!248 = !DILocation(line: 157, column: 31, scope: !215)
!249 = !DILocation(line: 157, column: 5, scope: !215)
!250 = !DILocation(line: 120, column: 8, scope: !177, inlinedAt: !251)
!251 = distinct !DILocation(line: 158, column: 7, scope: !252)
!252 = distinct !DILexicalBlock(scope: !215, file: !8, line: 157, column: 37)
!253 = !DILocation(line: 120, column: 8, scope: !167, inlinedAt: !251)
!254 = !DILocation(line: 121, column: 33, scope: !180, inlinedAt: !251)
!255 = !DILocation(line: 122, column: 33, scope: !180, inlinedAt: !251)
!256 = !DILocation(line: 124, column: 46, scope: !180, inlinedAt: !251)
!257 = !DILocation(line: 124, column: 24, scope: !180, inlinedAt: !251)
!258 = !DILocation(line: 125, column: 24, scope: !180, inlinedAt: !251)
!259 = !DILocation(line: 126, column: 3, scope: !180, inlinedAt: !251)
!260 = !DILocation(line: 0, scope: !261)
!261 = distinct !DILexicalBlock(scope: !262, file: !8, line: 161, column: 14)
!262 = distinct !DILexicalBlock(scope: !263, file: !8, line: 160, column: 41)
!263 = distinct !DILexicalBlock(scope: !264, file: !8, line: 160, column: 7)
!264 = distinct !DILexicalBlock(scope: !252, file: !8, line: 160, column: 7)
!265 = !DILocation(line: 160, column: 7, scope: !264)
!266 = !DILocation(line: 161, column: 23, scope: !261)
!267 = !DILocation(line: 162, column: 49, scope: !268)
!268 = distinct !DILexicalBlock(scope: !269, file: !8, line: 162, column: 16)
!269 = distinct !DILexicalBlock(scope: !261, file: !8, line: 161, column: 67)
!270 = !DILocation(line: 162, column: 23, scope: !268)
!271 = !DILocation(line: 163, column: 55, scope: !268)
!272 = !DILocation(line: 163, column: 46, scope: !268)
!273 = !DILocation(line: 162, column: 56, scope: !268)
!274 = !DILocation(line: 164, column: 41, scope: !275)
!275 = distinct !DILexicalBlock(scope: !268, file: !8, line: 163, column: 68)
!276 = !DILocation(line: 165, column: 36, scope: !275)
!277 = !DILocation(line: 165, column: 41, scope: !275)
!278 = !DILocation(line: 0, scope: !88, inlinedAt: !279)
!279 = distinct !DILocation(line: 166, column: 18, scope: !280)
!280 = distinct !DILexicalBlock(scope: !275, file: !8, line: 166, column: 18)
!281 = !DILocation(line: 95, column: 29, scope: !88, inlinedAt: !279)
!282 = !DILocation(line: 98, column: 8, scope: !102, inlinedAt: !279)
!283 = !DILocation(line: 98, column: 29, scope: !102, inlinedAt: !279)
!284 = !DILocation(line: 98, column: 8, scope: !88, inlinedAt: !279)
!285 = !DILocation(line: 100, column: 12, scope: !88, inlinedAt: !279)
!286 = !DILocation(line: 100, column: 17, scope: !88, inlinedAt: !279)
!287 = !DILocation(line: 101, column: 12, scope: !88, inlinedAt: !279)
!288 = !DILocation(line: 101, column: 17, scope: !88, inlinedAt: !279)
!289 = !DILocation(line: 102, column: 12, scope: !88, inlinedAt: !279)
!290 = !DILocation(line: 102, column: 17, scope: !88, inlinedAt: !279)
!291 = !DILocation(line: 103, column: 12, scope: !88, inlinedAt: !279)
!292 = !DILocation(line: 103, column: 17, scope: !88, inlinedAt: !279)
!293 = !DILocation(line: 105, column: 9, scope: !119, inlinedAt: !279)
!294 = !DILocation(line: 105, column: 8, scope: !88, inlinedAt: !279)
!295 = !DILocation(line: 110, column: 19, scope: !122, inlinedAt: !279)
!296 = !DILocation(line: 110, column: 5, scope: !122, inlinedAt: !279)
!297 = distinct !{!297, !296, !298}
!298 = !DILocation(line: 111, column: 20, scope: !122, inlinedAt: !279)
!299 = !DILocation(line: 0, scope: !119, inlinedAt: !279)
!300 = !DILocation(line: 114, column: 22, scope: !88, inlinedAt: !279)
!301 = !DILocation(line: 166, column: 18, scope: !275)
!302 = !DILocation(line: 160, column: 36, scope: !263)
!303 = !DILocation(line: 160, column: 22, scope: !263)
!304 = distinct !{!304, !265, !305}
!305 = !DILocation(line: 170, column: 7, scope: !264)
!306 = !DILocation(line: 174, column: 1, scope: !194)
!307 = !DILocalVariable(name: "ch", scope: !308, file: !8, line: 136, type: !11)
!308 = distinct !DISubprogram(name: "dijkstra_find", scope: !8, file: !8, line: 134, type: !195, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !309, retainedNodes: !339)
!309 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !310, globals: !318, nameTableKind: None)
!310 = !{!311}
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !313)
!313 = !{!314, !315, !316, !317}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !312, file: !8, line: 40, baseType: !11, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !312, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !312, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !312, file: !8, line: 43, baseType: !311, size: 64, offset: 128)
!318 = !{!319, !321, !323, !330, !332, !334, !336}
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !309, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !309, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !309, file: !8, line: 49, type: !325, isLocal: false, isDefinition: true)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 2560, elements: !25)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !327)
!327 = !{!328, !329}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !326, file: !8, line: 35, baseType: !11, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !326, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !309, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !309, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !309, file: !8, line: 53, type: !311, isLocal: false, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !309, file: !8, line: 54, type: !338, isLocal: false, isDefinition: true)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 192000, elements: !36)
!339 = !{!340, !341, !307, !342, !343, !344, !345, !346}
!340 = !DILocalVariable(name: "chStart", arg: 1, scope: !308, file: !8, line: 134, type: !11)
!341 = !DILocalVariable(name: "chEnd", arg: 2, scope: !308, file: !8, line: 134, type: !11)
!342 = !DILocalVariable(name: "prev", scope: !308, file: !8, line: 137, type: !11)
!343 = !DILocalVariable(name: "node", scope: !308, file: !8, line: 137, type: !11)
!344 = !DILocalVariable(name: "cost", scope: !308, file: !8, line: 138, type: !11)
!345 = !DILocalVariable(name: "dist", scope: !308, file: !8, line: 138, type: !11)
!346 = !DILocalVariable(name: "i", scope: !308, file: !8, line: 139, type: !11)
!347 = !DILocalVariable(name: "node", arg: 1, scope: !348, file: !8, line: 93, type: !11)
!348 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !89, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !349, retainedNodes: !379)
!349 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !350, globals: !358, nameTableKind: None)
!350 = !{!351}
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !353)
!353 = !{!354, !355, !356, !357}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !352, file: !8, line: 40, baseType: !11, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !352, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !352, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !352, file: !8, line: 43, baseType: !351, size: 64, offset: 128)
!358 = !{!359, !361, !363, !370, !372, !374, !376}
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !349, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !349, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !349, file: !8, line: 49, type: !365, isLocal: false, isDefinition: true)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 2560, elements: !25)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !367)
!367 = !{!368, !369}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !366, file: !8, line: 35, baseType: !11, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !366, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !349, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !349, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !349, file: !8, line: 53, type: !351, isLocal: false, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !349, file: !8, line: 54, type: !378, isLocal: false, isDefinition: true)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 192000, elements: !36)
!379 = !{!347, !380, !381, !382, !383}
!380 = !DILocalVariable(name: "dist", arg: 2, scope: !348, file: !8, line: 93, type: !11)
!381 = !DILocalVariable(name: "prev", arg: 3, scope: !348, file: !8, line: 93, type: !11)
!382 = !DILocalVariable(name: "newItem", scope: !348, file: !8, line: 95, type: !351)
!383 = !DILocalVariable(name: "last", scope: !348, file: !8, line: 96, type: !351)
!384 = !DILocalVariable(name: "last", scope: !385, file: !8, line: 96, type: !388)
!385 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !89, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !386, retainedNodes: !416)
!386 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !387, globals: !395, nameTableKind: None)
!387 = !{!388}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !390)
!390 = !{!391, !392, !393, !394}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !389, file: !8, line: 40, baseType: !11, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !389, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !389, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !389, file: !8, line: 43, baseType: !388, size: 64, offset: 128)
!395 = !{!396, !398, !400, !407, !409, !411, !413}
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !386, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !386, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !386, file: !8, line: 49, type: !402, isLocal: false, isDefinition: true)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !403, size: 2560, elements: !25)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !404)
!404 = !{!405, !406}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !403, file: !8, line: 35, baseType: !11, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !403, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !386, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !386, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !386, file: !8, line: 53, type: !388, isLocal: false, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !386, file: !8, line: 54, type: !415, isLocal: false, isDefinition: true)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 192000, elements: !36)
!416 = !{!417, !418, !419, !420, !384}
!417 = !DILocalVariable(name: "node", arg: 1, scope: !385, file: !8, line: 93, type: !11)
!418 = !DILocalVariable(name: "dist", arg: 2, scope: !385, file: !8, line: 93, type: !11)
!419 = !DILocalVariable(name: "prev", arg: 3, scope: !385, file: !8, line: 93, type: !11)
!420 = !DILocalVariable(name: "newItem", scope: !385, file: !8, line: 95, type: !388)
!421 = !DILocalVariable(name: "node", scope: !422, file: !8, line: 137, type: !11)
!422 = distinct !DISubprogram(name: "dijkstra_find", scope: !8, file: !8, line: 134, type: !195, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !423, retainedNodes: !453)
!423 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !424, globals: !432, nameTableKind: None)
!424 = !{!425}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !427)
!427 = !{!428, !429, !430, !431}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !426, file: !8, line: 40, baseType: !11, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !426, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !426, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !426, file: !8, line: 43, baseType: !425, size: 64, offset: 128)
!432 = !{!433, !435, !437, !444, !446, !448, !450}
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !423, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !423, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !423, file: !8, line: 49, type: !439, isLocal: false, isDefinition: true)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !440, size: 2560, elements: !25)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !441)
!441 = !{!442, !443}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !440, file: !8, line: 35, baseType: !11, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !440, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !423, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !423, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !423, file: !8, line: 53, type: !425, isLocal: false, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !423, file: !8, line: 54, type: !452, isLocal: false, isDefinition: true)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 192000, elements: !36)
!453 = !{!454, !455, !456, !457, !421, !458, !459, !460}
!454 = !DILocalVariable(name: "chStart", arg: 1, scope: !422, file: !8, line: 134, type: !11)
!455 = !DILocalVariable(name: "chEnd", arg: 2, scope: !422, file: !8, line: 134, type: !11)
!456 = !DILocalVariable(name: "ch", scope: !422, file: !8, line: 136, type: !11)
!457 = !DILocalVariable(name: "prev", scope: !422, file: !8, line: 137, type: !11)
!458 = !DILocalVariable(name: "cost", scope: !422, file: !8, line: 138, type: !11)
!459 = !DILocalVariable(name: "dist", scope: !422, file: !8, line: 138, type: !11)
!460 = !DILocalVariable(name: "i", scope: !422, file: !8, line: 139, type: !11)
!461 = !DILocalVariable(name: "node", arg: 1, scope: !462, file: !8, line: 93, type: !11)
!462 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !89, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !423, retainedNodes: !463)
!463 = !{!461, !464, !465, !466, !467}
!464 = !DILocalVariable(name: "dist", arg: 2, scope: !462, file: !8, line: 93, type: !11)
!465 = !DILocalVariable(name: "prev", arg: 3, scope: !462, file: !8, line: 93, type: !11)
!466 = !DILocalVariable(name: "newItem", scope: !462, file: !8, line: 95, type: !425)
!467 = !DILocalVariable(name: "last", scope: !462, file: !8, line: 96, type: !425)
!468 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !469)
!469 = !{!470, !471}
!470 = !DILocalVariable(name: "i", scope: !468, file: !8, line: 178, type: !11)
!471 = !DILocalVariable(name: "j", scope: !468, file: !8, line: 178, type: !11)
!472 = !DILocation(line: 0, scope: !468)
!473 = !DILocation(line: 184, column: 10, scope: !474)
!474 = distinct !DILexicalBlock(scope: !475, file: !8, line: 184, column: 10)
!475 = distinct !DILexicalBlock(scope: !476, file: !8, line: 182, column: 54)
!476 = distinct !DILexicalBlock(scope: !477, file: !8, line: 182, column: 3)
!477 = distinct !DILexicalBlock(scope: !468, file: !8, line: 182, column: 3)
!478 = !DILocation(line: 184, column: 32, scope: !474)
!479 = !DILocation(line: 185, column: 25, scope: !480)
!480 = distinct !DILexicalBlock(scope: !474, file: !8, line: 184, column: 51)
!481 = !DILocation(line: 186, column: 7, scope: !480)
!482 = !DILocation(line: 188, column: 51, scope: !474)
!483 = !DILocation(line: 188, column: 25, scope: !474)
!484 = !DILocation(line: 189, column: 24, scope: !475)
!485 = !DILocation(line: 191, column: 1, scope: !468)
!486 = !DILocation(line: 184, column: 10, scope: !475)
!487 = !DILocalVariable(name: "j", scope: !488, file: !8, line: 178, type: !11)
!488 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !489, retainedNodes: !519)
!489 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !490, globals: !498, nameTableKind: None)
!490 = !{!491}
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !493)
!493 = !{!494, !495, !496, !497}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !492, file: !8, line: 40, baseType: !11, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !492, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !492, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !492, file: !8, line: 43, baseType: !491, size: 64, offset: 128)
!498 = !{!499, !501, !503, !510, !512, !514, !516}
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !489, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !489, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !489, file: !8, line: 49, type: !505, isLocal: false, isDefinition: true)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 2560, elements: !25)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !507)
!507 = !{!508, !509}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !506, file: !8, line: 35, baseType: !11, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !506, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !489, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !489, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !489, file: !8, line: 53, type: !491, isLocal: false, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !489, file: !8, line: 54, type: !518, isLocal: false, isDefinition: true)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 192000, elements: !36)
!519 = !{!520, !487}
!520 = !DILocalVariable(name: "i", scope: !488, file: !8, line: 178, type: !11)
!521 = !DILocalVariable(name: "j", scope: !522, file: !8, line: 178, type: !11)
!522 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !523, retainedNodes: !553)
!523 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !524, globals: !532, nameTableKind: None)
!524 = !{!525}
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !527)
!527 = !{!528, !529, !530, !531}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !526, file: !8, line: 40, baseType: !11, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !526, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !526, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !526, file: !8, line: 43, baseType: !525, size: 64, offset: 128)
!532 = !{!533, !535, !537, !544, !546, !548, !550}
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !523, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !523, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !523, file: !8, line: 49, type: !539, isLocal: false, isDefinition: true)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !540, size: 2560, elements: !25)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !541)
!541 = !{!542, !543}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !540, file: !8, line: 35, baseType: !11, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !540, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !523, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !523, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !523, file: !8, line: 53, type: !525, isLocal: false, isDefinition: true)
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !523, file: !8, line: 54, type: !552, isLocal: false, isDefinition: true)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !526, size: 192000, elements: !36)
!553 = !{!554, !521}
!554 = !DILocalVariable(name: "i", scope: !522, file: !8, line: 178, type: !11)
!555 = !DILocalVariable(name: "j", scope: !556, file: !8, line: 178, type: !11)
!556 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !557, retainedNodes: !587)
!557 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !558, globals: !566, nameTableKind: None)
!558 = !{!559}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !561)
!561 = !{!562, !563, !564, !565}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !560, file: !8, line: 40, baseType: !11, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !560, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !560, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !560, file: !8, line: 43, baseType: !559, size: 64, offset: 128)
!566 = !{!567, !569, !571, !578, !580, !582, !584}
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !557, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !557, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !557, file: !8, line: 49, type: !573, isLocal: false, isDefinition: true)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 2560, elements: !25)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !575)
!575 = !{!576, !577}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !574, file: !8, line: 35, baseType: !11, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !574, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !557, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !557, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !557, file: !8, line: 53, type: !559, isLocal: false, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !557, file: !8, line: 54, type: !586, isLocal: false, isDefinition: true)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !560, size: 192000, elements: !36)
!587 = !{!588, !555}
!588 = !DILocalVariable(name: "i", scope: !556, file: !8, line: 178, type: !11)
!589 = distinct !DISubprogram(name: "main", scope: !8, file: !8, line: 193, type: !590, scopeLine: 194, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !595)
!590 = !DISubroutineType(types: !591)
!591 = !{!11, !11, !592}
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!595 = !{!596, !597}
!596 = !DILocalVariable(name: "argc", arg: 1, scope: !589, file: !8, line: 193, type: !11)
!597 = !DILocalVariable(name: "argv", arg: 2, scope: !589, file: !8, line: 193, type: !592)
!598 = !DILocation(line: 0, scope: !589)
!599 = !DILocation(line: 195, column: 3, scope: !589)
!600 = !DILocation(line: 196, column: 3, scope: !589)
!601 = !DILocation(line: 90, column: 14, scope: !81, inlinedAt: !602)
!602 = distinct !DILocation(line: 198, column: 12, scope: !589)
!603 = !DILocation(line: 90, column: 32, scope: !81, inlinedAt: !602)
!604 = !DILocation(line: 90, column: 12, scope: !81, inlinedAt: !602)
!605 = !DILocation(line: 198, column: 3, scope: !589)
