; ModuleID = '<stdin>'
source_filename = "./dijkstra.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._QITEM = type { i32, i32, i32, %struct._QITEM* }
%struct._NODE = type { i32, i32 }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !2, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !15, nameTableKind: None)
!3 = !DIFile(filename: "dijkstra.c", directory: "/home/newton/cfiles/xmark")
!4 = !{}
!5 = !{!6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !9)
!8 = !DIFile(filename: "./dijkstra.c", directory: "/home/newton/cfiles/xmark")
!9 = !{!10, !12, !13, !14}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !7, file: !8, line: 40, baseType: !11, size: 32)
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !7, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !7, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !7, file: !8, line: 43, baseType: !6, size: 64, offset: 128)
!15 = !{!0, !16, !18, !27, !29, !31, !33}
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !2, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !2, file: !8, line: 49, type: !20, isLocal: false, isDefinition: true)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 2560, elements: !25)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !22)
!22 = !{!23, !24}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !21, file: !8, line: 35, baseType: !11, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !21, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!25 = !{!26}
!26 = !DISubrange(count: 40)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !2, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !2, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !2, file: !8, line: 53, type: !6, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !2, file: !8, line: 54, type: !35, isLocal: false, isDefinition: true)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192000, elements: !36)
!36 = !{!37}
!37 = !DISubrange(count: 1000)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 12800, elements: !40)
!39 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!40 = !{!26, !26}
!41 = !{i32 2, !"Dwarf Version", i32 4}
!42 = !{i32 2, !"Debug Info Version", i32 3}
!43 = !{i32 1, !"wchar_size", i32 4}
!44 = !{!"clang version 9.0.1-12 "}
!45 = distinct !DISubprogram(name: "dijkstra_init", scope: !8, file: !8, line: 70, type: !46, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !48)
!46 = !DISubroutineType(types: !47)
!47 = !{null}
!48 = !{!49, !50, !51}
!49 = !DILocalVariable(name: "i", scope: !45, file: !8, line: 72, type: !11)
!50 = !DILocalVariable(name: "k", scope: !45, file: !8, line: 72, type: !11)
!51 = !DILocalVariable(name: "x", scope: !45, file: !8, line: 73, type: !52)
!52 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !11)
!53 = !DILocation(line: 73, column: 3, scope: !45)
!54 = !DILocation(line: 73, column: 16, scope: !45)
!55 = !{!56, !56, i64 0}
!56 = !{!"int", !57, i64 0}
!57 = !{!"omnipotent char", !58, i64 0}
!58 = !{!"Simple C/C++ TBAA"}
!59 = !DILocation(line: 0, scope: !45)
!60 = !DILocation(line: 75, column: 3, scope: !61)
!61 = distinct !DILexicalBlock(scope: !45, file: !8, line: 75, column: 3)
!62 = !DILocation(line: 78, column: 39, scope: !63)
!63 = distinct !DILexicalBlock(scope: !64, file: !8, line: 77, column: 5)
!64 = distinct !DILexicalBlock(scope: !65, file: !8, line: 77, column: 5)
!65 = distinct !DILexicalBlock(scope: !66, file: !8, line: 75, column: 37)
!66 = distinct !DILexicalBlock(scope: !61, file: !8, line: 75, column: 3)
!67 = !DILocation(line: 78, column: 7, scope: !63)
!68 = !DILocation(line: 78, column: 36, scope: !63)
!69 = !{!57, !57, i64 0}
!70 = !DILocation(line: 75, column: 32, scope: !66)
!71 = !DILocation(line: 75, column: 18, scope: !66)
!72 = distinct !{!72, !60, !73}
!73 = !DILocation(line: 79, column: 3, scope: !61)
!74 = !DILocation(line: 81, column: 23, scope: !45)
!75 = !DILocation(line: 82, column: 22, scope: !45)
!76 = !DILocation(line: 83, column: 22, scope: !45)
!77 = !{!78, !78, i64 0}
!78 = !{!"any pointer", !57, i64 0}
!79 = !DILocation(line: 85, column: 21, scope: !45)
!80 = !DILocation(line: 86, column: 1, scope: !45)
!81 = !DILocalVariable(name: "x", scope: !82, file: !8, line: 73, type: !52)
!82 = distinct !DISubprogram(name: "dijkstra_init", scope: !8, file: !8, line: 70, type: !46, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !83, retainedNodes: !113)
!83 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !84, globals: !92, nameTableKind: None)
!84 = !{!85}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !87)
!87 = !{!88, !89, !90, !91}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !86, file: !8, line: 40, baseType: !11, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !86, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !86, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !86, file: !8, line: 43, baseType: !85, size: 64, offset: 128)
!92 = !{!93, !95, !97, !104, !106, !108, !110}
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !83, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !83, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !83, file: !8, line: 49, type: !99, isLocal: false, isDefinition: true)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 2560, elements: !25)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !101)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !100, file: !8, line: 35, baseType: !11, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !100, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !83, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !83, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !83, file: !8, line: 53, type: !85, isLocal: false, isDefinition: true)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !83, file: !8, line: 54, type: !112, isLocal: false, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 192000, elements: !36)
!113 = !{!114, !115, !81}
!114 = !DILocalVariable(name: "i", scope: !82, file: !8, line: 72, type: !11)
!115 = !DILocalVariable(name: "k", scope: !82, file: !8, line: 72, type: !11)
!116 = !DILocalVariable(name: "k", scope: !117, file: !8, line: 72, type: !11)
!117 = distinct !DISubprogram(name: "dijkstra_init", scope: !8, file: !8, line: 70, type: !46, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !118, retainedNodes: !148)
!118 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !119, globals: !127, nameTableKind: None)
!119 = !{!120}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !122)
!122 = !{!123, !124, !125, !126}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !121, file: !8, line: 40, baseType: !11, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !121, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !121, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !121, file: !8, line: 43, baseType: !120, size: 64, offset: 128)
!127 = !{!128, !130, !132, !139, !141, !143, !145}
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !118, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !118, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !118, file: !8, line: 49, type: !134, isLocal: false, isDefinition: true)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 2560, elements: !25)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !136)
!136 = !{!137, !138}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !135, file: !8, line: 35, baseType: !11, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !135, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !118, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !118, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !118, file: !8, line: 53, type: !120, isLocal: false, isDefinition: true)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !118, file: !8, line: 54, type: !147, isLocal: false, isDefinition: true)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 192000, elements: !36)
!148 = !{!149, !116, !150}
!149 = !DILocalVariable(name: "i", scope: !117, file: !8, line: 72, type: !11)
!150 = !DILocalVariable(name: "x", scope: !117, file: !8, line: 73, type: !52)
!151 = distinct !DISubprogram(name: "dijkstra_return", scope: !8, file: !8, line: 88, type: !152, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!152 = !DISubroutineType(types: !153)
!153 = !{!11}
!154 = !DILocation(line: 90, column: 14, scope: !151)
!155 = !DILocation(line: 90, column: 32, scope: !151)
!156 = !DILocation(line: 90, column: 12, scope: !151)
!157 = !DILocation(line: 90, column: 3, scope: !151)
!158 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !159, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !161)
!159 = !DISubroutineType(types: !160)
!160 = !{!11, !11, !11, !11}
!161 = !{!162, !163, !164, !165, !166}
!162 = !DILocalVariable(name: "node", arg: 1, scope: !158, file: !8, line: 93, type: !11)
!163 = !DILocalVariable(name: "dist", arg: 2, scope: !158, file: !8, line: 93, type: !11)
!164 = !DILocalVariable(name: "prev", arg: 3, scope: !158, file: !8, line: 93, type: !11)
!165 = !DILocalVariable(name: "newItem", scope: !158, file: !8, line: 95, type: !6)
!166 = !DILocalVariable(name: "last", scope: !158, file: !8, line: 96, type: !6)
!167 = !DILocation(line: 0, scope: !158)
!168 = !DILocation(line: 95, column: 50, scope: !158)
!169 = !DILocation(line: 95, column: 29, scope: !158)
!170 = !DILocation(line: 96, column: 25, scope: !158)
!171 = !DILocation(line: 98, column: 8, scope: !172)
!172 = distinct !DILexicalBlock(scope: !158, file: !8, line: 98, column: 8)
!173 = !DILocation(line: 98, column: 29, scope: !172)
!174 = !DILocation(line: 98, column: 8, scope: !158)
!175 = !DILocation(line: 100, column: 12, scope: !158)
!176 = !DILocation(line: 100, column: 17, scope: !158)
!177 = !{!178, !56, i64 0}
!178 = !{!"_QITEM", !56, i64 0, !56, i64 4, !56, i64 8, !78, i64 16}
!179 = !DILocation(line: 101, column: 12, scope: !158)
!180 = !DILocation(line: 101, column: 17, scope: !158)
!181 = !{!178, !56, i64 4}
!182 = !DILocation(line: 102, column: 12, scope: !158)
!183 = !DILocation(line: 102, column: 17, scope: !158)
!184 = !{!178, !56, i64 8}
!185 = !DILocation(line: 103, column: 12, scope: !158)
!186 = !DILocation(line: 103, column: 17, scope: !158)
!187 = !{!178, !78, i64 16}
!188 = !DILocation(line: 105, column: 9, scope: !189)
!189 = distinct !DILexicalBlock(scope: !158, file: !8, line: 105, column: 8)
!190 = !DILocation(line: 105, column: 8, scope: !158)
!191 = !DILocation(line: 110, column: 19, scope: !192)
!192 = distinct !DILexicalBlock(scope: !189, file: !8, line: 107, column: 8)
!193 = !DILocation(line: 110, column: 5, scope: !192)
!194 = distinct !{!194, !193, !195}
!195 = !DILocation(line: 111, column: 20, scope: !192)
!196 = !DILocation(line: 0, scope: !189)
!197 = !DILocation(line: 114, column: 22, scope: !158)
!198 = !DILocation(line: 115, column: 3, scope: !158)
!199 = !DILocation(line: 116, column: 1, scope: !158)
!200 = distinct !DISubprogram(name: "dijkstra_dequeue", scope: !8, file: !8, line: 118, type: !201, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !204)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !203, !203, !203}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!204 = !{!205, !206, !207}
!205 = !DILocalVariable(name: "node", arg: 1, scope: !200, file: !8, line: 118, type: !203)
!206 = !DILocalVariable(name: "dist", arg: 2, scope: !200, file: !8, line: 118, type: !203)
!207 = !DILocalVariable(name: "prev", arg: 3, scope: !200, file: !8, line: 118, type: !203)
!208 = !DILocation(line: 0, scope: !200)
!209 = !DILocation(line: 120, column: 8, scope: !210)
!210 = distinct !DILexicalBlock(scope: !200, file: !8, line: 120, column: 8)
!211 = !DILocation(line: 120, column: 8, scope: !200)
!212 = !DILocation(line: 121, column: 33, scope: !213)
!213 = distinct !DILexicalBlock(scope: !210, file: !8, line: 120, column: 29)
!214 = !DILocation(line: 121, column: 11, scope: !213)
!215 = !DILocation(line: 122, column: 33, scope: !213)
!216 = !DILocation(line: 122, column: 11, scope: !213)
!217 = !DILocation(line: 123, column: 33, scope: !213)
!218 = !DILocation(line: 123, column: 11, scope: !213)
!219 = !DILocation(line: 124, column: 46, scope: !213)
!220 = !DILocation(line: 124, column: 24, scope: !213)
!221 = !DILocation(line: 125, column: 24, scope: !213)
!222 = !DILocation(line: 126, column: 3, scope: !213)
!223 = !DILocation(line: 127, column: 1, scope: !200)
!224 = distinct !DISubprogram(name: "dijkstra_qcount", scope: !8, file: !8, line: 129, type: !152, scopeLine: 130, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!225 = !DILocation(line: 131, column: 12, scope: !224)
!226 = !DILocation(line: 131, column: 3, scope: !224)
!227 = distinct !DISubprogram(name: "dijkstra_find", scope: !8, file: !8, line: 134, type: !228, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !230)
!228 = !DISubroutineType(types: !229)
!229 = !{!11, !11, !11}
!230 = !{!231, !232, !233, !234, !235, !236, !237, !238}
!231 = !DILocalVariable(name: "chStart", arg: 1, scope: !227, file: !8, line: 134, type: !11)
!232 = !DILocalVariable(name: "chEnd", arg: 2, scope: !227, file: !8, line: 134, type: !11)
!233 = !DILocalVariable(name: "ch", scope: !227, file: !8, line: 136, type: !11)
!234 = !DILocalVariable(name: "prev", scope: !227, file: !8, line: 137, type: !11)
!235 = !DILocalVariable(name: "node", scope: !227, file: !8, line: 137, type: !11)
!236 = !DILocalVariable(name: "cost", scope: !227, file: !8, line: 138, type: !11)
!237 = !DILocalVariable(name: "dist", scope: !227, file: !8, line: 138, type: !11)
!238 = !DILocalVariable(name: "i", scope: !227, file: !8, line: 139, type: !11)
!239 = !DILocation(line: 0, scope: !227)
!240 = !DILocation(line: 143, column: 34, scope: !241)
!241 = distinct !DILexicalBlock(scope: !242, file: !8, line: 142, column: 40)
!242 = distinct !DILexicalBlock(scope: !243, file: !8, line: 142, column: 3)
!243 = distinct !DILexicalBlock(scope: !227, file: !8, line: 142, column: 3)
!244 = !DILocation(line: 147, column: 16, scope: !245)
!245 = distinct !DILexicalBlock(scope: !227, file: !8, line: 147, column: 8)
!246 = !DILocation(line: 147, column: 8, scope: !227)
!247 = !DILocation(line: 149, column: 5, scope: !248)
!248 = distinct !DILexicalBlock(scope: !245, file: !8, line: 148, column: 10)
!249 = !DILocation(line: 149, column: 34, scope: !248)
!250 = !DILocation(line: 149, column: 39, scope: !248)
!251 = !{!252, !56, i64 0}
!252 = !{!"_NODE", !56, i64 0, !56, i64 4}
!253 = !DILocation(line: 150, column: 34, scope: !248)
!254 = !DILocation(line: 150, column: 39, scope: !248)
!255 = !{!252, !56, i64 4}
!256 = !DILocation(line: 0, scope: !158, inlinedAt: !257)
!257 = distinct !DILocation(line: 152, column: 10, scope: !258)
!258 = distinct !DILexicalBlock(scope: !248, file: !8, line: 152, column: 10)
!259 = !DILocation(line: 95, column: 50, scope: !158, inlinedAt: !257)
!260 = !DILocation(line: 95, column: 29, scope: !158, inlinedAt: !257)
!261 = !DILocation(line: 96, column: 25, scope: !158, inlinedAt: !257)
!262 = !DILocation(line: 98, column: 8, scope: !172, inlinedAt: !257)
!263 = !DILocation(line: 98, column: 29, scope: !172, inlinedAt: !257)
!264 = !DILocation(line: 98, column: 8, scope: !158, inlinedAt: !257)
!265 = !DILocation(line: 100, column: 12, scope: !158, inlinedAt: !257)
!266 = !DILocation(line: 100, column: 17, scope: !158, inlinedAt: !257)
!267 = !DILocation(line: 101, column: 12, scope: !158, inlinedAt: !257)
!268 = !DILocation(line: 101, column: 17, scope: !158, inlinedAt: !257)
!269 = !DILocation(line: 102, column: 12, scope: !158, inlinedAt: !257)
!270 = !DILocation(line: 102, column: 17, scope: !158, inlinedAt: !257)
!271 = !DILocation(line: 103, column: 12, scope: !158, inlinedAt: !257)
!272 = !DILocation(line: 103, column: 17, scope: !158, inlinedAt: !257)
!273 = !DILocation(line: 105, column: 9, scope: !189, inlinedAt: !257)
!274 = !DILocation(line: 105, column: 8, scope: !158, inlinedAt: !257)
!275 = !DILocation(line: 110, column: 19, scope: !192, inlinedAt: !257)
!276 = !DILocation(line: 110, column: 5, scope: !192, inlinedAt: !257)
!277 = distinct !{!277, !276, !278}
!278 = !DILocation(line: 111, column: 20, scope: !192, inlinedAt: !257)
!279 = !DILocation(line: 0, scope: !189, inlinedAt: !257)
!280 = !DILocation(line: 114, column: 22, scope: !158, inlinedAt: !257)
!281 = !DILocation(line: 157, column: 31, scope: !248)
!282 = !DILocation(line: 157, column: 5, scope: !248)
!283 = !DILocation(line: 120, column: 8, scope: !210, inlinedAt: !284)
!284 = distinct !DILocation(line: 158, column: 7, scope: !285)
!285 = distinct !DILexicalBlock(scope: !248, file: !8, line: 157, column: 37)
!286 = !DILocation(line: 120, column: 8, scope: !200, inlinedAt: !284)
!287 = !DILocation(line: 121, column: 33, scope: !213, inlinedAt: !284)
!288 = !DILocation(line: 122, column: 33, scope: !213, inlinedAt: !284)
!289 = !DILocation(line: 124, column: 46, scope: !213, inlinedAt: !284)
!290 = !DILocation(line: 124, column: 24, scope: !213, inlinedAt: !284)
!291 = !DILocation(line: 125, column: 24, scope: !213, inlinedAt: !284)
!292 = !DILocation(line: 126, column: 3, scope: !213, inlinedAt: !284)
!293 = !DILocation(line: 0, scope: !294)
!294 = distinct !DILexicalBlock(scope: !295, file: !8, line: 161, column: 14)
!295 = distinct !DILexicalBlock(scope: !296, file: !8, line: 160, column: 41)
!296 = distinct !DILexicalBlock(scope: !297, file: !8, line: 160, column: 7)
!297 = distinct !DILexicalBlock(scope: !285, file: !8, line: 160, column: 7)
!298 = !DILocation(line: 160, column: 7, scope: !297)
!299 = !DILocation(line: 161, column: 23, scope: !294)
!300 = !DILocation(line: 162, column: 49, scope: !301)
!301 = distinct !DILexicalBlock(scope: !302, file: !8, line: 162, column: 16)
!302 = distinct !DILexicalBlock(scope: !294, file: !8, line: 161, column: 67)
!303 = !DILocation(line: 162, column: 23, scope: !301)
!304 = !DILocation(line: 163, column: 55, scope: !301)
!305 = !DILocation(line: 163, column: 46, scope: !301)
!306 = !DILocation(line: 162, column: 56, scope: !301)
!307 = !DILocation(line: 164, column: 41, scope: !308)
!308 = distinct !DILexicalBlock(scope: !301, file: !8, line: 163, column: 68)
!309 = !DILocation(line: 165, column: 36, scope: !308)
!310 = !DILocation(line: 165, column: 41, scope: !308)
!311 = !DILocation(line: 0, scope: !158, inlinedAt: !312)
!312 = distinct !DILocation(line: 166, column: 18, scope: !313)
!313 = distinct !DILexicalBlock(scope: !308, file: !8, line: 166, column: 18)
!314 = !DILocation(line: 95, column: 29, scope: !158, inlinedAt: !312)
!315 = !DILocation(line: 98, column: 8, scope: !172, inlinedAt: !312)
!316 = !DILocation(line: 98, column: 29, scope: !172, inlinedAt: !312)
!317 = !DILocation(line: 98, column: 8, scope: !158, inlinedAt: !312)
!318 = !DILocation(line: 100, column: 12, scope: !158, inlinedAt: !312)
!319 = !DILocation(line: 100, column: 17, scope: !158, inlinedAt: !312)
!320 = !DILocation(line: 101, column: 12, scope: !158, inlinedAt: !312)
!321 = !DILocation(line: 101, column: 17, scope: !158, inlinedAt: !312)
!322 = !DILocation(line: 102, column: 12, scope: !158, inlinedAt: !312)
!323 = !DILocation(line: 102, column: 17, scope: !158, inlinedAt: !312)
!324 = !DILocation(line: 103, column: 12, scope: !158, inlinedAt: !312)
!325 = !DILocation(line: 103, column: 17, scope: !158, inlinedAt: !312)
!326 = !DILocation(line: 105, column: 9, scope: !189, inlinedAt: !312)
!327 = !DILocation(line: 105, column: 8, scope: !158, inlinedAt: !312)
!328 = !DILocation(line: 110, column: 19, scope: !192, inlinedAt: !312)
!329 = !DILocation(line: 110, column: 5, scope: !192, inlinedAt: !312)
!330 = distinct !{!330, !329, !331}
!331 = !DILocation(line: 111, column: 20, scope: !192, inlinedAt: !312)
!332 = !DILocation(line: 0, scope: !189, inlinedAt: !312)
!333 = !DILocation(line: 114, column: 22, scope: !158, inlinedAt: !312)
!334 = !DILocation(line: 166, column: 18, scope: !308)
!335 = !DILocation(line: 160, column: 36, scope: !296)
!336 = !DILocation(line: 160, column: 22, scope: !296)
!337 = distinct !{!337, !298, !338}
!338 = !DILocation(line: 170, column: 7, scope: !297)
!339 = !DILocation(line: 174, column: 1, scope: !227)
!340 = !DILocalVariable(name: "ch", scope: !341, file: !8, line: 136, type: !11)
!341 = distinct !DISubprogram(name: "dijkstra_find", scope: !8, file: !8, line: 134, type: !228, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !342, retainedNodes: !372)
!342 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !343, globals: !351, nameTableKind: None)
!343 = !{!344}
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !346)
!346 = !{!347, !348, !349, !350}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !345, file: !8, line: 40, baseType: !11, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !345, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !345, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !345, file: !8, line: 43, baseType: !344, size: 64, offset: 128)
!351 = !{!352, !354, !356, !363, !365, !367, !369}
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !342, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !342, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !342, file: !8, line: 49, type: !358, isLocal: false, isDefinition: true)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 2560, elements: !25)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !360)
!360 = !{!361, !362}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !359, file: !8, line: 35, baseType: !11, size: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !359, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !342, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !342, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !342, file: !8, line: 53, type: !344, isLocal: false, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !342, file: !8, line: 54, type: !371, isLocal: false, isDefinition: true)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !345, size: 192000, elements: !36)
!372 = !{!373, !374, !340, !375, !376, !377, !378, !379}
!373 = !DILocalVariable(name: "chStart", arg: 1, scope: !341, file: !8, line: 134, type: !11)
!374 = !DILocalVariable(name: "chEnd", arg: 2, scope: !341, file: !8, line: 134, type: !11)
!375 = !DILocalVariable(name: "prev", scope: !341, file: !8, line: 137, type: !11)
!376 = !DILocalVariable(name: "node", scope: !341, file: !8, line: 137, type: !11)
!377 = !DILocalVariable(name: "cost", scope: !341, file: !8, line: 138, type: !11)
!378 = !DILocalVariable(name: "dist", scope: !341, file: !8, line: 138, type: !11)
!379 = !DILocalVariable(name: "i", scope: !341, file: !8, line: 139, type: !11)
!380 = !DILocalVariable(name: "last", scope: !381, file: !8, line: 96, type: !384)
!381 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !159, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !382, retainedNodes: !412)
!382 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !383, globals: !391, nameTableKind: None)
!383 = !{!384}
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !386)
!386 = !{!387, !388, !389, !390}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !385, file: !8, line: 40, baseType: !11, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !385, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !385, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !385, file: !8, line: 43, baseType: !384, size: 64, offset: 128)
!391 = !{!392, !394, !396, !403, !405, !407, !409}
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !382, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !382, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !382, file: !8, line: 49, type: !398, isLocal: false, isDefinition: true)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 2560, elements: !25)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !400)
!400 = !{!401, !402}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !399, file: !8, line: 35, baseType: !11, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !399, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !382, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !382, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !382, file: !8, line: 53, type: !384, isLocal: false, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !382, file: !8, line: 54, type: !411, isLocal: false, isDefinition: true)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 192000, elements: !36)
!412 = !{!413, !414, !415, !416, !380}
!413 = !DILocalVariable(name: "node", arg: 1, scope: !381, file: !8, line: 93, type: !11)
!414 = !DILocalVariable(name: "dist", arg: 2, scope: !381, file: !8, line: 93, type: !11)
!415 = !DILocalVariable(name: "prev", arg: 3, scope: !381, file: !8, line: 93, type: !11)
!416 = !DILocalVariable(name: "newItem", scope: !381, file: !8, line: 95, type: !384)
!417 = !DILocalVariable(name: "cost", scope: !418, file: !8, line: 138, type: !11)
!418 = distinct !DISubprogram(name: "dijkstra_find", scope: !8, file: !8, line: 134, type: !228, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !419, retainedNodes: !449)
!419 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !420, globals: !428, nameTableKind: None)
!420 = !{!421}
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !423)
!423 = !{!424, !425, !426, !427}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !422, file: !8, line: 40, baseType: !11, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !422, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !422, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !422, file: !8, line: 43, baseType: !421, size: 64, offset: 128)
!428 = !{!429, !431, !433, !440, !442, !444, !446}
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !419, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !419, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !419, file: !8, line: 49, type: !435, isLocal: false, isDefinition: true)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 2560, elements: !25)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !437)
!437 = !{!438, !439}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !436, file: !8, line: 35, baseType: !11, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !436, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !419, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !419, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !419, file: !8, line: 53, type: !421, isLocal: false, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !419, file: !8, line: 54, type: !448, isLocal: false, isDefinition: true)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !422, size: 192000, elements: !36)
!449 = !{!450, !451, !452, !453, !454, !417, !455, !456}
!450 = !DILocalVariable(name: "chStart", arg: 1, scope: !418, file: !8, line: 134, type: !11)
!451 = !DILocalVariable(name: "chEnd", arg: 2, scope: !418, file: !8, line: 134, type: !11)
!452 = !DILocalVariable(name: "ch", scope: !418, file: !8, line: 136, type: !11)
!453 = !DILocalVariable(name: "prev", scope: !418, file: !8, line: 137, type: !11)
!454 = !DILocalVariable(name: "node", scope: !418, file: !8, line: 137, type: !11)
!455 = !DILocalVariable(name: "dist", scope: !418, file: !8, line: 138, type: !11)
!456 = !DILocalVariable(name: "i", scope: !418, file: !8, line: 139, type: !11)
!457 = !DILocalVariable(name: "last", scope: !458, file: !8, line: 96, type: !461)
!458 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !159, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !459, retainedNodes: !489)
!459 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !460, globals: !468, nameTableKind: None)
!460 = !{!461}
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !463)
!463 = !{!464, !465, !466, !467}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !462, file: !8, line: 40, baseType: !11, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !462, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !462, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !462, file: !8, line: 43, baseType: !461, size: 64, offset: 128)
!468 = !{!469, !471, !473, !480, !482, !484, !486}
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !459, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !459, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !459, file: !8, line: 49, type: !475, isLocal: false, isDefinition: true)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !476, size: 2560, elements: !25)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !477)
!477 = !{!478, !479}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !476, file: !8, line: 35, baseType: !11, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !476, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !459, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !459, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !459, file: !8, line: 53, type: !461, isLocal: false, isDefinition: true)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !459, file: !8, line: 54, type: !488, isLocal: false, isDefinition: true)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !462, size: 192000, elements: !36)
!489 = !{!490, !491, !492, !493, !457}
!490 = !DILocalVariable(name: "node", arg: 1, scope: !458, file: !8, line: 93, type: !11)
!491 = !DILocalVariable(name: "dist", arg: 2, scope: !458, file: !8, line: 93, type: !11)
!492 = !DILocalVariable(name: "prev", arg: 3, scope: !458, file: !8, line: 93, type: !11)
!493 = !DILocalVariable(name: "newItem", scope: !458, file: !8, line: 95, type: !461)
!494 = !DILocalVariable(name: "i", scope: !495, file: !8, line: 139, type: !11)
!495 = distinct !DISubprogram(name: "dijkstra_find", scope: !8, file: !8, line: 134, type: !228, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !496, retainedNodes: !526)
!496 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !497, globals: !505, nameTableKind: None)
!497 = !{!498}
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !500)
!500 = !{!501, !502, !503, !504}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !499, file: !8, line: 40, baseType: !11, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !499, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !499, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !499, file: !8, line: 43, baseType: !498, size: 64, offset: 128)
!505 = !{!506, !508, !510, !517, !519, !521, !523}
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !496, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !496, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !496, file: !8, line: 49, type: !512, isLocal: false, isDefinition: true)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 2560, elements: !25)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !514)
!514 = !{!515, !516}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !513, file: !8, line: 35, baseType: !11, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !513, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !496, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !496, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !496, file: !8, line: 53, type: !498, isLocal: false, isDefinition: true)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !496, file: !8, line: 54, type: !525, isLocal: false, isDefinition: true)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 192000, elements: !36)
!526 = !{!527, !528, !529, !530, !531, !532, !533, !494}
!527 = !DILocalVariable(name: "chStart", arg: 1, scope: !495, file: !8, line: 134, type: !11)
!528 = !DILocalVariable(name: "chEnd", arg: 2, scope: !495, file: !8, line: 134, type: !11)
!529 = !DILocalVariable(name: "ch", scope: !495, file: !8, line: 136, type: !11)
!530 = !DILocalVariable(name: "prev", scope: !495, file: !8, line: 137, type: !11)
!531 = !DILocalVariable(name: "node", scope: !495, file: !8, line: 137, type: !11)
!532 = !DILocalVariable(name: "cost", scope: !495, file: !8, line: 138, type: !11)
!533 = !DILocalVariable(name: "dist", scope: !495, file: !8, line: 138, type: !11)
!534 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !535)
!535 = !{!536, !537}
!536 = !DILocalVariable(name: "i", scope: !534, file: !8, line: 178, type: !11)
!537 = !DILocalVariable(name: "j", scope: !534, file: !8, line: 178, type: !11)
!538 = !DILocation(line: 0, scope: !534)
!539 = !DILocation(line: 184, column: 10, scope: !540)
!540 = distinct !DILexicalBlock(scope: !541, file: !8, line: 184, column: 10)
!541 = distinct !DILexicalBlock(scope: !542, file: !8, line: 182, column: 54)
!542 = distinct !DILexicalBlock(scope: !543, file: !8, line: 182, column: 3)
!543 = distinct !DILexicalBlock(scope: !534, file: !8, line: 182, column: 3)
!544 = !DILocation(line: 184, column: 32, scope: !540)
!545 = !DILocation(line: 185, column: 25, scope: !546)
!546 = distinct !DILexicalBlock(scope: !540, file: !8, line: 184, column: 51)
!547 = !DILocation(line: 186, column: 7, scope: !546)
!548 = !DILocation(line: 188, column: 51, scope: !540)
!549 = !DILocation(line: 188, column: 25, scope: !540)
!550 = !DILocation(line: 189, column: 24, scope: !541)
!551 = !DILocation(line: 191, column: 1, scope: !534)
!552 = !DILocation(line: 184, column: 10, scope: !541)
!553 = !DILocalVariable(name: "j", scope: !554, file: !8, line: 178, type: !11)
!554 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !555, retainedNodes: !585)
!555 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !556, globals: !564, nameTableKind: None)
!556 = !{!557}
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !559)
!559 = !{!560, !561, !562, !563}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !558, file: !8, line: 40, baseType: !11, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !558, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !558, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !558, file: !8, line: 43, baseType: !557, size: 64, offset: 128)
!564 = !{!565, !567, !569, !576, !578, !580, !582}
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !555, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !555, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !555, file: !8, line: 49, type: !571, isLocal: false, isDefinition: true)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !572, size: 2560, elements: !25)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !573)
!573 = !{!574, !575}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !572, file: !8, line: 35, baseType: !11, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !572, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !555, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !555, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !555, file: !8, line: 53, type: !557, isLocal: false, isDefinition: true)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !555, file: !8, line: 54, type: !584, isLocal: false, isDefinition: true)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 192000, elements: !36)
!585 = !{!586, !553}
!586 = !DILocalVariable(name: "i", scope: !554, file: !8, line: 178, type: !11)
!587 = !DILocalVariable(name: "j", scope: !588, file: !8, line: 178, type: !11)
!588 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !589, retainedNodes: !619)
!589 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !590, globals: !598, nameTableKind: None)
!590 = !{!591}
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !593)
!593 = !{!594, !595, !596, !597}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !592, file: !8, line: 40, baseType: !11, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !592, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !592, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !592, file: !8, line: 43, baseType: !591, size: 64, offset: 128)
!598 = !{!599, !601, !603, !610, !612, !614, !616}
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !589, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !589, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !589, file: !8, line: 49, type: !605, isLocal: false, isDefinition: true)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !606, size: 2560, elements: !25)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !607)
!607 = !{!608, !609}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !606, file: !8, line: 35, baseType: !11, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !606, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !589, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !589, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !589, file: !8, line: 53, type: !591, isLocal: false, isDefinition: true)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !589, file: !8, line: 54, type: !618, isLocal: false, isDefinition: true)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !592, size: 192000, elements: !36)
!619 = !{!620, !587}
!620 = !DILocalVariable(name: "i", scope: !588, file: !8, line: 178, type: !11)
!621 = !DILocalVariable(name: "j", scope: !622, file: !8, line: 178, type: !11)
!622 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !623, retainedNodes: !653)
!623 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !624, globals: !632, nameTableKind: None)
!624 = !{!625}
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !627)
!627 = !{!628, !629, !630, !631}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !626, file: !8, line: 40, baseType: !11, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !626, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !626, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !626, file: !8, line: 43, baseType: !625, size: 64, offset: 128)
!632 = !{!633, !635, !637, !644, !646, !648, !650}
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !623, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !623, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !623, file: !8, line: 49, type: !639, isLocal: false, isDefinition: true)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !640, size: 2560, elements: !25)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !641)
!641 = !{!642, !643}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !640, file: !8, line: 35, baseType: !11, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !640, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !623, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !623, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !623, file: !8, line: 53, type: !625, isLocal: false, isDefinition: true)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !623, file: !8, line: 54, type: !652, isLocal: false, isDefinition: true)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !626, size: 192000, elements: !36)
!653 = !{!654, !621}
!654 = !DILocalVariable(name: "i", scope: !622, file: !8, line: 178, type: !11)
!655 = !DILocalVariable(name: "j", scope: !656, file: !8, line: 178, type: !11)
!656 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !657, retainedNodes: !687)
!657 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !658, globals: !666, nameTableKind: None)
!658 = !{!659}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !661)
!661 = !{!662, !663, !664, !665}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !660, file: !8, line: 40, baseType: !11, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !660, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !660, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !660, file: !8, line: 43, baseType: !659, size: 64, offset: 128)
!666 = !{!667, !669, !671, !678, !680, !682, !684}
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !657, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !657, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !657, file: !8, line: 49, type: !673, isLocal: false, isDefinition: true)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !674, size: 2560, elements: !25)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !675)
!675 = !{!676, !677}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !674, file: !8, line: 35, baseType: !11, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !674, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !657, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !657, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !657, file: !8, line: 53, type: !659, isLocal: false, isDefinition: true)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !657, file: !8, line: 54, type: !686, isLocal: false, isDefinition: true)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !660, size: 192000, elements: !36)
!687 = !{!688, !655}
!688 = !DILocalVariable(name: "i", scope: !656, file: !8, line: 178, type: !11)
!689 = !DILocalVariable(name: "j", scope: !690, file: !8, line: 178, type: !11)
!690 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !691, retainedNodes: !721)
!691 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !692, globals: !700, nameTableKind: None)
!692 = !{!693}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !695)
!695 = !{!696, !697, !698, !699}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !694, file: !8, line: 40, baseType: !11, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !694, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !694, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !694, file: !8, line: 43, baseType: !693, size: 64, offset: 128)
!700 = !{!701, !703, !705, !712, !714, !716, !718}
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !691, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !691, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !691, file: !8, line: 49, type: !707, isLocal: false, isDefinition: true)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !708, size: 2560, elements: !25)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !709)
!709 = !{!710, !711}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !708, file: !8, line: 35, baseType: !11, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !708, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !691, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !691, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !691, file: !8, line: 53, type: !693, isLocal: false, isDefinition: true)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !691, file: !8, line: 54, type: !720, isLocal: false, isDefinition: true)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !694, size: 192000, elements: !36)
!721 = !{!722, !689}
!722 = !DILocalVariable(name: "i", scope: !690, file: !8, line: 178, type: !11)
!723 = !DILocalVariable(name: "j", scope: !724, file: !8, line: 178, type: !11)
!724 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !725, retainedNodes: !755)
!725 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !726, globals: !734, nameTableKind: None)
!726 = !{!727}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !729)
!729 = !{!730, !731, !732, !733}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !728, file: !8, line: 40, baseType: !11, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !728, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !728, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !728, file: !8, line: 43, baseType: !727, size: 64, offset: 128)
!734 = !{!735, !737, !739, !746, !748, !750, !752}
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !725, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !725, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !725, file: !8, line: 49, type: !741, isLocal: false, isDefinition: true)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !742, size: 2560, elements: !25)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !743)
!743 = !{!744, !745}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !742, file: !8, line: 35, baseType: !11, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !742, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !725, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !725, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !725, file: !8, line: 53, type: !727, isLocal: false, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !725, file: !8, line: 54, type: !754, isLocal: false, isDefinition: true)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !728, size: 192000, elements: !36)
!755 = !{!756, !723}
!756 = !DILocalVariable(name: "i", scope: !724, file: !8, line: 178, type: !11)
!757 = !DILocalVariable(name: "j", scope: !758, file: !8, line: 178, type: !11)
!758 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !759, retainedNodes: !789)
!759 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !760, globals: !768, nameTableKind: None)
!760 = !{!761}
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !763)
!763 = !{!764, !765, !766, !767}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !762, file: !8, line: 40, baseType: !11, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !762, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !762, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !762, file: !8, line: 43, baseType: !761, size: 64, offset: 128)
!768 = !{!769, !771, !773, !780, !782, !784, !786}
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !759, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !759, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !759, file: !8, line: 49, type: !775, isLocal: false, isDefinition: true)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !776, size: 2560, elements: !25)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !777)
!777 = !{!778, !779}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !776, file: !8, line: 35, baseType: !11, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !776, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !759, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !759, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !759, file: !8, line: 53, type: !761, isLocal: false, isDefinition: true)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !759, file: !8, line: 54, type: !788, isLocal: false, isDefinition: true)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 192000, elements: !36)
!789 = !{!790, !757}
!790 = !DILocalVariable(name: "i", scope: !758, file: !8, line: 178, type: !11)
!791 = !DILocalVariable(name: "j", scope: !792, file: !8, line: 178, type: !11)
!792 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !793, retainedNodes: !823)
!793 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !794, globals: !802, nameTableKind: None)
!794 = !{!795}
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !797)
!797 = !{!798, !799, !800, !801}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !796, file: !8, line: 40, baseType: !11, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !796, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !796, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !796, file: !8, line: 43, baseType: !795, size: 64, offset: 128)
!802 = !{!803, !805, !807, !814, !816, !818, !820}
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !793, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !793, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !793, file: !8, line: 49, type: !809, isLocal: false, isDefinition: true)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !810, size: 2560, elements: !25)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !811)
!811 = !{!812, !813}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !810, file: !8, line: 35, baseType: !11, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !810, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !793, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !793, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !793, file: !8, line: 53, type: !795, isLocal: false, isDefinition: true)
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !793, file: !8, line: 54, type: !822, isLocal: false, isDefinition: true)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !796, size: 192000, elements: !36)
!823 = !{!824, !791}
!824 = !DILocalVariable(name: "i", scope: !792, file: !8, line: 178, type: !11)
!825 = !DILocalVariable(name: "j", scope: !826, file: !8, line: 178, type: !11)
!826 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !827, retainedNodes: !857)
!827 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !828, globals: !836, nameTableKind: None)
!828 = !{!829}
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !831)
!831 = !{!832, !833, !834, !835}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !830, file: !8, line: 40, baseType: !11, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !830, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !830, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !830, file: !8, line: 43, baseType: !829, size: 64, offset: 128)
!836 = !{!837, !839, !841, !848, !850, !852, !854}
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !827, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !827, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !827, file: !8, line: 49, type: !843, isLocal: false, isDefinition: true)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !844, size: 2560, elements: !25)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !845)
!845 = !{!846, !847}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !844, file: !8, line: 35, baseType: !11, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !844, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !827, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !827, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !827, file: !8, line: 53, type: !829, isLocal: false, isDefinition: true)
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !827, file: !8, line: 54, type: !856, isLocal: false, isDefinition: true)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !830, size: 192000, elements: !36)
!857 = !{!858, !825}
!858 = !DILocalVariable(name: "i", scope: !826, file: !8, line: 178, type: !11)
!859 = distinct !DISubprogram(name: "main", scope: !8, file: !8, line: 193, type: !860, scopeLine: 194, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !865)
!860 = !DISubroutineType(types: !861)
!861 = !{!11, !11, !862}
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!865 = !{!866, !867}
!866 = !DILocalVariable(name: "argc", arg: 1, scope: !859, file: !8, line: 193, type: !11)
!867 = !DILocalVariable(name: "argv", arg: 2, scope: !859, file: !8, line: 193, type: !862)
!868 = !DILocation(line: 0, scope: !859)
!869 = !DILocation(line: 195, column: 3, scope: !859)
!870 = !DILocation(line: 196, column: 3, scope: !859)
!871 = !DILocation(line: 90, column: 14, scope: !151, inlinedAt: !872)
!872 = distinct !DILocation(line: 198, column: 12, scope: !859)
!873 = !DILocation(line: 90, column: 32, scope: !151, inlinedAt: !872)
!874 = !DILocation(line: 90, column: 12, scope: !151, inlinedAt: !872)
!875 = !DILocation(line: 198, column: 3, scope: !859)
!876 = !DILocalVariable(name: "argc", arg: 1, scope: !877, file: !8, line: 193, type: !11)
!877 = distinct !DISubprogram(name: "main", scope: !8, file: !8, line: 193, type: !860, scopeLine: 194, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !878, retainedNodes: !908)
!878 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !879, globals: !887, nameTableKind: None)
!879 = !{!880}
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !882)
!882 = !{!883, !884, !885, !886}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !881, file: !8, line: 40, baseType: !11, size: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !881, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !881, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !881, file: !8, line: 43, baseType: !880, size: 64, offset: 128)
!887 = !{!888, !890, !892, !899, !901, !903, !905}
!888 = !DIGlobalVariableExpression(var: !889, expr: !DIExpression())
!889 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !878, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !878, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !878, file: !8, line: 49, type: !894, isLocal: false, isDefinition: true)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !895, size: 2560, elements: !25)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !896)
!896 = !{!897, !898}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !895, file: !8, line: 35, baseType: !11, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !895, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !878, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !878, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !878, file: !8, line: 53, type: !880, isLocal: false, isDefinition: true)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !878, file: !8, line: 54, type: !907, isLocal: false, isDefinition: true)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !881, size: 192000, elements: !36)
!908 = !{!876, !909}
!909 = !DILocalVariable(name: "argv", arg: 2, scope: !877, file: !8, line: 193, type: !862)
