; ModuleID = '<stdin>'
source_filename = "./dijkstra.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._QITEM = type { i32, i32, i32, %struct._QITEM* }
%struct._NODE = type { i32, i32 }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !2, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !15, nameTableKind: None)
!3 = !DIFile(filename: "dijkstra.c", directory: "/home/newton/cfiles/xmark")
!4 = !{}
!5 = !{!6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !9)
!8 = !DIFile(filename: "./dijkstra.c", directory: "/home/newton/cfiles/xmark")
!9 = !{!10, !12, !13, !14}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !7, file: !8, line: 40, baseType: !11, size: 32)
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !7, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !7, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !7, file: !8, line: 43, baseType: !6, size: 64, offset: 128)
!15 = !{!0, !16, !18, !27, !29, !31, !33}
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !2, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !2, file: !8, line: 49, type: !20, isLocal: false, isDefinition: true)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 2560, elements: !25)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !22)
!22 = !{!23, !24}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !21, file: !8, line: 35, baseType: !11, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !21, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!25 = !{!26}
!26 = !DISubrange(count: 40)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !2, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !2, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !2, file: !8, line: 53, type: !6, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !2, file: !8, line: 54, type: !35, isLocal: false, isDefinition: true)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192000, elements: !36)
!36 = !{!37}
!37 = !DISubrange(count: 1000)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 12800, elements: !40)
!39 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!40 = !{!26, !26}
!41 = !{i32 2, !"Dwarf Version", i32 4}
!42 = !{i32 2, !"Debug Info Version", i32 3}
!43 = !{i32 1, !"wchar_size", i32 4}
!44 = !{!"clang version 9.0.1-12 "}
!45 = distinct !DISubprogram(name: "dijkstra_init", scope: !8, file: !8, line: 70, type: !46, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !48)
!46 = !DISubroutineType(types: !47)
!47 = !{null}
!48 = !{!49, !50, !51}
!49 = !DILocalVariable(name: "i", scope: !45, file: !8, line: 72, type: !11)
!50 = !DILocalVariable(name: "k", scope: !45, file: !8, line: 72, type: !11)
!51 = !DILocalVariable(name: "x", scope: !45, file: !8, line: 73, type: !52)
!52 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !11)
!53 = !DILocation(line: 73, column: 3, scope: !45)
!54 = !DILocation(line: 73, column: 16, scope: !45)
!55 = !{!56, !56, i64 0}
!56 = !{!"int", !57, i64 0}
!57 = !{!"omnipotent char", !58, i64 0}
!58 = !{!"Simple C/C++ TBAA"}
!59 = !DILocation(line: 0, scope: !45)
!60 = !DILocation(line: 75, column: 3, scope: !61)
!61 = distinct !DILexicalBlock(scope: !45, file: !8, line: 75, column: 3)
!62 = !DILocation(line: 78, column: 39, scope: !63)
!63 = distinct !DILexicalBlock(scope: !64, file: !8, line: 77, column: 5)
!64 = distinct !DILexicalBlock(scope: !65, file: !8, line: 77, column: 5)
!65 = distinct !DILexicalBlock(scope: !66, file: !8, line: 75, column: 37)
!66 = distinct !DILexicalBlock(scope: !61, file: !8, line: 75, column: 3)
!67 = !DILocation(line: 78, column: 7, scope: !63)
!68 = !DILocation(line: 78, column: 36, scope: !63)
!69 = !{!57, !57, i64 0}
!70 = !DILocation(line: 75, column: 32, scope: !66)
!71 = !DILocation(line: 75, column: 18, scope: !66)
!72 = distinct !{!72, !60, !73}
!73 = !DILocation(line: 79, column: 3, scope: !61)
!74 = !DILocation(line: 81, column: 23, scope: !45)
!75 = !DILocation(line: 82, column: 22, scope: !45)
!76 = !DILocation(line: 83, column: 22, scope: !45)
!77 = !{!78, !78, i64 0}
!78 = !{!"any pointer", !57, i64 0}
!79 = !DILocation(line: 85, column: 21, scope: !45)
!80 = !DILocation(line: 86, column: 1, scope: !45)
!81 = distinct !DISubprogram(name: "dijkstra_return", scope: !8, file: !8, line: 88, type: !82, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!82 = !DISubroutineType(types: !83)
!83 = !{!11}
!84 = !DILocation(line: 90, column: 14, scope: !81)
!85 = !DILocation(line: 90, column: 32, scope: !81)
!86 = !DILocation(line: 90, column: 12, scope: !81)
!87 = !DILocation(line: 90, column: 3, scope: !81)
!88 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !89, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !91)
!89 = !DISubroutineType(types: !90)
!90 = !{!11, !11, !11, !11}
!91 = !{!92, !93, !94, !95, !96}
!92 = !DILocalVariable(name: "node", arg: 1, scope: !88, file: !8, line: 93, type: !11)
!93 = !DILocalVariable(name: "dist", arg: 2, scope: !88, file: !8, line: 93, type: !11)
!94 = !DILocalVariable(name: "prev", arg: 3, scope: !88, file: !8, line: 93, type: !11)
!95 = !DILocalVariable(name: "newItem", scope: !88, file: !8, line: 95, type: !6)
!96 = !DILocalVariable(name: "last", scope: !88, file: !8, line: 96, type: !6)
!97 = !DILocation(line: 0, scope: !88)
!98 = !DILocation(line: 95, column: 50, scope: !88)
!99 = !DILocation(line: 95, column: 29, scope: !88)
!100 = !DILocation(line: 96, column: 25, scope: !88)
!101 = !DILocation(line: 98, column: 8, scope: !102)
!102 = distinct !DILexicalBlock(scope: !88, file: !8, line: 98, column: 8)
!103 = !DILocation(line: 98, column: 29, scope: !102)
!104 = !DILocation(line: 98, column: 8, scope: !88)
!105 = !DILocation(line: 100, column: 12, scope: !88)
!106 = !DILocation(line: 100, column: 17, scope: !88)
!107 = !{!108, !56, i64 0}
!108 = !{!"_QITEM", !56, i64 0, !56, i64 4, !56, i64 8, !78, i64 16}
!109 = !DILocation(line: 101, column: 12, scope: !88)
!110 = !DILocation(line: 101, column: 17, scope: !88)
!111 = !{!108, !56, i64 4}
!112 = !DILocation(line: 102, column: 12, scope: !88)
!113 = !DILocation(line: 102, column: 17, scope: !88)
!114 = !{!108, !56, i64 8}
!115 = !DILocation(line: 103, column: 12, scope: !88)
!116 = !DILocation(line: 103, column: 17, scope: !88)
!117 = !{!108, !78, i64 16}
!118 = !DILocation(line: 105, column: 9, scope: !119)
!119 = distinct !DILexicalBlock(scope: !88, file: !8, line: 105, column: 8)
!120 = !DILocation(line: 105, column: 8, scope: !88)
!121 = !DILocation(line: 110, column: 19, scope: !122)
!122 = distinct !DILexicalBlock(scope: !119, file: !8, line: 107, column: 8)
!123 = !DILocation(line: 110, column: 5, scope: !122)
!124 = distinct !{!124, !123, !125}
!125 = !DILocation(line: 111, column: 20, scope: !122)
!126 = !DILocation(line: 0, scope: !119)
!127 = !DILocation(line: 114, column: 22, scope: !88)
!128 = !DILocation(line: 115, column: 3, scope: !88)
!129 = !DILocation(line: 116, column: 1, scope: !88)
!130 = distinct !DISubprogram(name: "dijkstra_dequeue", scope: !8, file: !8, line: 118, type: !131, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !134)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !133, !133, !133}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!134 = !{!135, !136, !137}
!135 = !DILocalVariable(name: "node", arg: 1, scope: !130, file: !8, line: 118, type: !133)
!136 = !DILocalVariable(name: "dist", arg: 2, scope: !130, file: !8, line: 118, type: !133)
!137 = !DILocalVariable(name: "prev", arg: 3, scope: !130, file: !8, line: 118, type: !133)
!138 = !DILocation(line: 0, scope: !130)
!139 = !DILocation(line: 120, column: 8, scope: !140)
!140 = distinct !DILexicalBlock(scope: !130, file: !8, line: 120, column: 8)
!141 = !DILocation(line: 120, column: 8, scope: !130)
!142 = !DILocation(line: 121, column: 33, scope: !143)
!143 = distinct !DILexicalBlock(scope: !140, file: !8, line: 120, column: 29)
!144 = !DILocation(line: 121, column: 11, scope: !143)
!145 = !DILocation(line: 122, column: 33, scope: !143)
!146 = !DILocation(line: 122, column: 11, scope: !143)
!147 = !DILocation(line: 123, column: 33, scope: !143)
!148 = !DILocation(line: 123, column: 11, scope: !143)
!149 = !DILocation(line: 124, column: 46, scope: !143)
!150 = !DILocation(line: 124, column: 24, scope: !143)
!151 = !DILocation(line: 125, column: 24, scope: !143)
!152 = !DILocation(line: 126, column: 3, scope: !143)
!153 = !DILocation(line: 127, column: 1, scope: !130)
!154 = distinct !DISubprogram(name: "dijkstra_qcount", scope: !8, file: !8, line: 129, type: !82, scopeLine: 130, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!155 = !DILocation(line: 131, column: 12, scope: !154)
!156 = !DILocation(line: 131, column: 3, scope: !154)
!157 = distinct !DISubprogram(name: "dijkstra_find", scope: !8, file: !8, line: 134, type: !158, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !160)
!158 = !DISubroutineType(types: !159)
!159 = !{!11, !11, !11}
!160 = !{!161, !162, !163, !164, !165, !166, !167, !168}
!161 = !DILocalVariable(name: "chStart", arg: 1, scope: !157, file: !8, line: 134, type: !11)
!162 = !DILocalVariable(name: "chEnd", arg: 2, scope: !157, file: !8, line: 134, type: !11)
!163 = !DILocalVariable(name: "ch", scope: !157, file: !8, line: 136, type: !11)
!164 = !DILocalVariable(name: "prev", scope: !157, file: !8, line: 137, type: !11)
!165 = !DILocalVariable(name: "node", scope: !157, file: !8, line: 137, type: !11)
!166 = !DILocalVariable(name: "cost", scope: !157, file: !8, line: 138, type: !11)
!167 = !DILocalVariable(name: "dist", scope: !157, file: !8, line: 138, type: !11)
!168 = !DILocalVariable(name: "i", scope: !157, file: !8, line: 139, type: !11)
!169 = !DILocation(line: 0, scope: !157)
!170 = !DILocation(line: 143, column: 34, scope: !171)
!171 = distinct !DILexicalBlock(scope: !172, file: !8, line: 142, column: 40)
!172 = distinct !DILexicalBlock(scope: !173, file: !8, line: 142, column: 3)
!173 = distinct !DILexicalBlock(scope: !157, file: !8, line: 142, column: 3)
!174 = !DILocation(line: 147, column: 16, scope: !175)
!175 = distinct !DILexicalBlock(scope: !157, file: !8, line: 147, column: 8)
!176 = !DILocation(line: 147, column: 8, scope: !157)
!177 = !DILocation(line: 149, column: 5, scope: !178)
!178 = distinct !DILexicalBlock(scope: !175, file: !8, line: 148, column: 10)
!179 = !DILocation(line: 149, column: 34, scope: !178)
!180 = !DILocation(line: 149, column: 39, scope: !178)
!181 = !{!182, !56, i64 0}
!182 = !{!"_NODE", !56, i64 0, !56, i64 4}
!183 = !DILocation(line: 150, column: 34, scope: !178)
!184 = !DILocation(line: 150, column: 39, scope: !178)
!185 = !{!182, !56, i64 4}
!186 = !DILocation(line: 0, scope: !88, inlinedAt: !187)
!187 = distinct !DILocation(line: 152, column: 10, scope: !188)
!188 = distinct !DILexicalBlock(scope: !178, file: !8, line: 152, column: 10)
!189 = !DILocation(line: 95, column: 50, scope: !88, inlinedAt: !187)
!190 = !DILocation(line: 95, column: 29, scope: !88, inlinedAt: !187)
!191 = !DILocation(line: 96, column: 25, scope: !88, inlinedAt: !187)
!192 = !DILocation(line: 98, column: 8, scope: !102, inlinedAt: !187)
!193 = !DILocation(line: 98, column: 29, scope: !102, inlinedAt: !187)
!194 = !DILocation(line: 98, column: 8, scope: !88, inlinedAt: !187)
!195 = !DILocation(line: 100, column: 12, scope: !88, inlinedAt: !187)
!196 = !DILocation(line: 100, column: 17, scope: !88, inlinedAt: !187)
!197 = !DILocation(line: 101, column: 12, scope: !88, inlinedAt: !187)
!198 = !DILocation(line: 101, column: 17, scope: !88, inlinedAt: !187)
!199 = !DILocation(line: 102, column: 12, scope: !88, inlinedAt: !187)
!200 = !DILocation(line: 102, column: 17, scope: !88, inlinedAt: !187)
!201 = !DILocation(line: 103, column: 12, scope: !88, inlinedAt: !187)
!202 = !DILocation(line: 103, column: 17, scope: !88, inlinedAt: !187)
!203 = !DILocation(line: 105, column: 9, scope: !119, inlinedAt: !187)
!204 = !DILocation(line: 105, column: 8, scope: !88, inlinedAt: !187)
!205 = !DILocation(line: 110, column: 19, scope: !122, inlinedAt: !187)
!206 = !DILocation(line: 110, column: 5, scope: !122, inlinedAt: !187)
!207 = distinct !{!207, !206, !208}
!208 = !DILocation(line: 111, column: 20, scope: !122, inlinedAt: !187)
!209 = !DILocation(line: 0, scope: !119, inlinedAt: !187)
!210 = !DILocation(line: 114, column: 22, scope: !88, inlinedAt: !187)
!211 = !DILocation(line: 157, column: 31, scope: !178)
!212 = !DILocation(line: 157, column: 5, scope: !178)
!213 = !DILocation(line: 120, column: 8, scope: !140, inlinedAt: !214)
!214 = distinct !DILocation(line: 158, column: 7, scope: !215)
!215 = distinct !DILexicalBlock(scope: !178, file: !8, line: 157, column: 37)
!216 = !DILocation(line: 120, column: 8, scope: !130, inlinedAt: !214)
!217 = !DILocation(line: 121, column: 33, scope: !143, inlinedAt: !214)
!218 = !DILocation(line: 122, column: 33, scope: !143, inlinedAt: !214)
!219 = !DILocation(line: 124, column: 46, scope: !143, inlinedAt: !214)
!220 = !DILocation(line: 124, column: 24, scope: !143, inlinedAt: !214)
!221 = !DILocation(line: 125, column: 24, scope: !143, inlinedAt: !214)
!222 = !DILocation(line: 126, column: 3, scope: !143, inlinedAt: !214)
!223 = !DILocation(line: 0, scope: !224)
!224 = distinct !DILexicalBlock(scope: !225, file: !8, line: 161, column: 14)
!225 = distinct !DILexicalBlock(scope: !226, file: !8, line: 160, column: 41)
!226 = distinct !DILexicalBlock(scope: !227, file: !8, line: 160, column: 7)
!227 = distinct !DILexicalBlock(scope: !215, file: !8, line: 160, column: 7)
!228 = !DILocation(line: 160, column: 7, scope: !227)
!229 = !DILocation(line: 161, column: 23, scope: !224)
!230 = !DILocation(line: 162, column: 49, scope: !231)
!231 = distinct !DILexicalBlock(scope: !232, file: !8, line: 162, column: 16)
!232 = distinct !DILexicalBlock(scope: !224, file: !8, line: 161, column: 67)
!233 = !DILocation(line: 162, column: 23, scope: !231)
!234 = !DILocation(line: 163, column: 55, scope: !231)
!235 = !DILocation(line: 163, column: 46, scope: !231)
!236 = !DILocation(line: 162, column: 56, scope: !231)
!237 = !DILocation(line: 164, column: 41, scope: !238)
!238 = distinct !DILexicalBlock(scope: !231, file: !8, line: 163, column: 68)
!239 = !DILocation(line: 165, column: 36, scope: !238)
!240 = !DILocation(line: 165, column: 41, scope: !238)
!241 = !DILocation(line: 0, scope: !88, inlinedAt: !242)
!242 = distinct !DILocation(line: 166, column: 18, scope: !243)
!243 = distinct !DILexicalBlock(scope: !238, file: !8, line: 166, column: 18)
!244 = !DILocation(line: 95, column: 29, scope: !88, inlinedAt: !242)
!245 = !DILocation(line: 98, column: 8, scope: !102, inlinedAt: !242)
!246 = !DILocation(line: 98, column: 29, scope: !102, inlinedAt: !242)
!247 = !DILocation(line: 98, column: 8, scope: !88, inlinedAt: !242)
!248 = !DILocation(line: 100, column: 12, scope: !88, inlinedAt: !242)
!249 = !DILocation(line: 100, column: 17, scope: !88, inlinedAt: !242)
!250 = !DILocation(line: 101, column: 12, scope: !88, inlinedAt: !242)
!251 = !DILocation(line: 101, column: 17, scope: !88, inlinedAt: !242)
!252 = !DILocation(line: 102, column: 12, scope: !88, inlinedAt: !242)
!253 = !DILocation(line: 102, column: 17, scope: !88, inlinedAt: !242)
!254 = !DILocation(line: 103, column: 12, scope: !88, inlinedAt: !242)
!255 = !DILocation(line: 103, column: 17, scope: !88, inlinedAt: !242)
!256 = !DILocation(line: 105, column: 9, scope: !119, inlinedAt: !242)
!257 = !DILocation(line: 105, column: 8, scope: !88, inlinedAt: !242)
!258 = !DILocation(line: 110, column: 19, scope: !122, inlinedAt: !242)
!259 = !DILocation(line: 110, column: 5, scope: !122, inlinedAt: !242)
!260 = distinct !{!260, !259, !261}
!261 = !DILocation(line: 111, column: 20, scope: !122, inlinedAt: !242)
!262 = !DILocation(line: 0, scope: !119, inlinedAt: !242)
!263 = !DILocation(line: 114, column: 22, scope: !88, inlinedAt: !242)
!264 = !DILocation(line: 166, column: 18, scope: !238)
!265 = !DILocation(line: 160, column: 36, scope: !226)
!266 = !DILocation(line: 160, column: 22, scope: !226)
!267 = distinct !{!267, !228, !268}
!268 = !DILocation(line: 170, column: 7, scope: !227)
!269 = !DILocation(line: 174, column: 1, scope: !157)
!270 = !DILocalVariable(name: "ch", scope: !271, file: !8, line: 136, type: !11)
!271 = distinct !DISubprogram(name: "dijkstra_find", scope: !8, file: !8, line: 134, type: !158, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !272, retainedNodes: !302)
!272 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !273, globals: !281, nameTableKind: None)
!273 = !{!274}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !276)
!276 = !{!277, !278, !279, !280}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !275, file: !8, line: 40, baseType: !11, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !275, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !275, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !275, file: !8, line: 43, baseType: !274, size: 64, offset: 128)
!281 = !{!282, !284, !286, !293, !295, !297, !299}
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !272, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !272, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !272, file: !8, line: 49, type: !288, isLocal: false, isDefinition: true)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 2560, elements: !25)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !290)
!290 = !{!291, !292}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !289, file: !8, line: 35, baseType: !11, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !289, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !272, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !272, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !272, file: !8, line: 53, type: !274, isLocal: false, isDefinition: true)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !272, file: !8, line: 54, type: !301, isLocal: false, isDefinition: true)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 192000, elements: !36)
!302 = !{!303, !304, !270, !305, !306, !307, !308, !309}
!303 = !DILocalVariable(name: "chStart", arg: 1, scope: !271, file: !8, line: 134, type: !11)
!304 = !DILocalVariable(name: "chEnd", arg: 2, scope: !271, file: !8, line: 134, type: !11)
!305 = !DILocalVariable(name: "prev", scope: !271, file: !8, line: 137, type: !11)
!306 = !DILocalVariable(name: "node", scope: !271, file: !8, line: 137, type: !11)
!307 = !DILocalVariable(name: "cost", scope: !271, file: !8, line: 138, type: !11)
!308 = !DILocalVariable(name: "dist", scope: !271, file: !8, line: 138, type: !11)
!309 = !DILocalVariable(name: "i", scope: !271, file: !8, line: 139, type: !11)
!310 = !DILocalVariable(name: "last", scope: !311, file: !8, line: 96, type: !314)
!311 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !89, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !342)
!312 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !313, globals: !321, nameTableKind: None)
!313 = !{!314}
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !316)
!316 = !{!317, !318, !319, !320}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !315, file: !8, line: 40, baseType: !11, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !315, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !315, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !315, file: !8, line: 43, baseType: !314, size: 64, offset: 128)
!321 = !{!322, !324, !326, !333, !335, !337, !339}
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !312, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !312, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !312, file: !8, line: 49, type: !328, isLocal: false, isDefinition: true)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 2560, elements: !25)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !330)
!330 = !{!331, !332}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !329, file: !8, line: 35, baseType: !11, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !329, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !312, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !312, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !312, file: !8, line: 53, type: !314, isLocal: false, isDefinition: true)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !312, file: !8, line: 54, type: !341, isLocal: false, isDefinition: true)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 192000, elements: !36)
!342 = !{!343, !344, !345, !346, !310}
!343 = !DILocalVariable(name: "node", arg: 1, scope: !311, file: !8, line: 93, type: !11)
!344 = !DILocalVariable(name: "dist", arg: 2, scope: !311, file: !8, line: 93, type: !11)
!345 = !DILocalVariable(name: "prev", arg: 3, scope: !311, file: !8, line: 93, type: !11)
!346 = !DILocalVariable(name: "newItem", scope: !311, file: !8, line: 95, type: !314)
!347 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !348)
!348 = !{!349, !350}
!349 = !DILocalVariable(name: "i", scope: !347, file: !8, line: 178, type: !11)
!350 = !DILocalVariable(name: "j", scope: !347, file: !8, line: 178, type: !11)
!351 = !DILocation(line: 0, scope: !347)
!352 = !DILocation(line: 184, column: 10, scope: !353)
!353 = distinct !DILexicalBlock(scope: !354, file: !8, line: 184, column: 10)
!354 = distinct !DILexicalBlock(scope: !355, file: !8, line: 182, column: 54)
!355 = distinct !DILexicalBlock(scope: !356, file: !8, line: 182, column: 3)
!356 = distinct !DILexicalBlock(scope: !347, file: !8, line: 182, column: 3)
!357 = !DILocation(line: 184, column: 32, scope: !353)
!358 = !DILocation(line: 185, column: 25, scope: !359)
!359 = distinct !DILexicalBlock(scope: !353, file: !8, line: 184, column: 51)
!360 = !DILocation(line: 186, column: 7, scope: !359)
!361 = !DILocation(line: 188, column: 51, scope: !353)
!362 = !DILocation(line: 188, column: 25, scope: !353)
!363 = !DILocation(line: 189, column: 24, scope: !354)
!364 = !DILocation(line: 191, column: 1, scope: !347)
!365 = !DILocation(line: 184, column: 10, scope: !354)
!366 = !DILocalVariable(name: "j", scope: !367, file: !8, line: 178, type: !11)
!367 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !368, retainedNodes: !398)
!368 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !369, globals: !377, nameTableKind: None)
!369 = !{!370}
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !372)
!372 = !{!373, !374, !375, !376}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !371, file: !8, line: 40, baseType: !11, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !371, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !371, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !371, file: !8, line: 43, baseType: !370, size: 64, offset: 128)
!377 = !{!378, !380, !382, !389, !391, !393, !395}
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !368, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !368, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !368, file: !8, line: 49, type: !384, isLocal: false, isDefinition: true)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 2560, elements: !25)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !386)
!386 = !{!387, !388}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !385, file: !8, line: 35, baseType: !11, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !385, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !368, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !368, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !368, file: !8, line: 53, type: !370, isLocal: false, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !368, file: !8, line: 54, type: !397, isLocal: false, isDefinition: true)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !371, size: 192000, elements: !36)
!398 = !{!399, !366}
!399 = !DILocalVariable(name: "i", scope: !367, file: !8, line: 178, type: !11)
!400 = !DILocalVariable(name: "j", scope: !401, file: !8, line: 178, type: !11)
!401 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !402, retainedNodes: !432)
!402 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !403, globals: !411, nameTableKind: None)
!403 = !{!404}
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !406)
!406 = !{!407, !408, !409, !410}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !405, file: !8, line: 40, baseType: !11, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !405, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !405, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !405, file: !8, line: 43, baseType: !404, size: 64, offset: 128)
!411 = !{!412, !414, !416, !423, !425, !427, !429}
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !402, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !402, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !402, file: !8, line: 49, type: !418, isLocal: false, isDefinition: true)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !419, size: 2560, elements: !25)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !420)
!420 = !{!421, !422}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !419, file: !8, line: 35, baseType: !11, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !419, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !402, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !402, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !402, file: !8, line: 53, type: !404, isLocal: false, isDefinition: true)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !402, file: !8, line: 54, type: !431, isLocal: false, isDefinition: true)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 192000, elements: !36)
!432 = !{!433, !400}
!433 = !DILocalVariable(name: "i", scope: !401, file: !8, line: 178, type: !11)
!434 = distinct !DISubprogram(name: "main", scope: !8, file: !8, line: 193, type: !435, scopeLine: 194, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !440)
!435 = !DISubroutineType(types: !436)
!436 = !{!11, !11, !437}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!440 = !{!441, !442}
!441 = !DILocalVariable(name: "argc", arg: 1, scope: !434, file: !8, line: 193, type: !11)
!442 = !DILocalVariable(name: "argv", arg: 2, scope: !434, file: !8, line: 193, type: !437)
!443 = !DILocation(line: 0, scope: !434)
!444 = !DILocation(line: 195, column: 3, scope: !434)
!445 = !DILocation(line: 196, column: 3, scope: !434)
!446 = !DILocation(line: 90, column: 14, scope: !81, inlinedAt: !447)
!447 = distinct !DILocation(line: 198, column: 12, scope: !434)
!448 = !DILocation(line: 90, column: 32, scope: !81, inlinedAt: !447)
!449 = !DILocation(line: 90, column: 12, scope: !81, inlinedAt: !447)
!450 = !DILocation(line: 198, column: 3, scope: !434)
!451 = !DILocalVariable(name: "argc", arg: 1, scope: !452, file: !8, line: 193, type: !11)
!452 = distinct !DISubprogram(name: "main", scope: !8, file: !8, line: 193, type: !435, scopeLine: 194, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !453, retainedNodes: !483)
!453 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !454, globals: !462, nameTableKind: None)
!454 = !{!455}
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !457)
!457 = !{!458, !459, !460, !461}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !456, file: !8, line: 40, baseType: !11, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !456, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !456, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !456, file: !8, line: 43, baseType: !455, size: 64, offset: 128)
!462 = !{!463, !465, !467, !474, !476, !478, !480}
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !453, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !453, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !453, file: !8, line: 49, type: !469, isLocal: false, isDefinition: true)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !470, size: 2560, elements: !25)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !471)
!471 = !{!472, !473}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !470, file: !8, line: 35, baseType: !11, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !470, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !453, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !453, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !453, file: !8, line: 53, type: !455, isLocal: false, isDefinition: true)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !453, file: !8, line: 54, type: !482, isLocal: false, isDefinition: true)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !456, size: 192000, elements: !36)
!483 = !{!451, !484}
!484 = !DILocalVariable(name: "argv", arg: 2, scope: !452, file: !8, line: 193, type: !437)
