; ModuleID = '<stdin>'
source_filename = "./dijkstra.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._QITEM = type { i32, i32, i32, %struct._QITEM* }
%struct._NODE = type { i32, i32 }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !2, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !15, nameTableKind: None)
!3 = !DIFile(filename: "dijkstra.c", directory: "/home/newton/cfiles/xmark")
!4 = !{}
!5 = !{!6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !9)
!8 = !DIFile(filename: "./dijkstra.c", directory: "/home/newton/cfiles/xmark")
!9 = !{!10, !12, !13, !14}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !7, file: !8, line: 40, baseType: !11, size: 32)
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !7, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !7, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !7, file: !8, line: 43, baseType: !6, size: 64, offset: 128)
!15 = !{!0, !16, !18, !27, !29, !31, !33}
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !2, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !2, file: !8, line: 49, type: !20, isLocal: false, isDefinition: true)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 2560, elements: !25)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !22)
!22 = !{!23, !24}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !21, file: !8, line: 35, baseType: !11, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !21, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!25 = !{!26}
!26 = !DISubrange(count: 40)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !2, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !2, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !2, file: !8, line: 53, type: !6, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !2, file: !8, line: 54, type: !35, isLocal: false, isDefinition: true)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192000, elements: !36)
!36 = !{!37}
!37 = !DISubrange(count: 1000)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 12800, elements: !40)
!39 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!40 = !{!26, !26}
!41 = !{i32 2, !"Dwarf Version", i32 4}
!42 = !{i32 2, !"Debug Info Version", i32 3}
!43 = !{i32 1, !"wchar_size", i32 4}
!44 = !{!"clang version 9.0.1-12 "}
!45 = distinct !DISubprogram(name: "dijkstra_init", scope: !8, file: !8, line: 70, type: !46, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !48)
!46 = !DISubroutineType(types: !47)
!47 = !{null}
!48 = !{!49, !50, !51}
!49 = !DILocalVariable(name: "i", scope: !45, file: !8, line: 72, type: !11)
!50 = !DILocalVariable(name: "k", scope: !45, file: !8, line: 72, type: !11)
!51 = !DILocalVariable(name: "x", scope: !45, file: !8, line: 73, type: !52)
!52 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !11)
!53 = !DILocation(line: 73, column: 3, scope: !45)
!54 = !DILocation(line: 73, column: 16, scope: !45)
!55 = !{!56, !56, i64 0}
!56 = !{!"int", !57, i64 0}
!57 = !{!"omnipotent char", !58, i64 0}
!58 = !{!"Simple C/C++ TBAA"}
!59 = !DILocation(line: 0, scope: !45)
!60 = !DILocation(line: 75, column: 3, scope: !61)
!61 = distinct !DILexicalBlock(scope: !45, file: !8, line: 75, column: 3)
!62 = !DILocation(line: 78, column: 39, scope: !63)
!63 = distinct !DILexicalBlock(scope: !64, file: !8, line: 77, column: 5)
!64 = distinct !DILexicalBlock(scope: !65, file: !8, line: 77, column: 5)
!65 = distinct !DILexicalBlock(scope: !66, file: !8, line: 75, column: 37)
!66 = distinct !DILexicalBlock(scope: !61, file: !8, line: 75, column: 3)
!67 = !DILocation(line: 78, column: 7, scope: !63)
!68 = !DILocation(line: 78, column: 36, scope: !63)
!69 = !{!57, !57, i64 0}
!70 = !DILocation(line: 75, column: 32, scope: !66)
!71 = !DILocation(line: 75, column: 18, scope: !66)
!72 = distinct !{!72, !60, !73}
!73 = !DILocation(line: 79, column: 3, scope: !61)
!74 = !DILocation(line: 81, column: 23, scope: !45)
!75 = !DILocation(line: 82, column: 22, scope: !45)
!76 = !DILocation(line: 83, column: 22, scope: !45)
!77 = !{!78, !78, i64 0}
!78 = !{!"any pointer", !57, i64 0}
!79 = !DILocation(line: 85, column: 21, scope: !45)
!80 = !DILocation(line: 86, column: 1, scope: !45)
!81 = !DILocalVariable(name: "k", scope: !82, file: !8, line: 72, type: !11)
!82 = distinct !DISubprogram(name: "dijkstra_init", scope: !8, file: !8, line: 70, type: !46, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !83, retainedNodes: !113)
!83 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !84, globals: !92, nameTableKind: None)
!84 = !{!85}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !87)
!87 = !{!88, !89, !90, !91}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !86, file: !8, line: 40, baseType: !11, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !86, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !86, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !86, file: !8, line: 43, baseType: !85, size: 64, offset: 128)
!92 = !{!93, !95, !97, !104, !106, !108, !110}
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !83, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !83, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !83, file: !8, line: 49, type: !99, isLocal: false, isDefinition: true)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 2560, elements: !25)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !101)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !100, file: !8, line: 35, baseType: !11, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !100, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !83, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !83, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !83, file: !8, line: 53, type: !85, isLocal: false, isDefinition: true)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !83, file: !8, line: 54, type: !112, isLocal: false, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 192000, elements: !36)
!113 = !{!114, !81, !115}
!114 = !DILocalVariable(name: "i", scope: !82, file: !8, line: 72, type: !11)
!115 = !DILocalVariable(name: "x", scope: !82, file: !8, line: 73, type: !52)
!116 = distinct !DISubprogram(name: "dijkstra_return", scope: !8, file: !8, line: 88, type: !117, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!117 = !DISubroutineType(types: !118)
!118 = !{!11}
!119 = !DILocation(line: 90, column: 14, scope: !116)
!120 = !DILocation(line: 90, column: 32, scope: !116)
!121 = !DILocation(line: 90, column: 12, scope: !116)
!122 = !DILocation(line: 90, column: 3, scope: !116)
!123 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !124, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !126)
!124 = !DISubroutineType(types: !125)
!125 = !{!11, !11, !11, !11}
!126 = !{!127, !128, !129, !130, !131}
!127 = !DILocalVariable(name: "node", arg: 1, scope: !123, file: !8, line: 93, type: !11)
!128 = !DILocalVariable(name: "dist", arg: 2, scope: !123, file: !8, line: 93, type: !11)
!129 = !DILocalVariable(name: "prev", arg: 3, scope: !123, file: !8, line: 93, type: !11)
!130 = !DILocalVariable(name: "newItem", scope: !123, file: !8, line: 95, type: !6)
!131 = !DILocalVariable(name: "last", scope: !123, file: !8, line: 96, type: !6)
!132 = !DILocation(line: 0, scope: !123)
!133 = !DILocation(line: 95, column: 50, scope: !123)
!134 = !DILocation(line: 95, column: 29, scope: !123)
!135 = !DILocation(line: 96, column: 25, scope: !123)
!136 = !DILocation(line: 98, column: 8, scope: !137)
!137 = distinct !DILexicalBlock(scope: !123, file: !8, line: 98, column: 8)
!138 = !DILocation(line: 98, column: 29, scope: !137)
!139 = !DILocation(line: 98, column: 8, scope: !123)
!140 = !DILocation(line: 100, column: 12, scope: !123)
!141 = !DILocation(line: 100, column: 17, scope: !123)
!142 = !{!143, !56, i64 0}
!143 = !{!"_QITEM", !56, i64 0, !56, i64 4, !56, i64 8, !78, i64 16}
!144 = !DILocation(line: 101, column: 12, scope: !123)
!145 = !DILocation(line: 101, column: 17, scope: !123)
!146 = !{!143, !56, i64 4}
!147 = !DILocation(line: 102, column: 12, scope: !123)
!148 = !DILocation(line: 102, column: 17, scope: !123)
!149 = !{!143, !56, i64 8}
!150 = !DILocation(line: 103, column: 12, scope: !123)
!151 = !DILocation(line: 103, column: 17, scope: !123)
!152 = !{!143, !78, i64 16}
!153 = !DILocation(line: 105, column: 9, scope: !154)
!154 = distinct !DILexicalBlock(scope: !123, file: !8, line: 105, column: 8)
!155 = !DILocation(line: 105, column: 8, scope: !123)
!156 = !DILocation(line: 110, column: 19, scope: !157)
!157 = distinct !DILexicalBlock(scope: !154, file: !8, line: 107, column: 8)
!158 = !DILocation(line: 110, column: 5, scope: !157)
!159 = distinct !{!159, !158, !160}
!160 = !DILocation(line: 111, column: 20, scope: !157)
!161 = !DILocation(line: 0, scope: !154)
!162 = !DILocation(line: 114, column: 22, scope: !123)
!163 = !DILocation(line: 115, column: 3, scope: !123)
!164 = !DILocation(line: 116, column: 1, scope: !123)
!165 = !DILocalVariable(name: "newItem", scope: !166, file: !8, line: 95, type: !169)
!166 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !124, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !167, retainedNodes: !197)
!167 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !168, globals: !176, nameTableKind: None)
!168 = !{!169}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !171)
!171 = !{!172, !173, !174, !175}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !170, file: !8, line: 40, baseType: !11, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !170, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !170, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !170, file: !8, line: 43, baseType: !169, size: 64, offset: 128)
!176 = !{!177, !179, !181, !188, !190, !192, !194}
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !167, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !167, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !167, file: !8, line: 49, type: !183, isLocal: false, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 2560, elements: !25)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !185)
!185 = !{!186, !187}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !184, file: !8, line: 35, baseType: !11, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !184, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !167, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !167, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !167, file: !8, line: 53, type: !169, isLocal: false, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !167, file: !8, line: 54, type: !196, isLocal: false, isDefinition: true)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 192000, elements: !36)
!197 = !{!198, !199, !200, !165, !201}
!198 = !DILocalVariable(name: "node", arg: 1, scope: !166, file: !8, line: 93, type: !11)
!199 = !DILocalVariable(name: "dist", arg: 2, scope: !166, file: !8, line: 93, type: !11)
!200 = !DILocalVariable(name: "prev", arg: 3, scope: !166, file: !8, line: 93, type: !11)
!201 = !DILocalVariable(name: "last", scope: !166, file: !8, line: 96, type: !169)
!202 = !DILocalVariable(name: "last", scope: !203, file: !8, line: 96, type: !206)
!203 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !124, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !204, retainedNodes: !234)
!204 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !205, globals: !213, nameTableKind: None)
!205 = !{!206}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !208)
!208 = !{!209, !210, !211, !212}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !207, file: !8, line: 40, baseType: !11, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !207, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !207, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !207, file: !8, line: 43, baseType: !206, size: 64, offset: 128)
!213 = !{!214, !216, !218, !225, !227, !229, !231}
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !204, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !204, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !204, file: !8, line: 49, type: !220, isLocal: false, isDefinition: true)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 2560, elements: !25)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !222)
!222 = !{!223, !224}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !221, file: !8, line: 35, baseType: !11, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !221, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !204, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !204, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !204, file: !8, line: 53, type: !206, isLocal: false, isDefinition: true)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !204, file: !8, line: 54, type: !233, isLocal: false, isDefinition: true)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 192000, elements: !36)
!234 = !{!235, !236, !237, !238, !202}
!235 = !DILocalVariable(name: "node", arg: 1, scope: !203, file: !8, line: 93, type: !11)
!236 = !DILocalVariable(name: "dist", arg: 2, scope: !203, file: !8, line: 93, type: !11)
!237 = !DILocalVariable(name: "prev", arg: 3, scope: !203, file: !8, line: 93, type: !11)
!238 = !DILocalVariable(name: "newItem", scope: !203, file: !8, line: 95, type: !206)
!239 = distinct !DISubprogram(name: "dijkstra_dequeue", scope: !8, file: !8, line: 118, type: !240, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !243)
!240 = !DISubroutineType(types: !241)
!241 = !{null, !242, !242, !242}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!243 = !{!244, !245, !246}
!244 = !DILocalVariable(name: "node", arg: 1, scope: !239, file: !8, line: 118, type: !242)
!245 = !DILocalVariable(name: "dist", arg: 2, scope: !239, file: !8, line: 118, type: !242)
!246 = !DILocalVariable(name: "prev", arg: 3, scope: !239, file: !8, line: 118, type: !242)
!247 = !DILocation(line: 0, scope: !239)
!248 = !DILocation(line: 120, column: 8, scope: !249)
!249 = distinct !DILexicalBlock(scope: !239, file: !8, line: 120, column: 8)
!250 = !DILocation(line: 120, column: 8, scope: !239)
!251 = !DILocation(line: 121, column: 33, scope: !252)
!252 = distinct !DILexicalBlock(scope: !249, file: !8, line: 120, column: 29)
!253 = !DILocation(line: 121, column: 11, scope: !252)
!254 = !DILocation(line: 122, column: 33, scope: !252)
!255 = !DILocation(line: 122, column: 11, scope: !252)
!256 = !DILocation(line: 123, column: 33, scope: !252)
!257 = !DILocation(line: 123, column: 11, scope: !252)
!258 = !DILocation(line: 124, column: 46, scope: !252)
!259 = !DILocation(line: 124, column: 24, scope: !252)
!260 = !DILocation(line: 125, column: 24, scope: !252)
!261 = !DILocation(line: 126, column: 3, scope: !252)
!262 = !DILocation(line: 127, column: 1, scope: !239)
!263 = distinct !DISubprogram(name: "dijkstra_qcount", scope: !8, file: !8, line: 129, type: !117, scopeLine: 130, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!264 = !DILocation(line: 131, column: 12, scope: !263)
!265 = !DILocation(line: 131, column: 3, scope: !263)
!266 = distinct !DISubprogram(name: "dijkstra_find", scope: !8, file: !8, line: 134, type: !267, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !269)
!267 = !DISubroutineType(types: !268)
!268 = !{!11, !11, !11}
!269 = !{!270, !271, !272, !273, !274, !275, !276, !277}
!270 = !DILocalVariable(name: "chStart", arg: 1, scope: !266, file: !8, line: 134, type: !11)
!271 = !DILocalVariable(name: "chEnd", arg: 2, scope: !266, file: !8, line: 134, type: !11)
!272 = !DILocalVariable(name: "ch", scope: !266, file: !8, line: 136, type: !11)
!273 = !DILocalVariable(name: "prev", scope: !266, file: !8, line: 137, type: !11)
!274 = !DILocalVariable(name: "node", scope: !266, file: !8, line: 137, type: !11)
!275 = !DILocalVariable(name: "cost", scope: !266, file: !8, line: 138, type: !11)
!276 = !DILocalVariable(name: "dist", scope: !266, file: !8, line: 138, type: !11)
!277 = !DILocalVariable(name: "i", scope: !266, file: !8, line: 139, type: !11)
!278 = !DILocation(line: 0, scope: !266)
!279 = !DILocation(line: 143, column: 34, scope: !280)
!280 = distinct !DILexicalBlock(scope: !281, file: !8, line: 142, column: 40)
!281 = distinct !DILexicalBlock(scope: !282, file: !8, line: 142, column: 3)
!282 = distinct !DILexicalBlock(scope: !266, file: !8, line: 142, column: 3)
!283 = !DILocation(line: 147, column: 16, scope: !284)
!284 = distinct !DILexicalBlock(scope: !266, file: !8, line: 147, column: 8)
!285 = !DILocation(line: 147, column: 8, scope: !266)
!286 = !DILocation(line: 149, column: 5, scope: !287)
!287 = distinct !DILexicalBlock(scope: !284, file: !8, line: 148, column: 10)
!288 = !DILocation(line: 149, column: 34, scope: !287)
!289 = !DILocation(line: 149, column: 39, scope: !287)
!290 = !{!291, !56, i64 0}
!291 = !{!"_NODE", !56, i64 0, !56, i64 4}
!292 = !DILocation(line: 150, column: 34, scope: !287)
!293 = !DILocation(line: 150, column: 39, scope: !287)
!294 = !{!291, !56, i64 4}
!295 = !DILocation(line: 0, scope: !123, inlinedAt: !296)
!296 = distinct !DILocation(line: 152, column: 10, scope: !297)
!297 = distinct !DILexicalBlock(scope: !287, file: !8, line: 152, column: 10)
!298 = !DILocation(line: 95, column: 50, scope: !123, inlinedAt: !296)
!299 = !DILocation(line: 95, column: 29, scope: !123, inlinedAt: !296)
!300 = !DILocation(line: 96, column: 25, scope: !123, inlinedAt: !296)
!301 = !DILocation(line: 98, column: 8, scope: !137, inlinedAt: !296)
!302 = !DILocation(line: 98, column: 29, scope: !137, inlinedAt: !296)
!303 = !DILocation(line: 98, column: 8, scope: !123, inlinedAt: !296)
!304 = !DILocation(line: 100, column: 12, scope: !123, inlinedAt: !296)
!305 = !DILocation(line: 100, column: 17, scope: !123, inlinedAt: !296)
!306 = !DILocation(line: 101, column: 12, scope: !123, inlinedAt: !296)
!307 = !DILocation(line: 101, column: 17, scope: !123, inlinedAt: !296)
!308 = !DILocation(line: 102, column: 12, scope: !123, inlinedAt: !296)
!309 = !DILocation(line: 102, column: 17, scope: !123, inlinedAt: !296)
!310 = !DILocation(line: 103, column: 12, scope: !123, inlinedAt: !296)
!311 = !DILocation(line: 103, column: 17, scope: !123, inlinedAt: !296)
!312 = !DILocation(line: 105, column: 9, scope: !154, inlinedAt: !296)
!313 = !DILocation(line: 105, column: 8, scope: !123, inlinedAt: !296)
!314 = !DILocation(line: 110, column: 19, scope: !157, inlinedAt: !296)
!315 = !DILocation(line: 110, column: 5, scope: !157, inlinedAt: !296)
!316 = distinct !{!316, !315, !317}
!317 = !DILocation(line: 111, column: 20, scope: !157, inlinedAt: !296)
!318 = !DILocation(line: 0, scope: !154, inlinedAt: !296)
!319 = !DILocation(line: 114, column: 22, scope: !123, inlinedAt: !296)
!320 = !DILocation(line: 157, column: 31, scope: !287)
!321 = !DILocation(line: 157, column: 5, scope: !287)
!322 = !DILocation(line: 120, column: 8, scope: !249, inlinedAt: !323)
!323 = distinct !DILocation(line: 158, column: 7, scope: !324)
!324 = distinct !DILexicalBlock(scope: !287, file: !8, line: 157, column: 37)
!325 = !DILocation(line: 120, column: 8, scope: !239, inlinedAt: !323)
!326 = !DILocation(line: 121, column: 33, scope: !252, inlinedAt: !323)
!327 = !DILocation(line: 122, column: 33, scope: !252, inlinedAt: !323)
!328 = !DILocation(line: 124, column: 46, scope: !252, inlinedAt: !323)
!329 = !DILocation(line: 124, column: 24, scope: !252, inlinedAt: !323)
!330 = !DILocation(line: 125, column: 24, scope: !252, inlinedAt: !323)
!331 = !DILocation(line: 126, column: 3, scope: !252, inlinedAt: !323)
!332 = !DILocation(line: 0, scope: !333)
!333 = distinct !DILexicalBlock(scope: !334, file: !8, line: 161, column: 14)
!334 = distinct !DILexicalBlock(scope: !335, file: !8, line: 160, column: 41)
!335 = distinct !DILexicalBlock(scope: !336, file: !8, line: 160, column: 7)
!336 = distinct !DILexicalBlock(scope: !324, file: !8, line: 160, column: 7)
!337 = !DILocation(line: 160, column: 7, scope: !336)
!338 = !DILocation(line: 161, column: 23, scope: !333)
!339 = !DILocation(line: 162, column: 49, scope: !340)
!340 = distinct !DILexicalBlock(scope: !341, file: !8, line: 162, column: 16)
!341 = distinct !DILexicalBlock(scope: !333, file: !8, line: 161, column: 67)
!342 = !DILocation(line: 162, column: 23, scope: !340)
!343 = !DILocation(line: 163, column: 55, scope: !340)
!344 = !DILocation(line: 163, column: 46, scope: !340)
!345 = !DILocation(line: 162, column: 56, scope: !340)
!346 = !DILocation(line: 164, column: 41, scope: !347)
!347 = distinct !DILexicalBlock(scope: !340, file: !8, line: 163, column: 68)
!348 = !DILocation(line: 165, column: 36, scope: !347)
!349 = !DILocation(line: 165, column: 41, scope: !347)
!350 = !DILocation(line: 0, scope: !123, inlinedAt: !351)
!351 = distinct !DILocation(line: 166, column: 18, scope: !352)
!352 = distinct !DILexicalBlock(scope: !347, file: !8, line: 166, column: 18)
!353 = !DILocation(line: 95, column: 29, scope: !123, inlinedAt: !351)
!354 = !DILocation(line: 98, column: 8, scope: !137, inlinedAt: !351)
!355 = !DILocation(line: 98, column: 29, scope: !137, inlinedAt: !351)
!356 = !DILocation(line: 98, column: 8, scope: !123, inlinedAt: !351)
!357 = !DILocation(line: 100, column: 12, scope: !123, inlinedAt: !351)
!358 = !DILocation(line: 100, column: 17, scope: !123, inlinedAt: !351)
!359 = !DILocation(line: 101, column: 12, scope: !123, inlinedAt: !351)
!360 = !DILocation(line: 101, column: 17, scope: !123, inlinedAt: !351)
!361 = !DILocation(line: 102, column: 12, scope: !123, inlinedAt: !351)
!362 = !DILocation(line: 102, column: 17, scope: !123, inlinedAt: !351)
!363 = !DILocation(line: 103, column: 12, scope: !123, inlinedAt: !351)
!364 = !DILocation(line: 103, column: 17, scope: !123, inlinedAt: !351)
!365 = !DILocation(line: 105, column: 9, scope: !154, inlinedAt: !351)
!366 = !DILocation(line: 105, column: 8, scope: !123, inlinedAt: !351)
!367 = !DILocation(line: 110, column: 19, scope: !157, inlinedAt: !351)
!368 = !DILocation(line: 110, column: 5, scope: !157, inlinedAt: !351)
!369 = distinct !{!369, !368, !370}
!370 = !DILocation(line: 111, column: 20, scope: !157, inlinedAt: !351)
!371 = !DILocation(line: 0, scope: !154, inlinedAt: !351)
!372 = !DILocation(line: 114, column: 22, scope: !123, inlinedAt: !351)
!373 = !DILocation(line: 166, column: 18, scope: !347)
!374 = !DILocation(line: 160, column: 36, scope: !335)
!375 = !DILocation(line: 160, column: 22, scope: !335)
!376 = distinct !{!376, !337, !377}
!377 = !DILocation(line: 170, column: 7, scope: !336)
!378 = !DILocation(line: 174, column: 1, scope: !266)
!379 = !DILocalVariable(name: "node", arg: 1, scope: !380, file: !8, line: 93, type: !11)
!380 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !124, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !381, retainedNodes: !411)
!381 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !382, globals: !390, nameTableKind: None)
!382 = !{!383}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !385)
!385 = !{!386, !387, !388, !389}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !384, file: !8, line: 40, baseType: !11, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !384, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !384, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !384, file: !8, line: 43, baseType: !383, size: 64, offset: 128)
!390 = !{!391, !393, !395, !402, !404, !406, !408}
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !381, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !381, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !381, file: !8, line: 49, type: !397, isLocal: false, isDefinition: true)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 2560, elements: !25)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !399)
!399 = !{!400, !401}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !398, file: !8, line: 35, baseType: !11, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !398, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !381, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !381, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !381, file: !8, line: 53, type: !383, isLocal: false, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !381, file: !8, line: 54, type: !410, isLocal: false, isDefinition: true)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 192000, elements: !36)
!411 = !{!379, !412, !413, !414, !415}
!412 = !DILocalVariable(name: "dist", arg: 2, scope: !380, file: !8, line: 93, type: !11)
!413 = !DILocalVariable(name: "prev", arg: 3, scope: !380, file: !8, line: 93, type: !11)
!414 = !DILocalVariable(name: "newItem", scope: !380, file: !8, line: 95, type: !383)
!415 = !DILocalVariable(name: "last", scope: !380, file: !8, line: 96, type: !383)
!416 = !DILocalVariable(name: "last", scope: !417, file: !8, line: 96, type: !420)
!417 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !124, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !418, retainedNodes: !448)
!418 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !419, globals: !427, nameTableKind: None)
!419 = !{!420}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !422)
!422 = !{!423, !424, !425, !426}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !421, file: !8, line: 40, baseType: !11, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !421, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !421, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !421, file: !8, line: 43, baseType: !420, size: 64, offset: 128)
!427 = !{!428, !430, !432, !439, !441, !443, !445}
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !418, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !418, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !418, file: !8, line: 49, type: !434, isLocal: false, isDefinition: true)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 2560, elements: !25)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !436)
!436 = !{!437, !438}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !435, file: !8, line: 35, baseType: !11, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !435, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !418, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !418, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !418, file: !8, line: 53, type: !420, isLocal: false, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !418, file: !8, line: 54, type: !447, isLocal: false, isDefinition: true)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 192000, elements: !36)
!448 = !{!449, !450, !451, !452, !416}
!449 = !DILocalVariable(name: "node", arg: 1, scope: !417, file: !8, line: 93, type: !11)
!450 = !DILocalVariable(name: "dist", arg: 2, scope: !417, file: !8, line: 93, type: !11)
!451 = !DILocalVariable(name: "prev", arg: 3, scope: !417, file: !8, line: 93, type: !11)
!452 = !DILocalVariable(name: "newItem", scope: !417, file: !8, line: 95, type: !420)
!453 = !DILocalVariable(name: "cost", scope: !454, file: !8, line: 138, type: !11)
!454 = distinct !DISubprogram(name: "dijkstra_find", scope: !8, file: !8, line: 134, type: !267, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !455, retainedNodes: !485)
!455 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !456, globals: !464, nameTableKind: None)
!456 = !{!457}
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !459)
!459 = !{!460, !461, !462, !463}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !458, file: !8, line: 40, baseType: !11, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !458, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !458, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !458, file: !8, line: 43, baseType: !457, size: 64, offset: 128)
!464 = !{!465, !467, !469, !476, !478, !480, !482}
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !455, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !455, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !455, file: !8, line: 49, type: !471, isLocal: false, isDefinition: true)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !472, size: 2560, elements: !25)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !473)
!473 = !{!474, !475}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !472, file: !8, line: 35, baseType: !11, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !472, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !455, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !455, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !455, file: !8, line: 53, type: !457, isLocal: false, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !455, file: !8, line: 54, type: !484, isLocal: false, isDefinition: true)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !458, size: 192000, elements: !36)
!485 = !{!486, !487, !488, !489, !490, !453, !491, !492}
!486 = !DILocalVariable(name: "chStart", arg: 1, scope: !454, file: !8, line: 134, type: !11)
!487 = !DILocalVariable(name: "chEnd", arg: 2, scope: !454, file: !8, line: 134, type: !11)
!488 = !DILocalVariable(name: "ch", scope: !454, file: !8, line: 136, type: !11)
!489 = !DILocalVariable(name: "prev", scope: !454, file: !8, line: 137, type: !11)
!490 = !DILocalVariable(name: "node", scope: !454, file: !8, line: 137, type: !11)
!491 = !DILocalVariable(name: "dist", scope: !454, file: !8, line: 138, type: !11)
!492 = !DILocalVariable(name: "i", scope: !454, file: !8, line: 139, type: !11)
!493 = !DILocalVariable(name: "i", scope: !494, file: !8, line: 139, type: !11)
!494 = distinct !DISubprogram(name: "dijkstra_find", scope: !8, file: !8, line: 134, type: !267, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !495, retainedNodes: !525)
!495 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !496, globals: !504, nameTableKind: None)
!496 = !{!497}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !499)
!499 = !{!500, !501, !502, !503}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !498, file: !8, line: 40, baseType: !11, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !498, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !498, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !498, file: !8, line: 43, baseType: !497, size: 64, offset: 128)
!504 = !{!505, !507, !509, !516, !518, !520, !522}
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !495, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !495, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !495, file: !8, line: 49, type: !511, isLocal: false, isDefinition: true)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 2560, elements: !25)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !513)
!513 = !{!514, !515}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !512, file: !8, line: 35, baseType: !11, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !512, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !495, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !495, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !495, file: !8, line: 53, type: !497, isLocal: false, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !495, file: !8, line: 54, type: !524, isLocal: false, isDefinition: true)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !498, size: 192000, elements: !36)
!525 = !{!526, !527, !528, !529, !530, !531, !532, !493}
!526 = !DILocalVariable(name: "chStart", arg: 1, scope: !494, file: !8, line: 134, type: !11)
!527 = !DILocalVariable(name: "chEnd", arg: 2, scope: !494, file: !8, line: 134, type: !11)
!528 = !DILocalVariable(name: "ch", scope: !494, file: !8, line: 136, type: !11)
!529 = !DILocalVariable(name: "prev", scope: !494, file: !8, line: 137, type: !11)
!530 = !DILocalVariable(name: "node", scope: !494, file: !8, line: 137, type: !11)
!531 = !DILocalVariable(name: "cost", scope: !494, file: !8, line: 138, type: !11)
!532 = !DILocalVariable(name: "dist", scope: !494, file: !8, line: 138, type: !11)
!533 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !534)
!534 = !{!535, !536}
!535 = !DILocalVariable(name: "i", scope: !533, file: !8, line: 178, type: !11)
!536 = !DILocalVariable(name: "j", scope: !533, file: !8, line: 178, type: !11)
!537 = !DILocation(line: 0, scope: !533)
!538 = !DILocation(line: 184, column: 10, scope: !539)
!539 = distinct !DILexicalBlock(scope: !540, file: !8, line: 184, column: 10)
!540 = distinct !DILexicalBlock(scope: !541, file: !8, line: 182, column: 54)
!541 = distinct !DILexicalBlock(scope: !542, file: !8, line: 182, column: 3)
!542 = distinct !DILexicalBlock(scope: !533, file: !8, line: 182, column: 3)
!543 = !DILocation(line: 184, column: 32, scope: !539)
!544 = !DILocation(line: 185, column: 25, scope: !545)
!545 = distinct !DILexicalBlock(scope: !539, file: !8, line: 184, column: 51)
!546 = !DILocation(line: 186, column: 7, scope: !545)
!547 = !DILocation(line: 188, column: 51, scope: !539)
!548 = !DILocation(line: 188, column: 25, scope: !539)
!549 = !DILocation(line: 189, column: 24, scope: !540)
!550 = !DILocation(line: 191, column: 1, scope: !533)
!551 = !DILocation(line: 184, column: 10, scope: !540)
!552 = !DILocalVariable(name: "j", scope: !553, file: !8, line: 178, type: !11)
!553 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !554, retainedNodes: !584)
!554 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !555, globals: !563, nameTableKind: None)
!555 = !{!556}
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !558)
!558 = !{!559, !560, !561, !562}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !557, file: !8, line: 40, baseType: !11, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !557, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !557, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !557, file: !8, line: 43, baseType: !556, size: 64, offset: 128)
!563 = !{!564, !566, !568, !575, !577, !579, !581}
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !554, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !554, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !554, file: !8, line: 49, type: !570, isLocal: false, isDefinition: true)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 2560, elements: !25)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !572)
!572 = !{!573, !574}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !571, file: !8, line: 35, baseType: !11, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !571, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !554, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !554, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !554, file: !8, line: 53, type: !556, isLocal: false, isDefinition: true)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !554, file: !8, line: 54, type: !583, isLocal: false, isDefinition: true)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !557, size: 192000, elements: !36)
!584 = !{!585, !552}
!585 = !DILocalVariable(name: "i", scope: !553, file: !8, line: 178, type: !11)
!586 = !DILocalVariable(name: "j", scope: !587, file: !8, line: 178, type: !11)
!587 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !588, retainedNodes: !618)
!588 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !589, globals: !597, nameTableKind: None)
!589 = !{!590}
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !592)
!592 = !{!593, !594, !595, !596}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !591, file: !8, line: 40, baseType: !11, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !591, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !591, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !591, file: !8, line: 43, baseType: !590, size: 64, offset: 128)
!597 = !{!598, !600, !602, !609, !611, !613, !615}
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !588, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !588, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !588, file: !8, line: 49, type: !604, isLocal: false, isDefinition: true)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !605, size: 2560, elements: !25)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !606)
!606 = !{!607, !608}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !605, file: !8, line: 35, baseType: !11, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !605, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !588, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !588, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !588, file: !8, line: 53, type: !590, isLocal: false, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !588, file: !8, line: 54, type: !617, isLocal: false, isDefinition: true)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 192000, elements: !36)
!618 = !{!619, !586}
!619 = !DILocalVariable(name: "i", scope: !587, file: !8, line: 178, type: !11)
!620 = !DILocalVariable(name: "j", scope: !621, file: !8, line: 178, type: !11)
!621 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !622, retainedNodes: !652)
!622 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !623, globals: !631, nameTableKind: None)
!623 = !{!624}
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !626)
!626 = !{!627, !628, !629, !630}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !625, file: !8, line: 40, baseType: !11, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !625, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !625, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !625, file: !8, line: 43, baseType: !624, size: 64, offset: 128)
!631 = !{!632, !634, !636, !643, !645, !647, !649}
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !622, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !622, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !622, file: !8, line: 49, type: !638, isLocal: false, isDefinition: true)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !639, size: 2560, elements: !25)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !640)
!640 = !{!641, !642}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !639, file: !8, line: 35, baseType: !11, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !639, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !622, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !622, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !622, file: !8, line: 53, type: !624, isLocal: false, isDefinition: true)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !622, file: !8, line: 54, type: !651, isLocal: false, isDefinition: true)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !625, size: 192000, elements: !36)
!652 = !{!653, !620}
!653 = !DILocalVariable(name: "i", scope: !621, file: !8, line: 178, type: !11)
!654 = !DILocalVariable(name: "j", scope: !655, file: !8, line: 178, type: !11)
!655 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !656, retainedNodes: !686)
!656 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !657, globals: !665, nameTableKind: None)
!657 = !{!658}
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !660)
!660 = !{!661, !662, !663, !664}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !659, file: !8, line: 40, baseType: !11, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !659, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !659, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !659, file: !8, line: 43, baseType: !658, size: 64, offset: 128)
!665 = !{!666, !668, !670, !677, !679, !681, !683}
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !656, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !656, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !656, file: !8, line: 49, type: !672, isLocal: false, isDefinition: true)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !673, size: 2560, elements: !25)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !674)
!674 = !{!675, !676}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !673, file: !8, line: 35, baseType: !11, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !673, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !656, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !656, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !656, file: !8, line: 53, type: !658, isLocal: false, isDefinition: true)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !656, file: !8, line: 54, type: !685, isLocal: false, isDefinition: true)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !659, size: 192000, elements: !36)
!686 = !{!687, !654}
!687 = !DILocalVariable(name: "i", scope: !655, file: !8, line: 178, type: !11)
!688 = !DILocalVariable(name: "j", scope: !689, file: !8, line: 178, type: !11)
!689 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !690, retainedNodes: !720)
!690 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !691, globals: !699, nameTableKind: None)
!691 = !{!692}
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !694)
!694 = !{!695, !696, !697, !698}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !693, file: !8, line: 40, baseType: !11, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !693, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !693, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !693, file: !8, line: 43, baseType: !692, size: 64, offset: 128)
!699 = !{!700, !702, !704, !711, !713, !715, !717}
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !690, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !690, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !690, file: !8, line: 49, type: !706, isLocal: false, isDefinition: true)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !707, size: 2560, elements: !25)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !708)
!708 = !{!709, !710}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !707, file: !8, line: 35, baseType: !11, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !707, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !690, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !690, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !690, file: !8, line: 53, type: !692, isLocal: false, isDefinition: true)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !690, file: !8, line: 54, type: !719, isLocal: false, isDefinition: true)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !693, size: 192000, elements: !36)
!720 = !{!721, !688}
!721 = !DILocalVariable(name: "i", scope: !689, file: !8, line: 178, type: !11)
!722 = !DILocalVariable(name: "j", scope: !723, file: !8, line: 178, type: !11)
!723 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !724, retainedNodes: !754)
!724 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !725, globals: !733, nameTableKind: None)
!725 = !{!726}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !728)
!728 = !{!729, !730, !731, !732}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !727, file: !8, line: 40, baseType: !11, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !727, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !727, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !727, file: !8, line: 43, baseType: !726, size: 64, offset: 128)
!733 = !{!734, !736, !738, !745, !747, !749, !751}
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !724, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !724, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !724, file: !8, line: 49, type: !740, isLocal: false, isDefinition: true)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !741, size: 2560, elements: !25)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !742)
!742 = !{!743, !744}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !741, file: !8, line: 35, baseType: !11, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !741, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !724, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !724, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !724, file: !8, line: 53, type: !726, isLocal: false, isDefinition: true)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !724, file: !8, line: 54, type: !753, isLocal: false, isDefinition: true)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !727, size: 192000, elements: !36)
!754 = !{!755, !722}
!755 = !DILocalVariable(name: "i", scope: !723, file: !8, line: 178, type: !11)
!756 = !DILocalVariable(name: "j", scope: !757, file: !8, line: 178, type: !11)
!757 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !758, retainedNodes: !788)
!758 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !759, globals: !767, nameTableKind: None)
!759 = !{!760}
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !762)
!762 = !{!763, !764, !765, !766}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !761, file: !8, line: 40, baseType: !11, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !761, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !761, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !761, file: !8, line: 43, baseType: !760, size: 64, offset: 128)
!767 = !{!768, !770, !772, !779, !781, !783, !785}
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !758, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !758, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !758, file: !8, line: 49, type: !774, isLocal: false, isDefinition: true)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !775, size: 2560, elements: !25)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !776)
!776 = !{!777, !778}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !775, file: !8, line: 35, baseType: !11, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !775, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !758, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !758, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !758, file: !8, line: 53, type: !760, isLocal: false, isDefinition: true)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !758, file: !8, line: 54, type: !787, isLocal: false, isDefinition: true)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !761, size: 192000, elements: !36)
!788 = !{!789, !756}
!789 = !DILocalVariable(name: "i", scope: !757, file: !8, line: 178, type: !11)
!790 = !DILocalVariable(name: "j", scope: !791, file: !8, line: 178, type: !11)
!791 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !792, retainedNodes: !822)
!792 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !793, globals: !801, nameTableKind: None)
!793 = !{!794}
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !796)
!796 = !{!797, !798, !799, !800}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !795, file: !8, line: 40, baseType: !11, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !795, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !795, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !795, file: !8, line: 43, baseType: !794, size: 64, offset: 128)
!801 = !{!802, !804, !806, !813, !815, !817, !819}
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !792, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !792, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !792, file: !8, line: 49, type: !808, isLocal: false, isDefinition: true)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !809, size: 2560, elements: !25)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !810)
!810 = !{!811, !812}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !809, file: !8, line: 35, baseType: !11, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !809, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !792, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !792, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !792, file: !8, line: 53, type: !794, isLocal: false, isDefinition: true)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !792, file: !8, line: 54, type: !821, isLocal: false, isDefinition: true)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !795, size: 192000, elements: !36)
!822 = !{!823, !790}
!823 = !DILocalVariable(name: "i", scope: !791, file: !8, line: 178, type: !11)
!824 = !DILocalVariable(name: "j", scope: !825, file: !8, line: 178, type: !11)
!825 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !826, retainedNodes: !856)
!826 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !827, globals: !835, nameTableKind: None)
!827 = !{!828}
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !830)
!830 = !{!831, !832, !833, !834}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !829, file: !8, line: 40, baseType: !11, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !829, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !829, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !829, file: !8, line: 43, baseType: !828, size: 64, offset: 128)
!835 = !{!836, !838, !840, !847, !849, !851, !853}
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !826, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !826, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !826, file: !8, line: 49, type: !842, isLocal: false, isDefinition: true)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !843, size: 2560, elements: !25)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !844)
!844 = !{!845, !846}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !843, file: !8, line: 35, baseType: !11, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !843, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !826, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !826, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !826, file: !8, line: 53, type: !828, isLocal: false, isDefinition: true)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !826, file: !8, line: 54, type: !855, isLocal: false, isDefinition: true)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !829, size: 192000, elements: !36)
!856 = !{!857, !824}
!857 = !DILocalVariable(name: "i", scope: !825, file: !8, line: 178, type: !11)
!858 = distinct !DISubprogram(name: "main", scope: !8, file: !8, line: 193, type: !859, scopeLine: 194, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !864)
!859 = !DISubroutineType(types: !860)
!860 = !{!11, !11, !861}
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!864 = !{!865, !866}
!865 = !DILocalVariable(name: "argc", arg: 1, scope: !858, file: !8, line: 193, type: !11)
!866 = !DILocalVariable(name: "argv", arg: 2, scope: !858, file: !8, line: 193, type: !861)
!867 = !DILocation(line: 0, scope: !858)
!868 = !DILocation(line: 195, column: 3, scope: !858)
!869 = !DILocation(line: 196, column: 3, scope: !858)
!870 = !DILocation(line: 90, column: 14, scope: !116, inlinedAt: !871)
!871 = distinct !DILocation(line: 198, column: 12, scope: !858)
!872 = !DILocation(line: 90, column: 32, scope: !116, inlinedAt: !871)
!873 = !DILocation(line: 90, column: 12, scope: !116, inlinedAt: !871)
!874 = !DILocation(line: 198, column: 3, scope: !858)
!875 = !DILocalVariable(name: "argc", arg: 1, scope: !876, file: !8, line: 193, type: !11)
!876 = distinct !DISubprogram(name: "main", scope: !8, file: !8, line: 193, type: !859, scopeLine: 194, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !877, retainedNodes: !907)
!877 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !878, globals: !886, nameTableKind: None)
!878 = !{!879}
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !881)
!881 = !{!882, !883, !884, !885}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !880, file: !8, line: 40, baseType: !11, size: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !880, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !880, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !880, file: !8, line: 43, baseType: !879, size: 64, offset: 128)
!886 = !{!887, !889, !891, !898, !900, !902, !904}
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !877, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !877, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !877, file: !8, line: 49, type: !893, isLocal: false, isDefinition: true)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !894, size: 2560, elements: !25)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !895)
!895 = !{!896, !897}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !894, file: !8, line: 35, baseType: !11, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !894, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !877, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !877, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !877, file: !8, line: 53, type: !879, isLocal: false, isDefinition: true)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !877, file: !8, line: 54, type: !906, isLocal: false, isDefinition: true)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !880, size: 192000, elements: !36)
!907 = !{!875, !908}
!908 = !DILocalVariable(name: "argv", arg: 2, scope: !876, file: !8, line: 193, type: !861)
