; ModuleID = '<stdin>'
source_filename = "./dijkstra.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._QITEM = type { i32, i32, i32, %struct._QITEM* }
%struct._NODE = type { i32, i32 }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !2, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !15, nameTableKind: None)
!3 = !DIFile(filename: "dijkstra.c", directory: "/home/newton/cfiles/xmark")
!4 = !{}
!5 = !{!6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !9)
!8 = !DIFile(filename: "./dijkstra.c", directory: "/home/newton/cfiles/xmark")
!9 = !{!10, !12, !13, !14}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !7, file: !8, line: 40, baseType: !11, size: 32)
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !7, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !7, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !7, file: !8, line: 43, baseType: !6, size: 64, offset: 128)
!15 = !{!0, !16, !18, !27, !29, !31, !33}
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !2, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !2, file: !8, line: 49, type: !20, isLocal: false, isDefinition: true)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 2560, elements: !25)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !22)
!22 = !{!23, !24}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !21, file: !8, line: 35, baseType: !11, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !21, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!25 = !{!26}
!26 = !DISubrange(count: 40)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !2, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !2, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !2, file: !8, line: 53, type: !6, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !2, file: !8, line: 54, type: !35, isLocal: false, isDefinition: true)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192000, elements: !36)
!36 = !{!37}
!37 = !DISubrange(count: 1000)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 12800, elements: !40)
!39 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!40 = !{!26, !26}
!41 = !{i32 2, !"Dwarf Version", i32 4}
!42 = !{i32 2, !"Debug Info Version", i32 3}
!43 = !{i32 1, !"wchar_size", i32 4}
!44 = !{!"clang version 9.0.1-12 "}
!45 = distinct !DISubprogram(name: "dijkstra_init", scope: !8, file: !8, line: 70, type: !46, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !48)
!46 = !DISubroutineType(types: !47)
!47 = !{null}
!48 = !{!49, !50, !51}
!49 = !DILocalVariable(name: "i", scope: !45, file: !8, line: 72, type: !11)
!50 = !DILocalVariable(name: "k", scope: !45, file: !8, line: 72, type: !11)
!51 = !DILocalVariable(name: "x", scope: !45, file: !8, line: 73, type: !52)
!52 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !11)
!53 = !DILocation(line: 73, column: 3, scope: !45)
!54 = !DILocation(line: 73, column: 16, scope: !45)
!55 = !{!56, !56, i64 0}
!56 = !{!"int", !57, i64 0}
!57 = !{!"omnipotent char", !58, i64 0}
!58 = !{!"Simple C/C++ TBAA"}
!59 = !DILocation(line: 0, scope: !45)
!60 = !DILocation(line: 75, column: 3, scope: !61)
!61 = distinct !DILexicalBlock(scope: !45, file: !8, line: 75, column: 3)
!62 = !DILocation(line: 78, column: 39, scope: !63)
!63 = distinct !DILexicalBlock(scope: !64, file: !8, line: 77, column: 5)
!64 = distinct !DILexicalBlock(scope: !65, file: !8, line: 77, column: 5)
!65 = distinct !DILexicalBlock(scope: !66, file: !8, line: 75, column: 37)
!66 = distinct !DILexicalBlock(scope: !61, file: !8, line: 75, column: 3)
!67 = !DILocation(line: 78, column: 7, scope: !63)
!68 = !DILocation(line: 78, column: 36, scope: !63)
!69 = !{!57, !57, i64 0}
!70 = !DILocation(line: 75, column: 32, scope: !66)
!71 = !DILocation(line: 75, column: 18, scope: !66)
!72 = distinct !{!72, !60, !73}
!73 = !DILocation(line: 79, column: 3, scope: !61)
!74 = !DILocation(line: 81, column: 23, scope: !45)
!75 = !DILocation(line: 82, column: 22, scope: !45)
!76 = !DILocation(line: 83, column: 22, scope: !45)
!77 = !{!78, !78, i64 0}
!78 = !{!"any pointer", !57, i64 0}
!79 = !DILocation(line: 85, column: 21, scope: !45)
!80 = !DILocation(line: 86, column: 1, scope: !45)
!81 = !DILocalVariable(name: "k", scope: !82, file: !8, line: 72, type: !11)
!82 = distinct !DISubprogram(name: "dijkstra_init", scope: !8, file: !8, line: 70, type: !46, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !83, retainedNodes: !113)
!83 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !84, globals: !92, nameTableKind: None)
!84 = !{!85}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !87)
!87 = !{!88, !89, !90, !91}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !86, file: !8, line: 40, baseType: !11, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !86, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !86, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !86, file: !8, line: 43, baseType: !85, size: 64, offset: 128)
!92 = !{!93, !95, !97, !104, !106, !108, !110}
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !83, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !83, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !83, file: !8, line: 49, type: !99, isLocal: false, isDefinition: true)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 2560, elements: !25)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !101)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !100, file: !8, line: 35, baseType: !11, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !100, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !83, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !83, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !83, file: !8, line: 53, type: !85, isLocal: false, isDefinition: true)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !83, file: !8, line: 54, type: !112, isLocal: false, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 192000, elements: !36)
!113 = !{!114, !81, !115}
!114 = !DILocalVariable(name: "i", scope: !82, file: !8, line: 72, type: !11)
!115 = !DILocalVariable(name: "x", scope: !82, file: !8, line: 73, type: !52)
!116 = distinct !DISubprogram(name: "dijkstra_return", scope: !8, file: !8, line: 88, type: !117, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!117 = !DISubroutineType(types: !118)
!118 = !{!11}
!119 = !DILocation(line: 90, column: 14, scope: !116)
!120 = !DILocation(line: 90, column: 32, scope: !116)
!121 = !DILocation(line: 90, column: 12, scope: !116)
!122 = !DILocation(line: 90, column: 3, scope: !116)
!123 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !124, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !126)
!124 = !DISubroutineType(types: !125)
!125 = !{!11, !11, !11, !11}
!126 = !{!127, !128, !129, !130, !131}
!127 = !DILocalVariable(name: "node", arg: 1, scope: !123, file: !8, line: 93, type: !11)
!128 = !DILocalVariable(name: "dist", arg: 2, scope: !123, file: !8, line: 93, type: !11)
!129 = !DILocalVariable(name: "prev", arg: 3, scope: !123, file: !8, line: 93, type: !11)
!130 = !DILocalVariable(name: "newItem", scope: !123, file: !8, line: 95, type: !6)
!131 = !DILocalVariable(name: "last", scope: !123, file: !8, line: 96, type: !6)
!132 = !DILocation(line: 0, scope: !123)
!133 = !DILocation(line: 95, column: 50, scope: !123)
!134 = !DILocation(line: 95, column: 29, scope: !123)
!135 = !DILocation(line: 96, column: 25, scope: !123)
!136 = !DILocation(line: 98, column: 8, scope: !137)
!137 = distinct !DILexicalBlock(scope: !123, file: !8, line: 98, column: 8)
!138 = !DILocation(line: 98, column: 29, scope: !137)
!139 = !DILocation(line: 98, column: 8, scope: !123)
!140 = !DILocation(line: 100, column: 12, scope: !123)
!141 = !DILocation(line: 100, column: 17, scope: !123)
!142 = !{!143, !56, i64 0}
!143 = !{!"_QITEM", !56, i64 0, !56, i64 4, !56, i64 8, !78, i64 16}
!144 = !DILocation(line: 101, column: 12, scope: !123)
!145 = !DILocation(line: 101, column: 17, scope: !123)
!146 = !{!143, !56, i64 4}
!147 = !DILocation(line: 102, column: 12, scope: !123)
!148 = !DILocation(line: 102, column: 17, scope: !123)
!149 = !{!143, !56, i64 8}
!150 = !DILocation(line: 103, column: 12, scope: !123)
!151 = !DILocation(line: 103, column: 17, scope: !123)
!152 = !{!143, !78, i64 16}
!153 = !DILocation(line: 105, column: 9, scope: !154)
!154 = distinct !DILexicalBlock(scope: !123, file: !8, line: 105, column: 8)
!155 = !DILocation(line: 105, column: 8, scope: !123)
!156 = !DILocation(line: 110, column: 19, scope: !157)
!157 = distinct !DILexicalBlock(scope: !154, file: !8, line: 107, column: 8)
!158 = !DILocation(line: 110, column: 5, scope: !157)
!159 = distinct !{!159, !158, !160}
!160 = !DILocation(line: 111, column: 20, scope: !157)
!161 = !DILocation(line: 0, scope: !154)
!162 = !DILocation(line: 114, column: 22, scope: !123)
!163 = !DILocation(line: 115, column: 3, scope: !123)
!164 = !DILocation(line: 116, column: 1, scope: !123)
!165 = !DILocalVariable(name: "newItem", scope: !166, file: !8, line: 95, type: !169)
!166 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !124, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !167, retainedNodes: !197)
!167 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !168, globals: !176, nameTableKind: None)
!168 = !{!169}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !171)
!171 = !{!172, !173, !174, !175}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !170, file: !8, line: 40, baseType: !11, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !170, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !170, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !170, file: !8, line: 43, baseType: !169, size: 64, offset: 128)
!176 = !{!177, !179, !181, !188, !190, !192, !194}
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !167, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !167, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !167, file: !8, line: 49, type: !183, isLocal: false, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 2560, elements: !25)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !185)
!185 = !{!186, !187}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !184, file: !8, line: 35, baseType: !11, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !184, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !167, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !167, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !167, file: !8, line: 53, type: !169, isLocal: false, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !167, file: !8, line: 54, type: !196, isLocal: false, isDefinition: true)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 192000, elements: !36)
!197 = !{!198, !199, !200, !165, !201}
!198 = !DILocalVariable(name: "node", arg: 1, scope: !166, file: !8, line: 93, type: !11)
!199 = !DILocalVariable(name: "dist", arg: 2, scope: !166, file: !8, line: 93, type: !11)
!200 = !DILocalVariable(name: "prev", arg: 3, scope: !166, file: !8, line: 93, type: !11)
!201 = !DILocalVariable(name: "last", scope: !166, file: !8, line: 96, type: !169)
!202 = distinct !DISubprogram(name: "dijkstra_dequeue", scope: !8, file: !8, line: 118, type: !203, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !206)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !205, !205, !205}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!206 = !{!207, !208, !209}
!207 = !DILocalVariable(name: "node", arg: 1, scope: !202, file: !8, line: 118, type: !205)
!208 = !DILocalVariable(name: "dist", arg: 2, scope: !202, file: !8, line: 118, type: !205)
!209 = !DILocalVariable(name: "prev", arg: 3, scope: !202, file: !8, line: 118, type: !205)
!210 = !DILocation(line: 0, scope: !202)
!211 = !DILocation(line: 120, column: 8, scope: !212)
!212 = distinct !DILexicalBlock(scope: !202, file: !8, line: 120, column: 8)
!213 = !DILocation(line: 120, column: 8, scope: !202)
!214 = !DILocation(line: 121, column: 33, scope: !215)
!215 = distinct !DILexicalBlock(scope: !212, file: !8, line: 120, column: 29)
!216 = !DILocation(line: 121, column: 11, scope: !215)
!217 = !DILocation(line: 122, column: 33, scope: !215)
!218 = !DILocation(line: 122, column: 11, scope: !215)
!219 = !DILocation(line: 123, column: 33, scope: !215)
!220 = !DILocation(line: 123, column: 11, scope: !215)
!221 = !DILocation(line: 124, column: 46, scope: !215)
!222 = !DILocation(line: 124, column: 24, scope: !215)
!223 = !DILocation(line: 125, column: 24, scope: !215)
!224 = !DILocation(line: 126, column: 3, scope: !215)
!225 = !DILocation(line: 127, column: 1, scope: !202)
!226 = distinct !DISubprogram(name: "dijkstra_qcount", scope: !8, file: !8, line: 129, type: !117, scopeLine: 130, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!227 = !DILocation(line: 131, column: 12, scope: !226)
!228 = !DILocation(line: 131, column: 3, scope: !226)
!229 = distinct !DISubprogram(name: "dijkstra_find", scope: !8, file: !8, line: 134, type: !230, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !232)
!230 = !DISubroutineType(types: !231)
!231 = !{!11, !11, !11}
!232 = !{!233, !234, !235, !236, !237, !238, !239, !240}
!233 = !DILocalVariable(name: "chStart", arg: 1, scope: !229, file: !8, line: 134, type: !11)
!234 = !DILocalVariable(name: "chEnd", arg: 2, scope: !229, file: !8, line: 134, type: !11)
!235 = !DILocalVariable(name: "ch", scope: !229, file: !8, line: 136, type: !11)
!236 = !DILocalVariable(name: "prev", scope: !229, file: !8, line: 137, type: !11)
!237 = !DILocalVariable(name: "node", scope: !229, file: !8, line: 137, type: !11)
!238 = !DILocalVariable(name: "cost", scope: !229, file: !8, line: 138, type: !11)
!239 = !DILocalVariable(name: "dist", scope: !229, file: !8, line: 138, type: !11)
!240 = !DILocalVariable(name: "i", scope: !229, file: !8, line: 139, type: !11)
!241 = !DILocation(line: 0, scope: !229)
!242 = !DILocation(line: 143, column: 34, scope: !243)
!243 = distinct !DILexicalBlock(scope: !244, file: !8, line: 142, column: 40)
!244 = distinct !DILexicalBlock(scope: !245, file: !8, line: 142, column: 3)
!245 = distinct !DILexicalBlock(scope: !229, file: !8, line: 142, column: 3)
!246 = !DILocation(line: 147, column: 16, scope: !247)
!247 = distinct !DILexicalBlock(scope: !229, file: !8, line: 147, column: 8)
!248 = !DILocation(line: 147, column: 8, scope: !229)
!249 = !DILocation(line: 149, column: 5, scope: !250)
!250 = distinct !DILexicalBlock(scope: !247, file: !8, line: 148, column: 10)
!251 = !DILocation(line: 149, column: 34, scope: !250)
!252 = !DILocation(line: 149, column: 39, scope: !250)
!253 = !{!254, !56, i64 0}
!254 = !{!"_NODE", !56, i64 0, !56, i64 4}
!255 = !DILocation(line: 150, column: 34, scope: !250)
!256 = !DILocation(line: 150, column: 39, scope: !250)
!257 = !{!254, !56, i64 4}
!258 = !DILocation(line: 0, scope: !123, inlinedAt: !259)
!259 = distinct !DILocation(line: 152, column: 10, scope: !260)
!260 = distinct !DILexicalBlock(scope: !250, file: !8, line: 152, column: 10)
!261 = !DILocation(line: 95, column: 50, scope: !123, inlinedAt: !259)
!262 = !DILocation(line: 95, column: 29, scope: !123, inlinedAt: !259)
!263 = !DILocation(line: 96, column: 25, scope: !123, inlinedAt: !259)
!264 = !DILocation(line: 98, column: 8, scope: !137, inlinedAt: !259)
!265 = !DILocation(line: 98, column: 29, scope: !137, inlinedAt: !259)
!266 = !DILocation(line: 98, column: 8, scope: !123, inlinedAt: !259)
!267 = !DILocation(line: 100, column: 12, scope: !123, inlinedAt: !259)
!268 = !DILocation(line: 100, column: 17, scope: !123, inlinedAt: !259)
!269 = !DILocation(line: 101, column: 12, scope: !123, inlinedAt: !259)
!270 = !DILocation(line: 101, column: 17, scope: !123, inlinedAt: !259)
!271 = !DILocation(line: 102, column: 12, scope: !123, inlinedAt: !259)
!272 = !DILocation(line: 102, column: 17, scope: !123, inlinedAt: !259)
!273 = !DILocation(line: 103, column: 12, scope: !123, inlinedAt: !259)
!274 = !DILocation(line: 103, column: 17, scope: !123, inlinedAt: !259)
!275 = !DILocation(line: 105, column: 9, scope: !154, inlinedAt: !259)
!276 = !DILocation(line: 105, column: 8, scope: !123, inlinedAt: !259)
!277 = !DILocation(line: 110, column: 19, scope: !157, inlinedAt: !259)
!278 = !DILocation(line: 110, column: 5, scope: !157, inlinedAt: !259)
!279 = distinct !{!279, !278, !280}
!280 = !DILocation(line: 111, column: 20, scope: !157, inlinedAt: !259)
!281 = !DILocation(line: 0, scope: !154, inlinedAt: !259)
!282 = !DILocation(line: 114, column: 22, scope: !123, inlinedAt: !259)
!283 = !DILocation(line: 157, column: 31, scope: !250)
!284 = !DILocation(line: 157, column: 5, scope: !250)
!285 = !DILocation(line: 120, column: 8, scope: !212, inlinedAt: !286)
!286 = distinct !DILocation(line: 158, column: 7, scope: !287)
!287 = distinct !DILexicalBlock(scope: !250, file: !8, line: 157, column: 37)
!288 = !DILocation(line: 120, column: 8, scope: !202, inlinedAt: !286)
!289 = !DILocation(line: 121, column: 33, scope: !215, inlinedAt: !286)
!290 = !DILocation(line: 122, column: 33, scope: !215, inlinedAt: !286)
!291 = !DILocation(line: 124, column: 46, scope: !215, inlinedAt: !286)
!292 = !DILocation(line: 124, column: 24, scope: !215, inlinedAt: !286)
!293 = !DILocation(line: 125, column: 24, scope: !215, inlinedAt: !286)
!294 = !DILocation(line: 126, column: 3, scope: !215, inlinedAt: !286)
!295 = !DILocation(line: 0, scope: !296)
!296 = distinct !DILexicalBlock(scope: !297, file: !8, line: 161, column: 14)
!297 = distinct !DILexicalBlock(scope: !298, file: !8, line: 160, column: 41)
!298 = distinct !DILexicalBlock(scope: !299, file: !8, line: 160, column: 7)
!299 = distinct !DILexicalBlock(scope: !287, file: !8, line: 160, column: 7)
!300 = !DILocation(line: 160, column: 7, scope: !299)
!301 = !DILocation(line: 161, column: 23, scope: !296)
!302 = !DILocation(line: 162, column: 49, scope: !303)
!303 = distinct !DILexicalBlock(scope: !304, file: !8, line: 162, column: 16)
!304 = distinct !DILexicalBlock(scope: !296, file: !8, line: 161, column: 67)
!305 = !DILocation(line: 162, column: 23, scope: !303)
!306 = !DILocation(line: 163, column: 55, scope: !303)
!307 = !DILocation(line: 163, column: 46, scope: !303)
!308 = !DILocation(line: 162, column: 56, scope: !303)
!309 = !DILocation(line: 164, column: 41, scope: !310)
!310 = distinct !DILexicalBlock(scope: !303, file: !8, line: 163, column: 68)
!311 = !DILocation(line: 165, column: 36, scope: !310)
!312 = !DILocation(line: 165, column: 41, scope: !310)
!313 = !DILocation(line: 0, scope: !123, inlinedAt: !314)
!314 = distinct !DILocation(line: 166, column: 18, scope: !315)
!315 = distinct !DILexicalBlock(scope: !310, file: !8, line: 166, column: 18)
!316 = !DILocation(line: 95, column: 29, scope: !123, inlinedAt: !314)
!317 = !DILocation(line: 98, column: 8, scope: !137, inlinedAt: !314)
!318 = !DILocation(line: 98, column: 29, scope: !137, inlinedAt: !314)
!319 = !DILocation(line: 98, column: 8, scope: !123, inlinedAt: !314)
!320 = !DILocation(line: 100, column: 12, scope: !123, inlinedAt: !314)
!321 = !DILocation(line: 100, column: 17, scope: !123, inlinedAt: !314)
!322 = !DILocation(line: 101, column: 12, scope: !123, inlinedAt: !314)
!323 = !DILocation(line: 101, column: 17, scope: !123, inlinedAt: !314)
!324 = !DILocation(line: 102, column: 12, scope: !123, inlinedAt: !314)
!325 = !DILocation(line: 102, column: 17, scope: !123, inlinedAt: !314)
!326 = !DILocation(line: 103, column: 12, scope: !123, inlinedAt: !314)
!327 = !DILocation(line: 103, column: 17, scope: !123, inlinedAt: !314)
!328 = !DILocation(line: 105, column: 9, scope: !154, inlinedAt: !314)
!329 = !DILocation(line: 105, column: 8, scope: !123, inlinedAt: !314)
!330 = !DILocation(line: 110, column: 19, scope: !157, inlinedAt: !314)
!331 = !DILocation(line: 110, column: 5, scope: !157, inlinedAt: !314)
!332 = distinct !{!332, !331, !333}
!333 = !DILocation(line: 111, column: 20, scope: !157, inlinedAt: !314)
!334 = !DILocation(line: 0, scope: !154, inlinedAt: !314)
!335 = !DILocation(line: 114, column: 22, scope: !123, inlinedAt: !314)
!336 = !DILocation(line: 166, column: 18, scope: !310)
!337 = !DILocation(line: 160, column: 36, scope: !298)
!338 = !DILocation(line: 160, column: 22, scope: !298)
!339 = distinct !{!339, !300, !340}
!340 = !DILocation(line: 170, column: 7, scope: !299)
!341 = !DILocation(line: 174, column: 1, scope: !229)
!342 = !DILocalVariable(name: "last", scope: !343, file: !8, line: 96, type: !346)
!343 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !124, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !344, retainedNodes: !374)
!344 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !345, globals: !353, nameTableKind: None)
!345 = !{!346}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !348)
!348 = !{!349, !350, !351, !352}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !347, file: !8, line: 40, baseType: !11, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !347, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !347, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !347, file: !8, line: 43, baseType: !346, size: 64, offset: 128)
!353 = !{!354, !356, !358, !365, !367, !369, !371}
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !344, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !344, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !344, file: !8, line: 49, type: !360, isLocal: false, isDefinition: true)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 2560, elements: !25)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !362)
!362 = !{!363, !364}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !361, file: !8, line: 35, baseType: !11, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !361, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !344, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !344, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !344, file: !8, line: 53, type: !346, isLocal: false, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !344, file: !8, line: 54, type: !373, isLocal: false, isDefinition: true)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 192000, elements: !36)
!374 = !{!375, !376, !377, !378, !342}
!375 = !DILocalVariable(name: "node", arg: 1, scope: !343, file: !8, line: 93, type: !11)
!376 = !DILocalVariable(name: "dist", arg: 2, scope: !343, file: !8, line: 93, type: !11)
!377 = !DILocalVariable(name: "prev", arg: 3, scope: !343, file: !8, line: 93, type: !11)
!378 = !DILocalVariable(name: "newItem", scope: !343, file: !8, line: 95, type: !346)
!379 = !DILocalVariable(name: "last", scope: !380, file: !8, line: 96, type: !383)
!380 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !124, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !381, retainedNodes: !411)
!381 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !382, globals: !390, nameTableKind: None)
!382 = !{!383}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !385)
!385 = !{!386, !387, !388, !389}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !384, file: !8, line: 40, baseType: !11, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !384, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !384, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !384, file: !8, line: 43, baseType: !383, size: 64, offset: 128)
!390 = !{!391, !393, !395, !402, !404, !406, !408}
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !381, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !381, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !381, file: !8, line: 49, type: !397, isLocal: false, isDefinition: true)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 2560, elements: !25)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !399)
!399 = !{!400, !401}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !398, file: !8, line: 35, baseType: !11, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !398, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !381, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !381, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !381, file: !8, line: 53, type: !383, isLocal: false, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !381, file: !8, line: 54, type: !410, isLocal: false, isDefinition: true)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 192000, elements: !36)
!411 = !{!412, !413, !414, !415, !379}
!412 = !DILocalVariable(name: "node", arg: 1, scope: !380, file: !8, line: 93, type: !11)
!413 = !DILocalVariable(name: "dist", arg: 2, scope: !380, file: !8, line: 93, type: !11)
!414 = !DILocalVariable(name: "prev", arg: 3, scope: !380, file: !8, line: 93, type: !11)
!415 = !DILocalVariable(name: "newItem", scope: !380, file: !8, line: 95, type: !383)
!416 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !417)
!417 = !{!418, !419}
!418 = !DILocalVariable(name: "i", scope: !416, file: !8, line: 178, type: !11)
!419 = !DILocalVariable(name: "j", scope: !416, file: !8, line: 178, type: !11)
!420 = !DILocation(line: 0, scope: !416)
!421 = !DILocation(line: 184, column: 10, scope: !422)
!422 = distinct !DILexicalBlock(scope: !423, file: !8, line: 184, column: 10)
!423 = distinct !DILexicalBlock(scope: !424, file: !8, line: 182, column: 54)
!424 = distinct !DILexicalBlock(scope: !425, file: !8, line: 182, column: 3)
!425 = distinct !DILexicalBlock(scope: !416, file: !8, line: 182, column: 3)
!426 = !DILocation(line: 184, column: 32, scope: !422)
!427 = !DILocation(line: 185, column: 25, scope: !428)
!428 = distinct !DILexicalBlock(scope: !422, file: !8, line: 184, column: 51)
!429 = !DILocation(line: 186, column: 7, scope: !428)
!430 = !DILocation(line: 188, column: 51, scope: !422)
!431 = !DILocation(line: 188, column: 25, scope: !422)
!432 = !DILocation(line: 189, column: 24, scope: !423)
!433 = !DILocation(line: 191, column: 1, scope: !416)
!434 = !DILocation(line: 184, column: 10, scope: !423)
!435 = !DILocalVariable(name: "j", scope: !436, file: !8, line: 178, type: !11)
!436 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !437, retainedNodes: !467)
!437 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !438, globals: !446, nameTableKind: None)
!438 = !{!439}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !441)
!441 = !{!442, !443, !444, !445}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !440, file: !8, line: 40, baseType: !11, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !440, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !440, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !440, file: !8, line: 43, baseType: !439, size: 64, offset: 128)
!446 = !{!447, !449, !451, !458, !460, !462, !464}
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !437, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !437, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !437, file: !8, line: 49, type: !453, isLocal: false, isDefinition: true)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 2560, elements: !25)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !455)
!455 = !{!456, !457}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !454, file: !8, line: 35, baseType: !11, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !454, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !437, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !437, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !437, file: !8, line: 53, type: !439, isLocal: false, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !437, file: !8, line: 54, type: !466, isLocal: false, isDefinition: true)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !440, size: 192000, elements: !36)
!467 = !{!468, !435}
!468 = !DILocalVariable(name: "i", scope: !436, file: !8, line: 178, type: !11)
!469 = !DILocalVariable(name: "j", scope: !470, file: !8, line: 178, type: !11)
!470 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !471, retainedNodes: !501)
!471 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !472, globals: !480, nameTableKind: None)
!472 = !{!473}
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !475)
!475 = !{!476, !477, !478, !479}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !474, file: !8, line: 40, baseType: !11, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !474, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !474, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !474, file: !8, line: 43, baseType: !473, size: 64, offset: 128)
!480 = !{!481, !483, !485, !492, !494, !496, !498}
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !471, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !471, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !471, file: !8, line: 49, type: !487, isLocal: false, isDefinition: true)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, size: 2560, elements: !25)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !489)
!489 = !{!490, !491}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !488, file: !8, line: 35, baseType: !11, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !488, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !471, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !471, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !471, file: !8, line: 53, type: !473, isLocal: false, isDefinition: true)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !471, file: !8, line: 54, type: !500, isLocal: false, isDefinition: true)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !474, size: 192000, elements: !36)
!501 = !{!502, !469}
!502 = !DILocalVariable(name: "i", scope: !470, file: !8, line: 178, type: !11)
!503 = !DILocalVariable(name: "j", scope: !504, file: !8, line: 178, type: !11)
!504 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !505, retainedNodes: !535)
!505 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !506, globals: !514, nameTableKind: None)
!506 = !{!507}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !509)
!509 = !{!510, !511, !512, !513}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !508, file: !8, line: 40, baseType: !11, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !508, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !508, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !508, file: !8, line: 43, baseType: !507, size: 64, offset: 128)
!514 = !{!515, !517, !519, !526, !528, !530, !532}
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !505, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !505, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!519 = !DIGlobalVariableExpression(var: !520, expr: !DIExpression())
!520 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !505, file: !8, line: 49, type: !521, isLocal: false, isDefinition: true)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !522, size: 2560, elements: !25)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !523)
!523 = !{!524, !525}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !522, file: !8, line: 35, baseType: !11, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !522, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !505, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !505, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !505, file: !8, line: 53, type: !507, isLocal: false, isDefinition: true)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !505, file: !8, line: 54, type: !534, isLocal: false, isDefinition: true)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !508, size: 192000, elements: !36)
!535 = !{!536, !503}
!536 = !DILocalVariable(name: "i", scope: !504, file: !8, line: 178, type: !11)
!537 = !DILocalVariable(name: "j", scope: !538, file: !8, line: 178, type: !11)
!538 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !539, retainedNodes: !569)
!539 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !540, globals: !548, nameTableKind: None)
!540 = !{!541}
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !543)
!543 = !{!544, !545, !546, !547}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !542, file: !8, line: 40, baseType: !11, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !542, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !542, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !542, file: !8, line: 43, baseType: !541, size: 64, offset: 128)
!548 = !{!549, !551, !553, !560, !562, !564, !566}
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !539, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !539, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !539, file: !8, line: 49, type: !555, isLocal: false, isDefinition: true)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 2560, elements: !25)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !557)
!557 = !{!558, !559}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !556, file: !8, line: 35, baseType: !11, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !556, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !539, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !539, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !539, file: !8, line: 53, type: !541, isLocal: false, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !539, file: !8, line: 54, type: !568, isLocal: false, isDefinition: true)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !542, size: 192000, elements: !36)
!569 = !{!570, !537}
!570 = !DILocalVariable(name: "i", scope: !538, file: !8, line: 178, type: !11)
!571 = distinct !DISubprogram(name: "main", scope: !8, file: !8, line: 193, type: !572, scopeLine: 194, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !577)
!572 = !DISubroutineType(types: !573)
!573 = !{!11, !11, !574}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!577 = !{!578, !579}
!578 = !DILocalVariable(name: "argc", arg: 1, scope: !571, file: !8, line: 193, type: !11)
!579 = !DILocalVariable(name: "argv", arg: 2, scope: !571, file: !8, line: 193, type: !574)
!580 = !DILocation(line: 0, scope: !571)
!581 = !DILocation(line: 195, column: 3, scope: !571)
!582 = !DILocation(line: 196, column: 3, scope: !571)
!583 = !DILocation(line: 90, column: 14, scope: !116, inlinedAt: !584)
!584 = distinct !DILocation(line: 198, column: 12, scope: !571)
!585 = !DILocation(line: 90, column: 32, scope: !116, inlinedAt: !584)
!586 = !DILocation(line: 90, column: 12, scope: !116, inlinedAt: !584)
!587 = !DILocation(line: 198, column: 3, scope: !571)
!588 = !DILocalVariable(name: "argc", arg: 1, scope: !589, file: !8, line: 193, type: !11)
!589 = distinct !DISubprogram(name: "main", scope: !8, file: !8, line: 193, type: !572, scopeLine: 194, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !590, retainedNodes: !620)
!590 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !591, globals: !599, nameTableKind: None)
!591 = !{!592}
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !594)
!594 = !{!595, !596, !597, !598}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !593, file: !8, line: 40, baseType: !11, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !593, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !593, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !593, file: !8, line: 43, baseType: !592, size: 64, offset: 128)
!599 = !{!600, !602, !604, !611, !613, !615, !617}
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !590, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !590, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !590, file: !8, line: 49, type: !606, isLocal: false, isDefinition: true)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !607, size: 2560, elements: !25)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !608)
!608 = !{!609, !610}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !607, file: !8, line: 35, baseType: !11, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !607, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !590, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !590, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !590, file: !8, line: 53, type: !592, isLocal: false, isDefinition: true)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !590, file: !8, line: 54, type: !619, isLocal: false, isDefinition: true)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !593, size: 192000, elements: !36)
!620 = !{!588, !621}
!621 = !DILocalVariable(name: "argv", arg: 2, scope: !589, file: !8, line: 193, type: !574)
