; ModuleID = '<stdin>'
source_filename = "./dijkstra.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._QITEM = type { i32, i32, i32, %struct._QITEM* }
%struct._NODE = type { i32, i32 }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !2, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !15, nameTableKind: None)
!3 = !DIFile(filename: "dijkstra.c", directory: "/home/newton/cfiles/xmark")
!4 = !{}
!5 = !{!6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !9)
!8 = !DIFile(filename: "./dijkstra.c", directory: "/home/newton/cfiles/xmark")
!9 = !{!10, !12, !13, !14}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !7, file: !8, line: 40, baseType: !11, size: 32)
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !7, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !7, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !7, file: !8, line: 43, baseType: !6, size: 64, offset: 128)
!15 = !{!0, !16, !18, !27, !29, !31, !33}
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !2, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !2, file: !8, line: 49, type: !20, isLocal: false, isDefinition: true)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 2560, elements: !25)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !22)
!22 = !{!23, !24}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !21, file: !8, line: 35, baseType: !11, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !21, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!25 = !{!26}
!26 = !DISubrange(count: 40)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !2, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !2, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !2, file: !8, line: 53, type: !6, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !2, file: !8, line: 54, type: !35, isLocal: false, isDefinition: true)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192000, elements: !36)
!36 = !{!37}
!37 = !DISubrange(count: 1000)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 12800, elements: !40)
!39 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!40 = !{!26, !26}
!41 = !{i32 2, !"Dwarf Version", i32 4}
!42 = !{i32 2, !"Debug Info Version", i32 3}
!43 = !{i32 1, !"wchar_size", i32 4}
!44 = !{!"clang version 9.0.1-12 "}
!45 = distinct !DISubprogram(name: "dijkstra_init", scope: !8, file: !8, line: 70, type: !46, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !48)
!46 = !DISubroutineType(types: !47)
!47 = !{null}
!48 = !{!49, !50, !51}
!49 = !DILocalVariable(name: "i", scope: !45, file: !8, line: 72, type: !11)
!50 = !DILocalVariable(name: "k", scope: !45, file: !8, line: 72, type: !11)
!51 = !DILocalVariable(name: "x", scope: !45, file: !8, line: 73, type: !52)
!52 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !11)
!53 = !DILocation(line: 73, column: 3, scope: !45)
!54 = !DILocation(line: 73, column: 16, scope: !45)
!55 = !{!56, !56, i64 0}
!56 = !{!"int", !57, i64 0}
!57 = !{!"omnipotent char", !58, i64 0}
!58 = !{!"Simple C/C++ TBAA"}
!59 = !DILocation(line: 0, scope: !45)
!60 = !DILocation(line: 75, column: 3, scope: !61)
!61 = distinct !DILexicalBlock(scope: !45, file: !8, line: 75, column: 3)
!62 = !DILocation(line: 78, column: 39, scope: !63)
!63 = distinct !DILexicalBlock(scope: !64, file: !8, line: 77, column: 5)
!64 = distinct !DILexicalBlock(scope: !65, file: !8, line: 77, column: 5)
!65 = distinct !DILexicalBlock(scope: !66, file: !8, line: 75, column: 37)
!66 = distinct !DILexicalBlock(scope: !61, file: !8, line: 75, column: 3)
!67 = !DILocation(line: 78, column: 7, scope: !63)
!68 = !DILocation(line: 78, column: 36, scope: !63)
!69 = !{!57, !57, i64 0}
!70 = !DILocation(line: 75, column: 32, scope: !66)
!71 = !DILocation(line: 75, column: 18, scope: !66)
!72 = distinct !{!72, !60, !73}
!73 = !DILocation(line: 79, column: 3, scope: !61)
!74 = !DILocation(line: 81, column: 23, scope: !45)
!75 = !DILocation(line: 82, column: 22, scope: !45)
!76 = !DILocation(line: 83, column: 22, scope: !45)
!77 = !{!78, !78, i64 0}
!78 = !{!"any pointer", !57, i64 0}
!79 = !DILocation(line: 85, column: 21, scope: !45)
!80 = !DILocation(line: 86, column: 1, scope: !45)
!81 = !DILocalVariable(name: "k", scope: !82, file: !8, line: 72, type: !11)
!82 = distinct !DISubprogram(name: "dijkstra_init", scope: !8, file: !8, line: 70, type: !46, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !83, retainedNodes: !113)
!83 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !84, globals: !92, nameTableKind: None)
!84 = !{!85}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !87)
!87 = !{!88, !89, !90, !91}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !86, file: !8, line: 40, baseType: !11, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !86, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !86, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !86, file: !8, line: 43, baseType: !85, size: 64, offset: 128)
!92 = !{!93, !95, !97, !104, !106, !108, !110}
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !83, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !83, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !83, file: !8, line: 49, type: !99, isLocal: false, isDefinition: true)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 2560, elements: !25)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !101)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !100, file: !8, line: 35, baseType: !11, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !100, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !83, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !83, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !83, file: !8, line: 53, type: !85, isLocal: false, isDefinition: true)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !83, file: !8, line: 54, type: !112, isLocal: false, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 192000, elements: !36)
!113 = !{!114, !81, !115}
!114 = !DILocalVariable(name: "i", scope: !82, file: !8, line: 72, type: !11)
!115 = !DILocalVariable(name: "x", scope: !82, file: !8, line: 73, type: !52)
!116 = distinct !DISubprogram(name: "dijkstra_return", scope: !8, file: !8, line: 88, type: !117, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!117 = !DISubroutineType(types: !118)
!118 = !{!11}
!119 = !DILocation(line: 90, column: 14, scope: !116)
!120 = !DILocation(line: 90, column: 32, scope: !116)
!121 = !DILocation(line: 90, column: 12, scope: !116)
!122 = !DILocation(line: 90, column: 3, scope: !116)
!123 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !124, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !126)
!124 = !DISubroutineType(types: !125)
!125 = !{!11, !11, !11, !11}
!126 = !{!127, !128, !129, !130, !131}
!127 = !DILocalVariable(name: "node", arg: 1, scope: !123, file: !8, line: 93, type: !11)
!128 = !DILocalVariable(name: "dist", arg: 2, scope: !123, file: !8, line: 93, type: !11)
!129 = !DILocalVariable(name: "prev", arg: 3, scope: !123, file: !8, line: 93, type: !11)
!130 = !DILocalVariable(name: "newItem", scope: !123, file: !8, line: 95, type: !6)
!131 = !DILocalVariable(name: "last", scope: !123, file: !8, line: 96, type: !6)
!132 = !DILocation(line: 0, scope: !123)
!133 = !DILocation(line: 95, column: 50, scope: !123)
!134 = !DILocation(line: 95, column: 29, scope: !123)
!135 = !DILocation(line: 96, column: 25, scope: !123)
!136 = !DILocation(line: 98, column: 8, scope: !137)
!137 = distinct !DILexicalBlock(scope: !123, file: !8, line: 98, column: 8)
!138 = !DILocation(line: 98, column: 29, scope: !137)
!139 = !DILocation(line: 98, column: 8, scope: !123)
!140 = !DILocation(line: 100, column: 12, scope: !123)
!141 = !DILocation(line: 100, column: 17, scope: !123)
!142 = !{!143, !56, i64 0}
!143 = !{!"_QITEM", !56, i64 0, !56, i64 4, !56, i64 8, !78, i64 16}
!144 = !DILocation(line: 101, column: 12, scope: !123)
!145 = !DILocation(line: 101, column: 17, scope: !123)
!146 = !{!143, !56, i64 4}
!147 = !DILocation(line: 102, column: 12, scope: !123)
!148 = !DILocation(line: 102, column: 17, scope: !123)
!149 = !{!143, !56, i64 8}
!150 = !DILocation(line: 103, column: 12, scope: !123)
!151 = !DILocation(line: 103, column: 17, scope: !123)
!152 = !{!143, !78, i64 16}
!153 = !DILocation(line: 105, column: 9, scope: !154)
!154 = distinct !DILexicalBlock(scope: !123, file: !8, line: 105, column: 8)
!155 = !DILocation(line: 105, column: 8, scope: !123)
!156 = !DILocation(line: 110, column: 19, scope: !157)
!157 = distinct !DILexicalBlock(scope: !154, file: !8, line: 107, column: 8)
!158 = !DILocation(line: 110, column: 5, scope: !157)
!159 = distinct !{!159, !158, !160}
!160 = !DILocation(line: 111, column: 20, scope: !157)
!161 = !DILocation(line: 0, scope: !154)
!162 = !DILocation(line: 114, column: 22, scope: !123)
!163 = !DILocation(line: 115, column: 3, scope: !123)
!164 = !DILocation(line: 116, column: 1, scope: !123)
!165 = !DILocalVariable(name: "newItem", scope: !166, file: !8, line: 95, type: !169)
!166 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !124, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !167, retainedNodes: !197)
!167 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !168, globals: !176, nameTableKind: None)
!168 = !{!169}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !171)
!171 = !{!172, !173, !174, !175}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !170, file: !8, line: 40, baseType: !11, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !170, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !170, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !170, file: !8, line: 43, baseType: !169, size: 64, offset: 128)
!176 = !{!177, !179, !181, !188, !190, !192, !194}
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !167, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !167, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !167, file: !8, line: 49, type: !183, isLocal: false, isDefinition: true)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 2560, elements: !25)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !185)
!185 = !{!186, !187}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !184, file: !8, line: 35, baseType: !11, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !184, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !167, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !167, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !167, file: !8, line: 53, type: !169, isLocal: false, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !167, file: !8, line: 54, type: !196, isLocal: false, isDefinition: true)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 192000, elements: !36)
!197 = !{!198, !199, !200, !165, !201}
!198 = !DILocalVariable(name: "node", arg: 1, scope: !166, file: !8, line: 93, type: !11)
!199 = !DILocalVariable(name: "dist", arg: 2, scope: !166, file: !8, line: 93, type: !11)
!200 = !DILocalVariable(name: "prev", arg: 3, scope: !166, file: !8, line: 93, type: !11)
!201 = !DILocalVariable(name: "last", scope: !166, file: !8, line: 96, type: !169)
!202 = distinct !DISubprogram(name: "dijkstra_dequeue", scope: !8, file: !8, line: 118, type: !203, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !206)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !205, !205, !205}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!206 = !{!207, !208, !209}
!207 = !DILocalVariable(name: "node", arg: 1, scope: !202, file: !8, line: 118, type: !205)
!208 = !DILocalVariable(name: "dist", arg: 2, scope: !202, file: !8, line: 118, type: !205)
!209 = !DILocalVariable(name: "prev", arg: 3, scope: !202, file: !8, line: 118, type: !205)
!210 = !DILocation(line: 0, scope: !202)
!211 = !DILocation(line: 120, column: 8, scope: !212)
!212 = distinct !DILexicalBlock(scope: !202, file: !8, line: 120, column: 8)
!213 = !DILocation(line: 120, column: 8, scope: !202)
!214 = !DILocation(line: 121, column: 33, scope: !215)
!215 = distinct !DILexicalBlock(scope: !212, file: !8, line: 120, column: 29)
!216 = !DILocation(line: 121, column: 11, scope: !215)
!217 = !DILocation(line: 122, column: 33, scope: !215)
!218 = !DILocation(line: 122, column: 11, scope: !215)
!219 = !DILocation(line: 123, column: 33, scope: !215)
!220 = !DILocation(line: 123, column: 11, scope: !215)
!221 = !DILocation(line: 124, column: 46, scope: !215)
!222 = !DILocation(line: 124, column: 24, scope: !215)
!223 = !DILocation(line: 125, column: 24, scope: !215)
!224 = !DILocation(line: 126, column: 3, scope: !215)
!225 = !DILocation(line: 127, column: 1, scope: !202)
!226 = distinct !DISubprogram(name: "dijkstra_qcount", scope: !8, file: !8, line: 129, type: !117, scopeLine: 130, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!227 = !DILocation(line: 131, column: 12, scope: !226)
!228 = !DILocation(line: 131, column: 3, scope: !226)
!229 = distinct !DISubprogram(name: "dijkstra_find", scope: !8, file: !8, line: 134, type: !230, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !232)
!230 = !DISubroutineType(types: !231)
!231 = !{!11, !11, !11}
!232 = !{!233, !234, !235, !236, !237, !238, !239, !240}
!233 = !DILocalVariable(name: "chStart", arg: 1, scope: !229, file: !8, line: 134, type: !11)
!234 = !DILocalVariable(name: "chEnd", arg: 2, scope: !229, file: !8, line: 134, type: !11)
!235 = !DILocalVariable(name: "ch", scope: !229, file: !8, line: 136, type: !11)
!236 = !DILocalVariable(name: "prev", scope: !229, file: !8, line: 137, type: !11)
!237 = !DILocalVariable(name: "node", scope: !229, file: !8, line: 137, type: !11)
!238 = !DILocalVariable(name: "cost", scope: !229, file: !8, line: 138, type: !11)
!239 = !DILocalVariable(name: "dist", scope: !229, file: !8, line: 138, type: !11)
!240 = !DILocalVariable(name: "i", scope: !229, file: !8, line: 139, type: !11)
!241 = !DILocation(line: 0, scope: !229)
!242 = !DILocation(line: 143, column: 34, scope: !243)
!243 = distinct !DILexicalBlock(scope: !244, file: !8, line: 142, column: 40)
!244 = distinct !DILexicalBlock(scope: !245, file: !8, line: 142, column: 3)
!245 = distinct !DILexicalBlock(scope: !229, file: !8, line: 142, column: 3)
!246 = !DILocation(line: 147, column: 16, scope: !247)
!247 = distinct !DILexicalBlock(scope: !229, file: !8, line: 147, column: 8)
!248 = !DILocation(line: 147, column: 8, scope: !229)
!249 = !DILocation(line: 149, column: 5, scope: !250)
!250 = distinct !DILexicalBlock(scope: !247, file: !8, line: 148, column: 10)
!251 = !DILocation(line: 149, column: 34, scope: !250)
!252 = !DILocation(line: 149, column: 39, scope: !250)
!253 = !{!254, !56, i64 0}
!254 = !{!"_NODE", !56, i64 0, !56, i64 4}
!255 = !DILocation(line: 150, column: 34, scope: !250)
!256 = !DILocation(line: 150, column: 39, scope: !250)
!257 = !{!254, !56, i64 4}
!258 = !DILocation(line: 0, scope: !123, inlinedAt: !259)
!259 = distinct !DILocation(line: 152, column: 10, scope: !260)
!260 = distinct !DILexicalBlock(scope: !250, file: !8, line: 152, column: 10)
!261 = !DILocation(line: 95, column: 50, scope: !123, inlinedAt: !259)
!262 = !DILocation(line: 95, column: 29, scope: !123, inlinedAt: !259)
!263 = !DILocation(line: 96, column: 25, scope: !123, inlinedAt: !259)
!264 = !DILocation(line: 98, column: 8, scope: !137, inlinedAt: !259)
!265 = !DILocation(line: 98, column: 29, scope: !137, inlinedAt: !259)
!266 = !DILocation(line: 98, column: 8, scope: !123, inlinedAt: !259)
!267 = !DILocation(line: 100, column: 12, scope: !123, inlinedAt: !259)
!268 = !DILocation(line: 100, column: 17, scope: !123, inlinedAt: !259)
!269 = !DILocation(line: 101, column: 12, scope: !123, inlinedAt: !259)
!270 = !DILocation(line: 101, column: 17, scope: !123, inlinedAt: !259)
!271 = !DILocation(line: 102, column: 12, scope: !123, inlinedAt: !259)
!272 = !DILocation(line: 102, column: 17, scope: !123, inlinedAt: !259)
!273 = !DILocation(line: 103, column: 12, scope: !123, inlinedAt: !259)
!274 = !DILocation(line: 103, column: 17, scope: !123, inlinedAt: !259)
!275 = !DILocation(line: 105, column: 9, scope: !154, inlinedAt: !259)
!276 = !DILocation(line: 105, column: 8, scope: !123, inlinedAt: !259)
!277 = !DILocation(line: 110, column: 19, scope: !157, inlinedAt: !259)
!278 = !DILocation(line: 110, column: 5, scope: !157, inlinedAt: !259)
!279 = distinct !{!279, !278, !280}
!280 = !DILocation(line: 111, column: 20, scope: !157, inlinedAt: !259)
!281 = !DILocation(line: 0, scope: !154, inlinedAt: !259)
!282 = !DILocation(line: 114, column: 22, scope: !123, inlinedAt: !259)
!283 = !DILocation(line: 157, column: 31, scope: !250)
!284 = !DILocation(line: 157, column: 5, scope: !250)
!285 = !DILocation(line: 120, column: 8, scope: !212, inlinedAt: !286)
!286 = distinct !DILocation(line: 158, column: 7, scope: !287)
!287 = distinct !DILexicalBlock(scope: !250, file: !8, line: 157, column: 37)
!288 = !DILocation(line: 120, column: 8, scope: !202, inlinedAt: !286)
!289 = !DILocation(line: 121, column: 33, scope: !215, inlinedAt: !286)
!290 = !DILocation(line: 122, column: 33, scope: !215, inlinedAt: !286)
!291 = !DILocation(line: 124, column: 46, scope: !215, inlinedAt: !286)
!292 = !DILocation(line: 124, column: 24, scope: !215, inlinedAt: !286)
!293 = !DILocation(line: 125, column: 24, scope: !215, inlinedAt: !286)
!294 = !DILocation(line: 126, column: 3, scope: !215, inlinedAt: !286)
!295 = !DILocation(line: 0, scope: !296)
!296 = distinct !DILexicalBlock(scope: !297, file: !8, line: 161, column: 14)
!297 = distinct !DILexicalBlock(scope: !298, file: !8, line: 160, column: 41)
!298 = distinct !DILexicalBlock(scope: !299, file: !8, line: 160, column: 7)
!299 = distinct !DILexicalBlock(scope: !287, file: !8, line: 160, column: 7)
!300 = !DILocation(line: 160, column: 7, scope: !299)
!301 = !DILocation(line: 161, column: 23, scope: !296)
!302 = !DILocation(line: 162, column: 49, scope: !303)
!303 = distinct !DILexicalBlock(scope: !304, file: !8, line: 162, column: 16)
!304 = distinct !DILexicalBlock(scope: !296, file: !8, line: 161, column: 67)
!305 = !DILocation(line: 162, column: 23, scope: !303)
!306 = !DILocation(line: 163, column: 55, scope: !303)
!307 = !DILocation(line: 163, column: 46, scope: !303)
!308 = !DILocation(line: 162, column: 56, scope: !303)
!309 = !DILocation(line: 164, column: 41, scope: !310)
!310 = distinct !DILexicalBlock(scope: !303, file: !8, line: 163, column: 68)
!311 = !DILocation(line: 165, column: 36, scope: !310)
!312 = !DILocation(line: 165, column: 41, scope: !310)
!313 = !DILocation(line: 0, scope: !123, inlinedAt: !314)
!314 = distinct !DILocation(line: 166, column: 18, scope: !315)
!315 = distinct !DILexicalBlock(scope: !310, file: !8, line: 166, column: 18)
!316 = !DILocation(line: 95, column: 29, scope: !123, inlinedAt: !314)
!317 = !DILocation(line: 98, column: 8, scope: !137, inlinedAt: !314)
!318 = !DILocation(line: 98, column: 29, scope: !137, inlinedAt: !314)
!319 = !DILocation(line: 98, column: 8, scope: !123, inlinedAt: !314)
!320 = !DILocation(line: 100, column: 12, scope: !123, inlinedAt: !314)
!321 = !DILocation(line: 100, column: 17, scope: !123, inlinedAt: !314)
!322 = !DILocation(line: 101, column: 12, scope: !123, inlinedAt: !314)
!323 = !DILocation(line: 101, column: 17, scope: !123, inlinedAt: !314)
!324 = !DILocation(line: 102, column: 12, scope: !123, inlinedAt: !314)
!325 = !DILocation(line: 102, column: 17, scope: !123, inlinedAt: !314)
!326 = !DILocation(line: 103, column: 12, scope: !123, inlinedAt: !314)
!327 = !DILocation(line: 103, column: 17, scope: !123, inlinedAt: !314)
!328 = !DILocation(line: 105, column: 9, scope: !154, inlinedAt: !314)
!329 = !DILocation(line: 105, column: 8, scope: !123, inlinedAt: !314)
!330 = !DILocation(line: 110, column: 19, scope: !157, inlinedAt: !314)
!331 = !DILocation(line: 110, column: 5, scope: !157, inlinedAt: !314)
!332 = distinct !{!332, !331, !333}
!333 = !DILocation(line: 111, column: 20, scope: !157, inlinedAt: !314)
!334 = !DILocation(line: 0, scope: !154, inlinedAt: !314)
!335 = !DILocation(line: 114, column: 22, scope: !123, inlinedAt: !314)
!336 = !DILocation(line: 166, column: 18, scope: !310)
!337 = !DILocation(line: 160, column: 36, scope: !298)
!338 = !DILocation(line: 160, column: 22, scope: !298)
!339 = distinct !{!339, !300, !340}
!340 = !DILocation(line: 170, column: 7, scope: !299)
!341 = !DILocation(line: 174, column: 1, scope: !229)
!342 = !DILocalVariable(name: "last", scope: !343, file: !8, line: 96, type: !346)
!343 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !124, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !344, retainedNodes: !374)
!344 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !345, globals: !353, nameTableKind: None)
!345 = !{!346}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !348)
!348 = !{!349, !350, !351, !352}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !347, file: !8, line: 40, baseType: !11, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !347, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !347, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !347, file: !8, line: 43, baseType: !346, size: 64, offset: 128)
!353 = !{!354, !356, !358, !365, !367, !369, !371}
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !344, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !344, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !344, file: !8, line: 49, type: !360, isLocal: false, isDefinition: true)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 2560, elements: !25)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !362)
!362 = !{!363, !364}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !361, file: !8, line: 35, baseType: !11, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !361, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !344, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !344, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !344, file: !8, line: 53, type: !346, isLocal: false, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !344, file: !8, line: 54, type: !373, isLocal: false, isDefinition: true)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 192000, elements: !36)
!374 = !{!375, !376, !377, !378, !342}
!375 = !DILocalVariable(name: "node", arg: 1, scope: !343, file: !8, line: 93, type: !11)
!376 = !DILocalVariable(name: "dist", arg: 2, scope: !343, file: !8, line: 93, type: !11)
!377 = !DILocalVariable(name: "prev", arg: 3, scope: !343, file: !8, line: 93, type: !11)
!378 = !DILocalVariable(name: "newItem", scope: !343, file: !8, line: 95, type: !346)
!379 = !DILocalVariable(name: "cost", scope: !380, file: !8, line: 138, type: !11)
!380 = distinct !DISubprogram(name: "dijkstra_find", scope: !8, file: !8, line: 134, type: !230, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !381, retainedNodes: !411)
!381 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !382, globals: !390, nameTableKind: None)
!382 = !{!383}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !385)
!385 = !{!386, !387, !388, !389}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !384, file: !8, line: 40, baseType: !11, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !384, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !384, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !384, file: !8, line: 43, baseType: !383, size: 64, offset: 128)
!390 = !{!391, !393, !395, !402, !404, !406, !408}
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !381, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !381, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !381, file: !8, line: 49, type: !397, isLocal: false, isDefinition: true)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 2560, elements: !25)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !399)
!399 = !{!400, !401}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !398, file: !8, line: 35, baseType: !11, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !398, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !381, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !381, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !381, file: !8, line: 53, type: !383, isLocal: false, isDefinition: true)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !381, file: !8, line: 54, type: !410, isLocal: false, isDefinition: true)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 192000, elements: !36)
!411 = !{!412, !413, !414, !415, !416, !379, !417, !418}
!412 = !DILocalVariable(name: "chStart", arg: 1, scope: !380, file: !8, line: 134, type: !11)
!413 = !DILocalVariable(name: "chEnd", arg: 2, scope: !380, file: !8, line: 134, type: !11)
!414 = !DILocalVariable(name: "ch", scope: !380, file: !8, line: 136, type: !11)
!415 = !DILocalVariable(name: "prev", scope: !380, file: !8, line: 137, type: !11)
!416 = !DILocalVariable(name: "node", scope: !380, file: !8, line: 137, type: !11)
!417 = !DILocalVariable(name: "dist", scope: !380, file: !8, line: 138, type: !11)
!418 = !DILocalVariable(name: "i", scope: !380, file: !8, line: 139, type: !11)
!419 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !420)
!420 = !{!421, !422}
!421 = !DILocalVariable(name: "i", scope: !419, file: !8, line: 178, type: !11)
!422 = !DILocalVariable(name: "j", scope: !419, file: !8, line: 178, type: !11)
!423 = !DILocation(line: 0, scope: !419)
!424 = !DILocation(line: 184, column: 10, scope: !425)
!425 = distinct !DILexicalBlock(scope: !426, file: !8, line: 184, column: 10)
!426 = distinct !DILexicalBlock(scope: !427, file: !8, line: 182, column: 54)
!427 = distinct !DILexicalBlock(scope: !428, file: !8, line: 182, column: 3)
!428 = distinct !DILexicalBlock(scope: !419, file: !8, line: 182, column: 3)
!429 = !DILocation(line: 184, column: 32, scope: !425)
!430 = !DILocation(line: 185, column: 25, scope: !431)
!431 = distinct !DILexicalBlock(scope: !425, file: !8, line: 184, column: 51)
!432 = !DILocation(line: 186, column: 7, scope: !431)
!433 = !DILocation(line: 188, column: 51, scope: !425)
!434 = !DILocation(line: 188, column: 25, scope: !425)
!435 = !DILocation(line: 189, column: 24, scope: !426)
!436 = !DILocation(line: 191, column: 1, scope: !419)
!437 = !DILocation(line: 184, column: 10, scope: !426)
!438 = !DILocalVariable(name: "j", scope: !439, file: !8, line: 178, type: !11)
!439 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !440, retainedNodes: !470)
!440 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !441, globals: !449, nameTableKind: None)
!441 = !{!442}
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !444)
!444 = !{!445, !446, !447, !448}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !443, file: !8, line: 40, baseType: !11, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !443, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !443, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !443, file: !8, line: 43, baseType: !442, size: 64, offset: 128)
!449 = !{!450, !452, !454, !461, !463, !465, !467}
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !440, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !440, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !440, file: !8, line: 49, type: !456, isLocal: false, isDefinition: true)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 2560, elements: !25)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !458)
!458 = !{!459, !460}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !457, file: !8, line: 35, baseType: !11, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !457, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !440, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !440, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !440, file: !8, line: 53, type: !442, isLocal: false, isDefinition: true)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !440, file: !8, line: 54, type: !469, isLocal: false, isDefinition: true)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !443, size: 192000, elements: !36)
!470 = !{!471, !438}
!471 = !DILocalVariable(name: "i", scope: !439, file: !8, line: 178, type: !11)
!472 = !DILocalVariable(name: "j", scope: !473, file: !8, line: 178, type: !11)
!473 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !474, retainedNodes: !504)
!474 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !475, globals: !483, nameTableKind: None)
!475 = !{!476}
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !478)
!478 = !{!479, !480, !481, !482}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !477, file: !8, line: 40, baseType: !11, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !477, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !477, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !477, file: !8, line: 43, baseType: !476, size: 64, offset: 128)
!483 = !{!484, !486, !488, !495, !497, !499, !501}
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !474, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !474, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !474, file: !8, line: 49, type: !490, isLocal: false, isDefinition: true)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 2560, elements: !25)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !492)
!492 = !{!493, !494}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !491, file: !8, line: 35, baseType: !11, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !491, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !474, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !474, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !474, file: !8, line: 53, type: !476, isLocal: false, isDefinition: true)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !474, file: !8, line: 54, type: !503, isLocal: false, isDefinition: true)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 192000, elements: !36)
!504 = !{!505, !472}
!505 = !DILocalVariable(name: "i", scope: !473, file: !8, line: 178, type: !11)
!506 = !DILocalVariable(name: "j", scope: !507, file: !8, line: 178, type: !11)
!507 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !508, retainedNodes: !538)
!508 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !509, globals: !517, nameTableKind: None)
!509 = !{!510}
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !512)
!512 = !{!513, !514, !515, !516}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !511, file: !8, line: 40, baseType: !11, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !511, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !511, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !511, file: !8, line: 43, baseType: !510, size: 64, offset: 128)
!517 = !{!518, !520, !522, !529, !531, !533, !535}
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !508, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !508, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !508, file: !8, line: 49, type: !524, isLocal: false, isDefinition: true)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !525, size: 2560, elements: !25)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !526)
!526 = !{!527, !528}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !525, file: !8, line: 35, baseType: !11, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !525, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !508, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !508, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !508, file: !8, line: 53, type: !510, isLocal: false, isDefinition: true)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !508, file: !8, line: 54, type: !537, isLocal: false, isDefinition: true)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !511, size: 192000, elements: !36)
!538 = !{!539, !506}
!539 = !DILocalVariable(name: "i", scope: !507, file: !8, line: 178, type: !11)
!540 = distinct !DISubprogram(name: "main", scope: !8, file: !8, line: 193, type: !541, scopeLine: 194, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !546)
!541 = !DISubroutineType(types: !542)
!542 = !{!11, !11, !543}
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!546 = !{!547, !548}
!547 = !DILocalVariable(name: "argc", arg: 1, scope: !540, file: !8, line: 193, type: !11)
!548 = !DILocalVariable(name: "argv", arg: 2, scope: !540, file: !8, line: 193, type: !543)
!549 = !DILocation(line: 0, scope: !540)
!550 = !DILocation(line: 195, column: 3, scope: !540)
!551 = !DILocation(line: 196, column: 3, scope: !540)
!552 = !DILocation(line: 90, column: 14, scope: !116, inlinedAt: !553)
!553 = distinct !DILocation(line: 198, column: 12, scope: !540)
!554 = !DILocation(line: 90, column: 32, scope: !116, inlinedAt: !553)
!555 = !DILocation(line: 90, column: 12, scope: !116, inlinedAt: !553)
!556 = !DILocation(line: 198, column: 3, scope: !540)
