; ModuleID = '<stdin>'
source_filename = "./dijkstra.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._QITEM = type { i32, i32, i32, %struct._QITEM* }
%struct._NODE = type { i32, i32 }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !2, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !15, nameTableKind: None)
!3 = !DIFile(filename: "dijkstra.c", directory: "/home/newton/cfiles/xmark")
!4 = !{}
!5 = !{!6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !9)
!8 = !DIFile(filename: "./dijkstra.c", directory: "/home/newton/cfiles/xmark")
!9 = !{!10, !12, !13, !14}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !7, file: !8, line: 40, baseType: !11, size: 32)
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !7, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !7, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !7, file: !8, line: 43, baseType: !6, size: 64, offset: 128)
!15 = !{!0, !16, !18, !27, !29, !31, !33}
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !2, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !2, file: !8, line: 49, type: !20, isLocal: false, isDefinition: true)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 2560, elements: !25)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !22)
!22 = !{!23, !24}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !21, file: !8, line: 35, baseType: !11, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !21, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!25 = !{!26}
!26 = !DISubrange(count: 40)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !2, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !2, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !2, file: !8, line: 53, type: !6, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !2, file: !8, line: 54, type: !35, isLocal: false, isDefinition: true)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192000, elements: !36)
!36 = !{!37}
!37 = !DISubrange(count: 1000)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 12800, elements: !40)
!39 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!40 = !{!26, !26}
!41 = !{i32 2, !"Dwarf Version", i32 4}
!42 = !{i32 2, !"Debug Info Version", i32 3}
!43 = !{i32 1, !"wchar_size", i32 4}
!44 = !{!"clang version 9.0.1-12 "}
!45 = distinct !DISubprogram(name: "dijkstra_init", scope: !8, file: !8, line: 70, type: !46, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !48)
!46 = !DISubroutineType(types: !47)
!47 = !{null}
!48 = !{!49, !50, !51}
!49 = !DILocalVariable(name: "i", scope: !45, file: !8, line: 72, type: !11)
!50 = !DILocalVariable(name: "k", scope: !45, file: !8, line: 72, type: !11)
!51 = !DILocalVariable(name: "x", scope: !45, file: !8, line: 73, type: !52)
!52 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !11)
!53 = !DILocation(line: 73, column: 3, scope: !45)
!54 = !DILocation(line: 73, column: 16, scope: !45)
!55 = !{!56, !56, i64 0}
!56 = !{!"int", !57, i64 0}
!57 = !{!"omnipotent char", !58, i64 0}
!58 = !{!"Simple C/C++ TBAA"}
!59 = !DILocation(line: 0, scope: !45)
!60 = !DILocation(line: 75, column: 3, scope: !61)
!61 = distinct !DILexicalBlock(scope: !45, file: !8, line: 75, column: 3)
!62 = !DILocation(line: 78, column: 39, scope: !63)
!63 = distinct !DILexicalBlock(scope: !64, file: !8, line: 77, column: 5)
!64 = distinct !DILexicalBlock(scope: !65, file: !8, line: 77, column: 5)
!65 = distinct !DILexicalBlock(scope: !66, file: !8, line: 75, column: 37)
!66 = distinct !DILexicalBlock(scope: !61, file: !8, line: 75, column: 3)
!67 = !DILocation(line: 78, column: 7, scope: !63)
!68 = !DILocation(line: 78, column: 36, scope: !63)
!69 = !{!57, !57, i64 0}
!70 = !DILocation(line: 75, column: 32, scope: !66)
!71 = !DILocation(line: 75, column: 18, scope: !66)
!72 = distinct !{!72, !60, !73}
!73 = !DILocation(line: 79, column: 3, scope: !61)
!74 = !DILocation(line: 81, column: 23, scope: !45)
!75 = !DILocation(line: 82, column: 22, scope: !45)
!76 = !DILocation(line: 83, column: 22, scope: !45)
!77 = !{!78, !78, i64 0}
!78 = !{!"any pointer", !57, i64 0}
!79 = !DILocation(line: 85, column: 21, scope: !45)
!80 = !DILocation(line: 86, column: 1, scope: !45)
!81 = !DILocalVariable(name: "k", scope: !82, file: !8, line: 72, type: !11)
!82 = distinct !DISubprogram(name: "dijkstra_init", scope: !8, file: !8, line: 70, type: !46, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !83, retainedNodes: !113)
!83 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !84, globals: !92, nameTableKind: None)
!84 = !{!85}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !87)
!87 = !{!88, !89, !90, !91}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !86, file: !8, line: 40, baseType: !11, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !86, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !86, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !86, file: !8, line: 43, baseType: !85, size: 64, offset: 128)
!92 = !{!93, !95, !97, !104, !106, !108, !110}
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !83, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !83, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !83, file: !8, line: 49, type: !99, isLocal: false, isDefinition: true)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 2560, elements: !25)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !101)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !100, file: !8, line: 35, baseType: !11, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !100, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !83, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !83, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !83, file: !8, line: 53, type: !85, isLocal: false, isDefinition: true)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !83, file: !8, line: 54, type: !112, isLocal: false, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 192000, elements: !36)
!113 = !{!114, !81, !115}
!114 = !DILocalVariable(name: "i", scope: !82, file: !8, line: 72, type: !11)
!115 = !DILocalVariable(name: "x", scope: !82, file: !8, line: 73, type: !52)
!116 = distinct !DISubprogram(name: "dijkstra_return", scope: !8, file: !8, line: 88, type: !117, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!117 = !DISubroutineType(types: !118)
!118 = !{!11}
!119 = !DILocation(line: 90, column: 14, scope: !116)
!120 = !DILocation(line: 90, column: 32, scope: !116)
!121 = !DILocation(line: 90, column: 12, scope: !116)
!122 = !DILocation(line: 90, column: 3, scope: !116)
!123 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !124, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !126)
!124 = !DISubroutineType(types: !125)
!125 = !{!11, !11, !11, !11}
!126 = !{!127, !128, !129, !130, !131}
!127 = !DILocalVariable(name: "node", arg: 1, scope: !123, file: !8, line: 93, type: !11)
!128 = !DILocalVariable(name: "dist", arg: 2, scope: !123, file: !8, line: 93, type: !11)
!129 = !DILocalVariable(name: "prev", arg: 3, scope: !123, file: !8, line: 93, type: !11)
!130 = !DILocalVariable(name: "newItem", scope: !123, file: !8, line: 95, type: !6)
!131 = !DILocalVariable(name: "last", scope: !123, file: !8, line: 96, type: !6)
!132 = !DILocation(line: 0, scope: !123)
!133 = !DILocation(line: 95, column: 50, scope: !123)
!134 = !DILocation(line: 95, column: 29, scope: !123)
!135 = !DILocation(line: 96, column: 25, scope: !123)
!136 = !DILocation(line: 98, column: 8, scope: !137)
!137 = distinct !DILexicalBlock(scope: !123, file: !8, line: 98, column: 8)
!138 = !DILocation(line: 98, column: 29, scope: !137)
!139 = !DILocation(line: 98, column: 8, scope: !123)
!140 = !DILocation(line: 100, column: 12, scope: !123)
!141 = !DILocation(line: 100, column: 17, scope: !123)
!142 = !{!143, !56, i64 0}
!143 = !{!"_QITEM", !56, i64 0, !56, i64 4, !56, i64 8, !78, i64 16}
!144 = !DILocation(line: 101, column: 12, scope: !123)
!145 = !DILocation(line: 101, column: 17, scope: !123)
!146 = !{!143, !56, i64 4}
!147 = !DILocation(line: 102, column: 12, scope: !123)
!148 = !DILocation(line: 102, column: 17, scope: !123)
!149 = !{!143, !56, i64 8}
!150 = !DILocation(line: 103, column: 12, scope: !123)
!151 = !DILocation(line: 103, column: 17, scope: !123)
!152 = !{!143, !78, i64 16}
!153 = !DILocation(line: 105, column: 9, scope: !154)
!154 = distinct !DILexicalBlock(scope: !123, file: !8, line: 105, column: 8)
!155 = !DILocation(line: 105, column: 8, scope: !123)
!156 = !DILocation(line: 110, column: 19, scope: !157)
!157 = distinct !DILexicalBlock(scope: !154, file: !8, line: 107, column: 8)
!158 = !DILocation(line: 110, column: 5, scope: !157)
!159 = distinct !{!159, !158, !160}
!160 = !DILocation(line: 111, column: 20, scope: !157)
!161 = !DILocation(line: 0, scope: !154)
!162 = !DILocation(line: 114, column: 22, scope: !123)
!163 = !DILocation(line: 115, column: 3, scope: !123)
!164 = !DILocation(line: 116, column: 1, scope: !123)
!165 = distinct !DISubprogram(name: "dijkstra_dequeue", scope: !8, file: !8, line: 118, type: !166, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !169)
!166 = !DISubroutineType(types: !167)
!167 = !{null, !168, !168, !168}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!169 = !{!170, !171, !172}
!170 = !DILocalVariable(name: "node", arg: 1, scope: !165, file: !8, line: 118, type: !168)
!171 = !DILocalVariable(name: "dist", arg: 2, scope: !165, file: !8, line: 118, type: !168)
!172 = !DILocalVariable(name: "prev", arg: 3, scope: !165, file: !8, line: 118, type: !168)
!173 = !DILocation(line: 0, scope: !165)
!174 = !DILocation(line: 120, column: 8, scope: !175)
!175 = distinct !DILexicalBlock(scope: !165, file: !8, line: 120, column: 8)
!176 = !DILocation(line: 120, column: 8, scope: !165)
!177 = !DILocation(line: 121, column: 33, scope: !178)
!178 = distinct !DILexicalBlock(scope: !175, file: !8, line: 120, column: 29)
!179 = !DILocation(line: 121, column: 11, scope: !178)
!180 = !DILocation(line: 122, column: 33, scope: !178)
!181 = !DILocation(line: 122, column: 11, scope: !178)
!182 = !DILocation(line: 123, column: 33, scope: !178)
!183 = !DILocation(line: 123, column: 11, scope: !178)
!184 = !DILocation(line: 124, column: 46, scope: !178)
!185 = !DILocation(line: 124, column: 24, scope: !178)
!186 = !DILocation(line: 125, column: 24, scope: !178)
!187 = !DILocation(line: 126, column: 3, scope: !178)
!188 = !DILocation(line: 127, column: 1, scope: !165)
!189 = distinct !DISubprogram(name: "dijkstra_qcount", scope: !8, file: !8, line: 129, type: !117, scopeLine: 130, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!190 = !DILocation(line: 131, column: 12, scope: !189)
!191 = !DILocation(line: 131, column: 3, scope: !189)
!192 = distinct !DISubprogram(name: "dijkstra_find", scope: !8, file: !8, line: 134, type: !193, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !195)
!193 = !DISubroutineType(types: !194)
!194 = !{!11, !11, !11}
!195 = !{!196, !197, !198, !199, !200, !201, !202, !203}
!196 = !DILocalVariable(name: "chStart", arg: 1, scope: !192, file: !8, line: 134, type: !11)
!197 = !DILocalVariable(name: "chEnd", arg: 2, scope: !192, file: !8, line: 134, type: !11)
!198 = !DILocalVariable(name: "ch", scope: !192, file: !8, line: 136, type: !11)
!199 = !DILocalVariable(name: "prev", scope: !192, file: !8, line: 137, type: !11)
!200 = !DILocalVariable(name: "node", scope: !192, file: !8, line: 137, type: !11)
!201 = !DILocalVariable(name: "cost", scope: !192, file: !8, line: 138, type: !11)
!202 = !DILocalVariable(name: "dist", scope: !192, file: !8, line: 138, type: !11)
!203 = !DILocalVariable(name: "i", scope: !192, file: !8, line: 139, type: !11)
!204 = !DILocation(line: 0, scope: !192)
!205 = !DILocation(line: 143, column: 34, scope: !206)
!206 = distinct !DILexicalBlock(scope: !207, file: !8, line: 142, column: 40)
!207 = distinct !DILexicalBlock(scope: !208, file: !8, line: 142, column: 3)
!208 = distinct !DILexicalBlock(scope: !192, file: !8, line: 142, column: 3)
!209 = !DILocation(line: 147, column: 16, scope: !210)
!210 = distinct !DILexicalBlock(scope: !192, file: !8, line: 147, column: 8)
!211 = !DILocation(line: 147, column: 8, scope: !192)
!212 = !DILocation(line: 149, column: 5, scope: !213)
!213 = distinct !DILexicalBlock(scope: !210, file: !8, line: 148, column: 10)
!214 = !DILocation(line: 149, column: 34, scope: !213)
!215 = !DILocation(line: 149, column: 39, scope: !213)
!216 = !{!217, !56, i64 0}
!217 = !{!"_NODE", !56, i64 0, !56, i64 4}
!218 = !DILocation(line: 150, column: 34, scope: !213)
!219 = !DILocation(line: 150, column: 39, scope: !213)
!220 = !{!217, !56, i64 4}
!221 = !DILocation(line: 0, scope: !123, inlinedAt: !222)
!222 = distinct !DILocation(line: 152, column: 10, scope: !223)
!223 = distinct !DILexicalBlock(scope: !213, file: !8, line: 152, column: 10)
!224 = !DILocation(line: 95, column: 50, scope: !123, inlinedAt: !222)
!225 = !DILocation(line: 95, column: 29, scope: !123, inlinedAt: !222)
!226 = !DILocation(line: 96, column: 25, scope: !123, inlinedAt: !222)
!227 = !DILocation(line: 98, column: 8, scope: !137, inlinedAt: !222)
!228 = !DILocation(line: 98, column: 29, scope: !137, inlinedAt: !222)
!229 = !DILocation(line: 98, column: 8, scope: !123, inlinedAt: !222)
!230 = !DILocation(line: 100, column: 12, scope: !123, inlinedAt: !222)
!231 = !DILocation(line: 100, column: 17, scope: !123, inlinedAt: !222)
!232 = !DILocation(line: 101, column: 12, scope: !123, inlinedAt: !222)
!233 = !DILocation(line: 101, column: 17, scope: !123, inlinedAt: !222)
!234 = !DILocation(line: 102, column: 12, scope: !123, inlinedAt: !222)
!235 = !DILocation(line: 102, column: 17, scope: !123, inlinedAt: !222)
!236 = !DILocation(line: 103, column: 12, scope: !123, inlinedAt: !222)
!237 = !DILocation(line: 103, column: 17, scope: !123, inlinedAt: !222)
!238 = !DILocation(line: 105, column: 9, scope: !154, inlinedAt: !222)
!239 = !DILocation(line: 105, column: 8, scope: !123, inlinedAt: !222)
!240 = !DILocation(line: 110, column: 19, scope: !157, inlinedAt: !222)
!241 = !DILocation(line: 110, column: 5, scope: !157, inlinedAt: !222)
!242 = distinct !{!242, !241, !243}
!243 = !DILocation(line: 111, column: 20, scope: !157, inlinedAt: !222)
!244 = !DILocation(line: 0, scope: !154, inlinedAt: !222)
!245 = !DILocation(line: 114, column: 22, scope: !123, inlinedAt: !222)
!246 = !DILocation(line: 157, column: 31, scope: !213)
!247 = !DILocation(line: 157, column: 5, scope: !213)
!248 = !DILocation(line: 120, column: 8, scope: !175, inlinedAt: !249)
!249 = distinct !DILocation(line: 158, column: 7, scope: !250)
!250 = distinct !DILexicalBlock(scope: !213, file: !8, line: 157, column: 37)
!251 = !DILocation(line: 120, column: 8, scope: !165, inlinedAt: !249)
!252 = !DILocation(line: 121, column: 33, scope: !178, inlinedAt: !249)
!253 = !DILocation(line: 122, column: 33, scope: !178, inlinedAt: !249)
!254 = !DILocation(line: 124, column: 46, scope: !178, inlinedAt: !249)
!255 = !DILocation(line: 124, column: 24, scope: !178, inlinedAt: !249)
!256 = !DILocation(line: 125, column: 24, scope: !178, inlinedAt: !249)
!257 = !DILocation(line: 126, column: 3, scope: !178, inlinedAt: !249)
!258 = !DILocation(line: 0, scope: !259)
!259 = distinct !DILexicalBlock(scope: !260, file: !8, line: 161, column: 14)
!260 = distinct !DILexicalBlock(scope: !261, file: !8, line: 160, column: 41)
!261 = distinct !DILexicalBlock(scope: !262, file: !8, line: 160, column: 7)
!262 = distinct !DILexicalBlock(scope: !250, file: !8, line: 160, column: 7)
!263 = !DILocation(line: 160, column: 7, scope: !262)
!264 = !DILocation(line: 161, column: 23, scope: !259)
!265 = !DILocation(line: 162, column: 49, scope: !266)
!266 = distinct !DILexicalBlock(scope: !267, file: !8, line: 162, column: 16)
!267 = distinct !DILexicalBlock(scope: !259, file: !8, line: 161, column: 67)
!268 = !DILocation(line: 162, column: 23, scope: !266)
!269 = !DILocation(line: 163, column: 55, scope: !266)
!270 = !DILocation(line: 163, column: 46, scope: !266)
!271 = !DILocation(line: 162, column: 56, scope: !266)
!272 = !DILocation(line: 164, column: 41, scope: !273)
!273 = distinct !DILexicalBlock(scope: !266, file: !8, line: 163, column: 68)
!274 = !DILocation(line: 165, column: 36, scope: !273)
!275 = !DILocation(line: 165, column: 41, scope: !273)
!276 = !DILocation(line: 0, scope: !123, inlinedAt: !277)
!277 = distinct !DILocation(line: 166, column: 18, scope: !278)
!278 = distinct !DILexicalBlock(scope: !273, file: !8, line: 166, column: 18)
!279 = !DILocation(line: 95, column: 29, scope: !123, inlinedAt: !277)
!280 = !DILocation(line: 98, column: 8, scope: !137, inlinedAt: !277)
!281 = !DILocation(line: 98, column: 29, scope: !137, inlinedAt: !277)
!282 = !DILocation(line: 98, column: 8, scope: !123, inlinedAt: !277)
!283 = !DILocation(line: 100, column: 12, scope: !123, inlinedAt: !277)
!284 = !DILocation(line: 100, column: 17, scope: !123, inlinedAt: !277)
!285 = !DILocation(line: 101, column: 12, scope: !123, inlinedAt: !277)
!286 = !DILocation(line: 101, column: 17, scope: !123, inlinedAt: !277)
!287 = !DILocation(line: 102, column: 12, scope: !123, inlinedAt: !277)
!288 = !DILocation(line: 102, column: 17, scope: !123, inlinedAt: !277)
!289 = !DILocation(line: 103, column: 12, scope: !123, inlinedAt: !277)
!290 = !DILocation(line: 103, column: 17, scope: !123, inlinedAt: !277)
!291 = !DILocation(line: 105, column: 9, scope: !154, inlinedAt: !277)
!292 = !DILocation(line: 105, column: 8, scope: !123, inlinedAt: !277)
!293 = !DILocation(line: 110, column: 19, scope: !157, inlinedAt: !277)
!294 = !DILocation(line: 110, column: 5, scope: !157, inlinedAt: !277)
!295 = distinct !{!295, !294, !296}
!296 = !DILocation(line: 111, column: 20, scope: !157, inlinedAt: !277)
!297 = !DILocation(line: 0, scope: !154, inlinedAt: !277)
!298 = !DILocation(line: 114, column: 22, scope: !123, inlinedAt: !277)
!299 = !DILocation(line: 166, column: 18, scope: !273)
!300 = !DILocation(line: 160, column: 36, scope: !261)
!301 = !DILocation(line: 160, column: 22, scope: !261)
!302 = distinct !{!302, !263, !303}
!303 = !DILocation(line: 170, column: 7, scope: !262)
!304 = !DILocation(line: 174, column: 1, scope: !192)
!305 = !DILocalVariable(name: "ch", scope: !306, file: !8, line: 136, type: !11)
!306 = distinct !DISubprogram(name: "dijkstra_find", scope: !8, file: !8, line: 134, type: !193, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !307, retainedNodes: !337)
!307 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !308, globals: !316, nameTableKind: None)
!308 = !{!309}
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !311)
!311 = !{!312, !313, !314, !315}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !310, file: !8, line: 40, baseType: !11, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !310, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !310, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !310, file: !8, line: 43, baseType: !309, size: 64, offset: 128)
!316 = !{!317, !319, !321, !328, !330, !332, !334}
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !307, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !307, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !307, file: !8, line: 49, type: !323, isLocal: false, isDefinition: true)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 2560, elements: !25)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !325)
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !324, file: !8, line: 35, baseType: !11, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !324, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !307, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !307, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !307, file: !8, line: 53, type: !309, isLocal: false, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !307, file: !8, line: 54, type: !336, isLocal: false, isDefinition: true)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 192000, elements: !36)
!337 = !{!338, !339, !305, !340, !341, !342, !343, !344}
!338 = !DILocalVariable(name: "chStart", arg: 1, scope: !306, file: !8, line: 134, type: !11)
!339 = !DILocalVariable(name: "chEnd", arg: 2, scope: !306, file: !8, line: 134, type: !11)
!340 = !DILocalVariable(name: "prev", scope: !306, file: !8, line: 137, type: !11)
!341 = !DILocalVariable(name: "node", scope: !306, file: !8, line: 137, type: !11)
!342 = !DILocalVariable(name: "cost", scope: !306, file: !8, line: 138, type: !11)
!343 = !DILocalVariable(name: "dist", scope: !306, file: !8, line: 138, type: !11)
!344 = !DILocalVariable(name: "i", scope: !306, file: !8, line: 139, type: !11)
!345 = !DILocalVariable(name: "node", arg: 1, scope: !346, file: !8, line: 93, type: !11)
!346 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !124, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !347, retainedNodes: !377)
!347 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !348, globals: !356, nameTableKind: None)
!348 = !{!349}
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !351)
!351 = !{!352, !353, !354, !355}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !350, file: !8, line: 40, baseType: !11, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !350, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !350, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !350, file: !8, line: 43, baseType: !349, size: 64, offset: 128)
!356 = !{!357, !359, !361, !368, !370, !372, !374}
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !347, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !347, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !347, file: !8, line: 49, type: !363, isLocal: false, isDefinition: true)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 2560, elements: !25)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !365)
!365 = !{!366, !367}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !364, file: !8, line: 35, baseType: !11, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !364, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !347, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !347, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !347, file: !8, line: 53, type: !349, isLocal: false, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !347, file: !8, line: 54, type: !376, isLocal: false, isDefinition: true)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 192000, elements: !36)
!377 = !{!345, !378, !379, !380, !381}
!378 = !DILocalVariable(name: "dist", arg: 2, scope: !346, file: !8, line: 93, type: !11)
!379 = !DILocalVariable(name: "prev", arg: 3, scope: !346, file: !8, line: 93, type: !11)
!380 = !DILocalVariable(name: "newItem", scope: !346, file: !8, line: 95, type: !349)
!381 = !DILocalVariable(name: "last", scope: !346, file: !8, line: 96, type: !349)
!382 = !DILocalVariable(name: "cost", scope: !383, file: !8, line: 138, type: !11)
!383 = distinct !DISubprogram(name: "dijkstra_find", scope: !8, file: !8, line: 134, type: !193, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !384, retainedNodes: !414)
!384 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !385, globals: !393, nameTableKind: None)
!385 = !{!386}
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !388)
!388 = !{!389, !390, !391, !392}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !387, file: !8, line: 40, baseType: !11, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !387, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !387, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !387, file: !8, line: 43, baseType: !386, size: 64, offset: 128)
!393 = !{!394, !396, !398, !405, !407, !409, !411}
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !384, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !384, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !384, file: !8, line: 49, type: !400, isLocal: false, isDefinition: true)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 2560, elements: !25)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !402)
!402 = !{!403, !404}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !401, file: !8, line: 35, baseType: !11, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !401, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !384, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !384, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !384, file: !8, line: 53, type: !386, isLocal: false, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !384, file: !8, line: 54, type: !413, isLocal: false, isDefinition: true)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 192000, elements: !36)
!414 = !{!415, !416, !417, !418, !419, !382, !420, !421}
!415 = !DILocalVariable(name: "chStart", arg: 1, scope: !383, file: !8, line: 134, type: !11)
!416 = !DILocalVariable(name: "chEnd", arg: 2, scope: !383, file: !8, line: 134, type: !11)
!417 = !DILocalVariable(name: "ch", scope: !383, file: !8, line: 136, type: !11)
!418 = !DILocalVariable(name: "prev", scope: !383, file: !8, line: 137, type: !11)
!419 = !DILocalVariable(name: "node", scope: !383, file: !8, line: 137, type: !11)
!420 = !DILocalVariable(name: "dist", scope: !383, file: !8, line: 138, type: !11)
!421 = !DILocalVariable(name: "i", scope: !383, file: !8, line: 139, type: !11)
!422 = !DILocalVariable(name: "i", scope: !423, file: !8, line: 139, type: !11)
!423 = distinct !DISubprogram(name: "dijkstra_find", scope: !8, file: !8, line: 134, type: !193, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !424, retainedNodes: !454)
!424 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !425, globals: !433, nameTableKind: None)
!425 = !{!426}
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !428)
!428 = !{!429, !430, !431, !432}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !427, file: !8, line: 40, baseType: !11, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !427, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !427, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !427, file: !8, line: 43, baseType: !426, size: 64, offset: 128)
!433 = !{!434, !436, !438, !445, !447, !449, !451}
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !424, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !424, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !424, file: !8, line: 49, type: !440, isLocal: false, isDefinition: true)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 2560, elements: !25)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !442)
!442 = !{!443, !444}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !441, file: !8, line: 35, baseType: !11, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !441, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !424, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !424, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !424, file: !8, line: 53, type: !426, isLocal: false, isDefinition: true)
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !424, file: !8, line: 54, type: !453, isLocal: false, isDefinition: true)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 192000, elements: !36)
!454 = !{!455, !456, !457, !458, !459, !460, !461, !422}
!455 = !DILocalVariable(name: "chStart", arg: 1, scope: !423, file: !8, line: 134, type: !11)
!456 = !DILocalVariable(name: "chEnd", arg: 2, scope: !423, file: !8, line: 134, type: !11)
!457 = !DILocalVariable(name: "ch", scope: !423, file: !8, line: 136, type: !11)
!458 = !DILocalVariable(name: "prev", scope: !423, file: !8, line: 137, type: !11)
!459 = !DILocalVariable(name: "node", scope: !423, file: !8, line: 137, type: !11)
!460 = !DILocalVariable(name: "cost", scope: !423, file: !8, line: 138, type: !11)
!461 = !DILocalVariable(name: "dist", scope: !423, file: !8, line: 138, type: !11)
!462 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !463)
!463 = !{!464, !465}
!464 = !DILocalVariable(name: "i", scope: !462, file: !8, line: 178, type: !11)
!465 = !DILocalVariable(name: "j", scope: !462, file: !8, line: 178, type: !11)
!466 = !DILocation(line: 0, scope: !462)
!467 = !DILocation(line: 184, column: 10, scope: !468)
!468 = distinct !DILexicalBlock(scope: !469, file: !8, line: 184, column: 10)
!469 = distinct !DILexicalBlock(scope: !470, file: !8, line: 182, column: 54)
!470 = distinct !DILexicalBlock(scope: !471, file: !8, line: 182, column: 3)
!471 = distinct !DILexicalBlock(scope: !462, file: !8, line: 182, column: 3)
!472 = !DILocation(line: 184, column: 32, scope: !468)
!473 = !DILocation(line: 185, column: 25, scope: !474)
!474 = distinct !DILexicalBlock(scope: !468, file: !8, line: 184, column: 51)
!475 = !DILocation(line: 186, column: 7, scope: !474)
!476 = !DILocation(line: 188, column: 51, scope: !468)
!477 = !DILocation(line: 188, column: 25, scope: !468)
!478 = !DILocation(line: 189, column: 24, scope: !469)
!479 = !DILocation(line: 191, column: 1, scope: !462)
!480 = !DILocation(line: 184, column: 10, scope: !469)
!481 = !DILocalVariable(name: "j", scope: !482, file: !8, line: 178, type: !11)
!482 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !483, retainedNodes: !513)
!483 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !484, globals: !492, nameTableKind: None)
!484 = !{!485}
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !487)
!487 = !{!488, !489, !490, !491}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !486, file: !8, line: 40, baseType: !11, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !486, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !486, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !486, file: !8, line: 43, baseType: !485, size: 64, offset: 128)
!492 = !{!493, !495, !497, !504, !506, !508, !510}
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !483, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !483, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !483, file: !8, line: 49, type: !499, isLocal: false, isDefinition: true)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 2560, elements: !25)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !501)
!501 = !{!502, !503}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !500, file: !8, line: 35, baseType: !11, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !500, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !483, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !483, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !483, file: !8, line: 53, type: !485, isLocal: false, isDefinition: true)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !483, file: !8, line: 54, type: !512, isLocal: false, isDefinition: true)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !486, size: 192000, elements: !36)
!513 = !{!514, !481}
!514 = !DILocalVariable(name: "i", scope: !482, file: !8, line: 178, type: !11)
!515 = !DILocalVariable(name: "j", scope: !516, file: !8, line: 178, type: !11)
!516 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !517, retainedNodes: !547)
!517 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !518, globals: !526, nameTableKind: None)
!518 = !{!519}
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !521)
!521 = !{!522, !523, !524, !525}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !520, file: !8, line: 40, baseType: !11, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !520, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !520, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !520, file: !8, line: 43, baseType: !519, size: 64, offset: 128)
!526 = !{!527, !529, !531, !538, !540, !542, !544}
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !517, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !517, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !517, file: !8, line: 49, type: !533, isLocal: false, isDefinition: true)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !534, size: 2560, elements: !25)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !535)
!535 = !{!536, !537}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !534, file: !8, line: 35, baseType: !11, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !534, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !517, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !517, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !517, file: !8, line: 53, type: !519, isLocal: false, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !517, file: !8, line: 54, type: !546, isLocal: false, isDefinition: true)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !520, size: 192000, elements: !36)
!547 = !{!548, !515}
!548 = !DILocalVariable(name: "i", scope: !516, file: !8, line: 178, type: !11)
!549 = !DILocalVariable(name: "j", scope: !550, file: !8, line: 178, type: !11)
!550 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !551, retainedNodes: !581)
!551 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !552, globals: !560, nameTableKind: None)
!552 = !{!553}
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !555)
!555 = !{!556, !557, !558, !559}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !554, file: !8, line: 40, baseType: !11, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !554, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !554, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !554, file: !8, line: 43, baseType: !553, size: 64, offset: 128)
!560 = !{!561, !563, !565, !572, !574, !576, !578}
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !551, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !551, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !551, file: !8, line: 49, type: !567, isLocal: false, isDefinition: true)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 2560, elements: !25)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !569)
!569 = !{!570, !571}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !568, file: !8, line: 35, baseType: !11, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !568, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !551, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !551, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !551, file: !8, line: 53, type: !553, isLocal: false, isDefinition: true)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !551, file: !8, line: 54, type: !580, isLocal: false, isDefinition: true)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !554, size: 192000, elements: !36)
!581 = !{!582, !549}
!582 = !DILocalVariable(name: "i", scope: !550, file: !8, line: 178, type: !11)
!583 = !DILocalVariable(name: "j", scope: !584, file: !8, line: 178, type: !11)
!584 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !585, retainedNodes: !615)
!585 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !586, globals: !594, nameTableKind: None)
!586 = !{!587}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !589)
!589 = !{!590, !591, !592, !593}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !588, file: !8, line: 40, baseType: !11, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !588, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !588, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !588, file: !8, line: 43, baseType: !587, size: 64, offset: 128)
!594 = !{!595, !597, !599, !606, !608, !610, !612}
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !585, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !585, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !585, file: !8, line: 49, type: !601, isLocal: false, isDefinition: true)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 2560, elements: !25)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !603)
!603 = !{!604, !605}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !602, file: !8, line: 35, baseType: !11, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !602, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !585, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !585, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !585, file: !8, line: 53, type: !587, isLocal: false, isDefinition: true)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !585, file: !8, line: 54, type: !614, isLocal: false, isDefinition: true)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 192000, elements: !36)
!615 = !{!616, !583}
!616 = !DILocalVariable(name: "i", scope: !584, file: !8, line: 178, type: !11)
!617 = !DILocalVariable(name: "j", scope: !618, file: !8, line: 178, type: !11)
!618 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !619, retainedNodes: !649)
!619 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !620, globals: !628, nameTableKind: None)
!620 = !{!621}
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !623)
!623 = !{!624, !625, !626, !627}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !622, file: !8, line: 40, baseType: !11, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !622, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !622, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !622, file: !8, line: 43, baseType: !621, size: 64, offset: 128)
!628 = !{!629, !631, !633, !640, !642, !644, !646}
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !619, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !619, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !619, file: !8, line: 49, type: !635, isLocal: false, isDefinition: true)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !636, size: 2560, elements: !25)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !637)
!637 = !{!638, !639}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !636, file: !8, line: 35, baseType: !11, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !636, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !619, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !619, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !619, file: !8, line: 53, type: !621, isLocal: false, isDefinition: true)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !619, file: !8, line: 54, type: !648, isLocal: false, isDefinition: true)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 192000, elements: !36)
!649 = !{!650, !617}
!650 = !DILocalVariable(name: "i", scope: !618, file: !8, line: 178, type: !11)
!651 = !DILocalVariable(name: "j", scope: !652, file: !8, line: 178, type: !11)
!652 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !653, retainedNodes: !683)
!653 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !654, globals: !662, nameTableKind: None)
!654 = !{!655}
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !657)
!657 = !{!658, !659, !660, !661}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !656, file: !8, line: 40, baseType: !11, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !656, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !656, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !656, file: !8, line: 43, baseType: !655, size: 64, offset: 128)
!662 = !{!663, !665, !667, !674, !676, !678, !680}
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !653, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !653, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !653, file: !8, line: 49, type: !669, isLocal: false, isDefinition: true)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !670, size: 2560, elements: !25)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !671)
!671 = !{!672, !673}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !670, file: !8, line: 35, baseType: !11, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !670, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !653, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !653, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !653, file: !8, line: 53, type: !655, isLocal: false, isDefinition: true)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !653, file: !8, line: 54, type: !682, isLocal: false, isDefinition: true)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !656, size: 192000, elements: !36)
!683 = !{!684, !651}
!684 = !DILocalVariable(name: "i", scope: !652, file: !8, line: 178, type: !11)
!685 = distinct !DISubprogram(name: "main", scope: !8, file: !8, line: 193, type: !686, scopeLine: 194, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !691)
!686 = !DISubroutineType(types: !687)
!687 = !{!11, !11, !688}
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!691 = !{!692, !693}
!692 = !DILocalVariable(name: "argc", arg: 1, scope: !685, file: !8, line: 193, type: !11)
!693 = !DILocalVariable(name: "argv", arg: 2, scope: !685, file: !8, line: 193, type: !688)
!694 = !DILocation(line: 0, scope: !685)
!695 = !DILocation(line: 195, column: 3, scope: !685)
!696 = !DILocation(line: 196, column: 3, scope: !685)
!697 = !DILocation(line: 90, column: 14, scope: !116, inlinedAt: !698)
!698 = distinct !DILocation(line: 198, column: 12, scope: !685)
!699 = !DILocation(line: 90, column: 32, scope: !116, inlinedAt: !698)
!700 = !DILocation(line: 90, column: 12, scope: !116, inlinedAt: !698)
!701 = !DILocation(line: 198, column: 3, scope: !685)
