; ModuleID = '<stdin>'
source_filename = "./dijkstra.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._QITEM = type { i32, i32, i32, %struct._QITEM* }
%struct._NODE = type { i32, i32 }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !2, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !15, nameTableKind: None)
!3 = !DIFile(filename: "dijkstra.c", directory: "/home/newton/cfiles/xmark")
!4 = !{}
!5 = !{!6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !9)
!8 = !DIFile(filename: "./dijkstra.c", directory: "/home/newton/cfiles/xmark")
!9 = !{!10, !12, !13, !14}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !7, file: !8, line: 40, baseType: !11, size: 32)
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !7, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !7, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !7, file: !8, line: 43, baseType: !6, size: 64, offset: 128)
!15 = !{!0, !16, !18, !27, !29, !31, !33}
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !2, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !2, file: !8, line: 49, type: !20, isLocal: false, isDefinition: true)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 2560, elements: !25)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !22)
!22 = !{!23, !24}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !21, file: !8, line: 35, baseType: !11, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !21, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!25 = !{!26}
!26 = !DISubrange(count: 40)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !2, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !2, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !2, file: !8, line: 53, type: !6, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !2, file: !8, line: 54, type: !35, isLocal: false, isDefinition: true)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192000, elements: !36)
!36 = !{!37}
!37 = !DISubrange(count: 1000)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 12800, elements: !40)
!39 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!40 = !{!26, !26}
!41 = !{i32 2, !"Dwarf Version", i32 4}
!42 = !{i32 2, !"Debug Info Version", i32 3}
!43 = !{i32 1, !"wchar_size", i32 4}
!44 = !{!"clang version 9.0.1-12 "}
!45 = distinct !DISubprogram(name: "dijkstra_init", scope: !8, file: !8, line: 70, type: !46, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !48)
!46 = !DISubroutineType(types: !47)
!47 = !{null}
!48 = !{!49, !50, !51}
!49 = !DILocalVariable(name: "i", scope: !45, file: !8, line: 72, type: !11)
!50 = !DILocalVariable(name: "k", scope: !45, file: !8, line: 72, type: !11)
!51 = !DILocalVariable(name: "x", scope: !45, file: !8, line: 73, type: !52)
!52 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !11)
!53 = !DILocation(line: 73, column: 3, scope: !45)
!54 = !DILocation(line: 73, column: 16, scope: !45)
!55 = !{!56, !56, i64 0}
!56 = !{!"int", !57, i64 0}
!57 = !{!"omnipotent char", !58, i64 0}
!58 = !{!"Simple C/C++ TBAA"}
!59 = !DILocation(line: 0, scope: !45)
!60 = !DILocation(line: 75, column: 3, scope: !61)
!61 = distinct !DILexicalBlock(scope: !45, file: !8, line: 75, column: 3)
!62 = !DILocation(line: 78, column: 39, scope: !63)
!63 = distinct !DILexicalBlock(scope: !64, file: !8, line: 77, column: 5)
!64 = distinct !DILexicalBlock(scope: !65, file: !8, line: 77, column: 5)
!65 = distinct !DILexicalBlock(scope: !66, file: !8, line: 75, column: 37)
!66 = distinct !DILexicalBlock(scope: !61, file: !8, line: 75, column: 3)
!67 = !DILocation(line: 78, column: 7, scope: !63)
!68 = !DILocation(line: 78, column: 36, scope: !63)
!69 = !{!57, !57, i64 0}
!70 = !DILocation(line: 75, column: 32, scope: !66)
!71 = !DILocation(line: 75, column: 18, scope: !66)
!72 = distinct !{!72, !60, !73}
!73 = !DILocation(line: 79, column: 3, scope: !61)
!74 = !DILocation(line: 81, column: 23, scope: !45)
!75 = !DILocation(line: 82, column: 22, scope: !45)
!76 = !DILocation(line: 83, column: 22, scope: !45)
!77 = !{!78, !78, i64 0}
!78 = !{!"any pointer", !57, i64 0}
!79 = !DILocation(line: 85, column: 21, scope: !45)
!80 = !DILocation(line: 86, column: 1, scope: !45)
!81 = !DILocalVariable(name: "x", scope: !82, file: !8, line: 73, type: !52)
!82 = distinct !DISubprogram(name: "dijkstra_init", scope: !8, file: !8, line: 70, type: !46, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !83, retainedNodes: !113)
!83 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !84, globals: !92, nameTableKind: None)
!84 = !{!85}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !87)
!87 = !{!88, !89, !90, !91}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !86, file: !8, line: 40, baseType: !11, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !86, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !86, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !86, file: !8, line: 43, baseType: !85, size: 64, offset: 128)
!92 = !{!93, !95, !97, !104, !106, !108, !110}
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !83, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !83, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !83, file: !8, line: 49, type: !99, isLocal: false, isDefinition: true)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 2560, elements: !25)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !101)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !100, file: !8, line: 35, baseType: !11, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !100, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !83, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !83, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !83, file: !8, line: 53, type: !85, isLocal: false, isDefinition: true)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !83, file: !8, line: 54, type: !112, isLocal: false, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 192000, elements: !36)
!113 = !{!114, !115, !81}
!114 = !DILocalVariable(name: "i", scope: !82, file: !8, line: 72, type: !11)
!115 = !DILocalVariable(name: "k", scope: !82, file: !8, line: 72, type: !11)
!116 = !DILocalVariable(name: "k", scope: !117, file: !8, line: 72, type: !11)
!117 = distinct !DISubprogram(name: "dijkstra_init", scope: !8, file: !8, line: 70, type: !46, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !118, retainedNodes: !148)
!118 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !119, globals: !127, nameTableKind: None)
!119 = !{!120}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !122)
!122 = !{!123, !124, !125, !126}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !121, file: !8, line: 40, baseType: !11, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !121, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !121, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !121, file: !8, line: 43, baseType: !120, size: 64, offset: 128)
!127 = !{!128, !130, !132, !139, !141, !143, !145}
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !118, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !118, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !118, file: !8, line: 49, type: !134, isLocal: false, isDefinition: true)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 2560, elements: !25)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !136)
!136 = !{!137, !138}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !135, file: !8, line: 35, baseType: !11, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !135, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !118, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !118, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !118, file: !8, line: 53, type: !120, isLocal: false, isDefinition: true)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !118, file: !8, line: 54, type: !147, isLocal: false, isDefinition: true)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 192000, elements: !36)
!148 = !{!149, !116, !150}
!149 = !DILocalVariable(name: "i", scope: !117, file: !8, line: 72, type: !11)
!150 = !DILocalVariable(name: "x", scope: !117, file: !8, line: 73, type: !52)
!151 = distinct !DISubprogram(name: "dijkstra_return", scope: !8, file: !8, line: 88, type: !152, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!152 = !DISubroutineType(types: !153)
!153 = !{!11}
!154 = !DILocation(line: 90, column: 14, scope: !151)
!155 = !DILocation(line: 90, column: 32, scope: !151)
!156 = !DILocation(line: 90, column: 12, scope: !151)
!157 = !DILocation(line: 90, column: 3, scope: !151)
!158 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !159, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !161)
!159 = !DISubroutineType(types: !160)
!160 = !{!11, !11, !11, !11}
!161 = !{!162, !163, !164, !165, !166}
!162 = !DILocalVariable(name: "node", arg: 1, scope: !158, file: !8, line: 93, type: !11)
!163 = !DILocalVariable(name: "dist", arg: 2, scope: !158, file: !8, line: 93, type: !11)
!164 = !DILocalVariable(name: "prev", arg: 3, scope: !158, file: !8, line: 93, type: !11)
!165 = !DILocalVariable(name: "newItem", scope: !158, file: !8, line: 95, type: !6)
!166 = !DILocalVariable(name: "last", scope: !158, file: !8, line: 96, type: !6)
!167 = !DILocation(line: 0, scope: !158)
!168 = !DILocation(line: 95, column: 50, scope: !158)
!169 = !DILocation(line: 95, column: 29, scope: !158)
!170 = !DILocation(line: 96, column: 25, scope: !158)
!171 = !DILocation(line: 98, column: 8, scope: !172)
!172 = distinct !DILexicalBlock(scope: !158, file: !8, line: 98, column: 8)
!173 = !DILocation(line: 98, column: 29, scope: !172)
!174 = !DILocation(line: 98, column: 8, scope: !158)
!175 = !DILocation(line: 100, column: 12, scope: !158)
!176 = !DILocation(line: 100, column: 17, scope: !158)
!177 = !{!178, !56, i64 0}
!178 = !{!"_QITEM", !56, i64 0, !56, i64 4, !56, i64 8, !78, i64 16}
!179 = !DILocation(line: 101, column: 12, scope: !158)
!180 = !DILocation(line: 101, column: 17, scope: !158)
!181 = !{!178, !56, i64 4}
!182 = !DILocation(line: 102, column: 12, scope: !158)
!183 = !DILocation(line: 102, column: 17, scope: !158)
!184 = !{!178, !56, i64 8}
!185 = !DILocation(line: 103, column: 12, scope: !158)
!186 = !DILocation(line: 103, column: 17, scope: !158)
!187 = !{!178, !78, i64 16}
!188 = !DILocation(line: 105, column: 9, scope: !189)
!189 = distinct !DILexicalBlock(scope: !158, file: !8, line: 105, column: 8)
!190 = !DILocation(line: 105, column: 8, scope: !158)
!191 = !DILocation(line: 110, column: 19, scope: !192)
!192 = distinct !DILexicalBlock(scope: !189, file: !8, line: 107, column: 8)
!193 = !DILocation(line: 110, column: 5, scope: !192)
!194 = distinct !{!194, !193, !195}
!195 = !DILocation(line: 111, column: 20, scope: !192)
!196 = !DILocation(line: 0, scope: !189)
!197 = !DILocation(line: 114, column: 22, scope: !158)
!198 = !DILocation(line: 115, column: 3, scope: !158)
!199 = !DILocation(line: 116, column: 1, scope: !158)
!200 = !DILocalVariable(name: "newItem", scope: !201, file: !8, line: 95, type: !204)
!201 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !159, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !202, retainedNodes: !232)
!202 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !203, globals: !211, nameTableKind: None)
!203 = !{!204}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !206)
!206 = !{!207, !208, !209, !210}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !205, file: !8, line: 40, baseType: !11, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !205, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !205, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !205, file: !8, line: 43, baseType: !204, size: 64, offset: 128)
!211 = !{!212, !214, !216, !223, !225, !227, !229}
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !202, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !202, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !202, file: !8, line: 49, type: !218, isLocal: false, isDefinition: true)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 2560, elements: !25)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !220)
!220 = !{!221, !222}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !219, file: !8, line: 35, baseType: !11, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !219, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !202, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !202, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !202, file: !8, line: 53, type: !204, isLocal: false, isDefinition: true)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !202, file: !8, line: 54, type: !231, isLocal: false, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 192000, elements: !36)
!232 = !{!233, !234, !235, !200, !236}
!233 = !DILocalVariable(name: "node", arg: 1, scope: !201, file: !8, line: 93, type: !11)
!234 = !DILocalVariable(name: "dist", arg: 2, scope: !201, file: !8, line: 93, type: !11)
!235 = !DILocalVariable(name: "prev", arg: 3, scope: !201, file: !8, line: 93, type: !11)
!236 = !DILocalVariable(name: "last", scope: !201, file: !8, line: 96, type: !204)
!237 = !DILocalVariable(name: "last", scope: !238, file: !8, line: 96, type: !241)
!238 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !159, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !239, retainedNodes: !269)
!239 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !240, globals: !248, nameTableKind: None)
!240 = !{!241}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !243)
!243 = !{!244, !245, !246, !247}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !242, file: !8, line: 40, baseType: !11, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !242, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !242, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !242, file: !8, line: 43, baseType: !241, size: 64, offset: 128)
!248 = !{!249, !251, !253, !260, !262, !264, !266}
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !239, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !239, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !239, file: !8, line: 49, type: !255, isLocal: false, isDefinition: true)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 2560, elements: !25)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !257)
!257 = !{!258, !259}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !256, file: !8, line: 35, baseType: !11, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !256, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !239, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !239, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !239, file: !8, line: 53, type: !241, isLocal: false, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !239, file: !8, line: 54, type: !268, isLocal: false, isDefinition: true)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 192000, elements: !36)
!269 = !{!270, !271, !272, !273, !237}
!270 = !DILocalVariable(name: "node", arg: 1, scope: !238, file: !8, line: 93, type: !11)
!271 = !DILocalVariable(name: "dist", arg: 2, scope: !238, file: !8, line: 93, type: !11)
!272 = !DILocalVariable(name: "prev", arg: 3, scope: !238, file: !8, line: 93, type: !11)
!273 = !DILocalVariable(name: "newItem", scope: !238, file: !8, line: 95, type: !241)
!274 = distinct !DISubprogram(name: "dijkstra_dequeue", scope: !8, file: !8, line: 118, type: !275, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !278)
!275 = !DISubroutineType(types: !276)
!276 = !{null, !277, !277, !277}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!278 = !{!279, !280, !281}
!279 = !DILocalVariable(name: "node", arg: 1, scope: !274, file: !8, line: 118, type: !277)
!280 = !DILocalVariable(name: "dist", arg: 2, scope: !274, file: !8, line: 118, type: !277)
!281 = !DILocalVariable(name: "prev", arg: 3, scope: !274, file: !8, line: 118, type: !277)
!282 = !DILocation(line: 0, scope: !274)
!283 = !DILocation(line: 120, column: 8, scope: !284)
!284 = distinct !DILexicalBlock(scope: !274, file: !8, line: 120, column: 8)
!285 = !DILocation(line: 120, column: 8, scope: !274)
!286 = !DILocation(line: 121, column: 33, scope: !287)
!287 = distinct !DILexicalBlock(scope: !284, file: !8, line: 120, column: 29)
!288 = !DILocation(line: 121, column: 11, scope: !287)
!289 = !DILocation(line: 122, column: 33, scope: !287)
!290 = !DILocation(line: 122, column: 11, scope: !287)
!291 = !DILocation(line: 123, column: 33, scope: !287)
!292 = !DILocation(line: 123, column: 11, scope: !287)
!293 = !DILocation(line: 124, column: 46, scope: !287)
!294 = !DILocation(line: 124, column: 24, scope: !287)
!295 = !DILocation(line: 125, column: 24, scope: !287)
!296 = !DILocation(line: 126, column: 3, scope: !287)
!297 = !DILocation(line: 127, column: 1, scope: !274)
!298 = distinct !DISubprogram(name: "dijkstra_qcount", scope: !8, file: !8, line: 129, type: !152, scopeLine: 130, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!299 = !DILocation(line: 131, column: 12, scope: !298)
!300 = !DILocation(line: 131, column: 3, scope: !298)
!301 = distinct !DISubprogram(name: "dijkstra_find", scope: !8, file: !8, line: 134, type: !302, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !304)
!302 = !DISubroutineType(types: !303)
!303 = !{!11, !11, !11}
!304 = !{!305, !306, !307, !308, !309, !310, !311, !312}
!305 = !DILocalVariable(name: "chStart", arg: 1, scope: !301, file: !8, line: 134, type: !11)
!306 = !DILocalVariable(name: "chEnd", arg: 2, scope: !301, file: !8, line: 134, type: !11)
!307 = !DILocalVariable(name: "ch", scope: !301, file: !8, line: 136, type: !11)
!308 = !DILocalVariable(name: "prev", scope: !301, file: !8, line: 137, type: !11)
!309 = !DILocalVariable(name: "node", scope: !301, file: !8, line: 137, type: !11)
!310 = !DILocalVariable(name: "cost", scope: !301, file: !8, line: 138, type: !11)
!311 = !DILocalVariable(name: "dist", scope: !301, file: !8, line: 138, type: !11)
!312 = !DILocalVariable(name: "i", scope: !301, file: !8, line: 139, type: !11)
!313 = !DILocation(line: 0, scope: !301)
!314 = !DILocation(line: 143, column: 34, scope: !315)
!315 = distinct !DILexicalBlock(scope: !316, file: !8, line: 142, column: 40)
!316 = distinct !DILexicalBlock(scope: !317, file: !8, line: 142, column: 3)
!317 = distinct !DILexicalBlock(scope: !301, file: !8, line: 142, column: 3)
!318 = !DILocation(line: 147, column: 16, scope: !319)
!319 = distinct !DILexicalBlock(scope: !301, file: !8, line: 147, column: 8)
!320 = !DILocation(line: 147, column: 8, scope: !301)
!321 = !DILocation(line: 149, column: 5, scope: !322)
!322 = distinct !DILexicalBlock(scope: !319, file: !8, line: 148, column: 10)
!323 = !DILocation(line: 149, column: 34, scope: !322)
!324 = !DILocation(line: 149, column: 39, scope: !322)
!325 = !{!326, !56, i64 0}
!326 = !{!"_NODE", !56, i64 0, !56, i64 4}
!327 = !DILocation(line: 150, column: 34, scope: !322)
!328 = !DILocation(line: 150, column: 39, scope: !322)
!329 = !{!326, !56, i64 4}
!330 = !DILocation(line: 0, scope: !158, inlinedAt: !331)
!331 = distinct !DILocation(line: 152, column: 10, scope: !332)
!332 = distinct !DILexicalBlock(scope: !322, file: !8, line: 152, column: 10)
!333 = !DILocation(line: 95, column: 50, scope: !158, inlinedAt: !331)
!334 = !DILocation(line: 95, column: 29, scope: !158, inlinedAt: !331)
!335 = !DILocation(line: 96, column: 25, scope: !158, inlinedAt: !331)
!336 = !DILocation(line: 98, column: 8, scope: !172, inlinedAt: !331)
!337 = !DILocation(line: 98, column: 29, scope: !172, inlinedAt: !331)
!338 = !DILocation(line: 98, column: 8, scope: !158, inlinedAt: !331)
!339 = !DILocation(line: 100, column: 12, scope: !158, inlinedAt: !331)
!340 = !DILocation(line: 100, column: 17, scope: !158, inlinedAt: !331)
!341 = !DILocation(line: 101, column: 12, scope: !158, inlinedAt: !331)
!342 = !DILocation(line: 101, column: 17, scope: !158, inlinedAt: !331)
!343 = !DILocation(line: 102, column: 12, scope: !158, inlinedAt: !331)
!344 = !DILocation(line: 102, column: 17, scope: !158, inlinedAt: !331)
!345 = !DILocation(line: 103, column: 12, scope: !158, inlinedAt: !331)
!346 = !DILocation(line: 103, column: 17, scope: !158, inlinedAt: !331)
!347 = !DILocation(line: 105, column: 9, scope: !189, inlinedAt: !331)
!348 = !DILocation(line: 105, column: 8, scope: !158, inlinedAt: !331)
!349 = !DILocation(line: 110, column: 19, scope: !192, inlinedAt: !331)
!350 = !DILocation(line: 110, column: 5, scope: !192, inlinedAt: !331)
!351 = distinct !{!351, !350, !352}
!352 = !DILocation(line: 111, column: 20, scope: !192, inlinedAt: !331)
!353 = !DILocation(line: 0, scope: !189, inlinedAt: !331)
!354 = !DILocation(line: 114, column: 22, scope: !158, inlinedAt: !331)
!355 = !DILocation(line: 157, column: 31, scope: !322)
!356 = !DILocation(line: 157, column: 5, scope: !322)
!357 = !DILocation(line: 120, column: 8, scope: !284, inlinedAt: !358)
!358 = distinct !DILocation(line: 158, column: 7, scope: !359)
!359 = distinct !DILexicalBlock(scope: !322, file: !8, line: 157, column: 37)
!360 = !DILocation(line: 120, column: 8, scope: !274, inlinedAt: !358)
!361 = !DILocation(line: 121, column: 33, scope: !287, inlinedAt: !358)
!362 = !DILocation(line: 122, column: 33, scope: !287, inlinedAt: !358)
!363 = !DILocation(line: 124, column: 46, scope: !287, inlinedAt: !358)
!364 = !DILocation(line: 124, column: 24, scope: !287, inlinedAt: !358)
!365 = !DILocation(line: 125, column: 24, scope: !287, inlinedAt: !358)
!366 = !DILocation(line: 126, column: 3, scope: !287, inlinedAt: !358)
!367 = !DILocation(line: 0, scope: !368)
!368 = distinct !DILexicalBlock(scope: !369, file: !8, line: 161, column: 14)
!369 = distinct !DILexicalBlock(scope: !370, file: !8, line: 160, column: 41)
!370 = distinct !DILexicalBlock(scope: !371, file: !8, line: 160, column: 7)
!371 = distinct !DILexicalBlock(scope: !359, file: !8, line: 160, column: 7)
!372 = !DILocation(line: 160, column: 7, scope: !371)
!373 = !DILocation(line: 161, column: 23, scope: !368)
!374 = !DILocation(line: 162, column: 49, scope: !375)
!375 = distinct !DILexicalBlock(scope: !376, file: !8, line: 162, column: 16)
!376 = distinct !DILexicalBlock(scope: !368, file: !8, line: 161, column: 67)
!377 = !DILocation(line: 162, column: 23, scope: !375)
!378 = !DILocation(line: 163, column: 55, scope: !375)
!379 = !DILocation(line: 163, column: 46, scope: !375)
!380 = !DILocation(line: 162, column: 56, scope: !375)
!381 = !DILocation(line: 164, column: 41, scope: !382)
!382 = distinct !DILexicalBlock(scope: !375, file: !8, line: 163, column: 68)
!383 = !DILocation(line: 165, column: 36, scope: !382)
!384 = !DILocation(line: 165, column: 41, scope: !382)
!385 = !DILocation(line: 0, scope: !158, inlinedAt: !386)
!386 = distinct !DILocation(line: 166, column: 18, scope: !387)
!387 = distinct !DILexicalBlock(scope: !382, file: !8, line: 166, column: 18)
!388 = !DILocation(line: 95, column: 29, scope: !158, inlinedAt: !386)
!389 = !DILocation(line: 98, column: 8, scope: !172, inlinedAt: !386)
!390 = !DILocation(line: 98, column: 29, scope: !172, inlinedAt: !386)
!391 = !DILocation(line: 98, column: 8, scope: !158, inlinedAt: !386)
!392 = !DILocation(line: 100, column: 12, scope: !158, inlinedAt: !386)
!393 = !DILocation(line: 100, column: 17, scope: !158, inlinedAt: !386)
!394 = !DILocation(line: 101, column: 12, scope: !158, inlinedAt: !386)
!395 = !DILocation(line: 101, column: 17, scope: !158, inlinedAt: !386)
!396 = !DILocation(line: 102, column: 12, scope: !158, inlinedAt: !386)
!397 = !DILocation(line: 102, column: 17, scope: !158, inlinedAt: !386)
!398 = !DILocation(line: 103, column: 12, scope: !158, inlinedAt: !386)
!399 = !DILocation(line: 103, column: 17, scope: !158, inlinedAt: !386)
!400 = !DILocation(line: 105, column: 9, scope: !189, inlinedAt: !386)
!401 = !DILocation(line: 105, column: 8, scope: !158, inlinedAt: !386)
!402 = !DILocation(line: 110, column: 19, scope: !192, inlinedAt: !386)
!403 = !DILocation(line: 110, column: 5, scope: !192, inlinedAt: !386)
!404 = distinct !{!404, !403, !405}
!405 = !DILocation(line: 111, column: 20, scope: !192, inlinedAt: !386)
!406 = !DILocation(line: 0, scope: !189, inlinedAt: !386)
!407 = !DILocation(line: 114, column: 22, scope: !158, inlinedAt: !386)
!408 = !DILocation(line: 166, column: 18, scope: !382)
!409 = !DILocation(line: 160, column: 36, scope: !370)
!410 = !DILocation(line: 160, column: 22, scope: !370)
!411 = distinct !{!411, !372, !412}
!412 = !DILocation(line: 170, column: 7, scope: !371)
!413 = !DILocation(line: 174, column: 1, scope: !301)
!414 = !DILocalVariable(name: "ch", scope: !415, file: !8, line: 136, type: !11)
!415 = distinct !DISubprogram(name: "dijkstra_find", scope: !8, file: !8, line: 134, type: !302, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !416, retainedNodes: !446)
!416 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !417, globals: !425, nameTableKind: None)
!417 = !{!418}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !420)
!420 = !{!421, !422, !423, !424}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !419, file: !8, line: 40, baseType: !11, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !419, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !419, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !419, file: !8, line: 43, baseType: !418, size: 64, offset: 128)
!425 = !{!426, !428, !430, !437, !439, !441, !443}
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !416, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !416, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !416, file: !8, line: 49, type: !432, isLocal: false, isDefinition: true)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 2560, elements: !25)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !434)
!434 = !{!435, !436}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !433, file: !8, line: 35, baseType: !11, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !433, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !416, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !416, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !416, file: !8, line: 53, type: !418, isLocal: false, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !416, file: !8, line: 54, type: !445, isLocal: false, isDefinition: true)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !419, size: 192000, elements: !36)
!446 = !{!447, !448, !414, !449, !450, !451, !452, !453}
!447 = !DILocalVariable(name: "chStart", arg: 1, scope: !415, file: !8, line: 134, type: !11)
!448 = !DILocalVariable(name: "chEnd", arg: 2, scope: !415, file: !8, line: 134, type: !11)
!449 = !DILocalVariable(name: "prev", scope: !415, file: !8, line: 137, type: !11)
!450 = !DILocalVariable(name: "node", scope: !415, file: !8, line: 137, type: !11)
!451 = !DILocalVariable(name: "cost", scope: !415, file: !8, line: 138, type: !11)
!452 = !DILocalVariable(name: "dist", scope: !415, file: !8, line: 138, type: !11)
!453 = !DILocalVariable(name: "i", scope: !415, file: !8, line: 139, type: !11)
!454 = !DILocalVariable(name: "node", arg: 1, scope: !455, file: !8, line: 93, type: !11)
!455 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !159, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !456, retainedNodes: !486)
!456 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !457, globals: !465, nameTableKind: None)
!457 = !{!458}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !460)
!460 = !{!461, !462, !463, !464}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !459, file: !8, line: 40, baseType: !11, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !459, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !459, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !459, file: !8, line: 43, baseType: !458, size: 64, offset: 128)
!465 = !{!466, !468, !470, !477, !479, !481, !483}
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !456, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !456, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !456, file: !8, line: 49, type: !472, isLocal: false, isDefinition: true)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 2560, elements: !25)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !474)
!474 = !{!475, !476}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !473, file: !8, line: 35, baseType: !11, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !473, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !456, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !456, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !456, file: !8, line: 53, type: !458, isLocal: false, isDefinition: true)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !456, file: !8, line: 54, type: !485, isLocal: false, isDefinition: true)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 192000, elements: !36)
!486 = !{!454, !487, !488, !489, !490}
!487 = !DILocalVariable(name: "dist", arg: 2, scope: !455, file: !8, line: 93, type: !11)
!488 = !DILocalVariable(name: "prev", arg: 3, scope: !455, file: !8, line: 93, type: !11)
!489 = !DILocalVariable(name: "newItem", scope: !455, file: !8, line: 95, type: !458)
!490 = !DILocalVariable(name: "last", scope: !455, file: !8, line: 96, type: !458)
!491 = !DILocalVariable(name: "last", scope: !492, file: !8, line: 96, type: !495)
!492 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !159, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !493, retainedNodes: !523)
!493 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !494, globals: !502, nameTableKind: None)
!494 = !{!495}
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !497)
!497 = !{!498, !499, !500, !501}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !496, file: !8, line: 40, baseType: !11, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !496, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !496, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !496, file: !8, line: 43, baseType: !495, size: 64, offset: 128)
!502 = !{!503, !505, !507, !514, !516, !518, !520}
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !493, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !493, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !493, file: !8, line: 49, type: !509, isLocal: false, isDefinition: true)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !510, size: 2560, elements: !25)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !511)
!511 = !{!512, !513}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !510, file: !8, line: 35, baseType: !11, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !510, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !493, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !493, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !493, file: !8, line: 53, type: !495, isLocal: false, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !493, file: !8, line: 54, type: !522, isLocal: false, isDefinition: true)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !496, size: 192000, elements: !36)
!523 = !{!524, !525, !526, !527, !491}
!524 = !DILocalVariable(name: "node", arg: 1, scope: !492, file: !8, line: 93, type: !11)
!525 = !DILocalVariable(name: "dist", arg: 2, scope: !492, file: !8, line: 93, type: !11)
!526 = !DILocalVariable(name: "prev", arg: 3, scope: !492, file: !8, line: 93, type: !11)
!527 = !DILocalVariable(name: "newItem", scope: !492, file: !8, line: 95, type: !495)
!528 = !DILocalVariable(name: "cost", scope: !529, file: !8, line: 138, type: !11)
!529 = distinct !DISubprogram(name: "dijkstra_find", scope: !8, file: !8, line: 134, type: !302, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !530, retainedNodes: !560)
!530 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !531, globals: !539, nameTableKind: None)
!531 = !{!532}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !534)
!534 = !{!535, !536, !537, !538}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !533, file: !8, line: 40, baseType: !11, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !533, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !533, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !533, file: !8, line: 43, baseType: !532, size: 64, offset: 128)
!539 = !{!540, !542, !544, !551, !553, !555, !557}
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !530, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !530, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !530, file: !8, line: 49, type: !546, isLocal: false, isDefinition: true)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !547, size: 2560, elements: !25)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !548)
!548 = !{!549, !550}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !547, file: !8, line: 35, baseType: !11, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !547, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !530, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !530, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !530, file: !8, line: 53, type: !532, isLocal: false, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !530, file: !8, line: 54, type: !559, isLocal: false, isDefinition: true)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !533, size: 192000, elements: !36)
!560 = !{!561, !562, !563, !564, !565, !528, !566, !567}
!561 = !DILocalVariable(name: "chStart", arg: 1, scope: !529, file: !8, line: 134, type: !11)
!562 = !DILocalVariable(name: "chEnd", arg: 2, scope: !529, file: !8, line: 134, type: !11)
!563 = !DILocalVariable(name: "ch", scope: !529, file: !8, line: 136, type: !11)
!564 = !DILocalVariable(name: "prev", scope: !529, file: !8, line: 137, type: !11)
!565 = !DILocalVariable(name: "node", scope: !529, file: !8, line: 137, type: !11)
!566 = !DILocalVariable(name: "dist", scope: !529, file: !8, line: 138, type: !11)
!567 = !DILocalVariable(name: "i", scope: !529, file: !8, line: 139, type: !11)
!568 = !DILocalVariable(name: "node", scope: !569, file: !8, line: 137, type: !11)
!569 = distinct !DISubprogram(name: "dijkstra_find", scope: !8, file: !8, line: 134, type: !302, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !570, retainedNodes: !600)
!570 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !571, globals: !579, nameTableKind: None)
!571 = !{!572}
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !574)
!574 = !{!575, !576, !577, !578}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !573, file: !8, line: 40, baseType: !11, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !573, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !573, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !573, file: !8, line: 43, baseType: !572, size: 64, offset: 128)
!579 = !{!580, !582, !584, !591, !593, !595, !597}
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !570, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !570, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !570, file: !8, line: 49, type: !586, isLocal: false, isDefinition: true)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 2560, elements: !25)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !588)
!588 = !{!589, !590}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !587, file: !8, line: 35, baseType: !11, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !587, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !570, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !570, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !570, file: !8, line: 53, type: !572, isLocal: false, isDefinition: true)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !570, file: !8, line: 54, type: !599, isLocal: false, isDefinition: true)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !573, size: 192000, elements: !36)
!600 = !{!601, !602, !603, !604, !568, !605, !606, !607}
!601 = !DILocalVariable(name: "chStart", arg: 1, scope: !569, file: !8, line: 134, type: !11)
!602 = !DILocalVariable(name: "chEnd", arg: 2, scope: !569, file: !8, line: 134, type: !11)
!603 = !DILocalVariable(name: "ch", scope: !569, file: !8, line: 136, type: !11)
!604 = !DILocalVariable(name: "prev", scope: !569, file: !8, line: 137, type: !11)
!605 = !DILocalVariable(name: "cost", scope: !569, file: !8, line: 138, type: !11)
!606 = !DILocalVariable(name: "dist", scope: !569, file: !8, line: 138, type: !11)
!607 = !DILocalVariable(name: "i", scope: !569, file: !8, line: 139, type: !11)
!608 = !DILocalVariable(name: "node", arg: 1, scope: !609, file: !8, line: 93, type: !11)
!609 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !159, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !570, retainedNodes: !610)
!610 = !{!608, !611, !612, !613, !614}
!611 = !DILocalVariable(name: "dist", arg: 2, scope: !609, file: !8, line: 93, type: !11)
!612 = !DILocalVariable(name: "prev", arg: 3, scope: !609, file: !8, line: 93, type: !11)
!613 = !DILocalVariable(name: "newItem", scope: !609, file: !8, line: 95, type: !572)
!614 = !DILocalVariable(name: "last", scope: !609, file: !8, line: 96, type: !572)
!615 = !DILocalVariable(name: "last", scope: !616, file: !8, line: 96, type: !619)
!616 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !159, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !617, retainedNodes: !647)
!617 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !618, globals: !626, nameTableKind: None)
!618 = !{!619}
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !621)
!621 = !{!622, !623, !624, !625}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !620, file: !8, line: 40, baseType: !11, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !620, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !620, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !620, file: !8, line: 43, baseType: !619, size: 64, offset: 128)
!626 = !{!627, !629, !631, !638, !640, !642, !644}
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !617, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !617, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !617, file: !8, line: 49, type: !633, isLocal: false, isDefinition: true)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !634, size: 2560, elements: !25)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !635)
!635 = !{!636, !637}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !634, file: !8, line: 35, baseType: !11, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !634, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !617, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !617, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !617, file: !8, line: 53, type: !619, isLocal: false, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !617, file: !8, line: 54, type: !646, isLocal: false, isDefinition: true)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !620, size: 192000, elements: !36)
!647 = !{!648, !649, !650, !651, !615}
!648 = !DILocalVariable(name: "node", arg: 1, scope: !616, file: !8, line: 93, type: !11)
!649 = !DILocalVariable(name: "dist", arg: 2, scope: !616, file: !8, line: 93, type: !11)
!650 = !DILocalVariable(name: "prev", arg: 3, scope: !616, file: !8, line: 93, type: !11)
!651 = !DILocalVariable(name: "newItem", scope: !616, file: !8, line: 95, type: !619)
!652 = !DILocalVariable(name: "i", scope: !653, file: !8, line: 139, type: !11)
!653 = distinct !DISubprogram(name: "dijkstra_find", scope: !8, file: !8, line: 134, type: !302, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !654, retainedNodes: !684)
!654 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !655, globals: !663, nameTableKind: None)
!655 = !{!656}
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !658)
!658 = !{!659, !660, !661, !662}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !657, file: !8, line: 40, baseType: !11, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !657, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !657, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !657, file: !8, line: 43, baseType: !656, size: 64, offset: 128)
!663 = !{!664, !666, !668, !675, !677, !679, !681}
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !654, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !654, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !654, file: !8, line: 49, type: !670, isLocal: false, isDefinition: true)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !671, size: 2560, elements: !25)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !672)
!672 = !{!673, !674}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !671, file: !8, line: 35, baseType: !11, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !671, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !654, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !654, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !654, file: !8, line: 53, type: !656, isLocal: false, isDefinition: true)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !654, file: !8, line: 54, type: !683, isLocal: false, isDefinition: true)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !657, size: 192000, elements: !36)
!684 = !{!685, !686, !687, !688, !689, !690, !691, !652}
!685 = !DILocalVariable(name: "chStart", arg: 1, scope: !653, file: !8, line: 134, type: !11)
!686 = !DILocalVariable(name: "chEnd", arg: 2, scope: !653, file: !8, line: 134, type: !11)
!687 = !DILocalVariable(name: "ch", scope: !653, file: !8, line: 136, type: !11)
!688 = !DILocalVariable(name: "prev", scope: !653, file: !8, line: 137, type: !11)
!689 = !DILocalVariable(name: "node", scope: !653, file: !8, line: 137, type: !11)
!690 = !DILocalVariable(name: "cost", scope: !653, file: !8, line: 138, type: !11)
!691 = !DILocalVariable(name: "dist", scope: !653, file: !8, line: 138, type: !11)
!692 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !693)
!693 = !{!694, !695}
!694 = !DILocalVariable(name: "i", scope: !692, file: !8, line: 178, type: !11)
!695 = !DILocalVariable(name: "j", scope: !692, file: !8, line: 178, type: !11)
!696 = !DILocation(line: 0, scope: !692)
!697 = !DILocation(line: 184, column: 10, scope: !698)
!698 = distinct !DILexicalBlock(scope: !699, file: !8, line: 184, column: 10)
!699 = distinct !DILexicalBlock(scope: !700, file: !8, line: 182, column: 54)
!700 = distinct !DILexicalBlock(scope: !701, file: !8, line: 182, column: 3)
!701 = distinct !DILexicalBlock(scope: !692, file: !8, line: 182, column: 3)
!702 = !DILocation(line: 184, column: 32, scope: !698)
!703 = !DILocation(line: 185, column: 25, scope: !704)
!704 = distinct !DILexicalBlock(scope: !698, file: !8, line: 184, column: 51)
!705 = !DILocation(line: 186, column: 7, scope: !704)
!706 = !DILocation(line: 188, column: 51, scope: !698)
!707 = !DILocation(line: 188, column: 25, scope: !698)
!708 = !DILocation(line: 189, column: 24, scope: !699)
!709 = !DILocation(line: 191, column: 1, scope: !692)
!710 = !DILocation(line: 184, column: 10, scope: !699)
!711 = !DILocalVariable(name: "j", scope: !712, file: !8, line: 178, type: !11)
!712 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !713, retainedNodes: !743)
!713 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !714, globals: !722, nameTableKind: None)
!714 = !{!715}
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !717)
!717 = !{!718, !719, !720, !721}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !716, file: !8, line: 40, baseType: !11, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !716, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !716, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !716, file: !8, line: 43, baseType: !715, size: 64, offset: 128)
!722 = !{!723, !725, !727, !734, !736, !738, !740}
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !713, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !713, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !713, file: !8, line: 49, type: !729, isLocal: false, isDefinition: true)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 2560, elements: !25)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !731)
!731 = !{!732, !733}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !730, file: !8, line: 35, baseType: !11, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !730, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !713, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !713, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !713, file: !8, line: 53, type: !715, isLocal: false, isDefinition: true)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !713, file: !8, line: 54, type: !742, isLocal: false, isDefinition: true)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !716, size: 192000, elements: !36)
!743 = !{!744, !711}
!744 = !DILocalVariable(name: "i", scope: !712, file: !8, line: 178, type: !11)
!745 = !DILocalVariable(name: "j", scope: !746, file: !8, line: 178, type: !11)
!746 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !747, retainedNodes: !777)
!747 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !748, globals: !756, nameTableKind: None)
!748 = !{!749}
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !751)
!751 = !{!752, !753, !754, !755}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !750, file: !8, line: 40, baseType: !11, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !750, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !750, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !750, file: !8, line: 43, baseType: !749, size: 64, offset: 128)
!756 = !{!757, !759, !761, !768, !770, !772, !774}
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !747, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !747, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !747, file: !8, line: 49, type: !763, isLocal: false, isDefinition: true)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !764, size: 2560, elements: !25)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !765)
!765 = !{!766, !767}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !764, file: !8, line: 35, baseType: !11, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !764, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !747, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !747, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !747, file: !8, line: 53, type: !749, isLocal: false, isDefinition: true)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !747, file: !8, line: 54, type: !776, isLocal: false, isDefinition: true)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !750, size: 192000, elements: !36)
!777 = !{!778, !745}
!778 = !DILocalVariable(name: "i", scope: !746, file: !8, line: 178, type: !11)
!779 = !DILocalVariable(name: "j", scope: !780, file: !8, line: 178, type: !11)
!780 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !781, retainedNodes: !811)
!781 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !782, globals: !790, nameTableKind: None)
!782 = !{!783}
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !785)
!785 = !{!786, !787, !788, !789}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !784, file: !8, line: 40, baseType: !11, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !784, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !784, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !784, file: !8, line: 43, baseType: !783, size: 64, offset: 128)
!790 = !{!791, !793, !795, !802, !804, !806, !808}
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !781, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !781, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !781, file: !8, line: 49, type: !797, isLocal: false, isDefinition: true)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 2560, elements: !25)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !799)
!799 = !{!800, !801}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !798, file: !8, line: 35, baseType: !11, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !798, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !781, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !781, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !781, file: !8, line: 53, type: !783, isLocal: false, isDefinition: true)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !781, file: !8, line: 54, type: !810, isLocal: false, isDefinition: true)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !784, size: 192000, elements: !36)
!811 = !{!812, !779}
!812 = !DILocalVariable(name: "i", scope: !780, file: !8, line: 178, type: !11)
!813 = !DILocalVariable(name: "j", scope: !814, file: !8, line: 178, type: !11)
!814 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !815, retainedNodes: !845)
!815 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !816, globals: !824, nameTableKind: None)
!816 = !{!817}
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !819)
!819 = !{!820, !821, !822, !823}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !818, file: !8, line: 40, baseType: !11, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !818, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !818, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !818, file: !8, line: 43, baseType: !817, size: 64, offset: 128)
!824 = !{!825, !827, !829, !836, !838, !840, !842}
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !815, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !815, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !815, file: !8, line: 49, type: !831, isLocal: false, isDefinition: true)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !832, size: 2560, elements: !25)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !833)
!833 = !{!834, !835}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !832, file: !8, line: 35, baseType: !11, size: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !832, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !815, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !815, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !815, file: !8, line: 53, type: !817, isLocal: false, isDefinition: true)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !815, file: !8, line: 54, type: !844, isLocal: false, isDefinition: true)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !818, size: 192000, elements: !36)
!845 = !{!846, !813}
!846 = !DILocalVariable(name: "i", scope: !814, file: !8, line: 178, type: !11)
!847 = !DILocalVariable(name: "j", scope: !848, file: !8, line: 178, type: !11)
!848 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !849, retainedNodes: !879)
!849 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !850, globals: !858, nameTableKind: None)
!850 = !{!851}
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !853)
!853 = !{!854, !855, !856, !857}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !852, file: !8, line: 40, baseType: !11, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !852, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !852, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !852, file: !8, line: 43, baseType: !851, size: 64, offset: 128)
!858 = !{!859, !861, !863, !870, !872, !874, !876}
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !849, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !849, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !849, file: !8, line: 49, type: !865, isLocal: false, isDefinition: true)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !866, size: 2560, elements: !25)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !867)
!867 = !{!868, !869}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !866, file: !8, line: 35, baseType: !11, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !866, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !849, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !849, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !849, file: !8, line: 53, type: !851, isLocal: false, isDefinition: true)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !849, file: !8, line: 54, type: !878, isLocal: false, isDefinition: true)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !852, size: 192000, elements: !36)
!879 = !{!880, !847}
!880 = !DILocalVariable(name: "i", scope: !848, file: !8, line: 178, type: !11)
!881 = !DILocalVariable(name: "j", scope: !882, file: !8, line: 178, type: !11)
!882 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !883, retainedNodes: !913)
!883 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !884, globals: !892, nameTableKind: None)
!884 = !{!885}
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !887)
!887 = !{!888, !889, !890, !891}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !886, file: !8, line: 40, baseType: !11, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !886, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !886, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !886, file: !8, line: 43, baseType: !885, size: 64, offset: 128)
!892 = !{!893, !895, !897, !904, !906, !908, !910}
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !883, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!895 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression())
!896 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !883, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !883, file: !8, line: 49, type: !899, isLocal: false, isDefinition: true)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !900, size: 2560, elements: !25)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !901)
!901 = !{!902, !903}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !900, file: !8, line: 35, baseType: !11, size: 32)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !900, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !883, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !883, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !883, file: !8, line: 53, type: !885, isLocal: false, isDefinition: true)
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !883, file: !8, line: 54, type: !912, isLocal: false, isDefinition: true)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !886, size: 192000, elements: !36)
!913 = !{!914, !881}
!914 = !DILocalVariable(name: "i", scope: !882, file: !8, line: 178, type: !11)
!915 = !DILocalVariable(name: "j", scope: !916, file: !8, line: 178, type: !11)
!916 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !917, retainedNodes: !947)
!917 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !918, globals: !926, nameTableKind: None)
!918 = !{!919}
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !921)
!921 = !{!922, !923, !924, !925}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !920, file: !8, line: 40, baseType: !11, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !920, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !920, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !920, file: !8, line: 43, baseType: !919, size: 64, offset: 128)
!926 = !{!927, !929, !931, !938, !940, !942, !944}
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !917, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !917, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !917, file: !8, line: 49, type: !933, isLocal: false, isDefinition: true)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !934, size: 2560, elements: !25)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !935)
!935 = !{!936, !937}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !934, file: !8, line: 35, baseType: !11, size: 32)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !934, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !917, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !917, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !917, file: !8, line: 53, type: !919, isLocal: false, isDefinition: true)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !917, file: !8, line: 54, type: !946, isLocal: false, isDefinition: true)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !920, size: 192000, elements: !36)
!947 = !{!948, !915}
!948 = !DILocalVariable(name: "i", scope: !916, file: !8, line: 178, type: !11)
!949 = !DILocalVariable(name: "j", scope: !950, file: !8, line: 178, type: !11)
!950 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !951, retainedNodes: !981)
!951 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !952, globals: !960, nameTableKind: None)
!952 = !{!953}
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !955)
!955 = !{!956, !957, !958, !959}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !954, file: !8, line: 40, baseType: !11, size: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !954, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !954, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !954, file: !8, line: 43, baseType: !953, size: 64, offset: 128)
!960 = !{!961, !963, !965, !972, !974, !976, !978}
!961 = !DIGlobalVariableExpression(var: !962, expr: !DIExpression())
!962 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !951, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!963 = !DIGlobalVariableExpression(var: !964, expr: !DIExpression())
!964 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !951, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!965 = !DIGlobalVariableExpression(var: !966, expr: !DIExpression())
!966 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !951, file: !8, line: 49, type: !967, isLocal: false, isDefinition: true)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !968, size: 2560, elements: !25)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !969)
!969 = !{!970, !971}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !968, file: !8, line: 35, baseType: !11, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !968, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !951, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !951, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !951, file: !8, line: 53, type: !953, isLocal: false, isDefinition: true)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !951, file: !8, line: 54, type: !980, isLocal: false, isDefinition: true)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !954, size: 192000, elements: !36)
!981 = !{!982, !949}
!982 = !DILocalVariable(name: "i", scope: !950, file: !8, line: 178, type: !11)
!983 = !DILocalVariable(name: "j", scope: !984, file: !8, line: 178, type: !11)
!984 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !985, retainedNodes: !1015)
!985 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !986, globals: !994, nameTableKind: None)
!986 = !{!987}
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !989)
!989 = !{!990, !991, !992, !993}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !988, file: !8, line: 40, baseType: !11, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !988, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !988, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !988, file: !8, line: 43, baseType: !987, size: 64, offset: 128)
!994 = !{!995, !997, !999, !1006, !1008, !1010, !1012}
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !985, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!997 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression())
!998 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !985, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !985, file: !8, line: 49, type: !1001, isLocal: false, isDefinition: true)
!1001 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1002, size: 2560, elements: !25)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !1003)
!1003 = !{!1004, !1005}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !1002, file: !8, line: 35, baseType: !11, size: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1002, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !985, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !985, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!1010 = !DIGlobalVariableExpression(var: !1011, expr: !DIExpression())
!1011 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !985, file: !8, line: 53, type: !987, isLocal: false, isDefinition: true)
!1012 = !DIGlobalVariableExpression(var: !1013, expr: !DIExpression())
!1013 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !985, file: !8, line: 54, type: !1014, isLocal: false, isDefinition: true)
!1014 = !DICompositeType(tag: DW_TAG_array_type, baseType: !988, size: 192000, elements: !36)
!1015 = !{!1016, !983}
!1016 = !DILocalVariable(name: "i", scope: !984, file: !8, line: 178, type: !11)
!1017 = !DILocalVariable(name: "j", scope: !1018, file: !8, line: 178, type: !11)
!1018 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1019, retainedNodes: !1049)
!1019 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !1020, globals: !1028, nameTableKind: None)
!1020 = !{!1021}
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !1023)
!1023 = !{!1024, !1025, !1026, !1027}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1022, file: !8, line: 40, baseType: !11, size: 32)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !1022, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1022, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1022, file: !8, line: 43, baseType: !1021, size: 64, offset: 128)
!1028 = !{!1029, !1031, !1033, !1040, !1042, !1044, !1046}
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
!1030 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !1019, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!1031 = !DIGlobalVariableExpression(var: !1032, expr: !DIExpression())
!1032 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !1019, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!1033 = !DIGlobalVariableExpression(var: !1034, expr: !DIExpression())
!1034 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !1019, file: !8, line: 49, type: !1035, isLocal: false, isDefinition: true)
!1035 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1036, size: 2560, elements: !25)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !1037)
!1037 = !{!1038, !1039}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !1036, file: !8, line: 35, baseType: !11, size: 32)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1036, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !1019, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !1019, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!1044 = !DIGlobalVariableExpression(var: !1045, expr: !DIExpression())
!1045 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !1019, file: !8, line: 53, type: !1021, isLocal: false, isDefinition: true)
!1046 = !DIGlobalVariableExpression(var: !1047, expr: !DIExpression())
!1047 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !1019, file: !8, line: 54, type: !1048, isLocal: false, isDefinition: true)
!1048 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1022, size: 192000, elements: !36)
!1049 = !{!1050, !1017}
!1050 = !DILocalVariable(name: "i", scope: !1018, file: !8, line: 178, type: !11)
!1051 = distinct !DISubprogram(name: "main", scope: !8, file: !8, line: 193, type: !1052, scopeLine: 194, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1057)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!11, !11, !1054}
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!1057 = !{!1058, !1059}
!1058 = !DILocalVariable(name: "argc", arg: 1, scope: !1051, file: !8, line: 193, type: !11)
!1059 = !DILocalVariable(name: "argv", arg: 2, scope: !1051, file: !8, line: 193, type: !1054)
!1060 = !DILocation(line: 0, scope: !1051)
!1061 = !DILocation(line: 195, column: 3, scope: !1051)
!1062 = !DILocation(line: 196, column: 3, scope: !1051)
!1063 = !DILocation(line: 90, column: 14, scope: !151, inlinedAt: !1064)
!1064 = distinct !DILocation(line: 198, column: 12, scope: !1051)
!1065 = !DILocation(line: 90, column: 32, scope: !151, inlinedAt: !1064)
!1066 = !DILocation(line: 90, column: 12, scope: !151, inlinedAt: !1064)
!1067 = !DILocation(line: 198, column: 3, scope: !1051)
!1068 = !DILocalVariable(name: "argc", arg: 1, scope: !1069, file: !8, line: 193, type: !11)
!1069 = distinct !DISubprogram(name: "main", scope: !8, file: !8, line: 193, type: !1052, scopeLine: 194, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1070, retainedNodes: !1100)
!1070 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !1071, globals: !1079, nameTableKind: None)
!1071 = !{!1072}
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !1074)
!1074 = !{!1075, !1076, !1077, !1078}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1073, file: !8, line: 40, baseType: !11, size: 32)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !1073, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1073, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1073, file: !8, line: 43, baseType: !1072, size: 64, offset: 128)
!1079 = !{!1080, !1082, !1084, !1091, !1093, !1095, !1097}
!1080 = !DIGlobalVariableExpression(var: !1081, expr: !DIExpression())
!1081 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !1070, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!1082 = !DIGlobalVariableExpression(var: !1083, expr: !DIExpression())
