; ModuleID = '<stdin>'
source_filename = "./dijkstra.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._QITEM = type { i32, i32, i32, %struct._QITEM* }
%struct._NODE = type { i32, i32 }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !2, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !15, nameTableKind: None)
!3 = !DIFile(filename: "dijkstra.c", directory: "/home/newton/cfiles/xmark")
!4 = !{}
!5 = !{!6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !9)
!8 = !DIFile(filename: "./dijkstra.c", directory: "/home/newton/cfiles/xmark")
!9 = !{!10, !12, !13, !14}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !7, file: !8, line: 40, baseType: !11, size: 32)
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !7, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !7, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !7, file: !8, line: 43, baseType: !6, size: 64, offset: 128)
!15 = !{!0, !16, !18, !27, !29, !31, !33}
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !2, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !2, file: !8, line: 49, type: !20, isLocal: false, isDefinition: true)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 2560, elements: !25)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !22)
!22 = !{!23, !24}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !21, file: !8, line: 35, baseType: !11, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !21, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!25 = !{!26}
!26 = !DISubrange(count: 40)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !2, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !2, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !2, file: !8, line: 53, type: !6, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !2, file: !8, line: 54, type: !35, isLocal: false, isDefinition: true)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192000, elements: !36)
!36 = !{!37}
!37 = !DISubrange(count: 1000)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 12800, elements: !40)
!39 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!40 = !{!26, !26}
!41 = !{i32 2, !"Dwarf Version", i32 4}
!42 = !{i32 2, !"Debug Info Version", i32 3}
!43 = !{i32 1, !"wchar_size", i32 4}
!44 = !{!"clang version 9.0.1-12 "}
!45 = distinct !DISubprogram(name: "dijkstra_init", scope: !8, file: !8, line: 70, type: !46, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !48)
!46 = !DISubroutineType(types: !47)
!47 = !{null}
!48 = !{!49, !50, !51}
!49 = !DILocalVariable(name: "i", scope: !45, file: !8, line: 72, type: !11)
!50 = !DILocalVariable(name: "k", scope: !45, file: !8, line: 72, type: !11)
!51 = !DILocalVariable(name: "x", scope: !45, file: !8, line: 73, type: !52)
!52 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !11)
!53 = !DILocation(line: 73, column: 3, scope: !45)
!54 = !DILocation(line: 73, column: 16, scope: !45)
!55 = !{!56, !56, i64 0}
!56 = !{!"int", !57, i64 0}
!57 = !{!"omnipotent char", !58, i64 0}
!58 = !{!"Simple C/C++ TBAA"}
!59 = !DILocation(line: 0, scope: !45)
!60 = !DILocation(line: 75, column: 3, scope: !61)
!61 = distinct !DILexicalBlock(scope: !45, file: !8, line: 75, column: 3)
!62 = !DILocation(line: 78, column: 39, scope: !63)
!63 = distinct !DILexicalBlock(scope: !64, file: !8, line: 77, column: 5)
!64 = distinct !DILexicalBlock(scope: !65, file: !8, line: 77, column: 5)
!65 = distinct !DILexicalBlock(scope: !66, file: !8, line: 75, column: 37)
!66 = distinct !DILexicalBlock(scope: !61, file: !8, line: 75, column: 3)
!67 = !DILocation(line: 78, column: 7, scope: !63)
!68 = !DILocation(line: 78, column: 36, scope: !63)
!69 = !{!57, !57, i64 0}
!70 = !DILocation(line: 75, column: 32, scope: !66)
!71 = !DILocation(line: 75, column: 18, scope: !66)
!72 = distinct !{!72, !60, !73}
!73 = !DILocation(line: 79, column: 3, scope: !61)
!74 = !DILocation(line: 81, column: 23, scope: !45)
!75 = !DILocation(line: 82, column: 22, scope: !45)
!76 = !DILocation(line: 83, column: 22, scope: !45)
!77 = !{!78, !78, i64 0}
!78 = !{!"any pointer", !57, i64 0}
!79 = !DILocation(line: 85, column: 21, scope: !45)
!80 = !DILocation(line: 86, column: 1, scope: !45)
!81 = !DILocalVariable(name: "x", scope: !82, file: !8, line: 73, type: !52)
!82 = distinct !DISubprogram(name: "dijkstra_init", scope: !8, file: !8, line: 70, type: !46, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !83, retainedNodes: !113)
!83 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !84, globals: !92, nameTableKind: None)
!84 = !{!85}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !87)
!87 = !{!88, !89, !90, !91}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !86, file: !8, line: 40, baseType: !11, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !86, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !86, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !86, file: !8, line: 43, baseType: !85, size: 64, offset: 128)
!92 = !{!93, !95, !97, !104, !106, !108, !110}
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !83, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !83, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !83, file: !8, line: 49, type: !99, isLocal: false, isDefinition: true)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 2560, elements: !25)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !101)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !100, file: !8, line: 35, baseType: !11, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !100, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !83, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !83, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !83, file: !8, line: 53, type: !85, isLocal: false, isDefinition: true)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !83, file: !8, line: 54, type: !112, isLocal: false, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 192000, elements: !36)
!113 = !{!114, !115, !81}
!114 = !DILocalVariable(name: "i", scope: !82, file: !8, line: 72, type: !11)
!115 = !DILocalVariable(name: "k", scope: !82, file: !8, line: 72, type: !11)
!116 = !DILocalVariable(name: "k", scope: !117, file: !8, line: 72, type: !11)
!117 = distinct !DISubprogram(name: "dijkstra_init", scope: !8, file: !8, line: 70, type: !46, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !118, retainedNodes: !148)
!118 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !119, globals: !127, nameTableKind: None)
!119 = !{!120}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !122)
!122 = !{!123, !124, !125, !126}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !121, file: !8, line: 40, baseType: !11, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !121, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !121, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !121, file: !8, line: 43, baseType: !120, size: 64, offset: 128)
!127 = !{!128, !130, !132, !139, !141, !143, !145}
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !118, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !118, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !118, file: !8, line: 49, type: !134, isLocal: false, isDefinition: true)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 2560, elements: !25)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !136)
!136 = !{!137, !138}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !135, file: !8, line: 35, baseType: !11, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !135, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !118, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !118, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !118, file: !8, line: 53, type: !120, isLocal: false, isDefinition: true)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !118, file: !8, line: 54, type: !147, isLocal: false, isDefinition: true)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 192000, elements: !36)
!148 = !{!149, !116, !150}
!149 = !DILocalVariable(name: "i", scope: !117, file: !8, line: 72, type: !11)
!150 = !DILocalVariable(name: "x", scope: !117, file: !8, line: 73, type: !52)
!151 = distinct !DISubprogram(name: "dijkstra_return", scope: !8, file: !8, line: 88, type: !152, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!152 = !DISubroutineType(types: !153)
!153 = !{!11}
!154 = !DILocation(line: 90, column: 14, scope: !151)
!155 = !DILocation(line: 90, column: 32, scope: !151)
!156 = !DILocation(line: 90, column: 12, scope: !151)
!157 = !DILocation(line: 90, column: 3, scope: !151)
!158 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !159, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !161)
!159 = !DISubroutineType(types: !160)
!160 = !{!11, !11, !11, !11}
!161 = !{!162, !163, !164, !165, !166}
!162 = !DILocalVariable(name: "node", arg: 1, scope: !158, file: !8, line: 93, type: !11)
!163 = !DILocalVariable(name: "dist", arg: 2, scope: !158, file: !8, line: 93, type: !11)
!164 = !DILocalVariable(name: "prev", arg: 3, scope: !158, file: !8, line: 93, type: !11)
!165 = !DILocalVariable(name: "newItem", scope: !158, file: !8, line: 95, type: !6)
!166 = !DILocalVariable(name: "last", scope: !158, file: !8, line: 96, type: !6)
!167 = !DILocation(line: 0, scope: !158)
!168 = !DILocation(line: 95, column: 50, scope: !158)
!169 = !DILocation(line: 95, column: 29, scope: !158)
!170 = !DILocation(line: 96, column: 25, scope: !158)
!171 = !DILocation(line: 98, column: 8, scope: !172)
!172 = distinct !DILexicalBlock(scope: !158, file: !8, line: 98, column: 8)
!173 = !DILocation(line: 98, column: 29, scope: !172)
!174 = !DILocation(line: 98, column: 8, scope: !158)
!175 = !DILocation(line: 100, column: 12, scope: !158)
!176 = !DILocation(line: 100, column: 17, scope: !158)
!177 = !{!178, !56, i64 0}
!178 = !{!"_QITEM", !56, i64 0, !56, i64 4, !56, i64 8, !78, i64 16}
!179 = !DILocation(line: 101, column: 12, scope: !158)
!180 = !DILocation(line: 101, column: 17, scope: !158)
!181 = !{!178, !56, i64 4}
!182 = !DILocation(line: 102, column: 12, scope: !158)
!183 = !DILocation(line: 102, column: 17, scope: !158)
!184 = !{!178, !56, i64 8}
!185 = !DILocation(line: 103, column: 12, scope: !158)
!186 = !DILocation(line: 103, column: 17, scope: !158)
!187 = !{!178, !78, i64 16}
!188 = !DILocation(line: 105, column: 9, scope: !189)
!189 = distinct !DILexicalBlock(scope: !158, file: !8, line: 105, column: 8)
!190 = !DILocation(line: 105, column: 8, scope: !158)
!191 = !DILocation(line: 110, column: 19, scope: !192)
!192 = distinct !DILexicalBlock(scope: !189, file: !8, line: 107, column: 8)
!193 = !DILocation(line: 110, column: 5, scope: !192)
!194 = distinct !{!194, !193, !195}
!195 = !DILocation(line: 111, column: 20, scope: !192)
!196 = !DILocation(line: 0, scope: !189)
!197 = !DILocation(line: 114, column: 22, scope: !158)
!198 = !DILocation(line: 115, column: 3, scope: !158)
!199 = !DILocation(line: 116, column: 1, scope: !158)
!200 = !DILocalVariable(name: "newItem", scope: !201, file: !8, line: 95, type: !204)
!201 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !159, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !202, retainedNodes: !232)
!202 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !203, globals: !211, nameTableKind: None)
!203 = !{!204}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !206)
!206 = !{!207, !208, !209, !210}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !205, file: !8, line: 40, baseType: !11, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !205, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !205, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !205, file: !8, line: 43, baseType: !204, size: 64, offset: 128)
!211 = !{!212, !214, !216, !223, !225, !227, !229}
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !202, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !202, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !202, file: !8, line: 49, type: !218, isLocal: false, isDefinition: true)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 2560, elements: !25)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !220)
!220 = !{!221, !222}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !219, file: !8, line: 35, baseType: !11, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !219, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !202, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !202, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !202, file: !8, line: 53, type: !204, isLocal: false, isDefinition: true)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !202, file: !8, line: 54, type: !231, isLocal: false, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 192000, elements: !36)
!232 = !{!233, !234, !235, !200, !236}
!233 = !DILocalVariable(name: "node", arg: 1, scope: !201, file: !8, line: 93, type: !11)
!234 = !DILocalVariable(name: "dist", arg: 2, scope: !201, file: !8, line: 93, type: !11)
!235 = !DILocalVariable(name: "prev", arg: 3, scope: !201, file: !8, line: 93, type: !11)
!236 = !DILocalVariable(name: "last", scope: !201, file: !8, line: 96, type: !204)
!237 = !DILocalVariable(name: "last", scope: !238, file: !8, line: 96, type: !241)
!238 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !159, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !239, retainedNodes: !269)
!239 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !240, globals: !248, nameTableKind: None)
!240 = !{!241}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !243)
!243 = !{!244, !245, !246, !247}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !242, file: !8, line: 40, baseType: !11, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !242, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !242, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !242, file: !8, line: 43, baseType: !241, size: 64, offset: 128)
!248 = !{!249, !251, !253, !260, !262, !264, !266}
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !239, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !239, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !239, file: !8, line: 49, type: !255, isLocal: false, isDefinition: true)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 2560, elements: !25)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !257)
!257 = !{!258, !259}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !256, file: !8, line: 35, baseType: !11, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !256, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !239, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !239, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !239, file: !8, line: 53, type: !241, isLocal: false, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !239, file: !8, line: 54, type: !268, isLocal: false, isDefinition: true)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 192000, elements: !36)
!269 = !{!270, !271, !272, !273, !237}
!270 = !DILocalVariable(name: "node", arg: 1, scope: !238, file: !8, line: 93, type: !11)
!271 = !DILocalVariable(name: "dist", arg: 2, scope: !238, file: !8, line: 93, type: !11)
!272 = !DILocalVariable(name: "prev", arg: 3, scope: !238, file: !8, line: 93, type: !11)
!273 = !DILocalVariable(name: "newItem", scope: !238, file: !8, line: 95, type: !241)
!274 = distinct !DISubprogram(name: "dijkstra_dequeue", scope: !8, file: !8, line: 118, type: !275, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !278)
!275 = !DISubroutineType(types: !276)
!276 = !{null, !277, !277, !277}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!278 = !{!279, !280, !281}
!279 = !DILocalVariable(name: "node", arg: 1, scope: !274, file: !8, line: 118, type: !277)
!280 = !DILocalVariable(name: "dist", arg: 2, scope: !274, file: !8, line: 118, type: !277)
!281 = !DILocalVariable(name: "prev", arg: 3, scope: !274, file: !8, line: 118, type: !277)
!282 = !DILocation(line: 0, scope: !274)
!283 = !DILocation(line: 120, column: 8, scope: !284)
!284 = distinct !DILexicalBlock(scope: !274, file: !8, line: 120, column: 8)
!285 = !DILocation(line: 120, column: 8, scope: !274)
!286 = !DILocation(line: 121, column: 33, scope: !287)
!287 = distinct !DILexicalBlock(scope: !284, file: !8, line: 120, column: 29)
!288 = !DILocation(line: 121, column: 11, scope: !287)
!289 = !DILocation(line: 122, column: 33, scope: !287)
!290 = !DILocation(line: 122, column: 11, scope: !287)
!291 = !DILocation(line: 123, column: 33, scope: !287)
!292 = !DILocation(line: 123, column: 11, scope: !287)
!293 = !DILocation(line: 124, column: 46, scope: !287)
!294 = !DILocation(line: 124, column: 24, scope: !287)
!295 = !DILocation(line: 125, column: 24, scope: !287)
!296 = !DILocation(line: 126, column: 3, scope: !287)
!297 = !DILocation(line: 127, column: 1, scope: !274)
!298 = distinct !DISubprogram(name: "dijkstra_qcount", scope: !8, file: !8, line: 129, type: !152, scopeLine: 130, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!299 = !DILocation(line: 131, column: 12, scope: !298)
!300 = !DILocation(line: 131, column: 3, scope: !298)
!301 = distinct !DISubprogram(name: "dijkstra_find", scope: !8, file: !8, line: 134, type: !302, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !304)
!302 = !DISubroutineType(types: !303)
!303 = !{!11, !11, !11}
!304 = !{!305, !306, !307, !308, !309, !310, !311, !312}
!305 = !DILocalVariable(name: "chStart", arg: 1, scope: !301, file: !8, line: 134, type: !11)
!306 = !DILocalVariable(name: "chEnd", arg: 2, scope: !301, file: !8, line: 134, type: !11)
!307 = !DILocalVariable(name: "ch", scope: !301, file: !8, line: 136, type: !11)
!308 = !DILocalVariable(name: "prev", scope: !301, file: !8, line: 137, type: !11)
!309 = !DILocalVariable(name: "node", scope: !301, file: !8, line: 137, type: !11)
!310 = !DILocalVariable(name: "cost", scope: !301, file: !8, line: 138, type: !11)
!311 = !DILocalVariable(name: "dist", scope: !301, file: !8, line: 138, type: !11)
!312 = !DILocalVariable(name: "i", scope: !301, file: !8, line: 139, type: !11)
!313 = !DILocation(line: 0, scope: !301)
!314 = !DILocation(line: 143, column: 34, scope: !315)
!315 = distinct !DILexicalBlock(scope: !316, file: !8, line: 142, column: 40)
!316 = distinct !DILexicalBlock(scope: !317, file: !8, line: 142, column: 3)
!317 = distinct !DILexicalBlock(scope: !301, file: !8, line: 142, column: 3)
!318 = !DILocation(line: 147, column: 16, scope: !319)
!319 = distinct !DILexicalBlock(scope: !301, file: !8, line: 147, column: 8)
!320 = !DILocation(line: 147, column: 8, scope: !301)
!321 = !DILocation(line: 149, column: 5, scope: !322)
!322 = distinct !DILexicalBlock(scope: !319, file: !8, line: 148, column: 10)
!323 = !DILocation(line: 149, column: 34, scope: !322)
!324 = !DILocation(line: 149, column: 39, scope: !322)
!325 = !{!326, !56, i64 0}
!326 = !{!"_NODE", !56, i64 0, !56, i64 4}
!327 = !DILocation(line: 150, column: 34, scope: !322)
!328 = !DILocation(line: 150, column: 39, scope: !322)
!329 = !{!326, !56, i64 4}
!330 = !DILocation(line: 0, scope: !158, inlinedAt: !331)
!331 = distinct !DILocation(line: 152, column: 10, scope: !332)
!332 = distinct !DILexicalBlock(scope: !322, file: !8, line: 152, column: 10)
!333 = !DILocation(line: 95, column: 50, scope: !158, inlinedAt: !331)
!334 = !DILocation(line: 95, column: 29, scope: !158, inlinedAt: !331)
!335 = !DILocation(line: 96, column: 25, scope: !158, inlinedAt: !331)
!336 = !DILocation(line: 98, column: 8, scope: !172, inlinedAt: !331)
!337 = !DILocation(line: 98, column: 29, scope: !172, inlinedAt: !331)
!338 = !DILocation(line: 98, column: 8, scope: !158, inlinedAt: !331)
!339 = !DILocation(line: 100, column: 12, scope: !158, inlinedAt: !331)
!340 = !DILocation(line: 100, column: 17, scope: !158, inlinedAt: !331)
!341 = !DILocation(line: 101, column: 12, scope: !158, inlinedAt: !331)
!342 = !DILocation(line: 101, column: 17, scope: !158, inlinedAt: !331)
!343 = !DILocation(line: 102, column: 12, scope: !158, inlinedAt: !331)
!344 = !DILocation(line: 102, column: 17, scope: !158, inlinedAt: !331)
!345 = !DILocation(line: 103, column: 12, scope: !158, inlinedAt: !331)
!346 = !DILocation(line: 103, column: 17, scope: !158, inlinedAt: !331)
!347 = !DILocation(line: 105, column: 9, scope: !189, inlinedAt: !331)
!348 = !DILocation(line: 105, column: 8, scope: !158, inlinedAt: !331)
!349 = !DILocation(line: 110, column: 19, scope: !192, inlinedAt: !331)
!350 = !DILocation(line: 110, column: 5, scope: !192, inlinedAt: !331)
!351 = distinct !{!351, !350, !352}
!352 = !DILocation(line: 111, column: 20, scope: !192, inlinedAt: !331)
!353 = !DILocation(line: 0, scope: !189, inlinedAt: !331)
!354 = !DILocation(line: 114, column: 22, scope: !158, inlinedAt: !331)
!355 = !DILocation(line: 157, column: 31, scope: !322)
!356 = !DILocation(line: 157, column: 5, scope: !322)
!357 = !DILocation(line: 120, column: 8, scope: !284, inlinedAt: !358)
!358 = distinct !DILocation(line: 158, column: 7, scope: !359)
!359 = distinct !DILexicalBlock(scope: !322, file: !8, line: 157, column: 37)
!360 = !DILocation(line: 120, column: 8, scope: !274, inlinedAt: !358)
!361 = !DILocation(line: 121, column: 33, scope: !287, inlinedAt: !358)
!362 = !DILocation(line: 122, column: 33, scope: !287, inlinedAt: !358)
!363 = !DILocation(line: 124, column: 46, scope: !287, inlinedAt: !358)
!364 = !DILocation(line: 124, column: 24, scope: !287, inlinedAt: !358)
!365 = !DILocation(line: 125, column: 24, scope: !287, inlinedAt: !358)
!366 = !DILocation(line: 126, column: 3, scope: !287, inlinedAt: !358)
!367 = !DILocation(line: 0, scope: !368)
!368 = distinct !DILexicalBlock(scope: !369, file: !8, line: 161, column: 14)
!369 = distinct !DILexicalBlock(scope: !370, file: !8, line: 160, column: 41)
!370 = distinct !DILexicalBlock(scope: !371, file: !8, line: 160, column: 7)
!371 = distinct !DILexicalBlock(scope: !359, file: !8, line: 160, column: 7)
!372 = !DILocation(line: 160, column: 7, scope: !371)
!373 = !DILocation(line: 161, column: 23, scope: !368)
!374 = !DILocation(line: 162, column: 49, scope: !375)
!375 = distinct !DILexicalBlock(scope: !376, file: !8, line: 162, column: 16)
!376 = distinct !DILexicalBlock(scope: !368, file: !8, line: 161, column: 67)
!377 = !DILocation(line: 162, column: 23, scope: !375)
!378 = !DILocation(line: 163, column: 55, scope: !375)
!379 = !DILocation(line: 163, column: 46, scope: !375)
!380 = !DILocation(line: 162, column: 56, scope: !375)
!381 = !DILocation(line: 164, column: 41, scope: !382)
!382 = distinct !DILexicalBlock(scope: !375, file: !8, line: 163, column: 68)
!383 = !DILocation(line: 165, column: 36, scope: !382)
!384 = !DILocation(line: 165, column: 41, scope: !382)
!385 = !DILocation(line: 0, scope: !158, inlinedAt: !386)
!386 = distinct !DILocation(line: 166, column: 18, scope: !387)
!387 = distinct !DILexicalBlock(scope: !382, file: !8, line: 166, column: 18)
!388 = !DILocation(line: 95, column: 29, scope: !158, inlinedAt: !386)
!389 = !DILocation(line: 98, column: 8, scope: !172, inlinedAt: !386)
!390 = !DILocation(line: 98, column: 29, scope: !172, inlinedAt: !386)
!391 = !DILocation(line: 98, column: 8, scope: !158, inlinedAt: !386)
!392 = !DILocation(line: 100, column: 12, scope: !158, inlinedAt: !386)
!393 = !DILocation(line: 100, column: 17, scope: !158, inlinedAt: !386)
!394 = !DILocation(line: 101, column: 12, scope: !158, inlinedAt: !386)
!395 = !DILocation(line: 101, column: 17, scope: !158, inlinedAt: !386)
!396 = !DILocation(line: 102, column: 12, scope: !158, inlinedAt: !386)
!397 = !DILocation(line: 102, column: 17, scope: !158, inlinedAt: !386)
!398 = !DILocation(line: 103, column: 12, scope: !158, inlinedAt: !386)
!399 = !DILocation(line: 103, column: 17, scope: !158, inlinedAt: !386)
!400 = !DILocation(line: 105, column: 9, scope: !189, inlinedAt: !386)
!401 = !DILocation(line: 105, column: 8, scope: !158, inlinedAt: !386)
!402 = !DILocation(line: 110, column: 19, scope: !192, inlinedAt: !386)
!403 = !DILocation(line: 110, column: 5, scope: !192, inlinedAt: !386)
!404 = distinct !{!404, !403, !405}
!405 = !DILocation(line: 111, column: 20, scope: !192, inlinedAt: !386)
!406 = !DILocation(line: 0, scope: !189, inlinedAt: !386)
!407 = !DILocation(line: 114, column: 22, scope: !158, inlinedAt: !386)
!408 = !DILocation(line: 166, column: 18, scope: !382)
!409 = !DILocation(line: 160, column: 36, scope: !370)
!410 = !DILocation(line: 160, column: 22, scope: !370)
!411 = distinct !{!411, !372, !412}
!412 = !DILocation(line: 170, column: 7, scope: !371)
!413 = !DILocation(line: 174, column: 1, scope: !301)
!414 = !DILocalVariable(name: "ch", scope: !415, file: !8, line: 136, type: !11)
!415 = distinct !DISubprogram(name: "dijkstra_find", scope: !8, file: !8, line: 134, type: !302, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !416, retainedNodes: !446)
!416 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !417, globals: !425, nameTableKind: None)
!417 = !{!418}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !420)
!420 = !{!421, !422, !423, !424}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !419, file: !8, line: 40, baseType: !11, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !419, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !419, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !419, file: !8, line: 43, baseType: !418, size: 64, offset: 128)
!425 = !{!426, !428, !430, !437, !439, !441, !443}
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !416, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !416, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !416, file: !8, line: 49, type: !432, isLocal: false, isDefinition: true)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 2560, elements: !25)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !434)
!434 = !{!435, !436}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !433, file: !8, line: 35, baseType: !11, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !433, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !416, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !416, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !416, file: !8, line: 53, type: !418, isLocal: false, isDefinition: true)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !416, file: !8, line: 54, type: !445, isLocal: false, isDefinition: true)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !419, size: 192000, elements: !36)
!446 = !{!447, !448, !414, !449, !450, !451, !452, !453}
!447 = !DILocalVariable(name: "chStart", arg: 1, scope: !415, file: !8, line: 134, type: !11)
!448 = !DILocalVariable(name: "chEnd", arg: 2, scope: !415, file: !8, line: 134, type: !11)
!449 = !DILocalVariable(name: "prev", scope: !415, file: !8, line: 137, type: !11)
!450 = !DILocalVariable(name: "node", scope: !415, file: !8, line: 137, type: !11)
!451 = !DILocalVariable(name: "cost", scope: !415, file: !8, line: 138, type: !11)
!452 = !DILocalVariable(name: "dist", scope: !415, file: !8, line: 138, type: !11)
!453 = !DILocalVariable(name: "i", scope: !415, file: !8, line: 139, type: !11)
!454 = !DILocalVariable(name: "node", arg: 1, scope: !455, file: !8, line: 93, type: !11)
!455 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !159, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !456, retainedNodes: !486)
!456 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !457, globals: !465, nameTableKind: None)
!457 = !{!458}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !460)
!460 = !{!461, !462, !463, !464}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !459, file: !8, line: 40, baseType: !11, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !459, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !459, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !459, file: !8, line: 43, baseType: !458, size: 64, offset: 128)
!465 = !{!466, !468, !470, !477, !479, !481, !483}
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !456, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !456, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !456, file: !8, line: 49, type: !472, isLocal: false, isDefinition: true)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 2560, elements: !25)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !474)
!474 = !{!475, !476}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !473, file: !8, line: 35, baseType: !11, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !473, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !456, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !456, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !456, file: !8, line: 53, type: !458, isLocal: false, isDefinition: true)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !456, file: !8, line: 54, type: !485, isLocal: false, isDefinition: true)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 192000, elements: !36)
!486 = !{!454, !487, !488, !489, !490}
!487 = !DILocalVariable(name: "dist", arg: 2, scope: !455, file: !8, line: 93, type: !11)
!488 = !DILocalVariable(name: "prev", arg: 3, scope: !455, file: !8, line: 93, type: !11)
!489 = !DILocalVariable(name: "newItem", scope: !455, file: !8, line: 95, type: !458)
!490 = !DILocalVariable(name: "last", scope: !455, file: !8, line: 96, type: !458)
!491 = !DILocalVariable(name: "last", scope: !492, file: !8, line: 96, type: !495)
!492 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !159, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !493, retainedNodes: !523)
!493 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !494, globals: !502, nameTableKind: None)
!494 = !{!495}
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !497)
!497 = !{!498, !499, !500, !501}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !496, file: !8, line: 40, baseType: !11, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !496, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !496, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !496, file: !8, line: 43, baseType: !495, size: 64, offset: 128)
!502 = !{!503, !505, !507, !514, !516, !518, !520}
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !493, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !493, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !493, file: !8, line: 49, type: !509, isLocal: false, isDefinition: true)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !510, size: 2560, elements: !25)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !511)
!511 = !{!512, !513}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !510, file: !8, line: 35, baseType: !11, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !510, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !493, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !493, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !493, file: !8, line: 53, type: !495, isLocal: false, isDefinition: true)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !493, file: !8, line: 54, type: !522, isLocal: false, isDefinition: true)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !496, size: 192000, elements: !36)
!523 = !{!524, !525, !526, !527, !491}
!524 = !DILocalVariable(name: "node", arg: 1, scope: !492, file: !8, line: 93, type: !11)
!525 = !DILocalVariable(name: "dist", arg: 2, scope: !492, file: !8, line: 93, type: !11)
!526 = !DILocalVariable(name: "prev", arg: 3, scope: !492, file: !8, line: 93, type: !11)
!527 = !DILocalVariable(name: "newItem", scope: !492, file: !8, line: 95, type: !495)
!528 = !DILocalVariable(name: "node", scope: !529, file: !8, line: 137, type: !11)
!529 = distinct !DISubprogram(name: "dijkstra_find", scope: !8, file: !8, line: 134, type: !302, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !530, retainedNodes: !560)
!530 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !531, globals: !539, nameTableKind: None)
!531 = !{!532}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !534)
!534 = !{!535, !536, !537, !538}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !533, file: !8, line: 40, baseType: !11, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !533, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !533, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !533, file: !8, line: 43, baseType: !532, size: 64, offset: 128)
!539 = !{!540, !542, !544, !551, !553, !555, !557}
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !530, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !530, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !530, file: !8, line: 49, type: !546, isLocal: false, isDefinition: true)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !547, size: 2560, elements: !25)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !548)
!548 = !{!549, !550}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !547, file: !8, line: 35, baseType: !11, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !547, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !530, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !530, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !530, file: !8, line: 53, type: !532, isLocal: false, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !530, file: !8, line: 54, type: !559, isLocal: false, isDefinition: true)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !533, size: 192000, elements: !36)
!560 = !{!561, !562, !563, !564, !528, !565, !566, !567}
!561 = !DILocalVariable(name: "chStart", arg: 1, scope: !529, file: !8, line: 134, type: !11)
!562 = !DILocalVariable(name: "chEnd", arg: 2, scope: !529, file: !8, line: 134, type: !11)
!563 = !DILocalVariable(name: "ch", scope: !529, file: !8, line: 136, type: !11)
!564 = !DILocalVariable(name: "prev", scope: !529, file: !8, line: 137, type: !11)
!565 = !DILocalVariable(name: "cost", scope: !529, file: !8, line: 138, type: !11)
!566 = !DILocalVariable(name: "dist", scope: !529, file: !8, line: 138, type: !11)
!567 = !DILocalVariable(name: "i", scope: !529, file: !8, line: 139, type: !11)
!568 = !DILocalVariable(name: "node", arg: 1, scope: !569, file: !8, line: 93, type: !11)
!569 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !159, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !530, retainedNodes: !570)
!570 = !{!568, !571, !572, !573, !574}
!571 = !DILocalVariable(name: "dist", arg: 2, scope: !569, file: !8, line: 93, type: !11)
!572 = !DILocalVariable(name: "prev", arg: 3, scope: !569, file: !8, line: 93, type: !11)
!573 = !DILocalVariable(name: "newItem", scope: !569, file: !8, line: 95, type: !532)
!574 = !DILocalVariable(name: "last", scope: !569, file: !8, line: 96, type: !532)
!575 = !DILocalVariable(name: "last", scope: !576, file: !8, line: 96, type: !579)
!576 = distinct !DISubprogram(name: "dijkstra_enqueue", scope: !8, file: !8, line: 93, type: !159, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !577, retainedNodes: !607)
!577 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !578, globals: !586, nameTableKind: None)
!578 = !{!579}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !581)
!581 = !{!582, !583, !584, !585}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !580, file: !8, line: 40, baseType: !11, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !580, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !580, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !580, file: !8, line: 43, baseType: !579, size: 64, offset: 128)
!586 = !{!587, !589, !591, !598, !600, !602, !604}
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !577, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !577, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !577, file: !8, line: 49, type: !593, isLocal: false, isDefinition: true)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !594, size: 2560, elements: !25)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !595)
!595 = !{!596, !597}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !594, file: !8, line: 35, baseType: !11, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !594, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !577, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !577, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !577, file: !8, line: 53, type: !579, isLocal: false, isDefinition: true)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !577, file: !8, line: 54, type: !606, isLocal: false, isDefinition: true)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !580, size: 192000, elements: !36)
!607 = !{!608, !609, !610, !611, !575}
!608 = !DILocalVariable(name: "node", arg: 1, scope: !576, file: !8, line: 93, type: !11)
!609 = !DILocalVariable(name: "dist", arg: 2, scope: !576, file: !8, line: 93, type: !11)
!610 = !DILocalVariable(name: "prev", arg: 3, scope: !576, file: !8, line: 93, type: !11)
!611 = !DILocalVariable(name: "newItem", scope: !576, file: !8, line: 95, type: !579)
!612 = !DILocalVariable(name: "i", scope: !613, file: !8, line: 139, type: !11)
!613 = distinct !DISubprogram(name: "dijkstra_find", scope: !8, file: !8, line: 134, type: !302, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !614, retainedNodes: !644)
!614 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !615, globals: !623, nameTableKind: None)
!615 = !{!616}
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !618)
!618 = !{!619, !620, !621, !622}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !617, file: !8, line: 40, baseType: !11, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !617, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !617, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !617, file: !8, line: 43, baseType: !616, size: 64, offset: 128)
!623 = !{!624, !626, !628, !635, !637, !639, !641}
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !614, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !614, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !614, file: !8, line: 49, type: !630, isLocal: false, isDefinition: true)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !631, size: 2560, elements: !25)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !632)
!632 = !{!633, !634}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !631, file: !8, line: 35, baseType: !11, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !631, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !614, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !614, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !614, file: !8, line: 53, type: !616, isLocal: false, isDefinition: true)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !614, file: !8, line: 54, type: !643, isLocal: false, isDefinition: true)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !617, size: 192000, elements: !36)
!644 = !{!645, !646, !647, !648, !649, !650, !651, !612}
!645 = !DILocalVariable(name: "chStart", arg: 1, scope: !613, file: !8, line: 134, type: !11)
!646 = !DILocalVariable(name: "chEnd", arg: 2, scope: !613, file: !8, line: 134, type: !11)
!647 = !DILocalVariable(name: "ch", scope: !613, file: !8, line: 136, type: !11)
!648 = !DILocalVariable(name: "prev", scope: !613, file: !8, line: 137, type: !11)
!649 = !DILocalVariable(name: "node", scope: !613, file: !8, line: 137, type: !11)
!650 = !DILocalVariable(name: "cost", scope: !613, file: !8, line: 138, type: !11)
!651 = !DILocalVariable(name: "dist", scope: !613, file: !8, line: 138, type: !11)
!652 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !653)
!653 = !{!654, !655}
!654 = !DILocalVariable(name: "i", scope: !652, file: !8, line: 178, type: !11)
!655 = !DILocalVariable(name: "j", scope: !652, file: !8, line: 178, type: !11)
!656 = !DILocation(line: 0, scope: !652)
!657 = !DILocation(line: 184, column: 10, scope: !658)
!658 = distinct !DILexicalBlock(scope: !659, file: !8, line: 184, column: 10)
!659 = distinct !DILexicalBlock(scope: !660, file: !8, line: 182, column: 54)
!660 = distinct !DILexicalBlock(scope: !661, file: !8, line: 182, column: 3)
!661 = distinct !DILexicalBlock(scope: !652, file: !8, line: 182, column: 3)
!662 = !DILocation(line: 184, column: 32, scope: !658)
!663 = !DILocation(line: 185, column: 25, scope: !664)
!664 = distinct !DILexicalBlock(scope: !658, file: !8, line: 184, column: 51)
!665 = !DILocation(line: 186, column: 7, scope: !664)
!666 = !DILocation(line: 188, column: 51, scope: !658)
!667 = !DILocation(line: 188, column: 25, scope: !658)
!668 = !DILocation(line: 189, column: 24, scope: !659)
!669 = !DILocation(line: 191, column: 1, scope: !652)
!670 = !DILocation(line: 184, column: 10, scope: !659)
!671 = !DILocalVariable(name: "j", scope: !672, file: !8, line: 178, type: !11)
!672 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !673, retainedNodes: !703)
!673 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !674, globals: !682, nameTableKind: None)
!674 = !{!675}
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !677)
!677 = !{!678, !679, !680, !681}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !676, file: !8, line: 40, baseType: !11, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !676, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !676, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !676, file: !8, line: 43, baseType: !675, size: 64, offset: 128)
!682 = !{!683, !685, !687, !694, !696, !698, !700}
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !673, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !673, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !673, file: !8, line: 49, type: !689, isLocal: false, isDefinition: true)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !690, size: 2560, elements: !25)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !691)
!691 = !{!692, !693}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !690, file: !8, line: 35, baseType: !11, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !690, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !673, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !673, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !673, file: !8, line: 53, type: !675, isLocal: false, isDefinition: true)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !673, file: !8, line: 54, type: !702, isLocal: false, isDefinition: true)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !676, size: 192000, elements: !36)
!703 = !{!704, !671}
!704 = !DILocalVariable(name: "i", scope: !672, file: !8, line: 178, type: !11)
!705 = !DILocalVariable(name: "j", scope: !706, file: !8, line: 178, type: !11)
!706 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !707, retainedNodes: !737)
!707 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !708, globals: !716, nameTableKind: None)
!708 = !{!709}
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !711)
!711 = !{!712, !713, !714, !715}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !710, file: !8, line: 40, baseType: !11, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !710, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !710, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !710, file: !8, line: 43, baseType: !709, size: 64, offset: 128)
!716 = !{!717, !719, !721, !728, !730, !732, !734}
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !707, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !707, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !707, file: !8, line: 49, type: !723, isLocal: false, isDefinition: true)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !724, size: 2560, elements: !25)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !725)
!725 = !{!726, !727}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !724, file: !8, line: 35, baseType: !11, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !724, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !707, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !707, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !707, file: !8, line: 53, type: !709, isLocal: false, isDefinition: true)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !707, file: !8, line: 54, type: !736, isLocal: false, isDefinition: true)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !710, size: 192000, elements: !36)
!737 = !{!738, !705}
!738 = !DILocalVariable(name: "i", scope: !706, file: !8, line: 178, type: !11)
!739 = !DILocalVariable(name: "j", scope: !740, file: !8, line: 178, type: !11)
!740 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !741, retainedNodes: !771)
!741 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !742, globals: !750, nameTableKind: None)
!742 = !{!743}
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !745)
!745 = !{!746, !747, !748, !749}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !744, file: !8, line: 40, baseType: !11, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !744, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !744, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !744, file: !8, line: 43, baseType: !743, size: 64, offset: 128)
!750 = !{!751, !753, !755, !762, !764, !766, !768}
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !741, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !741, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !741, file: !8, line: 49, type: !757, isLocal: false, isDefinition: true)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !758, size: 2560, elements: !25)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !759)
!759 = !{!760, !761}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !758, file: !8, line: 35, baseType: !11, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !758, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !741, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !741, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !741, file: !8, line: 53, type: !743, isLocal: false, isDefinition: true)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !741, file: !8, line: 54, type: !770, isLocal: false, isDefinition: true)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !744, size: 192000, elements: !36)
!771 = !{!772, !739}
!772 = !DILocalVariable(name: "i", scope: !740, file: !8, line: 178, type: !11)
!773 = !DILocalVariable(name: "j", scope: !774, file: !8, line: 178, type: !11)
!774 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !775, retainedNodes: !805)
!775 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !776, globals: !784, nameTableKind: None)
!776 = !{!777}
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !779)
!779 = !{!780, !781, !782, !783}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !778, file: !8, line: 40, baseType: !11, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !778, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !778, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !778, file: !8, line: 43, baseType: !777, size: 64, offset: 128)
!784 = !{!785, !787, !789, !796, !798, !800, !802}
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !775, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !775, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !775, file: !8, line: 49, type: !791, isLocal: false, isDefinition: true)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !792, size: 2560, elements: !25)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !793)
!793 = !{!794, !795}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !792, file: !8, line: 35, baseType: !11, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !792, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !775, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !775, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !775, file: !8, line: 53, type: !777, isLocal: false, isDefinition: true)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !775, file: !8, line: 54, type: !804, isLocal: false, isDefinition: true)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !778, size: 192000, elements: !36)
!805 = !{!806, !773}
!806 = !DILocalVariable(name: "i", scope: !774, file: !8, line: 178, type: !11)
!807 = !DILocalVariable(name: "j", scope: !808, file: !8, line: 178, type: !11)
!808 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !809, retainedNodes: !839)
!809 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !810, globals: !818, nameTableKind: None)
!810 = !{!811}
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !813)
!813 = !{!814, !815, !816, !817}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !812, file: !8, line: 40, baseType: !11, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !812, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !812, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !812, file: !8, line: 43, baseType: !811, size: 64, offset: 128)
!818 = !{!819, !821, !823, !830, !832, !834, !836}
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !809, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !809, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !809, file: !8, line: 49, type: !825, isLocal: false, isDefinition: true)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !826, size: 2560, elements: !25)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !827)
!827 = !{!828, !829}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !826, file: !8, line: 35, baseType: !11, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !826, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !809, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !809, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !809, file: !8, line: 53, type: !811, isLocal: false, isDefinition: true)
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !809, file: !8, line: 54, type: !838, isLocal: false, isDefinition: true)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !812, size: 192000, elements: !36)
!839 = !{!840, !807}
!840 = !DILocalVariable(name: "i", scope: !808, file: !8, line: 178, type: !11)
!841 = !DILocalVariable(name: "j", scope: !842, file: !8, line: 178, type: !11)
!842 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !843, retainedNodes: !873)
!843 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !844, globals: !852, nameTableKind: None)
!844 = !{!845}
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !847)
!847 = !{!848, !849, !850, !851}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !846, file: !8, line: 40, baseType: !11, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !846, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !846, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !846, file: !8, line: 43, baseType: !845, size: 64, offset: 128)
!852 = !{!853, !855, !857, !864, !866, !868, !870}
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !843, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !843, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!857 = !DIGlobalVariableExpression(var: !858, expr: !DIExpression())
!858 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !843, file: !8, line: 49, type: !859, isLocal: false, isDefinition: true)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !860, size: 2560, elements: !25)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !861)
!861 = !{!862, !863}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !860, file: !8, line: 35, baseType: !11, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !860, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !843, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !843, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !843, file: !8, line: 53, type: !845, isLocal: false, isDefinition: true)
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !843, file: !8, line: 54, type: !872, isLocal: false, isDefinition: true)
!872 = !DICompositeType(tag: DW_TAG_array_type, baseType: !846, size: 192000, elements: !36)
!873 = !{!874, !841}
!874 = !DILocalVariable(name: "i", scope: !842, file: !8, line: 178, type: !11)
!875 = !DILocalVariable(name: "j", scope: !876, file: !8, line: 178, type: !11)
!876 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !877, retainedNodes: !907)
!877 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !878, globals: !886, nameTableKind: None)
!878 = !{!879}
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !881)
!881 = !{!882, !883, !884, !885}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !880, file: !8, line: 40, baseType: !11, size: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !880, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !880, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !880, file: !8, line: 43, baseType: !879, size: 64, offset: 128)
!886 = !{!887, !889, !891, !898, !900, !902, !904}
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !877, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !877, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !877, file: !8, line: 49, type: !893, isLocal: false, isDefinition: true)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !894, size: 2560, elements: !25)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !895)
!895 = !{!896, !897}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !894, file: !8, line: 35, baseType: !11, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !894, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !877, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !877, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !877, file: !8, line: 53, type: !879, isLocal: false, isDefinition: true)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !877, file: !8, line: 54, type: !906, isLocal: false, isDefinition: true)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !880, size: 192000, elements: !36)
!907 = !{!908, !875}
!908 = !DILocalVariable(name: "i", scope: !876, file: !8, line: 178, type: !11)
!909 = !DILocalVariable(name: "j", scope: !910, file: !8, line: 178, type: !11)
!910 = distinct !DISubprogram(name: "dijkstra_main", scope: !8, file: !8, line: 176, type: !46, scopeLine: 177, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !911, retainedNodes: !941)
!911 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !912, globals: !920, nameTableKind: None)
!912 = !{!913}
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !915)
!915 = !{!916, !917, !918, !919}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !914, file: !8, line: 40, baseType: !11, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !914, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !914, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !914, file: !8, line: 43, baseType: !913, size: 64, offset: 128)
!920 = !{!921, !923, !925, !932, !934, !936, !938}
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !911, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !911, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !911, file: !8, line: 49, type: !927, isLocal: false, isDefinition: true)
!927 = !DICompositeType(tag: DW_TAG_array_type, baseType: !928, size: 2560, elements: !25)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !929)
!929 = !{!930, !931}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !928, file: !8, line: 35, baseType: !11, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !928, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !911, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !911, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !911, file: !8, line: 53, type: !913, isLocal: false, isDefinition: true)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !911, file: !8, line: 54, type: !940, isLocal: false, isDefinition: true)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !914, size: 192000, elements: !36)
!941 = !{!942, !909}
!942 = !DILocalVariable(name: "i", scope: !910, file: !8, line: 178, type: !11)
!943 = distinct !DISubprogram(name: "main", scope: !8, file: !8, line: 193, type: !944, scopeLine: 194, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !949)
!944 = !DISubroutineType(types: !945)
!945 = !{!11, !11, !946}
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!949 = !{!950, !951}
!950 = !DILocalVariable(name: "argc", arg: 1, scope: !943, file: !8, line: 193, type: !11)
!951 = !DILocalVariable(name: "argv", arg: 2, scope: !943, file: !8, line: 193, type: !946)
!952 = !DILocation(line: 0, scope: !943)
!953 = !DILocation(line: 195, column: 3, scope: !943)
!954 = !DILocation(line: 196, column: 3, scope: !943)
!955 = !DILocation(line: 90, column: 14, scope: !151, inlinedAt: !956)
!956 = distinct !DILocation(line: 198, column: 12, scope: !943)
!957 = !DILocation(line: 90, column: 32, scope: !151, inlinedAt: !956)
!958 = !DILocation(line: 90, column: 12, scope: !151, inlinedAt: !956)
!959 = !DILocation(line: 198, column: 3, scope: !943)
!960 = !DILocalVariable(name: "argc", arg: 1, scope: !961, file: !8, line: 193, type: !11)
!961 = distinct !DISubprogram(name: "main", scope: !8, file: !8, line: 193, type: !944, scopeLine: 194, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !962, retainedNodes: !992)
!962 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !963, globals: !971, nameTableKind: None)
!963 = !{!964}
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QITEM", file: !8, line: 39, size: 192, elements: !966)
!966 = !{!967, !968, !969, !970}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !965, file: !8, line: 40, baseType: !11, size: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !965, file: !8, line: 41, baseType: !11, size: 32, offset: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !965, file: !8, line: 42, baseType: !11, size: 32, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !965, file: !8, line: 43, baseType: !964, size: 64, offset: 128)
!971 = !{!972, !974, !976, !983, !985, !987, !989}
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(name: "dijkstra_AdjMatrix", scope: !962, file: !8, line: 22, type: !38, isLocal: false, isDefinition: true)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(name: "dijkstra_checksum", scope: !962, file: !8, line: 56, type: !11, isLocal: false, isDefinition: true)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(name: "dijkstra_rgnNodes", scope: !962, file: !8, line: 49, type: !978, isLocal: false, isDefinition: true)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !979, size: 2560, elements: !25)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NODE", file: !8, line: 34, size: 64, elements: !980)
!980 = !{!981, !982}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !979, file: !8, line: 35, baseType: !11, size: 32)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !979, file: !8, line: 36, baseType: !11, size: 32, offset: 32)
!983 = !DIGlobalVariableExpression(var: !984, expr: !DIExpression())
!984 = distinct !DIGlobalVariable(name: "dijkstra_queueCount", scope: !962, file: !8, line: 51, type: !11, isLocal: false, isDefinition: true)
!985 = !DIGlobalVariableExpression(var: !986, expr: !DIExpression())
!986 = distinct !DIGlobalVariable(name: "dijkstra_queueNext", scope: !962, file: !8, line: 52, type: !11, isLocal: false, isDefinition: true)
!987 = !DIGlobalVariableExpression(var: !988, expr: !DIExpression())
!988 = distinct !DIGlobalVariable(name: "dijkstra_queueHead", scope: !962, file: !8, line: 53, type: !964, isLocal: false, isDefinition: true)
!989 = !DIGlobalVariableExpression(var: !990, expr: !DIExpression())
!990 = distinct !DIGlobalVariable(name: "dijkstra_queueItems", scope: !962, file: !8, line: 54, type: !991, isLocal: false, isDefinition: true)
!991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !965, size: 192000, elements: !36)
!992 = !{!960, !993}
!993 = !DILocalVariable(name: "argv", arg: 2, scope: !961, file: !8, line: 193, type: !946)
