; ModuleID = '<stdin>'
source_filename = "./sha.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.SHA_INFO = type { [5 x i64], i64, i64, [16 x i64] }
%struct.SHA_MY_FILE = type { i8*, i32, i32 }

@sha_data = dso_local global [1024 x i8] c"KurtVonnegutsCommencementAddressatMITLadiesandgentlemenoftheclassof97WearsunscreenIfIcouldofferyouonlyonetipforthefuturesunscreenwouldbeitThelongtermbenefitsofsunscreenhavebeenprovedbyscientistswhereastherestofmyadvicehasnobasismorereliablethanmyownmeanderingexperienceIwilldispensethisadvicenowEnjoythepowerandbeautyofyouryouthOhnevermindYouwillnotunderstandthepowerandbeautyofyouryouthuntiltheyvefadedButtrustmein20yearsyoulllookbackatphotosofyourselfandrecallinawayyoucantgraspnowhowmuchpossibilitylaybeforeyouandhowfabulousyoureallylookedYouarenotasfatasyouimagineDontworryaboutthefutureOrworrybutknowthatKurtVonneguKurtVonnegutsCommencementAddressatMITLadiesandgentlemenoftheclassof97WearsunscreenIfIcouldofferyouonlyonetipforthefuturesunscreenwouldbeitThelongtermbenefitsofsunscreenhavebeenprovedbyscientistswhereastherestofmyadvicehasnobasismorereliablethanmyownmeanderingexperienceIwilldispensethisadvicenowEnjoythepowerandbeautyofyouryouthOhnevermindYouwillnotunderstandthepowerandbeautyofyouryouthuntiltheyvefadedB", align 16, !dbg !0
@sha_info = common dso_local global %struct.SHA_INFO zeroinitializer, align 8, !dbg !18
@inVal0 = global i32 0
@inVal1 = global i8** null

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "sha_data", scope: !2, file: !20, line: 25, type: !33, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !17, nameTableKind: None)
!3 = !DIFile(filename: "sha.c", directory: "/home/newton/cfiles/xmark")
!4 = !{}
!5 = !{!6, !7, !11, !10, !13, !14, !15, !16}
!6 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "BYTE", file: !9, line: 24, baseType: !10)
!9 = !DIFile(filename: "./sha.h", directory: "/home/newton/cfiles/xmark")
!10 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "LONG", file: !9, line: 25, baseType: !12)
!16 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!17 = !{!0, !18}
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "sha_info", scope: !2, file: !20, line: 319, type: !21, isLocal: false, isDefinition: true)
!20 = !DIFile(filename: "./sha.c", directory: "/home/newton/cfiles/xmark")
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SHA_INFO", file: !9, line: 42, size: 1472, elements: !22)
!22 = !{!23, !27, !28, !29}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !21, file: !9, line: 43, baseType: !24, size: 320)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 320, elements: !25)
!25 = !{!26}
!26 = !DISubrange(count: 5)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "count_lo", scope: !21, file: !9, line: 44, baseType: !15, size: 64, offset: 320)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "count_hi", scope: !21, file: !9, line: 44, baseType: !15, size: 64, offset: 384)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !21, file: !9, line: 45, baseType: !30, size: 1024, offset: 448)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 1024, elements: !31)
!31 = !{!32}
!32 = !DISubrange(count: 16)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 8192, elements: !35)
!34 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !10)
!35 = !{!36}
!36 = !DISubrange(count: 1024)
!37 = !{i32 2, !"Dwarf Version", i32 4}
!38 = !{i32 2, !"Debug Info Version", i32 3}
!39 = !{i32 1, !"wchar_size", i32 4}
!40 = !{!"clang version 9.0.1-12 "}
!41 = distinct !DISubprogram(name: "sha_glibc_memcpy", scope: !20, file: !20, line: 78, type: !42, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!42 = !DISubroutineType(types: !43)
!43 = !{!13, !13, !44, !46}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !9, line: 26, baseType: !47)
!47 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!48 = !DILocalVariable(name: "dstpp", arg: 1, scope: !41, file: !20, line: 78, type: !13)
!49 = !DILocation(line: 78, column: 31, scope: !41)
!50 = !DILocalVariable(name: "srcpp", arg: 2, scope: !41, file: !20, line: 78, type: !44)
!51 = !DILocation(line: 78, column: 50, scope: !41)
!52 = !DILocalVariable(name: "len", arg: 3, scope: !41, file: !20, line: 78, type: !46)
!53 = !DILocation(line: 78, column: 64, scope: !41)
!54 = !DILocalVariable(name: "dstp", scope: !41, file: !20, line: 80, type: !12)
!55 = !DILocation(line: 80, column: 21, scope: !41)
!56 = !DILocation(line: 80, column: 41, scope: !41)
!57 = !DILocation(line: 80, column: 28, scope: !41)
!58 = !DILocalVariable(name: "srcp", scope: !41, file: !20, line: 81, type: !12)
!59 = !DILocation(line: 81, column: 21, scope: !41)
!60 = !DILocation(line: 81, column: 41, scope: !41)
!61 = !DILocation(line: 81, column: 28, scope: !41)
!62 = !DILocalVariable(name: "__nbytes", scope: !41, file: !20, line: 82, type: !46)
!63 = !DILocation(line: 82, column: 10, scope: !41)
!64 = !DILocation(line: 87, column: 8, scope: !65)
!65 = distinct !DILexicalBlock(scope: !41, file: !20, line: 87, column: 8)
!66 = !DILocation(line: 87, column: 12, scope: !65)
!67 = !DILocation(line: 87, column: 8, scope: !41)
!68 = !DILocation(line: 89, column: 15, scope: !69)
!69 = distinct !DILexicalBlock(scope: !65, file: !20, line: 87, column: 28)
!70 = !DILocation(line: 89, column: 14, scope: !69)
!71 = !DILocation(line: 89, column: 22, scope: !69)
!72 = !DILocation(line: 89, column: 9, scope: !69)
!73 = !DILocation(line: 91, column: 19, scope: !69)
!74 = !DILocation(line: 91, column: 18, scope: !69)
!75 = !DILocation(line: 91, column: 26, scope: !69)
!76 = !DILocation(line: 91, column: 16, scope: !69)
!77 = !DILocation(line: 91, column: 14, scope: !69)
!78 = !DILocation(line: 93, column: 5, scope: !69)
!79 = !DILocation(line: 93, column: 13, scope: !69)
!80 = !DILocation(line: 93, column: 22, scope: !69)
!81 = !DILocalVariable(name: "__x", scope: !82, file: !20, line: 94, type: !8)
!82 = distinct !DILexicalBlock(scope: !69, file: !20, line: 93, column: 28)
!83 = !DILocation(line: 94, column: 12, scope: !82)
!84 = !DILocation(line: 94, column: 31, scope: !82)
!85 = !DILocation(line: 94, column: 20, scope: !82)
!86 = !DILocation(line: 94, column: 18, scope: !82)
!87 = !DILocation(line: 95, column: 12, scope: !82)
!88 = !DILocation(line: 96, column: 16, scope: !82)
!89 = !DILocation(line: 97, column: 34, scope: !82)
!90 = !DILocation(line: 97, column: 20, scope: !82)
!91 = !DILocation(line: 97, column: 9, scope: !82)
!92 = !DILocation(line: 97, column: 7, scope: !82)
!93 = !DILocation(line: 97, column: 32, scope: !82)
!94 = !DILocation(line: 98, column: 12, scope: !82)
!95 = distinct !{!95, !78, !96}
!96 = !DILocation(line: 99, column: 5, scope: !69)
!97 = !DILocation(line: 110, column: 5, scope: !98)
!98 = distinct !DILexicalBlock(scope: !99, file: !20, line: 110, column: 5)
!99 = distinct !DILexicalBlock(scope: !69, file: !20, line: 110, column: 5)
!100 = !DILocation(line: 110, column: 5, scope: !99)
!101 = !DILocation(line: 113, column: 3, scope: !69)
!102 = !DILocation(line: 116, column: 14, scope: !41)
!103 = !DILocation(line: 116, column: 12, scope: !41)
!104 = !DILocation(line: 118, column: 3, scope: !41)
!105 = !DILocation(line: 118, column: 11, scope: !41)
!106 = !DILocation(line: 118, column: 20, scope: !41)
!107 = !DILocalVariable(name: "__x", scope: !108, file: !20, line: 119, type: !8)
!108 = distinct !DILexicalBlock(scope: !41, file: !20, line: 118, column: 26)
!109 = !DILocation(line: 119, column: 10, scope: !108)
!110 = !DILocation(line: 119, column: 29, scope: !108)
!111 = !DILocation(line: 119, column: 18, scope: !108)
!112 = !DILocation(line: 119, column: 16, scope: !108)
!113 = !DILocation(line: 120, column: 10, scope: !108)
!114 = !DILocation(line: 121, column: 14, scope: !108)
!115 = !DILocation(line: 122, column: 32, scope: !108)
!116 = !DILocation(line: 122, column: 18, scope: !108)
!117 = !DILocation(line: 122, column: 7, scope: !108)
!118 = !DILocation(line: 122, column: 5, scope: !108)
!119 = !DILocation(line: 122, column: 30, scope: !108)
!120 = !DILocation(line: 123, column: 10, scope: !108)
!121 = distinct !{!121, !104, !122}
!122 = !DILocation(line: 124, column: 3, scope: !41)
!123 = !DILocation(line: 126, column: 10, scope: !41)
!124 = !DILocation(line: 126, column: 3, scope: !41)
!125 = !DILocalVariable(name: "dstpp", arg: 1, scope: !126, file: !20, line: 78, type: !13)
!126 = distinct !DISubprogram(name: "sha_glibc_memcpy", scope: !20, file: !20, line: 78, type: !42, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !127, retainedNodes: !4)
!127 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !128, nameTableKind: None)
!128 = !{!129, !131}
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "sha_data", scope: !127, file: !20, line: 25, type: !33, isLocal: false, isDefinition: true)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "sha_info", scope: !127, file: !20, line: 319, type: !133, isLocal: false, isDefinition: true)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SHA_INFO", file: !9, line: 42, size: 1472, elements: !134)
!134 = !{!135, !136, !137, !138}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !133, file: !9, line: 43, baseType: !24, size: 320)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "count_lo", scope: !133, file: !9, line: 44, baseType: !15, size: 64, offset: 320)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "count_hi", scope: !133, file: !9, line: 44, baseType: !15, size: 64, offset: 384)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !133, file: !9, line: 45, baseType: !30, size: 1024, offset: 448)
!139 = !DILocalVariable(name: "srcpp", arg: 2, scope: !126, file: !20, line: 78, type: !44)
!140 = !DILocalVariable(name: "len", arg: 3, scope: !126, file: !20, line: 78, type: !46)
!141 = !DILocalVariable(name: "dstp", scope: !126, file: !20, line: 80, type: !12)
!142 = !DILocalVariable(name: "srcp", scope: !126, file: !20, line: 81, type: !12)
!143 = !DILocalVariable(name: "__nbytes", scope: !126, file: !20, line: 82, type: !46)
!144 = distinct !DISubprogram(name: "sha_wordcopy_fwd_aligned", scope: !20, file: !20, line: 135, type: !145, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !6, !6, !46}
!147 = !DILocalVariable(name: "dstp", arg: 1, scope: !144, file: !20, line: 135, type: !6)
!148 = !DILocation(line: 135, column: 41, scope: !144)
!149 = !DILocalVariable(name: "srcp", arg: 2, scope: !144, file: !20, line: 135, type: !6)
!150 = !DILocation(line: 135, column: 56, scope: !144)
!151 = !DILocalVariable(name: "len", arg: 3, scope: !144, file: !20, line: 135, type: !46)
!152 = !DILocation(line: 135, column: 69, scope: !144)
!153 = !DILocalVariable(name: "a0", scope: !144, file: !20, line: 137, type: !12)
!154 = !DILocation(line: 137, column: 8, scope: !144)
!155 = !DILocalVariable(name: "a1", scope: !144, file: !20, line: 138, type: !12)
!156 = !DILocation(line: 138, column: 8, scope: !144)
!157 = !DILocalVariable(name: "switch_target", scope: !144, file: !20, line: 139, type: !158)
!158 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!159 = !DILocation(line: 139, column: 8, scope: !144)
!160 = !DILocation(line: 141, column: 12, scope: !144)
!161 = !DILocation(line: 141, column: 16, scope: !144)
!162 = !DILocation(line: 141, column: 3, scope: !144)
!163 = !DILocation(line: 143, column: 25, scope: !164)
!164 = distinct !DILexicalBlock(scope: !144, file: !20, line: 141, column: 22)
!165 = !DILocation(line: 143, column: 14, scope: !164)
!166 = !DILocation(line: 143, column: 12, scope: !164)
!167 = !DILocation(line: 143, column: 10, scope: !164)
!168 = !DILocation(line: 144, column: 12, scope: !164)
!169 = !DILocation(line: 145, column: 12, scope: !164)
!170 = !DILocation(line: 146, column: 11, scope: !164)
!171 = !DILocation(line: 147, column: 21, scope: !164)
!172 = !DILocation(line: 148, column: 7, scope: !164)
!173 = !DILocation(line: 150, column: 25, scope: !164)
!174 = !DILocation(line: 150, column: 14, scope: !164)
!175 = !DILocation(line: 150, column: 12, scope: !164)
!176 = !DILocation(line: 150, column: 10, scope: !164)
!177 = !DILocation(line: 151, column: 12, scope: !164)
!178 = !DILocation(line: 152, column: 12, scope: !164)
!179 = !DILocation(line: 153, column: 11, scope: !164)
!180 = !DILocation(line: 154, column: 21, scope: !164)
!181 = !DILocation(line: 155, column: 7, scope: !164)
!182 = !DILocation(line: 157, column: 25, scope: !164)
!183 = !DILocation(line: 157, column: 14, scope: !164)
!184 = !DILocation(line: 157, column: 12, scope: !164)
!185 = !DILocation(line: 157, column: 10, scope: !164)
!186 = !DILocation(line: 158, column: 12, scope: !164)
!187 = !DILocation(line: 159, column: 12, scope: !164)
!188 = !DILocation(line: 160, column: 11, scope: !164)
!189 = !DILocation(line: 161, column: 21, scope: !164)
!190 = !DILocation(line: 162, column: 7, scope: !164)
!191 = !DILocation(line: 164, column: 25, scope: !164)
!192 = !DILocation(line: 164, column: 14, scope: !164)
!193 = !DILocation(line: 164, column: 12, scope: !164)
!194 = !DILocation(line: 164, column: 10, scope: !164)
!195 = !DILocation(line: 165, column: 12, scope: !164)
!196 = !DILocation(line: 166, column: 12, scope: !164)
!197 = !DILocation(line: 167, column: 11, scope: !164)
!198 = !DILocation(line: 168, column: 21, scope: !164)
!199 = !DILocation(line: 169, column: 7, scope: !164)
!200 = !DILocation(line: 171, column: 25, scope: !164)
!201 = !DILocation(line: 171, column: 14, scope: !164)
!202 = !DILocation(line: 171, column: 12, scope: !164)
!203 = !DILocation(line: 171, column: 10, scope: !164)
!204 = !DILocation(line: 172, column: 12, scope: !164)
!205 = !DILocation(line: 173, column: 12, scope: !164)
!206 = !DILocation(line: 174, column: 11, scope: !164)
!207 = !DILocation(line: 175, column: 21, scope: !164)
!208 = !DILocation(line: 176, column: 7, scope: !164)
!209 = !DILocation(line: 178, column: 25, scope: !164)
!210 = !DILocation(line: 178, column: 14, scope: !164)
!211 = !DILocation(line: 178, column: 12, scope: !164)
!212 = !DILocation(line: 178, column: 10, scope: !164)
!213 = !DILocation(line: 179, column: 12, scope: !164)
!214 = !DILocation(line: 180, column: 12, scope: !164)
!215 = !DILocation(line: 181, column: 11, scope: !164)
!216 = !DILocation(line: 182, column: 21, scope: !164)
!217 = !DILocation(line: 183, column: 7, scope: !164)
!218 = !DILocation(line: 185, column: 39, scope: !219)
!219 = distinct !DILexicalBlock(scope: !164, file: !20, line: 185, column: 12)
!220 = !DILocation(line: 185, column: 43, scope: !219)
!221 = !DILocation(line: 186, column: 9, scope: !219)
!222 = !DILocation(line: 187, column: 25, scope: !164)
!223 = !DILocation(line: 187, column: 14, scope: !164)
!224 = !DILocation(line: 187, column: 12, scope: !164)
!225 = !DILocation(line: 187, column: 10, scope: !164)
!226 = !DILocation(line: 188, column: 12, scope: !164)
!227 = !DILocation(line: 189, column: 12, scope: !164)
!228 = !DILocation(line: 190, column: 21, scope: !164)
!229 = !DILocation(line: 191, column: 7, scope: !164)
!230 = !DILocation(line: 193, column: 25, scope: !164)
!231 = !DILocation(line: 193, column: 14, scope: !164)
!232 = !DILocation(line: 193, column: 12, scope: !164)
!233 = !DILocation(line: 193, column: 10, scope: !164)
!234 = !DILocation(line: 194, column: 12, scope: !164)
!235 = !DILocation(line: 195, column: 12, scope: !164)
!236 = !DILocation(line: 196, column: 11, scope: !164)
!237 = !DILocation(line: 197, column: 39, scope: !238)
!238 = distinct !DILexicalBlock(scope: !164, file: !20, line: 197, column: 12)
!239 = !DILocation(line: 197, column: 43, scope: !238)
!240 = !DILocation(line: 197, column: 12, scope: !164)
!241 = !DILocation(line: 198, column: 36, scope: !242)
!242 = distinct !DILexicalBlock(scope: !238, file: !20, line: 197, column: 50)
!243 = !DILocation(line: 198, column: 22, scope: !242)
!244 = !DILocation(line: 198, column: 11, scope: !242)
!245 = !DILocation(line: 198, column: 9, scope: !242)
!246 = !DILocation(line: 198, column: 34, scope: !242)
!247 = !DILocation(line: 199, column: 9, scope: !242)
!248 = !DILocation(line: 201, column: 23, scope: !249)
!249 = distinct !DILexicalBlock(scope: !238, file: !20, line: 200, column: 14)
!250 = !DILocation(line: 202, column: 9, scope: !249)
!251 = !DILocation(line: 207, column: 3, scope: !144)
!252 = !DILocation(line: 208, column: 14, scope: !253)
!253 = distinct !DILexicalBlock(scope: !144, file: !20, line: 207, column: 6)
!254 = !DILocation(line: 208, column: 5, scope: !253)
!255 = !DILocation(line: 210, column: 27, scope: !256)
!256 = distinct !DILexicalBlock(scope: !253, file: !20, line: 208, column: 30)
!257 = !DILocation(line: 210, column: 16, scope: !256)
!258 = !DILocation(line: 210, column: 14, scope: !256)
!259 = !DILocation(line: 210, column: 12, scope: !256)
!260 = !DILocation(line: 211, column: 36, scope: !256)
!261 = !DILocation(line: 211, column: 22, scope: !256)
!262 = !DILocation(line: 211, column: 11, scope: !256)
!263 = !DILocation(line: 211, column: 9, scope: !256)
!264 = !DILocation(line: 211, column: 34, scope: !256)
!265 = !DILocation(line: 212, column: 9, scope: !256)
!266 = !DILocation(line: 214, column: 27, scope: !256)
!267 = !DILocation(line: 214, column: 16, scope: !256)
!268 = !DILocation(line: 214, column: 14, scope: !256)
!269 = !DILocation(line: 214, column: 12, scope: !256)
!270 = !DILocation(line: 215, column: 36, scope: !256)
!271 = !DILocation(line: 215, column: 22, scope: !256)
!272 = !DILocation(line: 215, column: 11, scope: !256)
!273 = !DILocation(line: 215, column: 9, scope: !256)
!274 = !DILocation(line: 215, column: 34, scope: !256)
!275 = !DILocation(line: 216, column: 9, scope: !256)
!276 = !DILocation(line: 218, column: 27, scope: !256)
!277 = !DILocation(line: 218, column: 16, scope: !256)
!278 = !DILocation(line: 218, column: 14, scope: !256)
!279 = !DILocation(line: 218, column: 12, scope: !256)
!280 = !DILocation(line: 219, column: 36, scope: !256)
!281 = !DILocation(line: 219, column: 22, scope: !256)
!282 = !DILocation(line: 219, column: 11, scope: !256)
!283 = !DILocation(line: 219, column: 9, scope: !256)
!284 = !DILocation(line: 219, column: 34, scope: !256)
!285 = !DILocation(line: 220, column: 9, scope: !256)
!286 = !DILocation(line: 222, column: 27, scope: !256)
!287 = !DILocation(line: 222, column: 16, scope: !256)
!288 = !DILocation(line: 222, column: 14, scope: !256)
!289 = !DILocation(line: 222, column: 12, scope: !256)
!290 = !DILocation(line: 223, column: 36, scope: !256)
!291 = !DILocation(line: 223, column: 22, scope: !256)
!292 = !DILocation(line: 223, column: 11, scope: !256)
!293 = !DILocation(line: 223, column: 9, scope: !256)
!294 = !DILocation(line: 223, column: 34, scope: !256)
!295 = !DILocation(line: 224, column: 9, scope: !256)
!296 = !DILocation(line: 226, column: 27, scope: !256)
!297 = !DILocation(line: 226, column: 16, scope: !256)
!298 = !DILocation(line: 226, column: 14, scope: !256)
!299 = !DILocation(line: 226, column: 12, scope: !256)
!300 = !DILocation(line: 227, column: 36, scope: !256)
!301 = !DILocation(line: 227, column: 22, scope: !256)
!302 = !DILocation(line: 227, column: 11, scope: !256)
!303 = !DILocation(line: 227, column: 9, scope: !256)
!304 = !DILocation(line: 227, column: 34, scope: !256)
!305 = !DILocation(line: 228, column: 9, scope: !256)
!306 = !DILocation(line: 230, column: 27, scope: !256)
!307 = !DILocation(line: 230, column: 16, scope: !256)
!308 = !DILocation(line: 230, column: 14, scope: !256)
!309 = !DILocation(line: 230, column: 12, scope: !256)
!310 = !DILocation(line: 231, column: 36, scope: !256)
!311 = !DILocation(line: 231, column: 22, scope: !256)
!312 = !DILocation(line: 231, column: 11, scope: !256)
!313 = !DILocation(line: 231, column: 9, scope: !256)
!314 = !DILocation(line: 231, column: 34, scope: !256)
!315 = !DILocation(line: 232, column: 9, scope: !256)
!316 = !DILocation(line: 234, column: 27, scope: !256)
!317 = !DILocation(line: 234, column: 16, scope: !256)
!318 = !DILocation(line: 234, column: 14, scope: !256)
!319 = !DILocation(line: 234, column: 12, scope: !256)
!320 = !DILocation(line: 235, column: 36, scope: !256)
!321 = !DILocation(line: 235, column: 22, scope: !256)
!322 = !DILocation(line: 235, column: 11, scope: !256)
!323 = !DILocation(line: 235, column: 9, scope: !256)
!324 = !DILocation(line: 235, column: 34, scope: !256)
!325 = !DILocation(line: 236, column: 9, scope: !256)
!326 = !DILocation(line: 238, column: 27, scope: !256)
!327 = !DILocation(line: 238, column: 16, scope: !256)
!328 = !DILocation(line: 238, column: 14, scope: !256)
!329 = !DILocation(line: 238, column: 12, scope: !256)
!330 = !DILocation(line: 239, column: 36, scope: !256)
!331 = !DILocation(line: 239, column: 22, scope: !256)
!332 = !DILocation(line: 239, column: 11, scope: !256)
!333 = !DILocation(line: 239, column: 9, scope: !256)
!334 = !DILocation(line: 239, column: 34, scope: !256)
!335 = !DILocation(line: 240, column: 9, scope: !256)
!336 = !DILocation(line: 243, column: 10, scope: !253)
!337 = !DILocation(line: 244, column: 10, scope: !253)
!338 = !DILocation(line: 245, column: 9, scope: !253)
!339 = !DILocation(line: 246, column: 19, scope: !253)
!340 = !DILocation(line: 247, column: 3, scope: !253)
!341 = !DILocation(line: 247, column: 13, scope: !144)
!342 = !DILocation(line: 247, column: 17, scope: !144)
!343 = distinct !{!343, !251, !344}
!344 = !DILocation(line: 247, column: 22, scope: !144)
!345 = !DILocation(line: 249, column: 30, scope: !144)
!346 = !DILocation(line: 249, column: 16, scope: !144)
!347 = !DILocation(line: 249, column: 5, scope: !144)
!348 = !DILocation(line: 249, column: 3, scope: !144)
!349 = !DILocation(line: 249, column: 28, scope: !144)
!350 = !DILocation(line: 250, column: 1, scope: !144)
!351 = !DILocalVariable(name: "dstp", arg: 1, scope: !352, file: !20, line: 135, type: !6)
!352 = distinct !DISubprogram(name: "sha_wordcopy_fwd_aligned", scope: !20, file: !20, line: 135, type: !145, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !353, retainedNodes: !4)
!353 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !354, nameTableKind: None)
!354 = !{!355, !357}
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "sha_data", scope: !353, file: !20, line: 25, type: !33, isLocal: false, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "sha_info", scope: !353, file: !20, line: 319, type: !359, isLocal: false, isDefinition: true)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SHA_INFO", file: !9, line: 42, size: 1472, elements: !360)
!360 = !{!361, !362, !363, !364}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !359, file: !9, line: 43, baseType: !24, size: 320)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "count_lo", scope: !359, file: !9, line: 44, baseType: !15, size: 64, offset: 320)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "count_hi", scope: !359, file: !9, line: 44, baseType: !15, size: 64, offset: 384)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !359, file: !9, line: 45, baseType: !30, size: 1024, offset: 448)
!365 = !DILocalVariable(name: "srcp", arg: 2, scope: !352, file: !20, line: 135, type: !6)
!366 = !DILocalVariable(name: "len", arg: 3, scope: !352, file: !20, line: 135, type: !46)
!367 = !DILocalVariable(name: "a0", scope: !352, file: !20, line: 137, type: !12)
!368 = !DILocalVariable(name: "a1", scope: !352, file: !20, line: 138, type: !12)
!369 = !DILocalVariable(name: "switch_target", scope: !352, file: !20, line: 139, type: !158)
!370 = distinct !DISubprogram(name: "sha_glibc_memset", scope: !20, file: !20, line: 252, type: !371, scopeLine: 253, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!371 = !DISubroutineType(types: !372)
!372 = !{!13, !13, !16, !46}
!373 = !DILocalVariable(name: "dstpp", arg: 1, scope: !370, file: !20, line: 252, type: !13)
!374 = !DILocation(line: 252, column: 31, scope: !370)
!375 = !DILocalVariable(name: "c", arg: 2, scope: !370, file: !20, line: 252, type: !16)
!376 = !DILocation(line: 252, column: 42, scope: !370)
!377 = !DILocalVariable(name: "len", arg: 3, scope: !370, file: !20, line: 252, type: !46)
!378 = !DILocation(line: 252, column: 52, scope: !370)
!379 = !DILocalVariable(name: "dstp", scope: !370, file: !20, line: 254, type: !6)
!380 = !DILocation(line: 254, column: 12, scope: !370)
!381 = !DILocation(line: 254, column: 32, scope: !370)
!382 = !DILocation(line: 254, column: 19, scope: !370)
!383 = !DILocation(line: 256, column: 8, scope: !384)
!384 = distinct !DILexicalBlock(scope: !370, file: !20, line: 256, column: 8)
!385 = !DILocation(line: 256, column: 12, scope: !384)
!386 = !DILocation(line: 256, column: 8, scope: !370)
!387 = !DILocalVariable(name: "xlen", scope: !388, file: !20, line: 257, type: !46)
!388 = distinct !DILexicalBlock(scope: !384, file: !20, line: 256, column: 19)
!389 = !DILocation(line: 257, column: 12, scope: !388)
!390 = !DILocalVariable(name: "cccc", scope: !388, file: !20, line: 258, type: !12)
!391 = !DILocation(line: 258, column: 10, scope: !388)
!392 = !DILocation(line: 260, column: 30, scope: !388)
!393 = !DILocation(line: 260, column: 12, scope: !388)
!394 = !DILocation(line: 260, column: 10, scope: !388)
!395 = !DILocation(line: 261, column: 13, scope: !388)
!396 = !DILocation(line: 261, column: 18, scope: !388)
!397 = !DILocation(line: 261, column: 10, scope: !388)
!398 = !DILocation(line: 262, column: 13, scope: !388)
!399 = !DILocation(line: 262, column: 18, scope: !388)
!400 = !DILocation(line: 262, column: 10, scope: !388)
!401 = !DILocation(line: 265, column: 17, scope: !402)
!402 = distinct !DILexicalBlock(scope: !388, file: !20, line: 263, column: 10)
!403 = !DILocation(line: 265, column: 22, scope: !402)
!404 = !DILocation(line: 265, column: 30, scope: !402)
!405 = !DILocation(line: 265, column: 12, scope: !402)
!406 = !DILocation(line: 270, column: 5, scope: !388)
!407 = !DILocation(line: 270, column: 13, scope: !388)
!408 = !DILocation(line: 270, column: 18, scope: !388)
!409 = !DILocation(line: 270, column: 26, scope: !388)
!410 = !DILocation(line: 271, column: 34, scope: !411)
!411 = distinct !DILexicalBlock(scope: !388, file: !20, line: 270, column: 33)
!412 = !DILocation(line: 271, column: 20, scope: !411)
!413 = !DILocation(line: 271, column: 9, scope: !411)
!414 = !DILocation(line: 271, column: 7, scope: !411)
!415 = !DILocation(line: 271, column: 32, scope: !411)
!416 = !DILocation(line: 272, column: 12, scope: !411)
!417 = !DILocation(line: 273, column: 11, scope: !411)
!418 = distinct !{!418, !406, !419}
!419 = !DILocation(line: 274, column: 5, scope: !388)
!420 = !DILocation(line: 277, column: 12, scope: !388)
!421 = !DILocation(line: 277, column: 16, scope: !388)
!422 = !DILocation(line: 277, column: 10, scope: !388)
!423 = !DILocation(line: 279, column: 5, scope: !388)
!424 = !DILocation(line: 279, column: 13, scope: !388)
!425 = !DILocation(line: 279, column: 18, scope: !388)
!426 = !DILocation(line: 280, column: 34, scope: !427)
!427 = distinct !DILexicalBlock(scope: !388, file: !20, line: 279, column: 24)
!428 = !DILocation(line: 280, column: 20, scope: !427)
!429 = !DILocation(line: 280, column: 9, scope: !427)
!430 = !DILocation(line: 280, column: 7, scope: !427)
!431 = !DILocation(line: 280, column: 32, scope: !427)
!432 = !DILocation(line: 281, column: 34, scope: !427)
!433 = !DILocation(line: 281, column: 20, scope: !427)
!434 = !DILocation(line: 281, column: 9, scope: !427)
!435 = !DILocation(line: 281, column: 7, scope: !427)
!436 = !DILocation(line: 281, column: 32, scope: !427)
!437 = !DILocation(line: 282, column: 34, scope: !427)
!438 = !DILocation(line: 282, column: 20, scope: !427)
!439 = !DILocation(line: 282, column: 9, scope: !427)
!440 = !DILocation(line: 282, column: 7, scope: !427)
!441 = !DILocation(line: 282, column: 32, scope: !427)
!442 = !DILocation(line: 283, column: 34, scope: !427)
!443 = !DILocation(line: 283, column: 20, scope: !427)
!444 = !DILocation(line: 283, column: 9, scope: !427)
!445 = !DILocation(line: 283, column: 7, scope: !427)
!446 = !DILocation(line: 283, column: 32, scope: !427)
!447 = !DILocation(line: 284, column: 34, scope: !427)
!448 = !DILocation(line: 284, column: 20, scope: !427)
!449 = !DILocation(line: 284, column: 9, scope: !427)
!450 = !DILocation(line: 284, column: 7, scope: !427)
!451 = !DILocation(line: 284, column: 32, scope: !427)
!452 = !DILocation(line: 285, column: 34, scope: !427)
!453 = !DILocation(line: 285, column: 20, scope: !427)
!454 = !DILocation(line: 285, column: 9, scope: !427)
!455 = !DILocation(line: 285, column: 7, scope: !427)
!456 = !DILocation(line: 285, column: 32, scope: !427)
!457 = !DILocation(line: 286, column: 34, scope: !427)
!458 = !DILocation(line: 286, column: 20, scope: !427)
!459 = !DILocation(line: 286, column: 9, scope: !427)
!460 = !DILocation(line: 286, column: 7, scope: !427)
!461 = !DILocation(line: 286, column: 32, scope: !427)
!462 = !DILocation(line: 287, column: 34, scope: !427)
!463 = !DILocation(line: 287, column: 20, scope: !427)
!464 = !DILocation(line: 287, column: 9, scope: !427)
!465 = !DILocation(line: 287, column: 7, scope: !427)
!466 = !DILocation(line: 287, column: 32, scope: !427)
!467 = !DILocation(line: 288, column: 12, scope: !427)
!468 = !DILocation(line: 289, column: 12, scope: !427)
!469 = distinct !{!469, !423, !470}
!470 = !DILocation(line: 290, column: 5, scope: !388)
!471 = !DILocation(line: 291, column: 9, scope: !388)
!472 = !DILocation(line: 294, column: 12, scope: !388)
!473 = !DILocation(line: 294, column: 16, scope: !388)
!474 = !DILocation(line: 294, column: 10, scope: !388)
!475 = !DILocation(line: 296, column: 5, scope: !388)
!476 = !DILocation(line: 296, column: 13, scope: !388)
!477 = !DILocation(line: 296, column: 18, scope: !388)
!478 = !DILocation(line: 297, column: 34, scope: !479)
!479 = distinct !DILexicalBlock(scope: !388, file: !20, line: 296, column: 24)
!480 = !DILocation(line: 297, column: 20, scope: !479)
!481 = !DILocation(line: 297, column: 9, scope: !479)
!482 = !DILocation(line: 297, column: 7, scope: !479)
!483 = !DILocation(line: 297, column: 32, scope: !479)
!484 = !DILocation(line: 298, column: 12, scope: !479)
!485 = !DILocation(line: 299, column: 12, scope: !479)
!486 = distinct !{!486, !475, !487}
!487 = !DILocation(line: 300, column: 5, scope: !388)
!488 = !DILocation(line: 301, column: 9, scope: !388)
!489 = !DILocation(line: 302, column: 3, scope: !388)
!490 = !DILocation(line: 306, column: 3, scope: !370)
!491 = !DILocation(line: 306, column: 11, scope: !370)
!492 = !DILocation(line: 306, column: 15, scope: !370)
!493 = !DILocation(line: 307, column: 32, scope: !494)
!494 = distinct !DILexicalBlock(scope: !370, file: !20, line: 306, column: 21)
!495 = !DILocation(line: 307, column: 18, scope: !494)
!496 = !DILocation(line: 307, column: 7, scope: !494)
!497 = !DILocation(line: 307, column: 5, scope: !494)
!498 = !DILocation(line: 307, column: 30, scope: !494)
!499 = !DILocation(line: 308, column: 10, scope: !494)
!500 = !DILocation(line: 309, column: 9, scope: !494)
!501 = distinct !{!501, !490, !502}
!502 = !DILocation(line: 310, column: 3, scope: !370)
!503 = !DILocation(line: 312, column: 20, scope: !370)
!504 = !DILocation(line: 312, column: 3, scope: !370)
!505 = !DILocalVariable(name: "dstpp", arg: 1, scope: !506, file: !20, line: 252, type: !13)
!506 = distinct !DISubprogram(name: "sha_glibc_memset", scope: !20, file: !20, line: 252, type: !371, scopeLine: 253, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !507, retainedNodes: !4)
!507 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !508, nameTableKind: None)
!508 = !{!509, !511}
!509 = !DIGlobalVariableExpression(var: !510, expr: !DIExpression())
!510 = distinct !DIGlobalVariable(name: "sha_data", scope: !507, file: !20, line: 25, type: !33, isLocal: false, isDefinition: true)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "sha_info", scope: !507, file: !20, line: 319, type: !513, isLocal: false, isDefinition: true)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SHA_INFO", file: !9, line: 42, size: 1472, elements: !514)
!514 = !{!515, !516, !517, !518}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !513, file: !9, line: 43, baseType: !24, size: 320)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "count_lo", scope: !513, file: !9, line: 44, baseType: !15, size: 64, offset: 320)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "count_hi", scope: !513, file: !9, line: 44, baseType: !15, size: 64, offset: 384)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !513, file: !9, line: 45, baseType: !30, size: 1024, offset: 448)
!519 = !DILocalVariable(name: "c", arg: 2, scope: !506, file: !20, line: 252, type: !16)
!520 = !DILocalVariable(name: "len", arg: 3, scope: !506, file: !20, line: 252, type: !46)
!521 = !DILocalVariable(name: "dstp", scope: !506, file: !20, line: 254, type: !6)
!522 = distinct !DISubprogram(name: "sha_transform", scope: !20, file: !20, line: 344, type: !523, scopeLine: 345, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!523 = !DISubroutineType(types: !524)
!524 = !{null, !525}
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!526 = !DILocalVariable(name: "sha_info", arg: 1, scope: !522, file: !20, line: 344, type: !525)
!527 = !DILocation(line: 344, column: 38, scope: !522)
!528 = !DILocalVariable(name: "i", scope: !522, file: !20, line: 346, type: !16)
!529 = !DILocation(line: 346, column: 7, scope: !522)
!530 = !DILocalVariable(name: "temp", scope: !522, file: !20, line: 347, type: !15)
!531 = !DILocation(line: 347, column: 8, scope: !522)
!532 = !DILocalVariable(name: "A", scope: !522, file: !20, line: 347, type: !15)
!533 = !DILocation(line: 347, column: 14, scope: !522)
!534 = !DILocalVariable(name: "B", scope: !522, file: !20, line: 347, type: !15)
!535 = !DILocation(line: 347, column: 17, scope: !522)
!536 = !DILocalVariable(name: "C", scope: !522, file: !20, line: 347, type: !15)
!537 = !DILocation(line: 347, column: 20, scope: !522)
!538 = !DILocalVariable(name: "D", scope: !522, file: !20, line: 347, type: !15)
!539 = !DILocation(line: 347, column: 23, scope: !522)
!540 = !DILocalVariable(name: "E", scope: !522, file: !20, line: 347, type: !15)
!541 = !DILocation(line: 347, column: 26, scope: !522)
!542 = !DILocalVariable(name: "W", scope: !522, file: !20, line: 347, type: !543)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 5120, elements: !544)
!544 = !{!545}
!545 = !DISubrange(count: 80)
!546 = !DILocation(line: 347, column: 29, scope: !522)
!547 = !DILocation(line: 350, column: 11, scope: !548)
!548 = distinct !DILexicalBlock(scope: !522, file: !20, line: 350, column: 3)
!549 = !DILocation(line: 350, column: 9, scope: !548)
!550 = !DILocation(line: 350, column: 16, scope: !551)
!551 = distinct !DILexicalBlock(scope: !548, file: !20, line: 350, column: 3)
!552 = !DILocation(line: 350, column: 18, scope: !551)
!553 = !DILocation(line: 350, column: 3, scope: !548)
!554 = !DILocation(line: 351, column: 14, scope: !551)
!555 = !DILocation(line: 351, column: 24, scope: !551)
!556 = !DILocation(line: 351, column: 30, scope: !551)
!557 = !DILocation(line: 351, column: 8, scope: !551)
!558 = !DILocation(line: 351, column: 5, scope: !551)
!559 = !DILocation(line: 351, column: 12, scope: !551)
!560 = !DILocation(line: 350, column: 24, scope: !551)
!561 = !DILocation(line: 350, column: 3, scope: !551)
!562 = distinct !{!562, !553, !563}
!563 = !DILocation(line: 351, column: 32, scope: !548)
!564 = !DILocation(line: 353, column: 11, scope: !565)
!565 = distinct !DILexicalBlock(scope: !522, file: !20, line: 353, column: 3)
!566 = !DILocation(line: 353, column: 9, scope: !565)
!567 = !DILocation(line: 353, column: 17, scope: !568)
!568 = distinct !DILexicalBlock(scope: !565, file: !20, line: 353, column: 3)
!569 = !DILocation(line: 353, column: 19, scope: !568)
!570 = !DILocation(line: 353, column: 3, scope: !565)
!571 = !DILocation(line: 354, column: 17, scope: !568)
!572 = !DILocation(line: 354, column: 19, scope: !568)
!573 = !DILocation(line: 354, column: 14, scope: !568)
!574 = !DILocation(line: 354, column: 30, scope: !568)
!575 = !DILocation(line: 354, column: 32, scope: !568)
!576 = !DILocation(line: 354, column: 27, scope: !568)
!577 = !DILocation(line: 354, column: 25, scope: !568)
!578 = !DILocation(line: 354, column: 43, scope: !568)
!579 = !DILocation(line: 354, column: 45, scope: !568)
!580 = !DILocation(line: 354, column: 40, scope: !568)
!581 = !DILocation(line: 354, column: 38, scope: !568)
!582 = !DILocation(line: 354, column: 57, scope: !568)
!583 = !DILocation(line: 354, column: 59, scope: !568)
!584 = !DILocation(line: 354, column: 54, scope: !568)
!585 = !DILocation(line: 354, column: 52, scope: !568)
!586 = !DILocation(line: 354, column: 8, scope: !568)
!587 = !DILocation(line: 354, column: 5, scope: !568)
!588 = !DILocation(line: 354, column: 12, scope: !568)
!589 = !DILocation(line: 353, column: 25, scope: !568)
!590 = !DILocation(line: 353, column: 3, scope: !568)
!591 = distinct !{!591, !570, !592}
!592 = !DILocation(line: 354, column: 64, scope: !565)
!593 = !DILocation(line: 356, column: 7, scope: !522)
!594 = !DILocation(line: 356, column: 17, scope: !522)
!595 = !DILocation(line: 356, column: 5, scope: !522)
!596 = !DILocation(line: 357, column: 7, scope: !522)
!597 = !DILocation(line: 357, column: 17, scope: !522)
!598 = !DILocation(line: 357, column: 5, scope: !522)
!599 = !DILocation(line: 358, column: 7, scope: !522)
!600 = !DILocation(line: 358, column: 17, scope: !522)
!601 = !DILocation(line: 358, column: 5, scope: !522)
!602 = !DILocation(line: 359, column: 7, scope: !522)
!603 = !DILocation(line: 359, column: 17, scope: !522)
!604 = !DILocation(line: 359, column: 5, scope: !522)
!605 = !DILocation(line: 360, column: 7, scope: !522)
!606 = !DILocation(line: 360, column: 17, scope: !522)
!607 = !DILocation(line: 360, column: 5, scope: !522)
!608 = !DILocation(line: 364, column: 11, scope: !609)
!609 = distinct !DILexicalBlock(scope: !522, file: !20, line: 364, column: 3)
!610 = !DILocation(line: 364, column: 9, scope: !609)
!611 = !DILocation(line: 364, column: 16, scope: !612)
!612 = distinct !DILexicalBlock(scope: !609, file: !20, line: 364, column: 3)
!613 = !DILocation(line: 364, column: 18, scope: !612)
!614 = !DILocation(line: 364, column: 3, scope: !609)
!615 = !DILocation(line: 365, column: 5, scope: !612)
!616 = !DILocation(line: 364, column: 24, scope: !612)
!617 = !DILocation(line: 364, column: 3, scope: !612)
!618 = distinct !{!618, !614, !619}
!619 = !DILocation(line: 365, column: 5, scope: !609)
!620 = !DILocation(line: 365, column: 5, scope: !522)
!621 = !DILocation(line: 367, column: 11, scope: !622)
!622 = distinct !DILexicalBlock(scope: !522, file: !20, line: 367, column: 3)
!623 = !DILocation(line: 367, column: 9, scope: !622)
!624 = !DILocation(line: 367, column: 17, scope: !625)
!625 = distinct !DILexicalBlock(scope: !622, file: !20, line: 367, column: 3)
!626 = !DILocation(line: 367, column: 19, scope: !625)
!627 = !DILocation(line: 367, column: 3, scope: !622)
!628 = !DILocation(line: 368, column: 5, scope: !625)
!629 = !DILocation(line: 367, column: 25, scope: !625)
!630 = !DILocation(line: 367, column: 3, scope: !625)
!631 = distinct !{!631, !627, !632}
!632 = !DILocation(line: 368, column: 5, scope: !622)
!633 = !DILocation(line: 368, column: 5, scope: !522)
!634 = !DILocation(line: 370, column: 11, scope: !635)
!635 = distinct !DILexicalBlock(scope: !522, file: !20, line: 370, column: 3)
!636 = !DILocation(line: 370, column: 9, scope: !635)
!637 = !DILocation(line: 370, column: 17, scope: !638)
!638 = distinct !DILexicalBlock(scope: !635, file: !20, line: 370, column: 3)
!639 = !DILocation(line: 370, column: 19, scope: !638)
!640 = !DILocation(line: 370, column: 3, scope: !635)
!641 = !DILocation(line: 371, column: 5, scope: !638)
!642 = !DILocation(line: 370, column: 25, scope: !638)
!643 = !DILocation(line: 370, column: 3, scope: !638)
!644 = distinct !{!644, !640, !645}
!645 = !DILocation(line: 371, column: 5, scope: !635)
!646 = !DILocation(line: 371, column: 5, scope: !522)
!647 = !DILocation(line: 373, column: 11, scope: !648)
!648 = distinct !DILexicalBlock(scope: !522, file: !20, line: 373, column: 3)
!649 = !DILocation(line: 373, column: 9, scope: !648)
!650 = !DILocation(line: 373, column: 17, scope: !651)
!651 = distinct !DILexicalBlock(scope: !648, file: !20, line: 373, column: 3)
!652 = !DILocation(line: 373, column: 19, scope: !651)
!653 = !DILocation(line: 373, column: 3, scope: !648)
!654 = !DILocation(line: 374, column: 5, scope: !651)
!655 = !DILocation(line: 373, column: 25, scope: !651)
!656 = !DILocation(line: 373, column: 3, scope: !651)
!657 = distinct !{!657, !653, !658}
!658 = !DILocation(line: 374, column: 5, scope: !648)
!659 = !DILocation(line: 374, column: 5, scope: !522)
!660 = !DILocation(line: 375, column: 28, scope: !522)
!661 = !DILocation(line: 375, column: 3, scope: !522)
!662 = !DILocation(line: 375, column: 13, scope: !522)
!663 = !DILocation(line: 375, column: 25, scope: !522)
!664 = !DILocation(line: 376, column: 28, scope: !522)
!665 = !DILocation(line: 376, column: 3, scope: !522)
!666 = !DILocation(line: 376, column: 13, scope: !522)
!667 = !DILocation(line: 376, column: 25, scope: !522)
!668 = !DILocation(line: 377, column: 28, scope: !522)
!669 = !DILocation(line: 377, column: 3, scope: !522)
!670 = !DILocation(line: 377, column: 13, scope: !522)
!671 = !DILocation(line: 377, column: 25, scope: !522)
!672 = !DILocation(line: 378, column: 28, scope: !522)
!673 = !DILocation(line: 378, column: 3, scope: !522)
!674 = !DILocation(line: 378, column: 13, scope: !522)
!675 = !DILocation(line: 378, column: 25, scope: !522)
!676 = !DILocation(line: 379, column: 28, scope: !522)
!677 = !DILocation(line: 379, column: 3, scope: !522)
!678 = !DILocation(line: 379, column: 13, scope: !522)
!679 = !DILocation(line: 379, column: 25, scope: !522)
!680 = !DILocation(line: 380, column: 1, scope: !522)
!681 = !DILocalVariable(name: "sha_info", arg: 1, scope: !682, file: !20, line: 344, type: !685)
!682 = distinct !DISubprogram(name: "sha_transform", scope: !20, file: !20, line: 344, type: !683, scopeLine: 345, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !692, retainedNodes: !4)
!683 = !DISubroutineType(types: !684)
!684 = !{null, !685}
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SHA_INFO", file: !9, line: 42, size: 1472, elements: !687)
!687 = !{!688, !689, !690, !691}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !686, file: !9, line: 43, baseType: !24, size: 320)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "count_lo", scope: !686, file: !9, line: 44, baseType: !15, size: 64, offset: 320)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "count_hi", scope: !686, file: !9, line: 44, baseType: !15, size: 64, offset: 384)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !686, file: !9, line: 45, baseType: !30, size: 1024, offset: 448)
!692 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !693, nameTableKind: None)
!693 = !{!694, !696}
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(name: "sha_data", scope: !692, file: !20, line: 25, type: !33, isLocal: false, isDefinition: true)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(name: "sha_info", scope: !692, file: !20, line: 319, type: !686, isLocal: false, isDefinition: true)
!698 = !DILocalVariable(name: "i", scope: !682, file: !20, line: 346, type: !16)
!699 = !DILocalVariable(name: "temp", scope: !682, file: !20, line: 347, type: !15)
!700 = !DILocalVariable(name: "A", scope: !682, file: !20, line: 347, type: !15)
!701 = !DILocalVariable(name: "B", scope: !682, file: !20, line: 347, type: !15)
!702 = !DILocalVariable(name: "C", scope: !682, file: !20, line: 347, type: !15)
!703 = !DILocalVariable(name: "D", scope: !682, file: !20, line: 347, type: !15)
!704 = !DILocalVariable(name: "E", scope: !682, file: !20, line: 347, type: !15)
!705 = !DILocalVariable(name: "W", scope: !682, file: !20, line: 347, type: !543)
!706 = distinct !DISubprogram(name: "sha_byte_reverse", scope: !20, file: !20, line: 384, type: !707, scopeLine: 385, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!707 = !DISubroutineType(types: !708)
!708 = !{null, !709, !16}
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!710 = !DILocalVariable(name: "buffer", arg: 1, scope: !706, file: !20, line: 384, type: !709)
!711 = !DILocation(line: 384, column: 30, scope: !706)
!712 = !DILocalVariable(name: "count", arg: 2, scope: !706, file: !20, line: 384, type: !16)
!713 = !DILocation(line: 384, column: 42, scope: !706)
!714 = !DILocalVariable(name: "i", scope: !706, file: !20, line: 386, type: !16)
!715 = !DILocation(line: 386, column: 7, scope: !706)
!716 = !DILocalVariable(name: "ct", scope: !706, file: !20, line: 387, type: !717)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !718)
!718 = !{!719}
!719 = !DISubrange(count: 4)
!720 = !DILocation(line: 387, column: 8, scope: !706)
!721 = !DILocalVariable(name: "cp", scope: !706, file: !20, line: 387, type: !7)
!722 = !DILocation(line: 387, column: 18, scope: !706)
!723 = !DILocation(line: 389, column: 9, scope: !706)
!724 = !DILocation(line: 390, column: 19, scope: !706)
!725 = !DILocation(line: 390, column: 8, scope: !706)
!726 = !DILocation(line: 390, column: 6, scope: !706)
!727 = !DILocation(line: 392, column: 11, scope: !728)
!728 = distinct !DILexicalBlock(scope: !706, file: !20, line: 392, column: 3)
!729 = !DILocation(line: 392, column: 9, scope: !728)
!730 = !DILocation(line: 392, column: 16, scope: !731)
!731 = distinct !DILexicalBlock(scope: !728, file: !20, line: 392, column: 3)
!732 = !DILocation(line: 392, column: 20, scope: !731)
!733 = !DILocation(line: 392, column: 18, scope: !731)
!734 = !DILocation(line: 392, column: 3, scope: !728)
!735 = !DILocation(line: 393, column: 15, scope: !736)
!736 = distinct !DILexicalBlock(scope: !731, file: !20, line: 392, column: 33)
!737 = !DILocation(line: 393, column: 5, scope: !736)
!738 = !DILocation(line: 393, column: 13, scope: !736)
!739 = !DILocation(line: 394, column: 15, scope: !736)
!740 = !DILocation(line: 394, column: 5, scope: !736)
!741 = !DILocation(line: 394, column: 13, scope: !736)
!742 = !DILocation(line: 395, column: 15, scope: !736)
!743 = !DILocation(line: 395, column: 5, scope: !736)
!744 = !DILocation(line: 395, column: 13, scope: !736)
!745 = !DILocation(line: 396, column: 15, scope: !736)
!746 = !DILocation(line: 396, column: 5, scope: !736)
!747 = !DILocation(line: 396, column: 13, scope: !736)
!748 = !DILocation(line: 397, column: 15, scope: !736)
!749 = !DILocation(line: 397, column: 5, scope: !736)
!750 = !DILocation(line: 397, column: 13, scope: !736)
!751 = !DILocation(line: 398, column: 15, scope: !736)
!752 = !DILocation(line: 398, column: 5, scope: !736)
!753 = !DILocation(line: 398, column: 13, scope: !736)
!754 = !DILocation(line: 399, column: 15, scope: !736)
!755 = !DILocation(line: 399, column: 5, scope: !736)
!756 = !DILocation(line: 399, column: 13, scope: !736)
!757 = !DILocation(line: 400, column: 15, scope: !736)
!758 = !DILocation(line: 400, column: 5, scope: !736)
!759 = !DILocation(line: 400, column: 13, scope: !736)
!760 = !DILocation(line: 401, column: 8, scope: !736)
!761 = !DILocation(line: 402, column: 3, scope: !736)
!762 = !DILocation(line: 392, column: 27, scope: !731)
!763 = !DILocation(line: 392, column: 3, scope: !731)
!764 = distinct !{!764, !734, !765}
!765 = !DILocation(line: 402, column: 3, scope: !728)
!766 = !DILocation(line: 403, column: 1, scope: !706)
!767 = !DILocalVariable(name: "buffer", arg: 1, scope: !768, file: !20, line: 384, type: !709)
!768 = distinct !DISubprogram(name: "sha_byte_reverse", scope: !20, file: !20, line: 384, type: !707, scopeLine: 385, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !769, retainedNodes: !4)
!769 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !770, nameTableKind: None)
!770 = !{!771, !773}
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(name: "sha_data", scope: !769, file: !20, line: 25, type: !33, isLocal: false, isDefinition: true)
!773 = !DIGlobalVariableExpression(var: !774, expr: !DIExpression())
!774 = distinct !DIGlobalVariable(name: "sha_info", scope: !769, file: !20, line: 319, type: !775, isLocal: false, isDefinition: true)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SHA_INFO", file: !9, line: 42, size: 1472, elements: !776)
!776 = !{!777, !778, !779, !780}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !775, file: !9, line: 43, baseType: !24, size: 320)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "count_lo", scope: !775, file: !9, line: 44, baseType: !15, size: 64, offset: 320)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "count_hi", scope: !775, file: !9, line: 44, baseType: !15, size: 64, offset: 384)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !775, file: !9, line: 45, baseType: !30, size: 1024, offset: 448)
!781 = !DILocalVariable(name: "count", arg: 2, scope: !768, file: !20, line: 384, type: !16)
!782 = !DILocalVariable(name: "i", scope: !768, file: !20, line: 386, type: !16)
!783 = !DILocalVariable(name: "ct", scope: !768, file: !20, line: 387, type: !717)
!784 = !DILocalVariable(name: "cp", scope: !768, file: !20, line: 387, type: !7)
!785 = distinct !DISubprogram(name: "sha_init", scope: !20, file: !20, line: 406, type: !786, scopeLine: 407, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!786 = !DISubroutineType(types: !787)
!787 = !{null}
!788 = !DILocalVariable(name: "i", scope: !785, file: !20, line: 408, type: !16)
!789 = !DILocation(line: 408, column: 7, scope: !785)
!790 = !DILocation(line: 409, column: 24, scope: !785)
!791 = !DILocation(line: 410, column: 24, scope: !785)
!792 = !DILocation(line: 411, column: 24, scope: !785)
!793 = !DILocation(line: 412, column: 24, scope: !785)
!794 = !DILocation(line: 413, column: 24, scope: !785)
!795 = !DILocation(line: 414, column: 21, scope: !785)
!796 = !DILocation(line: 415, column: 21, scope: !785)
!797 = !DILocation(line: 416, column: 11, scope: !798)
!798 = distinct !DILexicalBlock(scope: !785, file: !20, line: 416, column: 3)
!799 = !DILocation(line: 416, column: 9, scope: !798)
!800 = !DILocation(line: 416, column: 16, scope: !801)
!801 = distinct !DILexicalBlock(scope: !798, file: !20, line: 416, column: 3)
!802 = !DILocation(line: 416, column: 18, scope: !801)
!803 = !DILocation(line: 416, column: 3, scope: !798)
!804 = !DILocation(line: 417, column: 20, scope: !801)
!805 = !DILocation(line: 417, column: 5, scope: !801)
!806 = !DILocation(line: 417, column: 24, scope: !801)
!807 = !DILocation(line: 416, column: 25, scope: !801)
!808 = !DILocation(line: 416, column: 3, scope: !801)
!809 = distinct !{!809, !803, !810}
!810 = !DILocation(line: 417, column: 26, scope: !798)
!811 = !DILocation(line: 418, column: 1, scope: !785)
!812 = !DILocalVariable(name: "i", scope: !813, file: !20, line: 408, type: !16)
!813 = distinct !DISubprogram(name: "sha_init", scope: !20, file: !20, line: 406, type: !786, scopeLine: 407, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !814, retainedNodes: !4)
!814 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !815, nameTableKind: None)
!815 = !{!816, !818}
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(name: "sha_data", scope: !814, file: !20, line: 25, type: !33, isLocal: false, isDefinition: true)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(name: "sha_info", scope: !814, file: !20, line: 319, type: !820, isLocal: false, isDefinition: true)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SHA_INFO", file: !9, line: 42, size: 1472, elements: !821)
!821 = !{!822, !823, !824, !825}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !820, file: !9, line: 43, baseType: !24, size: 320)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "count_lo", scope: !820, file: !9, line: 44, baseType: !15, size: 64, offset: 320)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "count_hi", scope: !820, file: !9, line: 44, baseType: !15, size: 64, offset: 384)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !820, file: !9, line: 45, baseType: !30, size: 1024, offset: 448)
!826 = distinct !DISubprogram(name: "sha_fread", scope: !20, file: !20, line: 420, type: !827, scopeLine: 422, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!827 = !DISubroutineType(types: !828)
!828 = !{!46, !13, !46, !46, !829}
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SHA_MY_FILE", file: !9, line: 36, size: 128, elements: !831)
!831 = !{!832, !834, !835}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !830, file: !9, line: 37, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !830, file: !9, line: 38, baseType: !46, size: 32, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "cur_pos", scope: !830, file: !9, line: 39, baseType: !47, size: 32, offset: 96)
!836 = !DILocalVariable(name: "ptr", arg: 1, scope: !826, file: !20, line: 420, type: !13)
!837 = !DILocation(line: 420, column: 25, scope: !826)
!838 = !DILocalVariable(name: "size", arg: 2, scope: !826, file: !20, line: 420, type: !46)
!839 = !DILocation(line: 420, column: 37, scope: !826)
!840 = !DILocalVariable(name: "count", arg: 3, scope: !826, file: !20, line: 420, type: !46)
!841 = !DILocation(line: 420, column: 50, scope: !826)
!842 = !DILocalVariable(name: "stream", arg: 4, scope: !826, file: !20, line: 421, type: !829)
!843 = !DILocation(line: 421, column: 39, scope: !826)
!844 = !DILocalVariable(name: "i", scope: !826, file: !20, line: 423, type: !47)
!845 = !DILocation(line: 423, column: 12, scope: !826)
!846 = !DILocation(line: 423, column: 16, scope: !826)
!847 = !DILocation(line: 423, column: 24, scope: !826)
!848 = !DILocalVariable(name: "i2", scope: !826, file: !20, line: 423, type: !47)
!849 = !DILocation(line: 423, column: 33, scope: !826)
!850 = !DILocalVariable(name: "number_of_chars_to_read", scope: !826, file: !20, line: 424, type: !46)
!851 = !DILocation(line: 424, column: 10, scope: !826)
!852 = !DILocation(line: 425, column: 5, scope: !826)
!853 = !DILocation(line: 425, column: 13, scope: !826)
!854 = !DILocation(line: 425, column: 20, scope: !826)
!855 = !DILocation(line: 425, column: 28, scope: !826)
!856 = !DILocation(line: 425, column: 18, scope: !826)
!857 = !DILocation(line: 425, column: 39, scope: !826)
!858 = !DILocation(line: 425, column: 46, scope: !826)
!859 = !DILocation(line: 425, column: 44, scope: !826)
!860 = !DILocation(line: 425, column: 36, scope: !826)
!861 = !DILocation(line: 426, column: 5, scope: !826)
!862 = !DILocation(line: 426, column: 12, scope: !826)
!863 = !DILocation(line: 426, column: 10, scope: !826)
!864 = !DILocation(line: 426, column: 20, scope: !826)
!865 = !DILocation(line: 426, column: 28, scope: !826)
!866 = !DILocation(line: 426, column: 35, scope: !826)
!867 = !DILocation(line: 426, column: 43, scope: !826)
!868 = !DILocation(line: 426, column: 33, scope: !826)
!869 = !DILocation(line: 428, column: 3, scope: !826)
!870 = !DILocation(line: 428, column: 11, scope: !826)
!871 = !DILocation(line: 428, column: 15, scope: !826)
!872 = !DILocation(line: 428, column: 23, scope: !826)
!873 = !DILocation(line: 428, column: 33, scope: !826)
!874 = !DILocation(line: 428, column: 31, scope: !826)
!875 = !DILocation(line: 428, column: 13, scope: !826)
!876 = !DILocation(line: 429, column: 42, scope: !826)
!877 = !DILocation(line: 429, column: 50, scope: !826)
!878 = !DILocation(line: 429, column: 57, scope: !826)
!879 = !DILocation(line: 429, column: 26, scope: !826)
!880 = !DILocation(line: 429, column: 35, scope: !826)
!881 = !DILocation(line: 429, column: 5, scope: !826)
!882 = !DILocation(line: 429, column: 40, scope: !826)
!883 = distinct !{!883, !869, !884}
!884 = !DILocation(line: 429, column: 60, scope: !826)
!885 = !DILocation(line: 430, column: 22, scope: !826)
!886 = !DILocation(line: 430, column: 3, scope: !826)
!887 = !DILocation(line: 430, column: 11, scope: !826)
!888 = !DILocation(line: 430, column: 19, scope: !826)
!889 = !DILocation(line: 431, column: 12, scope: !826)
!890 = !DILocation(line: 431, column: 3, scope: !826)
!891 = !DILocalVariable(name: "ptr", arg: 1, scope: !892, file: !20, line: 420, type: !13)
!892 = distinct !DISubprogram(name: "sha_fread", scope: !20, file: !20, line: 420, type: !893, scopeLine: 422, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !901, retainedNodes: !4)
!893 = !DISubroutineType(types: !894)
!894 = !{!46, !13, !46, !46, !895}
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SHA_MY_FILE", file: !9, line: 36, size: 128, elements: !897)
!897 = !{!898, !899, !900}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !896, file: !9, line: 37, baseType: !833, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !896, file: !9, line: 38, baseType: !46, size: 32, offset: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "cur_pos", scope: !896, file: !9, line: 39, baseType: !47, size: 32, offset: 96)
!901 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !902, nameTableKind: None)
!902 = !{!903, !905}
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(name: "sha_data", scope: !901, file: !20, line: 25, type: !33, isLocal: false, isDefinition: true)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(name: "sha_info", scope: !901, file: !20, line: 319, type: !907, isLocal: false, isDefinition: true)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SHA_INFO", file: !9, line: 42, size: 1472, elements: !908)
!908 = !{!909, !910, !911, !912}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !907, file: !9, line: 43, baseType: !24, size: 320)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "count_lo", scope: !907, file: !9, line: 44, baseType: !15, size: 64, offset: 320)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "count_hi", scope: !907, file: !9, line: 44, baseType: !15, size: 64, offset: 384)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !907, file: !9, line: 45, baseType: !30, size: 1024, offset: 448)
!913 = !DILocalVariable(name: "size", arg: 2, scope: !892, file: !20, line: 420, type: !46)
!914 = !DILocalVariable(name: "count", arg: 3, scope: !892, file: !20, line: 420, type: !46)
!915 = !DILocalVariable(name: "stream", arg: 4, scope: !892, file: !20, line: 421, type: !895)
!916 = !DILocalVariable(name: "i", scope: !892, file: !20, line: 423, type: !47)
!917 = !DILocalVariable(name: "i2", scope: !892, file: !20, line: 423, type: !47)
!918 = !DILocalVariable(name: "number_of_chars_to_read", scope: !892, file: !20, line: 424, type: !46)
!919 = distinct !DISubprogram(name: "sha_update", scope: !20, file: !20, line: 435, type: !920, scopeLine: 436, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!920 = !DISubroutineType(types: !921)
!921 = !{null, !525, !7, !16}
!922 = !DILocalVariable(name: "sha_info", arg: 1, scope: !919, file: !20, line: 435, type: !525)
!923 = !DILocation(line: 435, column: 35, scope: !919)
!924 = !DILocalVariable(name: "buffer", arg: 2, scope: !919, file: !20, line: 435, type: !7)
!925 = !DILocation(line: 435, column: 51, scope: !919)
!926 = !DILocalVariable(name: "count", arg: 3, scope: !919, file: !20, line: 435, type: !16)
!927 = !DILocation(line: 435, column: 63, scope: !919)
!928 = !DILocation(line: 437, column: 10, scope: !929)
!929 = distinct !DILexicalBlock(scope: !919, file: !20, line: 437, column: 8)
!930 = !DILocation(line: 437, column: 20, scope: !929)
!931 = !DILocation(line: 437, column: 42, scope: !929)
!932 = !DILocation(line: 437, column: 33, scope: !929)
!933 = !DILocation(line: 437, column: 48, scope: !929)
!934 = !DILocation(line: 437, column: 29, scope: !929)
!935 = !DILocation(line: 437, column: 59, scope: !929)
!936 = !DILocation(line: 437, column: 69, scope: !929)
!937 = !DILocation(line: 437, column: 57, scope: !929)
!938 = !DILocation(line: 437, column: 8, scope: !919)
!939 = !DILocation(line: 438, column: 7, scope: !929)
!940 = !DILocation(line: 438, column: 17, scope: !929)
!941 = !DILocation(line: 438, column: 5, scope: !929)
!942 = !DILocation(line: 439, column: 34, scope: !919)
!943 = !DILocation(line: 439, column: 25, scope: !919)
!944 = !DILocation(line: 439, column: 40, scope: !919)
!945 = !DILocation(line: 439, column: 3, scope: !919)
!946 = !DILocation(line: 439, column: 13, scope: !919)
!947 = !DILocation(line: 439, column: 22, scope: !919)
!948 = !DILocation(line: 440, column: 34, scope: !919)
!949 = !DILocation(line: 440, column: 25, scope: !919)
!950 = !DILocation(line: 440, column: 40, scope: !919)
!951 = !DILocation(line: 440, column: 3, scope: !919)
!952 = !DILocation(line: 440, column: 13, scope: !919)
!953 = !DILocation(line: 440, column: 22, scope: !919)
!954 = !DILocation(line: 442, column: 3, scope: !919)
!955 = !DILocation(line: 442, column: 11, scope: !919)
!956 = !DILocation(line: 442, column: 17, scope: !919)
!957 = !DILocation(line: 443, column: 23, scope: !958)
!958 = distinct !DILexicalBlock(scope: !919, file: !20, line: 442, column: 36)
!959 = !DILocation(line: 443, column: 33, scope: !958)
!960 = !DILocation(line: 443, column: 39, scope: !958)
!961 = !DILocation(line: 443, column: 5, scope: !958)
!962 = !DILocation(line: 444, column: 23, scope: !958)
!963 = !DILocation(line: 444, column: 33, scope: !958)
!964 = !DILocation(line: 444, column: 5, scope: !958)
!965 = !DILocation(line: 445, column: 20, scope: !958)
!966 = !DILocation(line: 445, column: 5, scope: !958)
!967 = !DILocation(line: 446, column: 12, scope: !958)
!968 = !DILocation(line: 447, column: 11, scope: !958)
!969 = distinct !{!969, !954, !970}
!970 = !DILocation(line: 448, column: 3, scope: !919)
!971 = !DILocation(line: 450, column: 21, scope: !919)
!972 = !DILocation(line: 450, column: 31, scope: !919)
!973 = !DILocation(line: 450, column: 37, scope: !919)
!974 = !DILocation(line: 450, column: 45, scope: !919)
!975 = !DILocation(line: 450, column: 3, scope: !919)
!976 = !DILocation(line: 451, column: 1, scope: !919)
!977 = !DILocalVariable(name: "sha_info", arg: 1, scope: !978, file: !20, line: 435, type: !981)
!978 = distinct !DISubprogram(name: "sha_update", scope: !20, file: !20, line: 435, type: !979, scopeLine: 436, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !988, retainedNodes: !4)
!979 = !DISubroutineType(types: !980)
!980 = !{null, !981, !7, !16}
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SHA_INFO", file: !9, line: 42, size: 1472, elements: !983)
!983 = !{!984, !985, !986, !987}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !982, file: !9, line: 43, baseType: !24, size: 320)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "count_lo", scope: !982, file: !9, line: 44, baseType: !15, size: 64, offset: 320)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "count_hi", scope: !982, file: !9, line: 44, baseType: !15, size: 64, offset: 384)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !982, file: !9, line: 45, baseType: !30, size: 1024, offset: 448)
!988 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !989, nameTableKind: None)
!989 = !{!990, !992}
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(name: "sha_data", scope: !988, file: !20, line: 25, type: !33, isLocal: false, isDefinition: true)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(name: "sha_info", scope: !988, file: !20, line: 319, type: !982, isLocal: false, isDefinition: true)
!994 = !DILocalVariable(name: "buffer", arg: 2, scope: !978, file: !20, line: 435, type: !7)
!995 = !DILocalVariable(name: "count", arg: 3, scope: !978, file: !20, line: 435, type: !16)
!996 = distinct !DISubprogram(name: "sha_final", scope: !20, file: !20, line: 454, type: !523, scopeLine: 455, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!997 = !DILocalVariable(name: "sha_info", arg: 1, scope: !996, file: !20, line: 454, type: !525)
!998 = !DILocation(line: 454, column: 34, scope: !996)
!999 = !DILocalVariable(name: "count", scope: !996, file: !20, line: 456, type: !16)
!1000 = !DILocation(line: 456, column: 7, scope: !996)
!1001 = !DILocalVariable(name: "lo_bit_count", scope: !996, file: !20, line: 457, type: !15)
!1002 = !DILocation(line: 457, column: 8, scope: !996)
!1003 = !DILocalVariable(name: "hi_bit_count", scope: !996, file: !20, line: 457, type: !15)
!1004 = !DILocation(line: 457, column: 22, scope: !996)
!1005 = !DILocation(line: 459, column: 18, scope: !996)
!1006 = !DILocation(line: 459, column: 28, scope: !996)
!1007 = !DILocation(line: 459, column: 16, scope: !996)
!1008 = !DILocation(line: 460, column: 18, scope: !996)
!1009 = !DILocation(line: 460, column: 28, scope: !996)
!1010 = !DILocation(line: 460, column: 16, scope: !996)
!1011 = !DILocation(line: 461, column: 23, scope: !996)
!1012 = !DILocation(line: 461, column: 36, scope: !996)
!1013 = !DILocation(line: 461, column: 43, scope: !996)
!1014 = !DILocation(line: 461, column: 11, scope: !996)
!1015 = !DILocation(line: 461, column: 9, scope: !996)
!1016 = !DILocation(line: 462, column: 16, scope: !996)
!1017 = !DILocation(line: 462, column: 26, scope: !996)
!1018 = !DILocation(line: 462, column: 3, scope: !996)
!1019 = !DILocation(line: 462, column: 39, scope: !996)
!1020 = !DILocation(line: 462, column: 44, scope: !996)
!1021 = !DILocation(line: 463, column: 8, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !996, file: !20, line: 463, column: 8)
!1023 = !DILocation(line: 463, column: 14, scope: !1022)
!1024 = !DILocation(line: 463, column: 8, scope: !996)
!1025 = !DILocation(line: 464, column: 35, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1022, file: !20, line: 463, column: 21)
!1027 = !DILocation(line: 464, column: 45, scope: !1026)
!1028 = !DILocation(line: 464, column: 23, scope: !1026)
!1029 = !DILocation(line: 464, column: 52, scope: !1026)
!1030 = !DILocation(line: 464, column: 50, scope: !1026)
!1031 = !DILocation(line: 464, column: 67, scope: !1026)
!1032 = !DILocation(line: 464, column: 65, scope: !1026)
!1033 = !DILocation(line: 464, column: 5, scope: !1026)
!1034 = !DILocation(line: 465, column: 23, scope: !1026)
!1035 = !DILocation(line: 465, column: 33, scope: !1026)
!1036 = !DILocation(line: 465, column: 5, scope: !1026)
!1037 = !DILocation(line: 466, column: 20, scope: !1026)
!1038 = !DILocation(line: 466, column: 5, scope: !1026)
!1039 = !DILocation(line: 467, column: 24, scope: !1026)
!1040 = !DILocation(line: 467, column: 34, scope: !1026)
!1041 = !DILocation(line: 467, column: 23, scope: !1026)
!1042 = !DILocation(line: 467, column: 5, scope: !1026)
!1043 = !DILocation(line: 468, column: 3, scope: !1026)
!1044 = !DILocation(line: 469, column: 35, scope: !1022)
!1045 = !DILocation(line: 469, column: 45, scope: !1022)
!1046 = !DILocation(line: 469, column: 23, scope: !1022)
!1047 = !DILocation(line: 469, column: 52, scope: !1022)
!1048 = !DILocation(line: 469, column: 50, scope: !1022)
!1049 = !DILocation(line: 469, column: 67, scope: !1022)
!1050 = !DILocation(line: 469, column: 65, scope: !1022)
!1051 = !DILocation(line: 469, column: 5, scope: !1022)
!1052 = !DILocation(line: 471, column: 21, scope: !996)
!1053 = !DILocation(line: 471, column: 31, scope: !996)
!1054 = !DILocation(line: 471, column: 3, scope: !996)
!1055 = !DILocation(line: 472, column: 26, scope: !996)
!1056 = !DILocation(line: 472, column: 3, scope: !996)
!1057 = !DILocation(line: 472, column: 13, scope: !996)
!1058 = !DILocation(line: 472, column: 24, scope: !996)
!1059 = !DILocation(line: 473, column: 26, scope: !996)
!1060 = !DILocation(line: 473, column: 3, scope: !996)
!1061 = !DILocation(line: 473, column: 13, scope: !996)
!1062 = !DILocation(line: 473, column: 24, scope: !996)
!1063 = !DILocation(line: 474, column: 18, scope: !996)
!1064 = !DILocation(line: 474, column: 3, scope: !996)
!1065 = !DILocation(line: 475, column: 1, scope: !996)
!1066 = !DILocalVariable(name: "sha_info", arg: 1, scope: !1067, file: !20, line: 454, type: !1070)
!1067 = distinct !DISubprogram(name: "sha_final", scope: !20, file: !20, line: 454, type: !1068, scopeLine: 455, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1077, retainedNodes: !4)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{null, !1070}
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SHA_INFO", file: !9, line: 42, size: 1472, elements: !1072)
!1072 = !{!1073, !1074, !1075, !1076}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !1071, file: !9, line: 43, baseType: !24, size: 320)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "count_lo", scope: !1071, file: !9, line: 44, baseType: !15, size: 64, offset: 320)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "count_hi", scope: !1071, file: !9, line: 44, baseType: !15, size: 64, offset: 384)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1071, file: !9, line: 45, baseType: !30, size: 1024, offset: 448)
!1077 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !1078, nameTableKind: None)
!1078 = !{!1079, !1081}
!1079 = !DIGlobalVariableExpression(var: !1080, expr: !DIExpression())
!1080 = distinct !DIGlobalVariable(name: "sha_data", scope: !1077, file: !20, line: 25, type: !33, isLocal: false, isDefinition: true)
!1081 = !DIGlobalVariableExpression(var: !1082, expr: !DIExpression())
!1082 = distinct !DIGlobalVariable(name: "sha_info", scope: !1077, file: !20, line: 319, type: !1071, isLocal: false, isDefinition: true)
!1083 = !DILocalVariable(name: "count", scope: !1067, file: !20, line: 456, type: !16)
!1084 = !DILocalVariable(name: "lo_bit_count", scope: !1067, file: !20, line: 457, type: !15)
!1085 = !DILocalVariable(name: "hi_bit_count", scope: !1067, file: !20, line: 457, type: !15)
!1086 = distinct !DISubprogram(name: "sha_stream", scope: !20, file: !20, line: 479, type: !1087, scopeLine: 480, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{null, !525, !829}
!1089 = !DILocalVariable(name: "sha_info", arg: 1, scope: !1086, file: !20, line: 479, type: !525)
!1090 = !DILocation(line: 479, column: 35, scope: !1086)
!1091 = !DILocalVariable(name: "fin", arg: 2, scope: !1086, file: !20, line: 479, type: !829)
!1092 = !DILocation(line: 479, column: 65, scope: !1086)
!1093 = !DILocalVariable(name: "i", scope: !1086, file: !20, line: 481, type: !16)
!1094 = !DILocation(line: 481, column: 7, scope: !1086)
!1095 = !DILocalVariable(name: "data", scope: !1086, file: !20, line: 482, type: !1096)
!1096 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 65536, elements: !1097)
!1097 = !{!1098}
!1098 = !DISubrange(count: 8192)
!1099 = !DILocation(line: 482, column: 8, scope: !1086)
!1100 = !DILocation(line: 484, column: 3, scope: !1086)
!1101 = !DILocation(line: 484, column: 28, scope: !1086)
!1102 = !DILocation(line: 484, column: 49, scope: !1086)
!1103 = !DILocation(line: 484, column: 17, scope: !1086)
!1104 = !DILocation(line: 484, column: 15, scope: !1086)
!1105 = !DILocation(line: 484, column: 57, scope: !1086)
!1106 = !DILocation(line: 485, column: 17, scope: !1086)
!1107 = !DILocation(line: 485, column: 27, scope: !1086)
!1108 = !DILocation(line: 485, column: 33, scope: !1086)
!1109 = !DILocation(line: 485, column: 5, scope: !1086)
!1110 = distinct !{!1110, !1100, !1111}
!1111 = !DILocation(line: 485, column: 35, scope: !1086)
!1112 = !DILocation(line: 487, column: 14, scope: !1086)
!1113 = !DILocation(line: 487, column: 3, scope: !1086)
!1114 = !DILocation(line: 488, column: 1, scope: !1086)
!1115 = !DILocalVariable(name: "sha_info", arg: 1, scope: !1116, file: !20, line: 479, type: !1119)
!1116 = distinct !DISubprogram(name: "sha_stream", scope: !20, file: !20, line: 479, type: !1117, scopeLine: 480, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1132, retainedNodes: !4)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{null, !1119, !1126}
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SHA_INFO", file: !9, line: 42, size: 1472, elements: !1121)
!1121 = !{!1122, !1123, !1124, !1125}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !1120, file: !9, line: 43, baseType: !24, size: 320)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "count_lo", scope: !1120, file: !9, line: 44, baseType: !15, size: 64, offset: 320)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "count_hi", scope: !1120, file: !9, line: 44, baseType: !15, size: 64, offset: 384)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1120, file: !9, line: 45, baseType: !30, size: 1024, offset: 448)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SHA_MY_FILE", file: !9, line: 36, size: 128, elements: !1128)
!1128 = !{!1129, !1130, !1131}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1127, file: !9, line: 37, baseType: !833, size: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1127, file: !9, line: 38, baseType: !46, size: 32, offset: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "cur_pos", scope: !1127, file: !9, line: 39, baseType: !47, size: 32, offset: 96)
!1132 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !1133, nameTableKind: None)
!1133 = !{!1134, !1136}
!1134 = !DIGlobalVariableExpression(var: !1135, expr: !DIExpression())
!1135 = distinct !DIGlobalVariable(name: "sha_data", scope: !1132, file: !20, line: 25, type: !33, isLocal: false, isDefinition: true)
!1136 = !DIGlobalVariableExpression(var: !1137, expr: !DIExpression())
!1137 = distinct !DIGlobalVariable(name: "sha_info", scope: !1132, file: !20, line: 319, type: !1120, isLocal: false, isDefinition: true)
!1138 = !DILocalVariable(name: "fin", arg: 2, scope: !1116, file: !20, line: 479, type: !1126)
!1139 = !DILocalVariable(name: "i", scope: !1116, file: !20, line: 481, type: !16)
!1140 = !DILocalVariable(name: "data", scope: !1116, file: !20, line: 482, type: !1096)
!1141 = distinct !DISubprogram(name: "sha_main", scope: !20, file: !20, line: 490, type: !786, scopeLine: 491, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1142 = !DILocalVariable(name: "fin", scope: !1141, file: !20, line: 492, type: !830)
!1143 = !DILocation(line: 492, column: 22, scope: !1141)
!1144 = !DILocation(line: 493, column: 7, scope: !1141)
!1145 = !DILocation(line: 493, column: 12, scope: !1141)
!1146 = !DILocation(line: 494, column: 7, scope: !1141)
!1147 = !DILocation(line: 494, column: 12, scope: !1141)
!1148 = !DILocation(line: 495, column: 7, scope: !1141)
!1149 = !DILocation(line: 495, column: 15, scope: !1141)
!1150 = !DILocation(line: 496, column: 3, scope: !1141)
!1151 = !DILocation(line: 497, column: 1, scope: !1141)
!1152 = !DILocalVariable(name: "fin", scope: !1153, file: !20, line: 492, type: !1166)
!1153 = distinct !DISubprogram(name: "sha_main", scope: !20, file: !20, line: 490, type: !786, scopeLine: 491, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1154, retainedNodes: !4)
!1154 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !1155, nameTableKind: None)
!1155 = !{!1156, !1158}
!1156 = !DIGlobalVariableExpression(var: !1157, expr: !DIExpression())
!1157 = distinct !DIGlobalVariable(name: "sha_data", scope: !1154, file: !20, line: 25, type: !33, isLocal: false, isDefinition: true)
!1158 = !DIGlobalVariableExpression(var: !1159, expr: !DIExpression())
!1159 = distinct !DIGlobalVariable(name: "sha_info", scope: !1154, file: !20, line: 319, type: !1160, isLocal: false, isDefinition: true)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SHA_INFO", file: !9, line: 42, size: 1472, elements: !1161)
!1161 = !{!1162, !1163, !1164, !1165}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !1160, file: !9, line: 43, baseType: !24, size: 320)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "count_lo", scope: !1160, file: !9, line: 44, baseType: !15, size: 64, offset: 320)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "count_hi", scope: !1160, file: !9, line: 44, baseType: !15, size: 64, offset: 384)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1160, file: !9, line: 45, baseType: !30, size: 1024, offset: 448)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SHA_MY_FILE", file: !9, line: 36, size: 128, elements: !1167)
!1167 = !{!1168, !1169, !1170}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1166, file: !9, line: 37, baseType: !833, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1166, file: !9, line: 38, baseType: !46, size: 32, offset: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "cur_pos", scope: !1166, file: !9, line: 39, baseType: !47, size: 32, offset: 96)
!1171 = distinct !DISubprogram(name: "sha_return", scope: !20, file: !20, line: 499, type: !1172, scopeLine: 500, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{!16}
!1174 = !DILocalVariable(name: "sum", scope: !1171, file: !20, line: 501, type: !16)
!1175 = !DILocation(line: 501, column: 7, scope: !1171)
!1176 = !DILocation(line: 502, column: 9, scope: !1171)
!1177 = !DILocation(line: 502, column: 31, scope: !1171)
!1178 = !DILocation(line: 502, column: 29, scope: !1171)
!1179 = !DILocation(line: 502, column: 7, scope: !1171)
!1180 = !DILocation(line: 503, column: 12, scope: !1171)
!1181 = !DILocation(line: 503, column: 16, scope: !1171)
!1182 = !DILocation(line: 503, column: 25, scope: !1171)
!1183 = !DILocation(line: 503, column: 3, scope: !1171)
!1184 = !DILocalVariable(name: "sum", scope: !1185, file: !20, line: 501, type: !16)
!1185 = distinct !DISubprogram(name: "sha_return", scope: !20, file: !20, line: 499, type: !1172, scopeLine: 500, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1186, retainedNodes: !4)
!1186 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !1187, nameTableKind: None)
!1187 = !{!1188, !1190}
!1188 = !DIGlobalVariableExpression(var: !1189, expr: !DIExpression())
!1189 = distinct !DIGlobalVariable(name: "sha_data", scope: !1186, file: !20, line: 25, type: !33, isLocal: false, isDefinition: true)
!1190 = !DIGlobalVariableExpression(var: !1191, expr: !DIExpression())
!1191 = distinct !DIGlobalVariable(name: "sha_info", scope: !1186, file: !20, line: 319, type: !1192, isLocal: false, isDefinition: true)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SHA_INFO", file: !9, line: 42, size: 1472, elements: !1193)
!1193 = !{!1194, !1195, !1196, !1197}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !1192, file: !9, line: 43, baseType: !24, size: 320)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "count_lo", scope: !1192, file: !9, line: 44, baseType: !15, size: 64, offset: 320)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "count_hi", scope: !1192, file: !9, line: 44, baseType: !15, size: 64, offset: 384)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1192, file: !9, line: 45, baseType: !30, size: 1024, offset: 448)
!1198 = distinct !DISubprogram(name: "main", scope: !20, file: !20, line: 506, type: !1199, scopeLine: 507, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1199 = !DISubroutineType(types: !1200)
!1200 = !{!16, !16, !1201}
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!1203 = !DILocalVariable(name: "argc", arg: 1, scope: !1198, file: !20, line: 506, type: !16)
!1204 = !DILocation(line: 506, column: 16, scope: !1198)
!1205 = !DILocalVariable(name: "argv", arg: 2, scope: !1198, file: !20, line: 506, type: !1201)
!1206 = !DILocation(line: 506, column: 29, scope: !1198)
!1207 = !DILocation(line: 508, column: 3, scope: !1198)
!1208 = !DILocation(line: 509, column: 3, scope: !1198)
!1209 = !DILocation(line: 510, column: 12, scope: !1198)
!1210 = !DILocation(line: 510, column: 3, scope: !1198)
!1211 = !DILocalVariable(name: "argc", arg: 1, scope: !1212, file: !20, line: 506, type: !16)
!1212 = distinct !DISubprogram(name: "main", scope: !20, file: !20, line: 506, type: !1199, scopeLine: 507, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1213, retainedNodes: !4)
!1213 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !1214, nameTableKind: None)
!1214 = !{!1215, !1217}
!1215 = !DIGlobalVariableExpression(var: !1216, expr: !DIExpression())
!1216 = distinct !DIGlobalVariable(name: "sha_data", scope: !1213, file: !20, line: 25, type: !33, isLocal: false, isDefinition: true)
!1217 = !DIGlobalVariableExpression(var: !1218, expr: !DIExpression())
!1218 = distinct !DIGlobalVariable(name: "sha_info", scope: !1213, file: !20, line: 319, type: !1219, isLocal: false, isDefinition: true)
!1219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SHA_INFO", file: !9, line: 42, size: 1472, elements: !1220)
!1220 = !{!1221, !1222, !1223, !1224}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !1219, file: !9, line: 43, baseType: !24, size: 320)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "count_lo", scope: !1219, file: !9, line: 44, baseType: !15, size: 64, offset: 320)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "count_hi", scope: !1219, file: !9, line: 44, baseType: !15, size: 64, offset: 384)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1219, file: !9, line: 45, baseType: !30, size: 1024, offset: 448)
!1225 = !DILocalVariable(name: "argv", arg: 2, scope: !1212, file: !20, line: 506, type: !1201)
