; ModuleID = 'datedir/date-O1-inserted.ll'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@stderr = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@.str.261 = private unnamed_addr constant [56 x i8] c"A NULL argv[0] was passed through an exec system call.\0A\00", align 1
@inVal0 = local_unnamed_addr global i32 0
@inVal1 = local_unnamed_addr global i8** null

; Function Attrs: nounwind uwtable
define dso_local i32 @main(i32, i8**) local_unnamed_addr #0 {
  store i8** %1, i8*** @inVal1, align 8
  store i32 %0, i32* @inVal0, align 4
  call void @llvm.dbg.value(metadata i32 %0, metadata !453, metadata !DIExpression()), !dbg !454
  call void @llvm.dbg.value(metadata i8** %1, metadata !455, metadata !DIExpression()), !dbg !454
  call void @llvm.dbg.value(metadata i8* null, metadata !456, metadata !DIExpression()), !dbg !454
  call void @llvm.dbg.value(metadata i8* null, metadata !457, metadata !DIExpression()), !dbg !454
  call void @llvm.dbg.value(metadata i8 0, metadata !458, metadata !DIExpression()), !dbg !454

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !11, globals: !17, nameTableKind: None)
!1 = !DIFile(filename: "src/date.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Time_spec", file: !1, line: 44, baseType: !4, size: 32, elements: !5)
!4 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "TIME_SPEC_DATE", value: 0, isUnsigned: true)
!7 = !DIEnumerator(name: "TIME_SPEC_SECONDS", value: 1, isUnsigned: true)
!8 = !DIEnumerator(name: "TIME_SPEC_NS", value: 2, isUnsigned: true)
!9 = !DIEnumerator(name: "TIME_SPEC_HOURS", value: 3, isUnsigned: true)
!10 = !DIEnumerator(name: "TIME_SPEC_MINUTES", value: 4, isUnsigned: true)
!11 = !{!12, !14, !16}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!17 = !{!18, !31, !36, !38, !43, !58, !63, !69}
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "rfc_3339_format", scope: !20, file: !1, line: 388, type: !26, isLocal: true, isDefinition: true)
!20 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 348, type: !21, scopeLine: 349, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !25)
!21 = !DISubroutineType(types: !22)
!22 = !{!23, !23, !24}
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!25 = !{}
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 768, elements: !28)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!28 = !{!29, !30}
!29 = !DISubrange(count: 3)
!30 = !DISubrange(count: 32)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "iso_8601_format", scope: !20, file: !1, line: 402, type: !33, isLocal: true, isDefinition: true)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 1280, elements: !34)
!34 = !{!35, !30}
!35 = !DISubrange(count: 5)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "parse_datetime_flags", scope: !0, file: !1, line: 109, type: !4, isLocal: true, isDefinition: true)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "short_options", scope: !0, file: !1, line: 86, type: !40, isLocal: true, isDefinition: true)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 112, elements: !41)
!41 = !{!42}
!42 = !DISubrange(count: 14)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "long_options", scope: !0, file: !1, line: 88, type: !45, isLocal: true, isDefinition: true)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 4096, elements: !56)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !48, line: 50, size: 256, elements: !49)
!48 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "")
!49 = !{!50, !52, !53, !55}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !47, file: !48, line: 52, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !47, file: !48, line: 55, baseType: !23, size: 32, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !47, file: !48, line: 56, baseType: !54, size: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !47, file: !48, line: 57, baseType: !23, size: 32, offset: 192)
!56 = !{!57}
!57 = !DISubrange(count: 16)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "time_spec", scope: !0, file: !1, line: 68, type: !60, isLocal: true, isDefinition: true)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 160, elements: !62)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!62 = !{!35}
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "time_spec_string", scope: !0, file: !1, line: 61, type: !65, isLocal: true, isDefinition: true)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 384, elements: !67)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!67 = !{!68}
!68 = !DISubrange(count: 6)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "rfc_email_format", scope: !0, file: !1, line: 76, type: !71, isLocal: true, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 200, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 25)
!74 = distinct !DICompileUnit(language: DW_LANG_C99, file: !75, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, globals: !76, nameTableKind: None)
!75 = !DIFile(filename: "src/version.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!76 = !{!77}
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "Version", scope: !74, file: !75, line: 2, type: !51, isLocal: false, isDefinition: true)
!79 = distinct !DICompileUnit(language: DW_LANG_C99, file: !80, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, retainedTypes: !81, globals: !82, nameTableKind: None)
!80 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!81 = !{!16, !51}
!82 = !{!83}
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !79, file: !85, line: 67, type: !86, isLocal: false, isDefinition: true)
!85 = !DIFile(filename: "lib/argmatch.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !87, line: 61, baseType: !88)
!87 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{null}
!91 = distinct !DICompileUnit(language: DW_LANG_C99, file: !92, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, globals: !93, nameTableKind: None)
!92 = !DIFile(filename: "./lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!93 = !{!94, !97}
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "file_name", scope: !91, file: !96, line: 46, type: !51, isLocal: true, isDefinition: true)
!96 = !DIFile(filename: "lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !91, file: !96, line: 56, type: !99, isLocal: true, isDefinition: true)
!99 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!100 = distinct !DICompileUnit(language: DW_LANG_C99, file: !101, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, globals: !102, nameTableKind: None)
!101 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!102 = !{!103}
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "exit_failure", scope: !100, file: !105, line: 24, type: !106, isLocal: false, isDefinition: true)
!105 = !DIFile(filename: "lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!106 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !23)
!107 = distinct !DICompileUnit(language: DW_LANG_C99, file: !108, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, retainedTypes: !109, nameTableKind: None)
!108 = !DIFile(filename: "./lib/fprintftime.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!109 = !{!110, !51, !4, !23, !113, !114, !115, !116, !117, !112, !118, !119}
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !111, line: 46, baseType: !112)
!111 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.1/include/stddef.h", directory: "")
!112 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!113 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!114 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!115 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!116 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!117 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!118 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!119 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!120 = distinct !DICompileUnit(language: DW_LANG_C99, file: !121, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, nameTableKind: None)
!121 = !DIFile(filename: "./lib/gettime.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!122 = distinct !DICompileUnit(language: DW_LANG_C99, file: !123, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, retainedTypes: !124, nameTableKind: None)
!123 = !DIFile(filename: "./lib/imaxtostr.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!124 = !{!125}
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !126, line: 101, baseType: !127)
!126 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !128, line: 72, baseType: !117)
!128 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!129 = distinct !DICompileUnit(language: DW_LANG_C99, file: !130, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, retainedTypes: !131, globals: !173, nameTableKind: None)
!130 = !DIFile(filename: "./lib/parse-datetime.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!131 = !{!132, !112, !134, !4, !125, !113, !114, !115, !116, !23, !117, !118, !119, !171}
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_int16", file: !133, line: 748, baseType: !115)
!133 = !DIFile(filename: "parse-datetime.tab.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "yyalloc", file: !133, line: 898, size: 448, elements: !136)
!136 = !{!137, !138}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "yyss_alloc", scope: !135, file: !133, line: 900, baseType: !132, size: 16)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "yyvs_alloc", scope: !135, file: !133, line: 901, baseType: !139, size: 448)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "YYSTYPE", file: !133, line: 710, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "YYSTYPE", file: !133, line: 698, size: 448, elements: !141)
!141 = !{!142, !144, !152, !160}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "intval", scope: !140, file: !143, line: 577, baseType: !125, size: 64)
!143 = !DIFile(filename: "parse-datetime.y", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!144 = !DIDerivedType(tag: DW_TAG_member, name: "textintval", scope: !140, file: !143, line: 578, baseType: !145, size: 192)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "textint", file: !143, line: 156, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !143, line: 151, size: 192, elements: !147)
!147 = !{!148, !149, !150}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "negative", scope: !146, file: !143, line: 153, baseType: !99, size: 8)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !146, file: !143, line: 154, baseType: !125, size: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "digits", scope: !146, file: !143, line: 155, baseType: !151, size: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !111, line: 35, baseType: !117)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "timespec", scope: !140, file: !143, line: 579, baseType: !153, size: 128)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !154, line: 10, size: 128, elements: !155)
!154 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!155 = !{!156, !158}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !153, file: !154, line: 12, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !128, line: 160, baseType: !117)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !153, file: !154, line: 16, baseType: !159, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !128, line: 196, baseType: !117)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "rel", scope: !140, file: !143, line: 580, baseType: !161, size: 448)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "relative_time", file: !143, line: 185, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !143, line: 175, size: 448, elements: !163)
!163 = !{!164, !165, !166, !167, !168, !169, !170}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !162, file: !143, line: 178, baseType: !125, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !162, file: !143, line: 179, baseType: !125, size: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !162, file: !143, line: 180, baseType: !125, size: 64, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !162, file: !143, line: 181, baseType: !125, size: 64, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !162, file: !143, line: 182, baseType: !125, size: 64, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !162, file: !143, line: 183, baseType: !125, size: 64, offset: 320)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !162, file: !143, line: 184, baseType: !23, size: 32, offset: 384)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !172, line: 7, baseType: !157)
!172 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!173 = !{!174, !222, !229, !236, !241, !244, !247, !252, !254, !259, !261, !263, !267, !270, !275, !280, !285, !290, !295, !298, !305}
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "yyval_default", scope: !176, file: !133, line: 1647, type: !139, isLocal: true, isDefinition: true)
!176 = distinct !DISubprogram(name: "yyparse", scope: !133, file: !133, line: 1638, type: !177, scopeLine: 1639, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !129, retainedNodes: !25)
!177 = !DISubroutineType(types: !178)
!178 = !{!23, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "parser_control", file: !143, line: 252, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !143, line: 194, size: 2240, elements: !182)
!182 = !{!183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !181, file: !143, line: 197, baseType: !51, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "day_ordinal", scope: !181, file: !143, line: 200, baseType: !125, size: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "day_number", scope: !181, file: !143, line: 203, baseType: !23, size: 32, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "local_isdst", scope: !181, file: !143, line: 206, baseType: !23, size: 32, offset: 160)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "time_zone", scope: !181, file: !143, line: 209, baseType: !23, size: 32, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "meridian", scope: !181, file: !143, line: 212, baseType: !23, size: 32, offset: 224)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !181, file: !143, line: 215, baseType: !145, size: 192, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !181, file: !143, line: 216, baseType: !125, size: 64, offset: 448)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !181, file: !143, line: 217, baseType: !125, size: 64, offset: 512)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !181, file: !143, line: 218, baseType: !125, size: 64, offset: 576)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !181, file: !143, line: 219, baseType: !125, size: 64, offset: 640)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !181, file: !143, line: 220, baseType: !153, size: 128, offset: 704)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "rel", scope: !181, file: !143, line: 223, baseType: !161, size: 448, offset: 832)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "timespec_seen", scope: !181, file: !143, line: 226, baseType: !99, size: 8, offset: 1280)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "rels_seen", scope: !181, file: !143, line: 227, baseType: !99, size: 8, offset: 1288)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "dates_seen", scope: !181, file: !143, line: 228, baseType: !151, size: 64, offset: 1344)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "days_seen", scope: !181, file: !143, line: 229, baseType: !151, size: 64, offset: 1408)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "local_zones_seen", scope: !181, file: !143, line: 230, baseType: !151, size: 64, offset: 1472)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "dsts_seen", scope: !181, file: !143, line: 231, baseType: !151, size: 64, offset: 1536)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "times_seen", scope: !181, file: !143, line: 232, baseType: !151, size: 64, offset: 1600)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "zones_seen", scope: !181, file: !143, line: 233, baseType: !151, size: 64, offset: 1664)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "year_seen", scope: !181, file: !143, line: 234, baseType: !99, size: 8, offset: 1728)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "parse_datetime_debug", scope: !181, file: !143, line: 237, baseType: !99, size: 8, offset: 1736)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "debug_dates_seen", scope: !181, file: !143, line: 240, baseType: !99, size: 8, offset: 1744)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "debug_days_seen", scope: !181, file: !143, line: 241, baseType: !99, size: 8, offset: 1752)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "debug_local_zones_seen", scope: !181, file: !143, line: 242, baseType: !99, size: 8, offset: 1760)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "debug_times_seen", scope: !181, file: !143, line: 243, baseType: !99, size: 8, offset: 1768)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "debug_zones_seen", scope: !181, file: !143, line: 244, baseType: !99, size: 8, offset: 1776)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "debug_year_seen", scope: !181, file: !143, line: 245, baseType: !99, size: 8, offset: 1784)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "debug_ordinal_day_seen", scope: !181, file: !143, line: 248, baseType: !99, size: 8, offset: 1792)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "local_time_zone_table", scope: !181, file: !143, line: 251, baseType: !214, size: 384, offset: 1856)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 384, elements: !221)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "table", file: !143, line: 164, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !143, line: 159, size: 128, elements: !217)
!217 = !{!218, !219, !220}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !216, file: !143, line: 161, baseType: !51, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !216, file: !143, line: 162, baseType: !23, size: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !216, file: !143, line: 163, baseType: !23, size: 32, offset: 96)
!221 = !{!29}
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "yypact", scope: !129, file: !133, line: 1067, type: !224, isLocal: true, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 912, elements: !227)
!225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_int8", file: !133, line: 736, baseType: !113)
!227 = !{!228}
!228 = !DISubrange(count: 114)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "yytranslate", scope: !129, file: !133, line: 977, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 2224, elements: !234)
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_uint8", file: !133, line: 730, baseType: !114)
!234 = !{!235}
!235 = !DISubrange(count: 278)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "yycheck", scope: !129, file: !133, line: 1137, type: !238, isLocal: true, isDefinition: true)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 904, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 113)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "yytable", scope: !129, file: !133, line: 1121, type: !243, isLocal: true, isDefinition: true)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 904, elements: !239)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "yydefact", scope: !129, file: !133, line: 1086, type: !246, isLocal: true, isDefinition: true)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 912, elements: !227)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "yyr2", scope: !129, file: !133, line: 1187, type: !249, isLocal: true, isDefinition: true)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 736, elements: !250)
!250 = !{!251}
!251 = !DISubrange(count: 92)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "yyr1", scope: !129, file: !133, line: 1172, type: !249, isLocal: true, isDefinition: true)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "yypgoto", scope: !129, file: !133, line: 1103, type: !256, isLocal: true, isDefinition: true)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 208, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 26)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "yydefgoto", scope: !129, file: !133, line: 1111, type: !256, isLocal: true, isDefinition: true)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "yystos", scope: !129, file: !133, line: 1155, type: !246, isLocal: true, isDefinition: true)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "meridian_table", scope: !129, file: !143, line: 1008, type: !265, isLocal: true, isDefinition: true)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 640, elements: !62)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !215)
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "month_and_day_table", scope: !129, file: !143, line: 1022, type: !269, isLocal: true, isDefinition: true)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 3200, elements: !72)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "universal_time_zone_table", scope: !129, file: !143, line: 1096, type: !272, isLocal: true, isDefinition: true)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 512, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 4)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "time_zone_table", scope: !129, file: !143, line: 1109, type: !277, isLocal: true, isDefinition: true)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 6144, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 48)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "dst_table", scope: !129, file: !143, line: 1017, type: !282, isLocal: true, isDefinition: true)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 128, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 1)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "time_units_table", scope: !129, file: !143, line: 1051, type: !287, isLocal: true, isDefinition: true)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 1408, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 11)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "relative_time_table", scope: !129, file: !143, line: 1067, type: !292, isLocal: true, isDefinition: true)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 2688, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 21)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "military_table", scope: !129, file: !143, line: 1168, type: !297, isLocal: true, isDefinition: true)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 3328, elements: !257)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "ordinal_values", scope: !300, file: !143, line: 343, type: !303, isLocal: true, isDefinition: true)
!300 = distinct !DISubprogram(name: "str_days", scope: !143, file: !143, line: 340, type: !301, scopeLine: 341, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !129, retainedNodes: !25)
!301 = !DISubroutineType(types: !302)
!302 = !{!51, !179, !14, !23}
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 1232, elements: !304)
!304 = !{!42, !289}
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "days_values", scope: !300, file: !143, line: 360, type: !307, isLocal: true, isDefinition: true)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 224, elements: !308)
!308 = !{!309, !274}
!309 = !DISubrange(count: 7)
!310 = distinct !DICompileUnit(language: DW_LANG_C99, file: !311, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, retainedTypes: !312, nameTableKind: None)
!311 = !DIFile(filename: "./lib/posixtm.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!312 = !{!4}
!313 = distinct !DICompileUnit(language: DW_LANG_C99, file: !314, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, retainedTypes: !315, globals: !316, nameTableKind: None)
!314 = !DIFile(filename: "./lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!315 = !{!16, !14}
!316 = !{!317}
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "program_name", scope: !313, file: !319, line: 33, type: !51, isLocal: false, isDefinition: true)
!319 = !DIFile(filename: "lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!320 = distinct !DICompileUnit(language: DW_LANG_C99, file: !321, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !322, retainedTypes: !337, globals: !338, nameTableKind: None)
!321 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!322 = !{!323}
!323 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !324, line: 32, baseType: !4, size: 32, elements: !325)
!324 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!325 = !{!326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336}
!326 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!327 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!328 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!329 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!330 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!331 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!332 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!333 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!334 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!335 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!336 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!337 = !{!23, !116, !110}
!338 = !{!339, !343, !349, !361, !363, !368, !375, !377}
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !320, file: !341, line: 85, type: !342, isLocal: false, isDefinition: true)
!341 = !DIFile(filename: "lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 704, elements: !288)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !320, file: !341, line: 101, type: !345, isLocal: false, isDefinition: true)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !346, size: 320, elements: !347)
!346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !323)
!347 = !{!348}
!348 = !DISubrange(count: 10)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !320, file: !341, line: 1052, type: !351, isLocal: false, isDefinition: true)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !341, line: 65, size: 448, elements: !352)
!352 = !{!353, !354, !355, !359, !360}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !351, file: !341, line: 68, baseType: !323, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !351, file: !341, line: 71, baseType: !23, size: 32, offset: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !351, file: !341, line: 75, baseType: !356, size: 256, offset: 64)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 8)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !351, file: !341, line: 78, baseType: !51, size: 64, offset: 320)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !351, file: !341, line: 81, baseType: !51, size: 64, offset: 384)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !320, file: !341, line: 116, type: !351, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "slot0", scope: !320, file: !341, line: 842, type: !365, isLocal: true, isDefinition: true)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 2048, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 256)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "slotvec", scope: !320, file: !341, line: 845, type: !370, isLocal: true, isDefinition: true)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !341, line: 834, size: 128, elements: !372)
!372 = !{!373, !374}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !371, file: !341, line: 836, baseType: !110, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !371, file: !341, line: 837, baseType: !14, size: 64, offset: 64)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "nslots", scope: !320, file: !341, line: 843, type: !23, isLocal: true, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "slotvec0", scope: !320, file: !341, line: 844, type: !371, isLocal: true, isDefinition: true)
!379 = distinct !DICompileUnit(language: DW_LANG_C99, file: !380, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, nameTableKind: None)
!380 = !DIFile(filename: "./lib/settime.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!381 = distinct !DICompileUnit(language: DW_LANG_C99, file: !382, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, nameTableKind: None)
!382 = !DIFile(filename: "./lib/stat-time.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!383 = distinct !DICompileUnit(language: DW_LANG_C99, file: !384, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, retainedTypes: !385, nameTableKind: None)
!384 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!385 = !{!16}
!386 = distinct !DICompileUnit(language: DW_LANG_C99, file: !387, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, globals: !388, nameTableKind: None)
!387 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!388 = !{!389}
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !386, file: !391, line: 26, type: !392, isLocal: false, isDefinition: true)
!391 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 376, elements: !393)
!393 = !{!394}
!394 = !DISubrange(count: 47)
!395 = distinct !DICompileUnit(language: DW_LANG_C99, file: !396, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, retainedTypes: !397, nameTableKind: None)
!396 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!397 = !{!110, !14, !16}
!398 = distinct !DICompileUnit(language: DW_LANG_C99, file: !399, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, nameTableKind: None)
!399 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!400 = distinct !DICompileUnit(language: DW_LANG_C99, file: !401, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, nameTableKind: None)
!401 = !DIFile(filename: "./lib/fclose.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!402 = distinct !DICompileUnit(language: DW_LANG_C99, file: !403, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, retainedTypes: !385, nameTableKind: None)
!403 = !DIFile(filename: "./lib/fflush.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!404 = distinct !DICompileUnit(language: DW_LANG_C99, file: !405, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, retainedTypes: !385, nameTableKind: None)
!405 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!406 = distinct !DICompileUnit(language: DW_LANG_C99, file: !407, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, retainedTypes: !408, nameTableKind: None)
!407 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!408 = !{!110}
!409 = distinct !DICompileUnit(language: DW_LANG_C99, file: !410, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, retainedTypes: !411, globals: !412, nameTableKind: None)
!410 = !DIFile(filename: "./lib/time_rz.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!411 = !{!14, !110}
!412 = !{!413}
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "local_tz", scope: !409, file: !415, line: 55, type: !416, isLocal: true, isDefinition: true)
!415 = !DIFile(filename: "lib/time_rz.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!416 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !417)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !418, line: 778, baseType: !419)
!418 = !DIFile(filename: "./lib/time.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !421, line: 21, size: 128, elements: !422)
!421 = !DIFile(filename: "./lib/time-internal.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!422 = !{!423, !424, !425}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !420, file: !421, line: 25, baseType: !419, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !420, file: !421, line: 36, baseType: !15, size: 8, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !420, file: !421, line: 48, baseType: !426, offset: 72)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: -1)
!429 = distinct !DICompileUnit(language: DW_LANG_C99, file: !430, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, nameTableKind: None)
!430 = !DIFile(filename: "./lib/c-ctype.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!431 = distinct !DICompileUnit(language: DW_LANG_C99, file: !432, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, retainedTypes: !433, nameTableKind: None)
!432 = !DIFile(filename: "./lib/c-strcasecmp.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!433 = !{!434}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!436 = distinct !DICompileUnit(language: DW_LANG_C99, file: !437, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, nameTableKind: None)
!437 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!438 = distinct !DICompileUnit(language: DW_LANG_C99, file: !439, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, nameTableKind: None)
!439 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!440 = distinct !DICompileUnit(language: DW_LANG_C99, file: !441, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, retainedTypes: !385, nameTableKind: None)
!441 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!442 = distinct !DICompileUnit(language: DW_LANG_C99, file: !443, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, retainedTypes: !444, nameTableKind: None)
!443 = !DIFile(filename: "./lib/nstrftime.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!444 = !{!51, !4, !23, !113, !114, !115, !116, !117, !112, !118, !119, !110, !16, !12}
!445 = distinct !DICompileUnit(language: DW_LANG_C99, file: !446, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, retainedTypes: !385, nameTableKind: None)
!446 = !DIFile(filename: "./lib/setlocale_null.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!447 = !{!"clang version 9.0.1-12 "}
!448 = !{i32 2, !"Dwarf Version", i32 4}
!449 = !{i32 2, !"Debug Info Version", i32 3}
!450 = !{i32 1, !"wchar_size", i32 4}
!451 = !{i32 1, !"ThinLTO", i32 0}
!452 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!453 = !DILocalVariable(name: "argc", arg: 1, scope: !20, file: !1, line: 348, type: !23)
!454 = !DILocation(line: 0, scope: !20)
!455 = !DILocalVariable(name: "argv", arg: 2, scope: !20, file: !1, line: 348, type: !24)
!456 = !DILocalVariable(name: "datestr", scope: !20, file: !1, line: 351, type: !51)
!457 = !DILocalVariable(name: "set_datestr", scope: !20, file: !1, line: 352, type: !51)
!458 = !DILocalVariable(name: "set_date", scope: !20, file: !1, line: 354, type: !99)
!459 = !DILocalVariable(name: "format", scope: !20, file: !1, line: 355, type: !51)
!460 = !DILocalVariable(name: "batch_file", scope: !20, file: !1, line: 356, type: !14)
!461 = !DILocalVariable(name: "reference", scope: !20, file: !1, line: 357, type: !14)
!462 = !DILocation(line: 363, column: 21, scope: !20)
!463 = !DILocation(line: 363, column: 3, scope: !20)
!464 = !DILocalVariable(name: "argv0", arg: 1, scope: !465, file: !319, line: 39, type: !51)
