; ModuleID = 'datedir/date-O3-inserted.ll'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%union.YYSTYPE = type { %struct.relative_time }
%struct.relative_time = type { i64, i64, i64, i64, i64, i64, i32 }
%struct.table = type { i8*, i32, i32 }
%struct.slotvec = type { i64, i8* }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.timespec = type { i64, i64 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.tm_zone = type { %struct.tm_zone*, i8, [0 x i8] }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.timezone = type { i32, i32 }
%struct.parser_control = type { i8*, i64, i32, i32, i32, i32, %struct.textint, i64, i64, i64, i64, %struct.timespec, %struct.relative_time, i8, i8, i64, i64, i64, i64, i64, i64, i8, i8, i8, i8, i8, i8, i8, i8, i8, [3 x %struct.table] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "short_options", scope: !2, file: !3, line: 86, type: !71, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !13, globals: !19, nameTableKind: None)
!3 = !DIFile(filename: "src/date.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Time_spec", file: !3, line: 44, baseType: !6, size: 32, elements: !7)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{!8, !9, !10, !11, !12}
!8 = !DIEnumerator(name: "TIME_SPEC_DATE", value: 0, isUnsigned: true)
!9 = !DIEnumerator(name: "TIME_SPEC_SECONDS", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "TIME_SPEC_NS", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "TIME_SPEC_HOURS", value: 3, isUnsigned: true)
!12 = !DIEnumerator(name: "TIME_SPEC_MINUTES", value: 4, isUnsigned: true)
!13 = !{!14, !16, !18}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!19 = !{!20, !33, !38, !0, !40, !55, !60, !66}
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "rfc_3339_format", scope: !22, file: !3, line: 388, type: !28, isLocal: true, isDefinition: true)
!22 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 348, type: !23, scopeLine: 349, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !27)
!23 = !DISubroutineType(types: !24)
!24 = !{!25, !25, !26}
!25 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!27 = !{}
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 768, elements: !30)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!30 = !{!31, !32}
!31 = !DISubrange(count: 3)
!32 = !DISubrange(count: 32)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "iso_8601_format", scope: !22, file: !3, line: 402, type: !35, isLocal: true, isDefinition: true)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 1280, elements: !36)
!36 = !{!37, !32}
!37 = !DISubrange(count: 5)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "parse_datetime_flags", scope: !2, file: !3, line: 109, type: !6, isLocal: true, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "long_options", scope: !2, file: !3, line: 88, type: !42, isLocal: true, isDefinition: true)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 4096, elements: !53)
!43 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !45, line: 50, size: 256, elements: !46)
!45 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "")
!46 = !{!47, !49, !50, !52}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !44, file: !45, line: 52, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !44, file: !45, line: 55, baseType: !25, size: 32, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !44, file: !45, line: 56, baseType: !51, size: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !44, file: !45, line: 57, baseType: !25, size: 32, offset: 192)
!53 = !{!54}
!54 = !DISubrange(count: 16)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "time_spec", scope: !2, file: !3, line: 68, type: !57, isLocal: true, isDefinition: true)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 160, elements: !59)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!59 = !{!37}
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "time_spec_string", scope: !2, file: !3, line: 61, type: !62, isLocal: true, isDefinition: true)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 384, elements: !64)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!64 = !{!65}
!65 = !DISubrange(count: 6)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "rfc_email_format", scope: !2, file: !3, line: 76, type: !68, isLocal: true, isDefinition: true)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 200, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 25)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 112, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 14)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(name: "exit_failure", scope: !76, file: !79, line: 24, type: !80, isLocal: false, isDefinition: true)
!76 = distinct !DICompileUnit(language: DW_LANG_C99, file: !77, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !27, globals: !78, nameTableKind: None)
!77 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!78 = !{!74}
!79 = !DIFile(filename: "lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!80 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !25)
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "yyval_default", scope: !83, file: !84, line: 1647, type: !173, isLocal: true, isDefinition: true)
!83 = distinct !DISubprogram(name: "yyparse", scope: !84, file: !84, line: 1638, type: !85, scopeLine: 1639, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !162, retainedNodes: !27)
!84 = !DIFile(filename: "parse-datetime.tab.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!85 = !DISubroutineType(types: !86)
!86 = !{!25, !87}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "parser_control", file: !89, line: 252, baseType: !90)
!89 = !DIFile(filename: "parse-datetime.y", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 194, size: 2240, elements: !91)
!91 = !{!92, !93, !99, !100, !101, !102, !103, !113, !114, !115, !116, !117, !125, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !90, file: !89, line: 197, baseType: !48, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "day_ordinal", scope: !90, file: !89, line: 200, baseType: !94, size: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !95, line: 101, baseType: !96)
!95 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !97, line: 72, baseType: !98)
!97 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!98 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "day_number", scope: !90, file: !89, line: 203, baseType: !25, size: 32, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "local_isdst", scope: !90, file: !89, line: 206, baseType: !25, size: 32, offset: 160)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "time_zone", scope: !90, file: !89, line: 209, baseType: !25, size: 32, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "meridian", scope: !90, file: !89, line: 212, baseType: !25, size: 32, offset: 224)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !90, file: !89, line: 215, baseType: !104, size: 192, offset: 256)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "textint", file: !89, line: 156, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 151, size: 192, elements: !106)
!106 = !{!107, !109, !110}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "negative", scope: !105, file: !89, line: 153, baseType: !108, size: 8)
!108 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !105, file: !89, line: 154, baseType: !94, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "digits", scope: !105, file: !89, line: 155, baseType: !111, size: 64, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !112, line: 35, baseType: !98)
!112 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.1/include/stddef.h", directory: "")
!113 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !90, file: !89, line: 216, baseType: !94, size: 64, offset: 448)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !90, file: !89, line: 217, baseType: !94, size: 64, offset: 512)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !90, file: !89, line: 218, baseType: !94, size: 64, offset: 576)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !90, file: !89, line: 219, baseType: !94, size: 64, offset: 640)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !90, file: !89, line: 220, baseType: !118, size: 128, offset: 704)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !119, line: 10, size: 128, elements: !120)
!119 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!120 = !{!121, !123}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !118, file: !119, line: 12, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !97, line: 160, baseType: !98)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !118, file: !119, line: 16, baseType: !124, size: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !97, line: 196, baseType: !98)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "rel", scope: !90, file: !89, line: 223, baseType: !126, size: 448, offset: 832)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "relative_time", file: !89, line: 185, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 175, size: 448, elements: !128)
!128 = !{!129, !130, !131, !132, !133, !134, !135}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !127, file: !89, line: 178, baseType: !94, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !127, file: !89, line: 179, baseType: !94, size: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !127, file: !89, line: 180, baseType: !94, size: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !127, file: !89, line: 181, baseType: !94, size: 64, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !127, file: !89, line: 182, baseType: !94, size: 64, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !127, file: !89, line: 183, baseType: !94, size: 64, offset: 320)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !127, file: !89, line: 184, baseType: !25, size: 32, offset: 384)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "timespec_seen", scope: !90, file: !89, line: 226, baseType: !108, size: 8, offset: 1280)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "rels_seen", scope: !90, file: !89, line: 227, baseType: !108, size: 8, offset: 1288)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "dates_seen", scope: !90, file: !89, line: 228, baseType: !111, size: 64, offset: 1344)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "days_seen", scope: !90, file: !89, line: 229, baseType: !111, size: 64, offset: 1408)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "local_zones_seen", scope: !90, file: !89, line: 230, baseType: !111, size: 64, offset: 1472)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "dsts_seen", scope: !90, file: !89, line: 231, baseType: !111, size: 64, offset: 1536)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "times_seen", scope: !90, file: !89, line: 232, baseType: !111, size: 64, offset: 1600)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "zones_seen", scope: !90, file: !89, line: 233, baseType: !111, size: 64, offset: 1664)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "year_seen", scope: !90, file: !89, line: 234, baseType: !108, size: 8, offset: 1728)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "parse_datetime_debug", scope: !90, file: !89, line: 237, baseType: !108, size: 8, offset: 1736)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "debug_dates_seen", scope: !90, file: !89, line: 240, baseType: !108, size: 8, offset: 1744)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "debug_days_seen", scope: !90, file: !89, line: 241, baseType: !108, size: 8, offset: 1752)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "debug_local_zones_seen", scope: !90, file: !89, line: 242, baseType: !108, size: 8, offset: 1760)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "debug_times_seen", scope: !90, file: !89, line: 243, baseType: !108, size: 8, offset: 1768)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "debug_zones_seen", scope: !90, file: !89, line: 244, baseType: !108, size: 8, offset: 1776)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "debug_year_seen", scope: !90, file: !89, line: 245, baseType: !108, size: 8, offset: 1784)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "debug_ordinal_day_seen", scope: !90, file: !89, line: 248, baseType: !108, size: 8, offset: 1792)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "local_time_zone_table", scope: !90, file: !89, line: 251, baseType: !154, size: 384, offset: 1856)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 384, elements: !161)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "table", file: !89, line: 164, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !89, line: 159, size: 128, elements: !157)
!157 = !{!158, !159, !160}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !156, file: !89, line: 161, baseType: !48, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !156, file: !89, line: 162, baseType: !25, size: 32, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !156, file: !89, line: 163, baseType: !25, size: 32, offset: 96)
!161 = !{!31}
!162 = distinct !DICompileUnit(language: DW_LANG_C99, file: !163, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !27, retainedTypes: !164, globals: !187, nameTableKind: None)
!163 = !DIFile(filename: "./lib/parse-datetime.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!164 = !{!165, !167, !168, !6, !94, !180, !181, !166, !182, !25, !98, !183, !184, !185}
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_int16", file: !84, line: 748, baseType: !166)
!166 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!167 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "yyalloc", file: !84, line: 898, size: 448, elements: !170)
!170 = !{!171, !172}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "yyss_alloc", scope: !169, file: !84, line: 900, baseType: !165, size: 16)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "yyvs_alloc", scope: !169, file: !84, line: 901, baseType: !173, size: 448)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "YYSTYPE", file: !84, line: 710, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "YYSTYPE", file: !84, line: 698, size: 448, elements: !175)
!175 = !{!176, !177, !178, !179}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "intval", scope: !174, file: !89, line: 577, baseType: !94, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "textintval", scope: !174, file: !89, line: 578, baseType: !104, size: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "timespec", scope: !174, file: !89, line: 579, baseType: !118, size: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "rel", scope: !174, file: !89, line: 580, baseType: !126, size: 448)
!180 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!181 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!182 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!183 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!184 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !186, line: 7, baseType: !122)
!186 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!187 = !{!81, !188, !195, !202, !207, !210, !213, !218, !220, !225, !227, !229, !233, !236, !241, !246, !251, !256, !261, !264, !271}
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "yypact", scope: !162, file: !84, line: 1067, type: !190, isLocal: true, isDefinition: true)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 912, elements: !193)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_int8", file: !84, line: 736, baseType: !180)
!193 = !{!194}
!194 = !DISubrange(count: 114)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "yytranslate", scope: !162, file: !84, line: 977, type: !197, isLocal: true, isDefinition: true)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 2224, elements: !200)
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "yytype_uint8", file: !84, line: 730, baseType: !181)
!200 = !{!201}
!201 = !DISubrange(count: 278)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "yycheck", scope: !162, file: !84, line: 1137, type: !204, isLocal: true, isDefinition: true)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 904, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 113)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "yytable", scope: !162, file: !84, line: 1121, type: !209, isLocal: true, isDefinition: true)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 904, elements: !205)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "yydefact", scope: !162, file: !84, line: 1086, type: !212, isLocal: true, isDefinition: true)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 912, elements: !193)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "yyr2", scope: !162, file: !84, line: 1187, type: !215, isLocal: true, isDefinition: true)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 736, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 92)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "yyr1", scope: !162, file: !84, line: 1172, type: !215, isLocal: true, isDefinition: true)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "yypgoto", scope: !162, file: !84, line: 1103, type: !222, isLocal: true, isDefinition: true)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 208, elements: !223)
!223 = !{!224}
!224 = !DISubrange(count: 26)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "yydefgoto", scope: !162, file: !84, line: 1111, type: !222, isLocal: true, isDefinition: true)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "yystos", scope: !162, file: !84, line: 1155, type: !212, isLocal: true, isDefinition: true)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "meridian_table", scope: !162, file: !89, line: 1008, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 640, elements: !59)
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "month_and_day_table", scope: !162, file: !89, line: 1022, type: !235, isLocal: true, isDefinition: true)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 3200, elements: !69)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "universal_time_zone_table", scope: !162, file: !89, line: 1096, type: !238, isLocal: true, isDefinition: true)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 512, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 4)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "time_zone_table", scope: !162, file: !89, line: 1109, type: !243, isLocal: true, isDefinition: true)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 6144, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 48)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "dst_table", scope: !162, file: !89, line: 1017, type: !248, isLocal: true, isDefinition: true)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 128, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 1)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "time_units_table", scope: !162, file: !89, line: 1051, type: !253, isLocal: true, isDefinition: true)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 1408, elements: !254)
!254 = !{!255}
!255 = !DISubrange(count: 11)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "relative_time_table", scope: !162, file: !89, line: 1067, type: !258, isLocal: true, isDefinition: true)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 2688, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 21)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "military_table", scope: !162, file: !89, line: 1168, type: !263, isLocal: true, isDefinition: true)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 3328, elements: !223)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "ordinal_values", scope: !266, file: !89, line: 343, type: !269, isLocal: true, isDefinition: true)
!266 = distinct !DISubprogram(name: "str_days", scope: !89, file: !89, line: 340, type: !267, scopeLine: 341, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !162, retainedNodes: !27)
!267 = !DISubroutineType(types: !268)
!268 = !{!48, !87, !16, !25}
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 1232, elements: !270)
!270 = !{!73, !255}
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "days_values", scope: !266, file: !89, line: 360, type: !273, isLocal: true, isDefinition: true)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 224, elements: !274)
!274 = !{!275, !240}
!275 = !DISubrange(count: 7)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "program_name", scope: !278, file: !282, line: 33, type: !48, isLocal: false, isDefinition: true)
!278 = distinct !DICompileUnit(language: DW_LANG_C99, file: !279, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !27, retainedTypes: !280, globals: !281, nameTableKind: None)
!279 = !DIFile(filename: "./lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!280 = !{!18, !16}
!281 = !{!276}
!282 = !DIFile(filename: "lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "slotvec", scope: !285, file: !307, line: 845, type: !342, isLocal: true, isDefinition: true)
!285 = distinct !DICompileUnit(language: DW_LANG_C99, file: !286, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !287, retainedTypes: !302, globals: !304, nameTableKind: None)
!286 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!287 = !{!288}
!288 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !289, line: 32, baseType: !6, size: 32, elements: !290)
!289 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!290 = !{!291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301}
!291 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!292 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!293 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!294 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!295 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!296 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!297 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!298 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!299 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!300 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!301 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!302 = !{!25, !182, !303}
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !112, line: 46, baseType: !167)
!304 = !{!305, !309, !315, !327, !329, !283, !334, !336}
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !285, file: !307, line: 85, type: !308, isLocal: false, isDefinition: true)
!307 = !DIFile(filename: "lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 704, elements: !254)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !285, file: !307, line: 101, type: !311, isLocal: false, isDefinition: true)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 320, elements: !313)
!312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !288)
!313 = !{!314}
!314 = !DISubrange(count: 10)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !285, file: !307, line: 1052, type: !317, isLocal: false, isDefinition: true)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !307, line: 65, size: 448, elements: !318)
!318 = !{!319, !320, !321, !325, !326}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !317, file: !307, line: 68, baseType: !288, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !317, file: !307, line: 71, baseType: !25, size: 32, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !317, file: !307, line: 75, baseType: !322, size: 256, offset: 64)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 8)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !317, file: !307, line: 78, baseType: !48, size: 64, offset: 320)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !317, file: !307, line: 81, baseType: !48, size: 64, offset: 384)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !285, file: !307, line: 116, type: !317, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "slot0", scope: !285, file: !307, line: 842, type: !331, isLocal: true, isDefinition: true)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 2048, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 256)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "nslots", scope: !285, file: !307, line: 843, type: !25, isLocal: true, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "slotvec0", scope: !285, file: !307, line: 844, type: !338, isLocal: true, isDefinition: true)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !307, line: 834, size: 128, elements: !339)
!339 = !{!340, !341}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !338, file: !307, line: 836, baseType: !303, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !338, file: !307, line: 837, baseType: !16, size: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !345, file: !348, line: 26, type: !349, isLocal: false, isDefinition: true)
!345 = distinct !DICompileUnit(language: DW_LANG_C99, file: !346, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !27, globals: !347, nameTableKind: None)
!346 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!347 = !{!343}
!348 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 376, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 47)
!352 = distinct !DICompileUnit(language: DW_LANG_C99, file: !353, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !27, globals: !354, nameTableKind: None)
!353 = !DIFile(filename: "src/version.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!354 = !{!355}
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "Version", scope: !352, file: !353, line: 2, type: !48, isLocal: false, isDefinition: true)
!357 = distinct !DICompileUnit(language: DW_LANG_C99, file: !358, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !27, retainedTypes: !359, globals: !360, nameTableKind: None)
!358 = !DIFile(filename: "./lib/argmatch.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!359 = !{!18, !48}
!360 = !{!361}
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "argmatch_die", scope: !357, file: !363, line: 67, type: !364, isLocal: false, isDefinition: true)
!363 = !DIFile(filename: "lib/argmatch.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "argmatch_exit_fn", file: !365, line: 61, baseType: !366)
!365 = !DIFile(filename: "./lib/argmatch.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{null}
!369 = distinct !DICompileUnit(language: DW_LANG_C99, file: !370, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !27, globals: !371, nameTableKind: None)
!370 = !DIFile(filename: "./lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!371 = !{!372, !375}
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "file_name", scope: !369, file: !374, line: 46, type: !48, isLocal: true, isDefinition: true)
!374 = !DIFile(filename: "lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !369, file: !374, line: 56, type: !108, isLocal: true, isDefinition: true)
!377 = distinct !DICompileUnit(language: DW_LANG_C99, file: !378, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !27, retainedTypes: !379, nameTableKind: None)
!378 = !DIFile(filename: "./lib/fprintftime.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!379 = !{!303, !48, !6, !25, !180, !181, !166, !182, !98, !167, !183, !184}
!380 = distinct !DICompileUnit(language: DW_LANG_C99, file: !381, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !27, nameTableKind: None)
!381 = !DIFile(filename: "./lib/gettime.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!382 = distinct !DICompileUnit(language: DW_LANG_C99, file: !383, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !27, retainedTypes: !384, nameTableKind: None)
!383 = !DIFile(filename: "./lib/imaxtostr.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!384 = !{!94}
!385 = distinct !DICompileUnit(language: DW_LANG_C99, file: !386, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !27, retainedTypes: !387, nameTableKind: None)
!386 = !DIFile(filename: "./lib/posixtm.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!387 = !{!6}
!388 = distinct !DICompileUnit(language: DW_LANG_C99, file: !389, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !27, nameTableKind: None)
!389 = !DIFile(filename: "./lib/settime.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!390 = distinct !DICompileUnit(language: DW_LANG_C99, file: !391, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !27, nameTableKind: None)
!391 = !DIFile(filename: "./lib/stat-time.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!392 = distinct !DICompileUnit(language: DW_LANG_C99, file: !393, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !27, retainedTypes: !394, nameTableKind: None)
!393 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!394 = !{!18}
!395 = distinct !DICompileUnit(language: DW_LANG_C99, file: !396, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !27, retainedTypes: !397, nameTableKind: None)
!396 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!397 = !{!303, !16, !18}
!398 = distinct !DICompileUnit(language: DW_LANG_C99, file: !399, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !27, nameTableKind: None)
!399 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!400 = distinct !DICompileUnit(language: DW_LANG_C99, file: !401, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !27, nameTableKind: None)
!401 = !DIFile(filename: "./lib/fclose.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!402 = distinct !DICompileUnit(language: DW_LANG_C99, file: !403, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !27, retainedTypes: !394, nameTableKind: None)
!403 = !DIFile(filename: "./lib/fflush.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!404 = distinct !DICompileUnit(language: DW_LANG_C99, file: !405, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !27, retainedTypes: !394, nameTableKind: None)
!405 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!406 = distinct !DICompileUnit(language: DW_LANG_C99, file: !407, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !27, retainedTypes: !408, nameTableKind: None)
!407 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!408 = !{!303}
!409 = distinct !DICompileUnit(language: DW_LANG_C99, file: !410, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !27, retainedTypes: !411, globals: !412, nameTableKind: None)
!410 = !DIFile(filename: "./lib/time_rz.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!411 = !{!16, !303}
!412 = !{!413}
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "local_tz", scope: !409, file: !415, line: 55, type: !416, isLocal: true, isDefinition: true)
!415 = !DIFile(filename: "lib/time_rz.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!416 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !417)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !418, line: 778, baseType: !419)
!418 = !DIFile(filename: "./lib/time.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !421, line: 21, size: 128, elements: !422)
!421 = !DIFile(filename: "./lib/time-internal.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!422 = !{!423, !424, !425}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !420, file: !421, line: 25, baseType: !419, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "tz_is_set", scope: !420, file: !421, line: 36, baseType: !17, size: 8, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "abbrs", scope: !420, file: !421, line: 48, baseType: !426, offset: 72)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: -1)
!429 = distinct !DICompileUnit(language: DW_LANG_C99, file: !430, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !27, nameTableKind: None)
!430 = !DIFile(filename: "./lib/c-ctype.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!431 = distinct !DICompileUnit(language: DW_LANG_C99, file: !432, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !27, retainedTypes: !433, nameTableKind: None)
!432 = !DIFile(filename: "./lib/c-strcasecmp.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!433 = !{!434}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!436 = distinct !DICompileUnit(language: DW_LANG_C99, file: !437, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !27, nameTableKind: None)
!437 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!438 = distinct !DICompileUnit(language: DW_LANG_C99, file: !439, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !27, nameTableKind: None)
!439 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!440 = distinct !DICompileUnit(language: DW_LANG_C99, file: !441, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !27, retainedTypes: !394, nameTableKind: None)
!441 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!442 = distinct !DICompileUnit(language: DW_LANG_C99, file: !443, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !27, retainedTypes: !444, nameTableKind: None)
!443 = !DIFile(filename: "./lib/nstrftime.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!444 = !{!48, !6, !25, !180, !181, !166, !182, !98, !167, !183, !184, !303, !18, !14}
!445 = distinct !DICompileUnit(language: DW_LANG_C99, file: !446, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !27, retainedTypes: !394, nameTableKind: None)
!446 = !DIFile(filename: "./lib/setlocale_null.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!447 = !{!"clang version 9.0.1-12 "}
!448 = !{i32 2, !"Dwarf Version", i32 4}
!449 = !{i32 2, !"Debug Info Version", i32 3}
!450 = !{i32 1, !"wchar_size", i32 4}
!451 = !{i32 1, !"ThinLTO", i32 0}
!452 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!453 = !DILocalVariable(name: "infomap", scope: !454, file: !455, line: 636, type: !458)
!454 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !455, file: !455, line: 634, type: !456, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !27)
!455 = !DIFile(filename: "src/system.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!456 = !DISubroutineType(types: !457)
!457 = !{null, !48}
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 896, elements: !464)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !454, file: !455, line: 636, size: 128, elements: !461)
!461 = !{!462, !463}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !460, file: !455, line: 636, baseType: !48, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !460, file: !455, line: 636, baseType: !48, size: 64, offset: 64)
!464 = !{!275}
!465 = !DILocation(line: 636, column: 67, scope: !454, inlinedAt: !466)
!466 = distinct !DILocation(line: 279, column: 7, scope: !467)
!467 = distinct !DILexicalBlock(scope: !468, file: !3, line: 129, column: 5)
!468 = distinct !DILexicalBlock(scope: !469, file: !3, line: 126, column: 7)
!469 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 124, type: !470, scopeLine: 125, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !27)
!470 = !DISubroutineType(types: !471)
!471 = !{null, !25}
!472 = !DILocalVariable(name: "status", arg: 1, scope: !469, file: !3, line: 124, type: !25)
!473 = !DILocation(line: 0, scope: !469)
!474 = !DILocation(line: 126, column: 14, scope: !468)
!475 = !DILocation(line: 126, column: 7, scope: !469)
!476 = !DILocation(line: 127, column: 5, scope: !477)
!477 = distinct !DILexicalBlock(scope: !468, file: !3, line: 127, column: 5)
!478 = !DILocation(line: 130, column: 15, scope: !467)
!479 = !DILocation(line: 134, column: 15, scope: !467)
!480 = !DILocation(line: 130, column: 7, scope: !467)
!481 = !DILocation(line: 135, column: 7, scope: !467)
!482 = !DILocation(line: 590, column: 3, scope: !483, inlinedAt: !484)
!483 = distinct !DISubprogram(name: "emit_mandatory_arg_note", scope: !455, file: !455, line: 588, type: !367, scopeLine: 589, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !27)
!484 = distinct !DILocation(line: 139, column: 7, scope: !467)
!485 = !DILocation(line: 141, column: 7, scope: !467)
!486 = !DILocation(line: 144, column: 7, scope: !467)
!487 = !DILocation(line: 148, column: 7, scope: !467)
!488 = !DILocation(line: 151, column: 7, scope: !467)
!489 = !DILocation(line: 158, column: 7, scope: !467)
!490 = !DILocation(line: 162, column: 7, scope: !467)
!491 = !DILocation(line: 168, column: 7, scope: !467)
!492 = !DILocation(line: 171, column: 7, scope: !467)
!493 = !DILocation(line: 175, column: 7, scope: !467)
!494 = !DILocation(line: 176, column: 7, scope: !467)
!495 = !DILocation(line: 177, column: 7, scope: !467)
!496 = !DILocation(line: 184, column: 7, scope: !467)
!497 = !DILocation(line: 190, column: 7, scope: !467)
!498 = !DILocation(line: 196, column: 7, scope: !467)
!499 = !DILocation(line: 201, column: 7, scope: !467)
!500 = !DILocation(line: 207, column: 7, scope: !467)
!501 = !DILocation(line: 213, column: 7, scope: !467)
!502 = !DILocation(line: 223, column: 7, scope: !467)
!503 = !DILocation(line: 229, column: 7, scope: !467)
!504 = !DILocation(line: 235, column: 7, scope: !467)
!505 = !DILocation(line: 241, column: 7, scope: !467)
!506 = !DILocation(line: 250, column: 7, scope: !467)
!507 = !DILocation(line: 260, column: 7, scope: !467)
!508 = !DILocation(line: 267, column: 7, scope: !467)
!509 = !DILocation(line: 0, scope: !454, inlinedAt: !466)
!510 = !DILocalVariable(name: "program", arg: 1, scope: !454, file: !455, line: 634, type: !48)
!511 = !DILocalVariable(name: "node", scope: !454, file: !455, line: 646, type: !48)
!512 = !DILocalVariable(name: "map_prog", scope: !454, file: !455, line: 647, type: !513)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!514 = !DILocation(line: 647, column: 36, scope: !454, inlinedAt: !466)
!515 = !DILocation(line: 649, column: 3, scope: !454, inlinedAt: !466)
!516 = !DILocation(line: 649, column: 33, scope: !454, inlinedAt: !466)
!517 = !DILocation(line: 650, column: 13, scope: !454, inlinedAt: !466)
!518 = !DILocation(line: 649, column: 20, scope: !454, inlinedAt: !466)
!519 = !DILocation(line: 649, column: 10, scope: !454, inlinedAt: !466)
!520 = !DILocation(line: 649, column: 28, scope: !454, inlinedAt: !466)
!521 = distinct !{!521, !515, !517}
!522 = !DILocation(line: 652, column: 17, scope: !523, inlinedAt: !466)
!523 = distinct !DILexicalBlock(scope: !454, file: !455, line: 652, column: 7)
!524 = !DILocation(line: 652, column: 7, scope: !523, inlinedAt: !466)
!525 = !DILocation(line: 652, column: 7, scope: !454, inlinedAt: !466)
!526 = !DILocation(line: 655, column: 11, scope: !454, inlinedAt: !466)
!527 = !DILocation(line: 655, column: 3, scope: !454, inlinedAt: !466)
!528 = !DILocation(line: 659, column: 29, scope: !454, inlinedAt: !466)
!529 = !DILocalVariable(name: "lc_messages", scope: !454, file: !455, line: 659, type: !48)
!530 = !DILocation(line: 660, column: 7, scope: !531, inlinedAt: !466)
!531 = distinct !DILexicalBlock(scope: !454, file: !455, line: 660, column: 7)
!532 = !DILocation(line: 660, column: 19, scope: !531, inlinedAt: !466)
!533 = !DILocation(line: 660, column: 22, scope: !531, inlinedAt: !466)
!534 = !DILocation(line: 660, column: 7, scope: !454, inlinedAt: !466)
!535 = !DILocation(line: 666, column: 7, scope: !536, inlinedAt: !466)
!536 = distinct !DILexicalBlock(scope: !531, file: !455, line: 661, column: 5)
!537 = !DILocation(line: 668, column: 5, scope: !536, inlinedAt: !466)
!538 = !DILocation(line: 669, column: 11, scope: !454, inlinedAt: !466)
!539 = !DILocation(line: 669, column: 3, scope: !454, inlinedAt: !466)
!540 = !DILocation(line: 671, column: 11, scope: !454, inlinedAt: !466)
!541 = !DILocation(line: 672, column: 22, scope: !454, inlinedAt: !466)
!542 = !DILocation(line: 672, column: 17, scope: !454, inlinedAt: !466)
!543 = !DILocation(line: 671, column: 3, scope: !454, inlinedAt: !466)
!544 = !DILocation(line: 673, column: 1, scope: !454, inlinedAt: !466)
!545 = !DILocation(line: 281, column: 3, scope: !469)
!546 = !DILocalVariable(name: "argc", arg: 1, scope: !22, file: !3, line: 348, type: !25)
!547 = !DILocation(line: 0, scope: !22)
!548 = !DILocalVariable(name: "argv", arg: 2, scope: !22, file: !3, line: 348, type: !26)
!549 = !DILocalVariable(name: "datestr", scope: !22, file: !3, line: 351, type: !48)
!550 = !DILocalVariable(name: "set_datestr", scope: !22, file: !3, line: 352, type: !48)
!551 = !DILocalVariable(name: "set_date", scope: !22, file: !3, line: 354, type: !108)
!552 = !DILocalVariable(name: "format", scope: !22, file: !3, line: 355, type: !48)
!553 = !DILocalVariable(name: "batch_file", scope: !22, file: !3, line: 356, type: !16)
!554 = !DILocalVariable(name: "reference", scope: !22, file: !3, line: 357, type: !16)
!555 = !DILocation(line: 363, column: 21, scope: !22)
!556 = !DILocalVariable(name: "argv0", arg: 1, scope: !557, file: !282, line: 39, type: !48)
!557 = distinct !DISubprogram(name: "set_program_name", scope: !282, file: !282, line: 39, type: !456, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !278, retainedNodes: !27)
!558 = !DILocation(line: 0, scope: !557, inlinedAt: !559)
!559 = distinct !DILocation(line: 363, column: 3, scope: !22)
!560 = !DILocation(line: 51, column: 13, scope: !561, inlinedAt: !559)
!561 = distinct !DILexicalBlock(scope: !557, file: !282, line: 51, column: 7)
!562 = !DILocation(line: 51, column: 7, scope: !557, inlinedAt: !559)
!563 = !DILocation(line: 55, column: 14, scope: !564, inlinedAt: !559)
!564 = distinct !DILexicalBlock(scope: !561, file: !282, line: 52, column: 5)
!565 = !DILocation(line: 54, column: 7, scope: !564, inlinedAt: !559)
!566 = !DILocation(line: 56, column: 7, scope: !564, inlinedAt: !559)
!567 = !DILocation(line: 59, column: 11, scope: !557, inlinedAt: !559)
!568 = !DILocalVariable(name: "slash", scope: !557, file: !282, line: 46, type: !48)
!569 = !DILocation(line: 60, column: 17, scope: !557, inlinedAt: !559)
!570 = !DILocation(line: 60, column: 11, scope: !557, inlinedAt: !559)
!571 = !DILocalVariable(name: "base", scope: !557, file: !282, line: 47, type: !48)
!572 = !DILocation(line: 61, column: 12, scope: !573, inlinedAt: !559)
!573 = distinct !DILexicalBlock(scope: !557, file: !282, line: 61, column: 7)
!574 = !DILocation(line: 61, column: 20, scope: !573, inlinedAt: !559)
!575 = !DILocation(line: 61, column: 25, scope: !573, inlinedAt: !559)
!576 = !DILocation(line: 61, column: 42, scope: !573, inlinedAt: !559)
!577 = !DILocation(line: 61, column: 28, scope: !573, inlinedAt: !559)
!578 = !DILocation(line: 61, column: 61, scope: !573, inlinedAt: !559)
!579 = !DILocation(line: 61, column: 7, scope: !557, inlinedAt: !559)
!580 = !DILocation(line: 64, column: 11, scope: !581, inlinedAt: !559)
!581 = distinct !DILexicalBlock(scope: !582, file: !282, line: 64, column: 11)
!582 = distinct !DILexicalBlock(scope: !573, file: !282, line: 62, column: 5)
!583 = !DILocation(line: 64, column: 36, scope: !581, inlinedAt: !559)
!584 = !DILocation(line: 64, column: 11, scope: !582, inlinedAt: !559)
!585 = !DILocation(line: 66, column: 24, scope: !586, inlinedAt: !559)
!586 = distinct !DILexicalBlock(scope: !581, file: !282, line: 65, column: 9)
!587 = !DILocation(line: 70, column: 41, scope: !586, inlinedAt: !559)
!588 = !DILocation(line: 72, column: 9, scope: !586, inlinedAt: !559)
!589 = !DILocation(line: 363, column: 3, scope: !22)
!590 = !DILocation(line: 84, column: 16, scope: !557, inlinedAt: !559)
!591 = !DILocation(line: 90, column: 27, scope: !557, inlinedAt: !559)
!592 = !DILocation(line: 370, column: 3, scope: !22)
!593 = !DILocation(line: 370, column: 18, scope: !22)
!594 = !DILocalVariable(name: "optc", scope: !22, file: !3, line: 350, type: !25)
!595 = !DILocation(line: 378, column: 21, scope: !596)
!596 = distinct !DILexicalBlock(scope: !597, file: !3, line: 376, column: 9)
!597 = distinct !DILexicalBlock(scope: !22, file: !3, line: 372, column: 5)
!598 = !DILocation(line: 379, column: 11, scope: !596)
!599 = distinct !{!599, !592, !600}
!600 = !DILocation(line: 447, column: 5, scope: !22)
!601 = !DILocation(line: 381, column: 32, scope: !596)
!602 = !DILocation(line: 382, column: 11, scope: !596)
!603 = !DILocation(line: 384, column: 24, scope: !596)
!604 = !DILocation(line: 385, column: 11, scope: !596)
!605 = !DILocation(line: 395, column: 15, scope: !606)
!606 = distinct !DILexicalBlock(scope: !596, file: !3, line: 387, column: 11)
!607 = !DILocalVariable(name: "i", scope: !606, file: !3, line: 394, type: !5)
!608 = !DILocation(line: 0, scope: !606)
!609 = !DILocation(line: 397, column: 26, scope: !606)
!610 = !DILocalVariable(name: "new_format", scope: !597, file: !3, line: 373, type: !48)
!611 = !DILocation(line: 0, scope: !597)
!612 = !DILocation(line: 398, column: 13, scope: !606)
!613 = !DILocation(line: 411, column: 16, scope: !614)
!614 = distinct !DILexicalBlock(scope: !596, file: !3, line: 401, column: 11)
!615 = !DILocation(line: 412, column: 18, scope: !614)
!616 = !DILocalVariable(name: "i", scope: !614, file: !3, line: 410, type: !5)
!617 = !DILocation(line: 0, scope: !614)
!618 = !DILocation(line: 414, column: 26, scope: !614)
!619 = !DILocation(line: 415, column: 13, scope: !614)
!620 = !DILocation(line: 418, column: 23, scope: !596)
!621 = !DILocation(line: 419, column: 11, scope: !596)
!622 = !DILocation(line: 424, column: 25, scope: !596)
!623 = !DILocation(line: 426, column: 11, scope: !596)
!624 = !DILocation(line: 431, column: 15, scope: !625)
!625 = distinct !DILexicalBlock(scope: !596, file: !3, line: 431, column: 15)
!626 = !DILocation(line: 431, column: 45, scope: !625)
!627 = !DILocation(line: 431, column: 15, scope: !596)
!628 = !DILocation(line: 432, column: 13, scope: !625)
!629 = !DILocation(line: 435, column: 9, scope: !596)
!630 = !DILocation(line: 436, column: 9, scope: !596)
!631 = !DILocation(line: 438, column: 11, scope: !596)
!632 = !DILocation(line: 443, column: 15, scope: !633)
!633 = distinct !DILexicalBlock(scope: !634, file: !3, line: 443, column: 15)
!634 = distinct !DILexicalBlock(scope: !635, file: !3, line: 442, column: 9)
!635 = distinct !DILexicalBlock(scope: !597, file: !3, line: 441, column: 11)
!636 = !DILocation(line: 443, column: 15, scope: !634)
!637 = !DILocation(line: 444, column: 13, scope: !633)
!638 = !DILocation(line: 449, column: 29, scope: !22)
!639 = !DILocation(line: 450, column: 31, scope: !22)
!640 = !DILocation(line: 451, column: 31, scope: !22)
!641 = !DILocation(line: 450, column: 28, scope: !22)
!642 = !DILocation(line: 451, column: 28, scope: !22)
!643 = !DILocalVariable(name: "option_specified_date", scope: !22, file: !3, line: 360, type: !25)
!644 = !DILocation(line: 453, column: 29, scope: !645)
!645 = distinct !DILexicalBlock(scope: !22, file: !3, line: 453, column: 7)
!646 = !DILocation(line: 453, column: 7, scope: !22)
!647 = !DILocation(line: 456, column: 9, scope: !648)
!648 = distinct !DILexicalBlock(scope: !645, file: !3, line: 454, column: 5)
!649 = !DILocation(line: 455, column: 7, scope: !648)
!650 = !DILocation(line: 457, column: 7, scope: !648)
!651 = !DILocation(line: 460, column: 7, scope: !652)
!652 = distinct !DILexicalBlock(scope: !22, file: !3, line: 460, column: 7)
!653 = !DILocation(line: 460, column: 19, scope: !652)
!654 = !DILocation(line: 460, column: 16, scope: !652)
!655 = !DILocation(line: 463, column: 11, scope: !656)
!656 = distinct !DILexicalBlock(scope: !652, file: !3, line: 461, column: 5)
!657 = !DILocation(line: 462, column: 7, scope: !656)
!658 = !DILocation(line: 464, column: 7, scope: !656)
!659 = !DILocation(line: 467, column: 7, scope: !660)
!660 = distinct !DILexicalBlock(scope: !22, file: !3, line: 467, column: 7)
!661 = !DILocation(line: 467, column: 14, scope: !660)
!662 = !DILocation(line: 467, column: 7, scope: !22)
!663 = !DILocation(line: 469, column: 18, scope: !664)
!664 = distinct !DILexicalBlock(scope: !665, file: !3, line: 469, column: 11)
!665 = distinct !DILexicalBlock(scope: !660, file: !3, line: 468, column: 5)
!666 = !DILocation(line: 469, column: 22, scope: !664)
!667 = !DILocation(line: 469, column: 11, scope: !665)
!668 = !DILocation(line: 471, column: 24, scope: !669)
!669 = distinct !DILexicalBlock(scope: !664, file: !3, line: 470, column: 9)
!670 = !DILocation(line: 471, column: 54, scope: !669)
!671 = !DILocation(line: 471, column: 47, scope: !669)
!672 = !DILocation(line: 471, column: 11, scope: !669)
!673 = !DILocation(line: 472, column: 11, scope: !669)
!674 = !DILocation(line: 475, column: 11, scope: !675)
!675 = distinct !DILexicalBlock(scope: !665, file: !3, line: 475, column: 11)
!676 = !DILocation(line: 477, column: 15, scope: !677)
!677 = distinct !DILexicalBlock(scope: !678, file: !3, line: 477, column: 15)
!678 = distinct !DILexicalBlock(scope: !675, file: !3, line: 476, column: 9)
!679 = !DILocation(line: 477, column: 15, scope: !678)
!680 = !DILocation(line: 478, column: 13, scope: !677)
!681 = !DILocation(line: 479, column: 31, scope: !678)
!682 = !DILocation(line: 479, column: 20, scope: !678)
!683 = !DILocation(line: 479, column: 35, scope: !678)
!684 = !DILocation(line: 492, column: 7, scope: !22)
!685 = !DILocation(line: 481, column: 25, scope: !686)
!686 = distinct !DILexicalBlock(scope: !675, file: !3, line: 481, column: 16)
!687 = !DILocation(line: 484, column: 18, scope: !688)
!688 = distinct !DILexicalBlock(scope: !686, file: !3, line: 482, column: 9)
!689 = !DILocation(line: 487, column: 30, scope: !688)
!690 = !DILocation(line: 487, column: 25, scope: !688)
!691 = !DILocation(line: 487, column: 18, scope: !688)
!692 = !DILocation(line: 483, column: 11, scope: !688)
!693 = !DILocation(line: 488, column: 11, scope: !688)
!694 = !DILocation(line: 492, column: 8, scope: !695)
!695 = distinct !DILexicalBlock(scope: !22, file: !3, line: 492, column: 7)
!696 = !DILocation(line: 494, column: 16, scope: !697)
!697 = distinct !DILexicalBlock(scope: !695, file: !3, line: 493, column: 5)
!698 = !DILocation(line: 495, column: 13, scope: !699)
!699 = distinct !DILexicalBlock(scope: !697, file: !3, line: 495, column: 11)
!700 = !DILocation(line: 495, column: 11, scope: !697)
!701 = !DILocation(line: 506, column: 5, scope: !697)
!702 = !DILocation(line: 508, column: 26, scope: !22)
!703 = !DILocalVariable(name: "tzstring", scope: !22, file: !3, line: 508, type: !48)
!704 = !DILocalVariable(name: "name", arg: 1, scope: !705, file: !415, line: 95, type: !48)
!705 = distinct !DISubprogram(name: "tzalloc", scope: !415, file: !415, line: 95, type: !706, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !409, retainedNodes: !27)
!706 = !DISubroutineType(types: !707)
!707 = !{!417, !48}
!708 = !DILocation(line: 0, scope: !705, inlinedAt: !709)
!709 = distinct !DILocation(line: 509, column: 19, scope: !22)
!710 = !DILocation(line: 97, column: 22, scope: !705, inlinedAt: !709)
!711 = !DILocation(line: 97, column: 29, scope: !705, inlinedAt: !709)
!712 = !DILocation(line: 97, column: 43, scope: !705, inlinedAt: !709)
!713 = !DILocalVariable(name: "name_size", scope: !705, file: !415, line: 97, type: !303)
!714 = !DILocation(line: 98, column: 32, scope: !705, inlinedAt: !709)
!715 = !DILocation(line: 99, column: 27, scope: !705, inlinedAt: !709)
!716 = !DILocation(line: 509, column: 19, scope: !22)
!717 = !DILocation(line: 99, column: 19, scope: !705, inlinedAt: !709)
!718 = !DILocalVariable(name: "tz", scope: !705, file: !415, line: 99, type: !417)
!719 = !DILocation(line: 100, column: 7, scope: !720, inlinedAt: !709)
!720 = distinct !DILexicalBlock(scope: !705, file: !415, line: 100, column: 7)
!721 = !DILocation(line: 100, column: 7, scope: !705, inlinedAt: !709)
!722 = !DILocation(line: 102, column: 11, scope: !723, inlinedAt: !709)
!723 = distinct !DILexicalBlock(scope: !720, file: !415, line: 101, column: 5)
!724 = !DILocation(line: 102, column: 16, scope: !723, inlinedAt: !709)
!725 = !DILocation(line: 106, column: 23, scope: !723, inlinedAt: !709)
!726 = !DILocation(line: 106, column: 11, scope: !723, inlinedAt: !709)
!727 = !DILocation(line: 106, column: 21, scope: !723, inlinedAt: !709)
!728 = !DILocation(line: 107, column: 11, scope: !723, inlinedAt: !709)
!729 = !DILocation(line: 107, column: 20, scope: !723, inlinedAt: !709)
!730 = !DILocation(line: 108, column: 11, scope: !723, inlinedAt: !709)
!731 = !DILocalVariable(name: "abbrs", arg: 1, scope: !732, file: !415, line: 86, type: !16)
!732 = distinct !DISubprogram(name: "extend_abbrs", scope: !415, file: !415, line: 86, type: !733, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !409, retainedNodes: !27)
!733 = !DISubroutineType(types: !734)
!734 = !{null, !16, !48, !303}
!735 = !DILocation(line: 0, scope: !732, inlinedAt: !736)
!736 = distinct !DILocation(line: 109, column: 9, scope: !737, inlinedAt: !709)
!737 = distinct !DILexicalBlock(scope: !723, file: !415, line: 108, column: 11)
!738 = !DILocalVariable(name: "abbr", arg: 2, scope: !732, file: !415, line: 86, type: !48)
!739 = !DILocation(line: 88, column: 3, scope: !732, inlinedAt: !736)
!740 = !DILocation(line: 89, column: 3, scope: !732, inlinedAt: !736)
!741 = !DILocation(line: 89, column: 20, scope: !732, inlinedAt: !736)
!742 = !DILocation(line: 109, column: 9, scope: !737, inlinedAt: !709)
!743 = !DILocalVariable(name: "tz", scope: !22, file: !3, line: 509, type: !744)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "timezone_t", file: !418, line: 778, baseType: !745)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm_zone", file: !418, line: 778, flags: DIFlagFwdDecl)
!747 = !DILocation(line: 511, column: 7, scope: !22)
!748 = !DILocation(line: 0, scope: !749, inlinedAt: !752)
!749 = distinct !DISubprogram(name: "batch_convert", scope: !3, file: !3, line: 290, type: !750, scopeLine: 292, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !27)
!750 = !DISubroutineType(types: !751)
!751 = !{!108, !48, !48, !744, !48}
!752 = distinct !DILocation(line: 512, column: 10, scope: !753)
!753 = distinct !DILexicalBlock(scope: !22, file: !3, line: 511, column: 7)
!754 = !DILocalVariable(name: "input_filename", arg: 1, scope: !749, file: !3, line: 290, type: !48)
!755 = !DILocalVariable(name: "format", arg: 2, scope: !749, file: !3, line: 290, type: !48)
!756 = !DILocalVariable(name: "tz", arg: 3, scope: !749, file: !3, line: 291, type: !744)
!757 = !DILocalVariable(name: "tzstring", arg: 4, scope: !749, file: !3, line: 291, type: !48)
!758 = !DILocation(line: 299, column: 7, scope: !759, inlinedAt: !752)
!759 = distinct !DILexicalBlock(scope: !749, file: !3, line: 299, column: 7)
!760 = !DILocation(line: 299, column: 7, scope: !749, inlinedAt: !752)
!761 = !DILocation(line: 301, column: 24, scope: !762, inlinedAt: !752)
!762 = distinct !DILexicalBlock(scope: !759, file: !3, line: 300, column: 5)
!763 = !DILocation(line: 302, column: 19, scope: !762, inlinedAt: !752)
!764 = !DILocalVariable(name: "in_stream", scope: !749, file: !3, line: 294, type: !765)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !767, line: 7, baseType: !768)
!767 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !769, line: 49, size: 1728, elements: !770)
!769 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!770 = !{!771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !786, !788, !789, !790, !792, !793, !794, !796, !799, !801, !804, !807, !808, !809, !810, !811}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !768, file: !769, line: 51, baseType: !25, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !768, file: !769, line: 54, baseType: !16, size: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !768, file: !769, line: 55, baseType: !16, size: 64, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !768, file: !769, line: 56, baseType: !16, size: 64, offset: 192)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !768, file: !769, line: 57, baseType: !16, size: 64, offset: 256)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !768, file: !769, line: 58, baseType: !16, size: 64, offset: 320)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !768, file: !769, line: 59, baseType: !16, size: 64, offset: 384)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !768, file: !769, line: 60, baseType: !16, size: 64, offset: 448)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !768, file: !769, line: 61, baseType: !16, size: 64, offset: 512)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !768, file: !769, line: 64, baseType: !16, size: 64, offset: 576)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !768, file: !769, line: 65, baseType: !16, size: 64, offset: 640)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !768, file: !769, line: 66, baseType: !16, size: 64, offset: 704)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !768, file: !769, line: 68, baseType: !784, size: 64, offset: 768)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !769, line: 36, flags: DIFlagFwdDecl)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !768, file: !769, line: 70, baseType: !787, size: 64, offset: 832)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !768, file: !769, line: 72, baseType: !25, size: 32, offset: 896)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !768, file: !769, line: 73, baseType: !25, size: 32, offset: 928)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !768, file: !769, line: 74, baseType: !791, size: 64, offset: 960)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !97, line: 152, baseType: !98)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !768, file: !769, line: 77, baseType: !182, size: 16, offset: 1024)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !768, file: !769, line: 78, baseType: !180, size: 8, offset: 1040)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !768, file: !769, line: 79, baseType: !795, size: 8, offset: 1048)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8, elements: !249)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !768, file: !769, line: 81, baseType: !797, size: 64, offset: 1088)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !769, line: 43, baseType: null)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !768, file: !769, line: 89, baseType: !800, size: 64, offset: 1152)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !97, line: 153, baseType: !98)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !768, file: !769, line: 91, baseType: !802, size: 64, offset: 1216)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !769, line: 37, flags: DIFlagFwdDecl)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !768, file: !769, line: 92, baseType: !805, size: 64, offset: 1280)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !769, line: 38, flags: DIFlagFwdDecl)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !768, file: !769, line: 93, baseType: !787, size: 64, offset: 1344)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !768, file: !769, line: 94, baseType: !18, size: 64, offset: 1408)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !768, file: !769, line: 95, baseType: !303, size: 64, offset: 1472)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !768, file: !769, line: 96, baseType: !25, size: 32, offset: 1536)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !768, file: !769, line: 98, baseType: !812, size: 160, offset: 1568)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 160, elements: !813)
!813 = !{!814}
!814 = !DISubrange(count: 20)
!815 = !DILocation(line: 303, column: 5, scope: !762, inlinedAt: !752)
!816 = !DILocation(line: 306, column: 19, scope: !817, inlinedAt: !752)
!817 = distinct !DILexicalBlock(scope: !759, file: !3, line: 305, column: 5)
!818 = !DILocation(line: 307, column: 21, scope: !819, inlinedAt: !752)
!819 = distinct !DILexicalBlock(scope: !817, file: !3, line: 307, column: 11)
!820 = !DILocation(line: 307, column: 11, scope: !817, inlinedAt: !752)
!821 = !DILocation(line: 309, column: 11, scope: !822, inlinedAt: !752)
!822 = distinct !DILexicalBlock(scope: !819, file: !3, line: 308, column: 9)
!823 = !DILocation(line: 0, scope: !759, inlinedAt: !752)
!824 = !DILocalVariable(name: "line", scope: !749, file: !3, line: 295, type: !16)
!825 = !DILocation(line: 313, column: 8, scope: !749, inlinedAt: !752)
!826 = !DILocalVariable(name: "buflen", scope: !749, file: !3, line: 296, type: !303)
!827 = !DILocation(line: 314, column: 10, scope: !749, inlinedAt: !752)
!828 = !DILocalVariable(name: "ok", scope: !749, file: !3, line: 293, type: !108)
!829 = !DILocation(line: 318, column: 29, scope: !830, inlinedAt: !752)
!830 = distinct !DILexicalBlock(scope: !749, file: !3, line: 317, column: 5)
!831 = !DILocalVariable(name: "line_length", scope: !830, file: !3, line: 318, type: !832)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !833, line: 77, baseType: !834)
!833 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !97, line: 193, baseType: !98)
!835 = !DILocation(line: 0, scope: !830, inlinedAt: !752)
!836 = !DILocation(line: 319, column: 23, scope: !837, inlinedAt: !752)
!837 = distinct !DILexicalBlock(scope: !830, file: !3, line: 319, column: 11)
!838 = !DILocation(line: 319, column: 11, scope: !830, inlinedAt: !752)
!839 = !DILocation(line: 0, scope: !840, inlinedAt: !752)
!840 = distinct !DILexicalBlock(scope: !841, file: !3, line: 334, column: 9)
!841 = distinct !DILexicalBlock(scope: !830, file: !3, line: 325, column: 11)
!842 = !DILocation(line: 325, column: 37, scope: !841, inlinedAt: !752)
!843 = !DILocation(line: 326, column: 30, scope: !841, inlinedAt: !752)
!844 = !DILocalVariable(name: "when", scope: !749, file: !3, line: 297, type: !845)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !119, line: 10, size: 128, elements: !846)
!846 = !{!847, !848}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !845, file: !119, line: 12, baseType: !122, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !845, file: !119, line: 16, baseType: !124, size: 64, offset: 64)
!849 = !DILocation(line: 325, column: 13, scope: !841, inlinedAt: !752)
!850 = !DILocation(line: 325, column: 11, scope: !830, inlinedAt: !752)
!851 = !DILocation(line: 328, column: 15, scope: !852, inlinedAt: !752)
!852 = distinct !DILexicalBlock(scope: !853, file: !3, line: 328, column: 15)
!853 = distinct !DILexicalBlock(scope: !841, file: !3, line: 327, column: 9)
!854 = !DILocation(line: 328, column: 32, scope: !852, inlinedAt: !752)
!855 = !DILocation(line: 328, column: 37, scope: !852, inlinedAt: !752)
!856 = !DILocation(line: 328, column: 15, scope: !853, inlinedAt: !752)
!857 = !DILocation(line: 329, column: 35, scope: !852, inlinedAt: !752)
!858 = !DILocation(line: 330, column: 53, scope: !853, inlinedAt: !752)
!859 = !DILocation(line: 329, column: 13, scope: !852, inlinedAt: !752)
!860 = !DILocation(line: 330, column: 24, scope: !853, inlinedAt: !752)
!861 = !DILocalVariable(name: "arg", arg: 1, scope: !862, file: !307, line: 1079, type: !48)
!862 = distinct !DISubprogram(name: "quote", scope: !307, file: !307, line: 1079, type: !863, scopeLine: 1080, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !285, retainedNodes: !27)
!863 = !DISubroutineType(types: !864)
!864 = !{!48, !48}
!865 = !DILocation(line: 0, scope: !862, inlinedAt: !866)
!866 = distinct !DILocation(line: 330, column: 46, scope: !853, inlinedAt: !752)
!867 = !DILocalVariable(name: "n", arg: 1, scope: !868, file: !307, line: 1073, type: !25)
!868 = distinct !DISubprogram(name: "quote_n", scope: !307, file: !307, line: 1073, type: !869, scopeLine: 1074, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !285, retainedNodes: !27)
!869 = !DISubroutineType(types: !870)
!870 = !{!48, !25, !48}
!871 = !DILocation(line: 0, scope: !868, inlinedAt: !872)
!872 = distinct !DILocation(line: 1081, column: 10, scope: !862, inlinedAt: !866)
!873 = !DILocalVariable(name: "arg", arg: 2, scope: !868, file: !307, line: 1073, type: !48)
!874 = !DILocalVariable(name: "n", arg: 1, scope: !875, file: !307, line: 1061, type: !25)
!875 = distinct !DISubprogram(name: "quote_n_mem", scope: !307, file: !307, line: 1061, type: !876, scopeLine: 1062, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !285, retainedNodes: !27)
!876 = !DISubroutineType(types: !877)
!877 = !{!48, !25, !48, !303}
!878 = !DILocation(line: 0, scope: !875, inlinedAt: !879)
!879 = distinct !DILocation(line: 1075, column: 10, scope: !868, inlinedAt: !872)
!880 = !DILocalVariable(name: "arg", arg: 2, scope: !875, file: !307, line: 1061, type: !48)
!881 = !DILocalVariable(name: "argsize", arg: 3, scope: !875, file: !307, line: 1061, type: !303)
!882 = !DILocation(line: 1063, column: 10, scope: !875, inlinedAt: !879)
!883 = !DILocation(line: 330, column: 11, scope: !853, inlinedAt: !752)
!884 = !DILocation(line: 332, column: 9, scope: !853, inlinedAt: !752)
!885 = !DILocation(line: 335, column: 17, scope: !840, inlinedAt: !752)
!886 = !DILocation(line: 335, column: 14, scope: !840, inlinedAt: !752)
!887 = !DILocation(line: 0, scope: !841, inlinedAt: !752)
!888 = distinct !{!888, !889, !890}
!889 = !DILocation(line: 316, column: 3, scope: !749, inlinedAt: !752)
!890 = !DILocation(line: 337, column: 5, scope: !749, inlinedAt: !752)
!891 = !DILocalVariable(name: "fp", arg: 1, scope: !892, file: !893, line: 58, type: !896)
!892 = distinct !DISubprogram(name: "rpl_fclose", scope: !893, file: !893, line: 58, type: !894, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !400, retainedNodes: !27)
!893 = !DIFile(filename: "lib/fclose.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!894 = !DISubroutineType(types: !895)
!895 = !{!25, !896}
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !767, line: 7, baseType: !898)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !769, line: 49, size: 1728, elements: !899)
!899 = !{!900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !898, file: !769, line: 51, baseType: !25, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !898, file: !769, line: 54, baseType: !16, size: 64, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !898, file: !769, line: 55, baseType: !16, size: 64, offset: 128)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !898, file: !769, line: 56, baseType: !16, size: 64, offset: 192)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !898, file: !769, line: 57, baseType: !16, size: 64, offset: 256)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !898, file: !769, line: 58, baseType: !16, size: 64, offset: 320)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !898, file: !769, line: 59, baseType: !16, size: 64, offset: 384)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !898, file: !769, line: 60, baseType: !16, size: 64, offset: 448)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !898, file: !769, line: 61, baseType: !16, size: 64, offset: 512)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !898, file: !769, line: 64, baseType: !16, size: 64, offset: 576)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !898, file: !769, line: 65, baseType: !16, size: 64, offset: 640)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !898, file: !769, line: 66, baseType: !16, size: 64, offset: 704)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !898, file: !769, line: 68, baseType: !784, size: 64, offset: 768)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !898, file: !769, line: 70, baseType: !914, size: 64, offset: 832)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !898, file: !769, line: 72, baseType: !25, size: 32, offset: 896)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !898, file: !769, line: 73, baseType: !25, size: 32, offset: 928)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !898, file: !769, line: 74, baseType: !791, size: 64, offset: 960)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !898, file: !769, line: 77, baseType: !182, size: 16, offset: 1024)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !898, file: !769, line: 78, baseType: !180, size: 8, offset: 1040)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !898, file: !769, line: 79, baseType: !795, size: 8, offset: 1048)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !898, file: !769, line: 81, baseType: !797, size: 64, offset: 1088)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !898, file: !769, line: 89, baseType: !800, size: 64, offset: 1152)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !898, file: !769, line: 91, baseType: !802, size: 64, offset: 1216)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !898, file: !769, line: 92, baseType: !805, size: 64, offset: 1280)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !898, file: !769, line: 93, baseType: !914, size: 64, offset: 1344)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !898, file: !769, line: 94, baseType: !18, size: 64, offset: 1408)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !898, file: !769, line: 95, baseType: !303, size: 64, offset: 1472)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !898, file: !769, line: 96, baseType: !25, size: 32, offset: 1536)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !898, file: !769, line: 98, baseType: !812, size: 160, offset: 1568)
!930 = !DILocation(line: 0, scope: !892, inlinedAt: !931)
!931 = distinct !DILocation(line: 339, column: 7, scope: !932, inlinedAt: !752)
!932 = distinct !DILexicalBlock(scope: !749, file: !3, line: 339, column: 7)
!933 = !DILocalVariable(name: "saved_errno", scope: !892, file: !893, line: 60, type: !25)
!934 = !DILocalVariable(name: "result", scope: !892, file: !893, line: 62, type: !25)
!935 = !DILocation(line: 65, column: 8, scope: !892, inlinedAt: !931)
!936 = !DILocalVariable(name: "fd", scope: !892, file: !893, line: 61, type: !25)
!937 = !DILocation(line: 66, column: 10, scope: !938, inlinedAt: !931)
!938 = distinct !DILexicalBlock(scope: !892, file: !893, line: 66, column: 7)
!939 = !DILocation(line: 66, column: 7, scope: !892, inlinedAt: !931)
!940 = !DILocation(line: 72, column: 9, scope: !941, inlinedAt: !931)
!941 = distinct !DILexicalBlock(scope: !892, file: !893, line: 72, column: 7)
!942 = !DILocation(line: 72, column: 23, scope: !941, inlinedAt: !931)
!943 = !DILocation(line: 72, column: 26, scope: !941, inlinedAt: !931)
!944 = !DILocation(line: 72, column: 59, scope: !941, inlinedAt: !931)
!945 = !DILocation(line: 73, column: 7, scope: !941, inlinedAt: !931)
!946 = !DILocalVariable(name: "stream", arg: 1, scope: !947, file: !948, line: 129, type: !951)
!947 = distinct !DISubprogram(name: "rpl_fflush", scope: !948, file: !948, line: 129, type: !949, scopeLine: 130, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !402, retainedNodes: !27)
!948 = !DIFile(filename: "lib/fflush.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!949 = !DISubroutineType(types: !950)
!950 = !{!25, !951}
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !767, line: 7, baseType: !953)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !769, line: 49, size: 1728, elements: !954)
!954 = !{!955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !953, file: !769, line: 51, baseType: !25, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !953, file: !769, line: 54, baseType: !16, size: 64, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !953, file: !769, line: 55, baseType: !16, size: 64, offset: 128)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !953, file: !769, line: 56, baseType: !16, size: 64, offset: 192)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !953, file: !769, line: 57, baseType: !16, size: 64, offset: 256)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !953, file: !769, line: 58, baseType: !16, size: 64, offset: 320)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !953, file: !769, line: 59, baseType: !16, size: 64, offset: 384)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !953, file: !769, line: 60, baseType: !16, size: 64, offset: 448)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !953, file: !769, line: 61, baseType: !16, size: 64, offset: 512)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !953, file: !769, line: 64, baseType: !16, size: 64, offset: 576)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !953, file: !769, line: 65, baseType: !16, size: 64, offset: 640)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !953, file: !769, line: 66, baseType: !16, size: 64, offset: 704)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !953, file: !769, line: 68, baseType: !784, size: 64, offset: 768)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !953, file: !769, line: 70, baseType: !969, size: 64, offset: 832)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !953, file: !769, line: 72, baseType: !25, size: 32, offset: 896)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !953, file: !769, line: 73, baseType: !25, size: 32, offset: 928)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !953, file: !769, line: 74, baseType: !791, size: 64, offset: 960)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !953, file: !769, line: 77, baseType: !182, size: 16, offset: 1024)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !953, file: !769, line: 78, baseType: !180, size: 8, offset: 1040)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !953, file: !769, line: 79, baseType: !795, size: 8, offset: 1048)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !953, file: !769, line: 81, baseType: !797, size: 64, offset: 1088)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !953, file: !769, line: 89, baseType: !800, size: 64, offset: 1152)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !953, file: !769, line: 91, baseType: !802, size: 64, offset: 1216)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !953, file: !769, line: 92, baseType: !805, size: 64, offset: 1280)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !953, file: !769, line: 93, baseType: !969, size: 64, offset: 1344)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !953, file: !769, line: 94, baseType: !18, size: 64, offset: 1408)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !953, file: !769, line: 95, baseType: !303, size: 64, offset: 1472)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !953, file: !769, line: 96, baseType: !25, size: 32, offset: 1536)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !953, file: !769, line: 98, baseType: !812, size: 160, offset: 1568)
!985 = !DILocation(line: 0, scope: !947, inlinedAt: !986)
!986 = distinct !DILocation(line: 73, column: 10, scope: !941, inlinedAt: !931)
!987 = !DILocalVariable(name: "fp", arg: 1, scope: !988, file: !948, line: 41, type: !951)
!988 = distinct !DISubprogram(name: "clear_ungetc_buffer_preserving_position", scope: !948, file: !948, line: 41, type: !989, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !402, retainedNodes: !27)
!989 = !DISubroutineType(types: !990)
!990 = !{null, !951}
!991 = !DILocation(line: 0, scope: !988, inlinedAt: !992)
!992 = distinct !DILocation(line: 156, column: 3, scope: !947, inlinedAt: !986)
!993 = !DILocation(line: 43, column: 11, scope: !994, inlinedAt: !992)
!994 = distinct !DILexicalBlock(scope: !988, file: !948, line: 43, column: 7)
!995 = !DILocation(line: 43, column: 18, scope: !994, inlinedAt: !992)
!996 = !DILocation(line: 43, column: 7, scope: !988, inlinedAt: !992)
!997 = !DILocalVariable(name: "fp", arg: 1, scope: !998, file: !999, line: 28, type: !1002)
!998 = distinct !DISubprogram(name: "rpl_fseeko", scope: !999, file: !999, line: 28, type: !1000, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !404, retainedNodes: !27)
!999 = !DIFile(filename: "lib/fseeko.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!25, !1002, !1036, !25}
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !767, line: 7, baseType: !1004)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !769, line: 49, size: 1728, elements: !1005)
!1005 = !{!1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1004, file: !769, line: 51, baseType: !25, size: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1004, file: !769, line: 54, baseType: !16, size: 64, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1004, file: !769, line: 55, baseType: !16, size: 64, offset: 128)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1004, file: !769, line: 56, baseType: !16, size: 64, offset: 192)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1004, file: !769, line: 57, baseType: !16, size: 64, offset: 256)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1004, file: !769, line: 58, baseType: !16, size: 64, offset: 320)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1004, file: !769, line: 59, baseType: !16, size: 64, offset: 384)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1004, file: !769, line: 60, baseType: !16, size: 64, offset: 448)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1004, file: !769, line: 61, baseType: !16, size: 64, offset: 512)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1004, file: !769, line: 64, baseType: !16, size: 64, offset: 576)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1004, file: !769, line: 65, baseType: !16, size: 64, offset: 640)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1004, file: !769, line: 66, baseType: !16, size: 64, offset: 704)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1004, file: !769, line: 68, baseType: !784, size: 64, offset: 768)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1004, file: !769, line: 70, baseType: !1020, size: 64, offset: 832)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1004, file: !769, line: 72, baseType: !25, size: 32, offset: 896)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1004, file: !769, line: 73, baseType: !25, size: 32, offset: 928)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1004, file: !769, line: 74, baseType: !791, size: 64, offset: 960)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1004, file: !769, line: 77, baseType: !182, size: 16, offset: 1024)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1004, file: !769, line: 78, baseType: !180, size: 8, offset: 1040)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1004, file: !769, line: 79, baseType: !795, size: 8, offset: 1048)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1004, file: !769, line: 81, baseType: !797, size: 64, offset: 1088)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1004, file: !769, line: 89, baseType: !800, size: 64, offset: 1152)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1004, file: !769, line: 91, baseType: !802, size: 64, offset: 1216)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1004, file: !769, line: 92, baseType: !805, size: 64, offset: 1280)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1004, file: !769, line: 93, baseType: !1020, size: 64, offset: 1344)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1004, file: !769, line: 94, baseType: !18, size: 64, offset: 1408)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1004, file: !769, line: 95, baseType: !303, size: 64, offset: 1472)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1004, file: !769, line: 96, baseType: !25, size: 32, offset: 1536)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1004, file: !769, line: 98, baseType: !812, size: 160, offset: 1568)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !833, line: 63, baseType: !791)
!1037 = !DILocation(line: 0, scope: !998, inlinedAt: !1038)
!1038 = distinct !DILocation(line: 45, column: 5, scope: !994, inlinedAt: !992)
!1039 = !DILocalVariable(name: "offset", arg: 2, scope: !998, file: !999, line: 28, type: !1036)
!1040 = !DILocalVariable(name: "whence", arg: 3, scope: !998, file: !999, line: 28, type: !25)
!1041 = !DILocation(line: 52, column: 11, scope: !1042, inlinedAt: !1038)
!1042 = distinct !DILexicalBlock(scope: !998, file: !999, line: 52, column: 7)
!1043 = !DILocation(line: 52, column: 31, scope: !1042, inlinedAt: !1038)
!1044 = !DILocation(line: 52, column: 24, scope: !1042, inlinedAt: !1038)
!1045 = !DILocation(line: 53, column: 7, scope: !1042, inlinedAt: !1038)
!1046 = !DILocation(line: 53, column: 14, scope: !1042, inlinedAt: !1038)
!1047 = !DILocation(line: 53, column: 35, scope: !1042, inlinedAt: !1038)
!1048 = !DILocation(line: 53, column: 28, scope: !1042, inlinedAt: !1038)
!1049 = !DILocation(line: 54, column: 7, scope: !1042, inlinedAt: !1038)
!1050 = !DILocation(line: 54, column: 14, scope: !1042, inlinedAt: !1038)
!1051 = !DILocation(line: 54, column: 28, scope: !1042, inlinedAt: !1038)
!1052 = !DILocation(line: 52, column: 7, scope: !998, inlinedAt: !1038)
!1053 = !DILocalVariable(name: "pos", scope: !1054, file: !999, line: 117, type: !1036)
!1054 = distinct !DILexicalBlock(scope: !1042, file: !999, line: 113, column: 5)
!1055 = !DILocation(line: 0, scope: !1054, inlinedAt: !1038)
!1056 = !DILocation(line: 129, column: 18, scope: !1054, inlinedAt: !1038)
!1057 = !DILocation(line: 130, column: 11, scope: !1054, inlinedAt: !1038)
!1058 = !DILocation(line: 130, column: 19, scope: !1054, inlinedAt: !1038)
!1059 = !DILocation(line: 161, column: 7, scope: !1054, inlinedAt: !1038)
!1060 = !DILocation(line: 163, column: 10, scope: !998, inlinedAt: !1038)
!1061 = !DILocation(line: 163, column: 3, scope: !998, inlinedAt: !1038)
!1062 = !DILocation(line: 73, column: 10, scope: !941, inlinedAt: !931)
!1063 = !DILocation(line: 72, column: 7, scope: !892, inlinedAt: !931)
!1064 = !DILocation(line: 74, column: 19, scope: !941, inlinedAt: !931)
!1065 = !DILocation(line: 100, column: 12, scope: !892, inlinedAt: !931)
!1066 = !DILocation(line: 105, column: 19, scope: !1067, inlinedAt: !931)
!1067 = distinct !DILexicalBlock(scope: !892, file: !893, line: 105, column: 7)
!1068 = !DILocation(line: 105, column: 7, scope: !892, inlinedAt: !931)
!1069 = !DILocation(line: 107, column: 13, scope: !1070, inlinedAt: !931)
!1070 = distinct !DILexicalBlock(scope: !1067, file: !893, line: 106, column: 5)
!1071 = !DILocation(line: 339, column: 7, scope: !749, inlinedAt: !752)
!1072 = !DILocation(line: 339, column: 26, scope: !932, inlinedAt: !752)
!1073 = !DILocation(line: 340, column: 5, scope: !932, inlinedAt: !752)
!1074 = !DILocation(line: 344, column: 10, scope: !749, inlinedAt: !752)
!1075 = !DILocation(line: 344, column: 3, scope: !749, inlinedAt: !752)
!1076 = !DILocalVariable(name: "ok", scope: !22, file: !3, line: 359, type: !108)
!1077 = !DILocation(line: 512, column: 5, scope: !753)
!1078 = !DILocalVariable(name: "valid_date", scope: !1079, file: !3, line: 515, type: !108)
!1079 = distinct !DILexicalBlock(scope: !753, file: !3, line: 514, column: 5)
!1080 = !DILocation(line: 0, scope: !1079)
!1081 = !DILocation(line: 518, column: 34, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1079, file: !3, line: 518, column: 11)
!1083 = !DILocation(line: 520, column: 15, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1085, file: !3, line: 520, column: 15)
!1085 = distinct !DILexicalBlock(scope: !1082, file: !3, line: 519, column: 9)
!1086 = !DILocation(line: 520, column: 22, scope: !1084)
!1087 = !DILocation(line: 520, column: 15, scope: !1085)
!1088 = !DILocation(line: 525, column: 25, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !1084, file: !3, line: 521, column: 13)
!1090 = !DILocalVariable(name: "p", arg: 1, scope: !1091, file: !1092, line: 175, type: !1095)
!1091 = distinct !DISubprogram(name: "posixtime", scope: !1092, file: !1092, line: 175, type: !1093, scopeLine: 176, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !385, retainedNodes: !27)
!1092 = !DIFile(filename: "lib/posixtm.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!108, !1095, !48, !6}
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!1096 = !DILocation(line: 0, scope: !1091, inlinedAt: !1097)
!1097 = distinct !DILocation(line: 526, column: 28, scope: !1089)
!1098 = !DILocalVariable(name: "s", arg: 2, scope: !1091, file: !1092, line: 175, type: !48)
!1099 = !DILocalVariable(name: "syntax_bits", arg: 3, scope: !1091, file: !1092, line: 175, type: !6)
!1100 = !DILocalVariable(name: "tm0", scope: !1091, file: !1092, line: 177, type: !1101)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !1102, line: 7, size: 448, elements: !1103)
!1102 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h", directory: "")
!1103 = !{!1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114}
