; ModuleID = 'whodir/who-O0-inserted.ll'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.addrinfo = type { i32, i32, i32, i32, i32, %struct.sockaddr*, i8*, %struct.addrinfo* }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.utmpx = type { i16, i32, [32 x i8], [4 x i8], [32 x i8], [256 x i8], %struct.__exit_status, i32, %struct.anon, [4 x i32], [20 x i8] }
%struct.__exit_status = type { i16, i16 }
%struct.anon = type { i32, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }


!10 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !12, line: 160, baseType: !13)
!12 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!13 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!14 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!15 = !{!16, !19, !21, !23, !25, !27, !29, !31, !33, !35, !37, !39, !41, !43, !45, !47, !51, !0, !54, !62, !108, !113, !118, !123, !131, !136, !138}
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "do_lookup", scope: !2, file: !3, line: 102, type: !18, isLocal: true, isDefinition: true)
!18 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "short_list", scope: !2, file: !3, line: 107, type: !18, isLocal: true, isDefinition: true)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "short_output", scope: !2, file: !3, line: 110, type: !18, isLocal: true, isDefinition: true)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "include_idle", scope: !2, file: !3, line: 115, type: !18, isLocal: true, isDefinition: true)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "include_heading", scope: !2, file: !3, line: 118, type: !18, isLocal: true, isDefinition: true)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "include_mesg", scope: !2, file: !3, line: 122, type: !18, isLocal: true, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "include_exit", scope: !2, file: !3, line: 125, type: !18, isLocal: true, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "need_boottime", scope: !2, file: !3, line: 128, type: !18, isLocal: true, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "need_deadprocs", scope: !2, file: !3, line: 131, type: !18, isLocal: true, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "need_login", scope: !2, file: !3, line: 134, type: !18, isLocal: true, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "need_initspawn", scope: !2, file: !3, line: 137, type: !18, isLocal: true, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "need_clockchange", scope: !2, file: !3, line: 140, type: !18, isLocal: true, isDefinition: true)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "need_runlevel", scope: !2, file: !3, line: 143, type: !18, isLocal: true, isDefinition: true)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "need_users", scope: !2, file: !3, line: 146, type: !18, isLocal: true, isDefinition: true)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "my_line_only", scope: !2, file: !3, line: 149, type: !18, isLocal: true, isDefinition: true)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "time_format", scope: !2, file: !3, line: 153, type: !49, isLocal: true, isDefinition: true)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "time_format_width", scope: !2, file: !3, line: 154, type: !53, isLocal: true, isDefinition: true)
!53 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "mesg", scope: !56, file: !3, line: 249, type: !59, isLocal: true, isDefinition: true)
!56 = distinct !DISubprogram(name: "print_line", scope: !3, file: !3, line: 244, type: !57, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!57 = !DISubroutineType(types: !58)
!58 = !{null, !53, !49, !50, !53, !49, !49, !49, !49, !49, !49}
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 24, elements: !60)
!60 = !{!61}
!61 = !DISubrange(count: 3)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "hoststr", scope: !64, file: !3, line: 339, type: !6, isLocal: true, isDefinition: true)
!64 = distinct !DISubprogram(name: "print_user", scope: !3, file: !3, line: 333, type: !65, scopeLine: 334, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!65 = !DISubroutineType(types: !66)
!66 = !{null, !67, !9}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !70, line: 146, baseType: !71)
!70 = !DIFile(filename: "./lib/readutmp.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !72, line: 55, size: 3072, elements: !73)
!72 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/utmpx.h", directory: "")
!73 = !{!74, !75, !77, !81, !85, !86, !90, !95, !97, !102, !104}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !71, file: !72, line: 57, baseType: !14, size: 16)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !71, file: !72, line: 58, baseType: !76, size: 32, offset: 32)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !12, line: 154, baseType: !53)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !71, file: !72, line: 59, baseType: !78, size: 256, offset: 64)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !71, file: !72, line: 61, baseType: !82, size: 32, offset: 320)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 4)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !71, file: !72, line: 63, baseType: !78, size: 256, offset: 352)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !71, file: !72, line: 65, baseType: !87, size: 2048, offset: 608)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 2048, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 256)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !71, file: !72, line: 67, baseType: !91, size: 32, offset: 2656)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !72, line: 42, size: 32, elements: !92)
!92 = !{!93, !94}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !91, file: !72, line: 45, baseType: !14, size: 16)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !91, file: !72, line: 46, baseType: !14, size: 16, offset: 16)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !71, file: !72, line: 74, baseType: !96, size: 32, offset: 2688)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !12, line: 41, baseType: !53)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !71, file: !72, line: 79, baseType: !98, size: 64, offset: 2720)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !71, file: !72, line: 75, size: 64, elements: !99)
!99 = !{!100, !101}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !98, file: !72, line: 77, baseType: !96, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !98, file: !72, line: 78, baseType: !96, size: 32, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !71, file: !72, line: 84, baseType: !103, size: 128, offset: 2784)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 128, elements: !83)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !71, file: !72, line: 85, baseType: !105, size: 160, offset: 2912)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 160, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 20)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "hostlen", scope: !64, file: !3, line: 341, type: !110, isLocal: true, isDefinition: true)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !111, line: 46, baseType: !112)
!111 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.1/include/stddef.h", directory: "")
!112 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "now", scope: !115, file: !3, line: 190, type: !9, isLocal: true, isDefinition: true)
!115 = distinct !DISubprogram(name: "idle_string", scope: !3, file: !3, line: 188, type: !116, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!116 = !DISubroutineType(types: !117)
!117 = !{!49, !9, !9}
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "idle_hhmm", scope: !115, file: !3, line: 202, type: !120, isLocal: true, isDefinition: true)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 48, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 6)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "buf", scope: !125, file: !3, line: 220, type: !128, isLocal: true, isDefinition: true)
!125 = distinct !DISubprogram(name: "time_string", scope: !3, file: !3, line: 218, type: !126, scopeLine: 219, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!126 = !DISubroutineType(types: !127)
!127 = !{!49, !67}
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 264, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 33)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "runlevline", scope: !133, file: !3, line: 516, type: !6, isLocal: true, isDefinition: true)
!133 = distinct !DISubprogram(name: "print_runlevel", scope: !3, file: !3, line: 514, type: !134, scopeLine: 515, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!134 = !DISubroutineType(types: !135)
!135 = !{null, !67}
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "comment", scope: !133, file: !3, line: 516, type: !6, isLocal: true, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "exitstr", scope: !140, file: !3, line: 461, type: !6, isLocal: true, isDefinition: true)
!140 = distinct !DISubprogram(name: "print_deadprocs", scope: !3, file: !3, line: 459, type: !134, scopeLine: 460, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 4608, elements: !151)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !144, line: 50, size: 256, elements: !145)
!144 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "")
!145 = !{!146, !147, !148, !150}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !143, file: !144, line: 52, baseType: !49, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !143, file: !144, line: 55, baseType: !53, size: 32, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !143, file: !144, line: 56, baseType: !149, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !143, file: !144, line: 57, baseType: !53, size: 32, offset: 192)
!151 = !{!152}
!152 = !DISubrange(count: 18)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "Version", scope: !155, file: !156, line: 2, type: !49, isLocal: false, isDefinition: true)
!155 = distinct !DICompileUnit(language: DW_LANG_C99, file: !156, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !157, nameTableKind: None)
!156 = !DIFile(filename: "src/version.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!157 = !{!153}
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "last_cherror", scope: !160, file: !166, line: 28, type: !53, isLocal: true, isDefinition: true)
!160 = distinct !DICompileUnit(language: DW_LANG_C99, file: !161, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !162, nameTableKind: None)
!161 = !DIFile(filename: "./lib/canon-host.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!162 = !{!163, !158}
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "hints", scope: !165, file: !166, line: 64, type: !169, isLocal: true, isDefinition: true)
!165 = distinct !DISubprogram(name: "canon_host_r", scope: !166, file: !166, line: 61, type: !167, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !160, retainedNodes: !4)
!166 = !DIFile(filename: "lib/canon-host.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!167 = !DISubroutineType(types: !168)
!168 = !{!6, !49, !149}
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !170, line: 565, size: 384, elements: !171)
!170 = !DIFile(filename: "/usr/include/netdb.h", directory: "")
!171 = !{!172, !173, !174, !175, !176, !181, !193, !194}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !169, file: !170, line: 567, baseType: !53, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !169, file: !170, line: 568, baseType: !53, size: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !169, file: !170, line: 569, baseType: !53, size: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !169, file: !170, line: 570, baseType: !53, size: 32, offset: 96)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !169, file: !170, line: 571, baseType: !177, size: 32, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !178, line: 33, baseType: !179)
!178 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "")
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !12, line: 209, baseType: !180)
!180 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !169, file: !170, line: 572, baseType: !182, size: 64, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !178, line: 178, size: 128, elements: !184)
!184 = !{!185, !189}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !183, file: !178, line: 180, baseType: !186, size: 16)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !187, line: 28, baseType: !188)
!187 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "")
!188 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !183, file: !178, line: 181, baseType: !190, size: 112, offset: 16)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 112, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 14)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !169, file: !170, line: 573, baseType: !6, size: 64, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !169, file: !170, line: 574, baseType: !195, size: 64, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !198, file: !203, line: 56, type: !18, isLocal: true, isDefinition: true)
!198 = distinct !DICompileUnit(language: DW_LANG_C99, file: !199, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !200, nameTableKind: None)
!199 = !DIFile(filename: "./lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!200 = !{!201, !196}
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "file_name", scope: !198, file: !203, line: 46, type: !49, isLocal: true, isDefinition: true)
!203 = !DIFile(filename: "lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "exit_failure", scope: !206, file: !209, line: 24, type: !210, isLocal: false, isDefinition: true)
!206 = distinct !DICompileUnit(language: DW_LANG_C99, file: !207, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !208, nameTableKind: None)
!207 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!208 = !{!204}
!209 = !DIFile(filename: "lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!210 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !53)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "program_name", scope: !213, file: !217, line: 33, type: !49, isLocal: false, isDefinition: true)
!213 = distinct !DICompileUnit(language: DW_LANG_C99, file: !214, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !215, globals: !216, nameTableKind: None)
!214 = !DIFile(filename: "./lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!215 = !{!8, !6}
!216 = !{!211}
!217 = !DIFile(filename: "lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !220, file: !241, line: 116, type: !254, isLocal: true, isDefinition: true)
!220 = distinct !DICompileUnit(language: DW_LANG_C99, file: !221, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !222, retainedTypes: !237, globals: !238, nameTableKind: None)
!221 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!222 = !{!223}
!223 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !224, line: 32, baseType: !180, size: 32, elements: !225)
!224 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!225 = !{!226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236}
!226 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!227 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!228 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!229 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!230 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!231 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!232 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!233 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!234 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!235 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!236 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!237 = !{!53, !188, !110}
!238 = !{!239, !246, !252, !218, !264, !266, !273, !275}
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !220, file: !241, line: 85, type: !242, isLocal: false, isDefinition: true)
!241 = !DIFile(filename: "lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 704, elements: !244)
!243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!244 = !{!245}
!245 = !DISubrange(count: 11)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !220, file: !241, line: 101, type: !248, isLocal: false, isDefinition: true)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 320, elements: !250)
!249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !223)
!250 = !{!251}
!251 = !DISubrange(count: 10)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !220, file: !241, line: 1052, type: !254, isLocal: false, isDefinition: true)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !241, line: 65, size: 448, elements: !255)
!255 = !{!256, !257, !258, !262, !263}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !254, file: !241, line: 68, baseType: !223, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !254, file: !241, line: 71, baseType: !53, size: 32, offset: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !254, file: !241, line: 75, baseType: !259, size: 256, offset: 64)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 256, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 8)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !254, file: !241, line: 78, baseType: !49, size: 64, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !254, file: !241, line: 81, baseType: !49, size: 64, offset: 384)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "slot0", scope: !220, file: !241, line: 842, type: !87, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "slotvec", scope: !220, file: !241, line: 845, type: !268, isLocal: true, isDefinition: true)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !241, line: 834, size: 128, elements: !270)
!270 = !{!271, !272}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !269, file: !241, line: 836, baseType: !110, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !269, file: !241, line: 837, baseType: !6, size: 64, offset: 64)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "nslots", scope: !220, file: !241, line: 843, type: !53, isLocal: true, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "slotvec0", scope: !220, file: !241, line: 844, type: !269, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !279, file: !282, line: 26, type: !283, isLocal: false, isDefinition: true)
!279 = distinct !DICompileUnit(language: DW_LANG_C99, file: !280, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !281, nameTableKind: None)
!280 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!281 = !{!277}
!282 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 376, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 47)
!286 = distinct !DICompileUnit(language: DW_LANG_C99, file: !287, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!287 = !DIFile(filename: "./lib/c-ctype.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!288 = distinct !DICompileUnit(language: DW_LANG_C99, file: !289, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!289 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!290 = distinct !DICompileUnit(language: DW_LANG_C99, file: !291, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !292, nameTableKind: None)
!291 = !DIFile(filename: "./lib/imaxtostr.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!292 = !{!293}
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !294, line: 101, baseType: !295)
!294 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !12, line: 72, baseType: !13)
!296 = distinct !DICompileUnit(language: DW_LANG_C99, file: !297, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !298, nameTableKind: None)
!297 = !DIFile(filename: "./lib/setlocale_null.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!298 = !{!8}
!299 = distinct !DICompileUnit(language: DW_LANG_C99, file: !300, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !298, nameTableKind: None)
!300 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!301 = distinct !DICompileUnit(language: DW_LANG_C99, file: !302, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !303, nameTableKind: None)
!302 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!303 = !{!110, !6, !8}
!304 = distinct !DICompileUnit(language: DW_LANG_C99, file: !305, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!305 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!306 = distinct !DICompileUnit(language: DW_LANG_C99, file: !307, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !308, nameTableKind: None)
!307 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!308 = !{!110}
!309 = distinct !DICompileUnit(language: DW_LANG_C99, file: !310, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !311, nameTableKind: None)
!310 = !DIFile(filename: "./lib/readutmp.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!311 = !{!6, !8}
!312 = distinct !DICompileUnit(language: DW_LANG_C99, file: !313, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !314, nameTableKind: None)
!313 = !DIFile(filename: "./lib/c-strcasecmp.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!314 = !{!315}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !317)
!317 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!318 = distinct !DICompileUnit(language: DW_LANG_C99, file: !319, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!319 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!320 = distinct !DICompileUnit(language: DW_LANG_C99, file: !321, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !298, nameTableKind: None)
!321 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!322 = distinct !DICompileUnit(language: DW_LANG_C99, file: !323, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!323 = !DIFile(filename: "./lib/fclose.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!324 = distinct !DICompileUnit(language: DW_LANG_C99, file: !325, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !298, nameTableKind: None)
!325 = !DIFile(filename: "./lib/fflush.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!326 = distinct !DICompileUnit(language: DW_LANG_C99, file: !327, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !298, nameTableKind: None)
!327 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!328 = !{!"clang version 9.0.1-12 "}
!329 = !{i32 2, !"Dwarf Version", i32 4}
!330 = !{i32 2, !"Debug Info Version", i32 3}
!331 = !{i32 1, !"wchar_size", i32 4}
!332 = !{i32 1, !"ThinLTO", i32 0}
!333 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!334 = !DILocalVariable(name: "status", arg: 1, scope: !335, file: !3, line: 638, type: !53)
!335 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 638, type: !336, scopeLine: 639, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!336 = !DISubroutineType(types: !337)
!337 = !{null, !53}
!338 = !DILocation(line: 638, column: 12, scope: !335)
!339 = !DILocation(line: 640, column: 7, scope: !340)
!340 = distinct !DILexicalBlock(scope: !335, file: !3, line: 640, column: 7)
!341 = !DILocation(line: 640, column: 14, scope: !340)
!342 = !DILocation(line: 640, column: 7, scope: !335)
!343 = !DILocation(line: 641, column: 5, scope: !340)
!344 = !DILocation(line: 641, column: 5, scope: !345)
!345 = distinct !DILexicalBlock(scope: !340, file: !3, line: 641, column: 5)
!346 = !DILocation(line: 644, column: 15, scope: !347)
!347 = distinct !DILexicalBlock(scope: !340, file: !3, line: 643, column: 5)
!348 = !DILocation(line: 644, column: 66, scope: !347)
!349 = !DILocation(line: 644, column: 7, scope: !347)
!350 = !DILocation(line: 645, column: 7, scope: !347)
!351 = !DILocation(line: 648, column: 7, scope: !347)
!352 = !DILocation(line: 655, column: 7, scope: !347)
!353 = !DILocation(line: 658, column: 7, scope: !347)
!354 = !DILocation(line: 663, column: 7, scope: !347)
!355 = !DILocation(line: 669, column: 7, scope: !347)
!356 = !DILocation(line: 675, column: 7, scope: !347)
!357 = !DILocation(line: 676, column: 7, scope: !347)
!358 = !DILocation(line: 677, column: 15, scope: !347)
!359 = !DILocation(line: 677, column: 7, scope: !347)
!360 = !DILocation(line: 682, column: 7, scope: !347)
!361 = !DILocation(line: 684, column: 9, scope: !335)
!362 = !DILocation(line: 684, column: 3, scope: !335)
!363 = !DILocalVariable(name: "program", arg: 1, scope: !364, file: !365, line: 634, type: !49)
!364 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !365, file: !365, line: 634, type: !366, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!365 = !DIFile(filename: "src/system.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!366 = !DISubroutineType(types: !367)
!367 = !{null, !49}
!368 = !DILocation(line: 634, column: 34, scope: !364)
!369 = !DILocalVariable(name: "infomap", scope: !364, file: !365, line: 636, type: !370)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !371, size: 896, elements: !376)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !364, file: !365, line: 636, size: 128, elements: !373)
!373 = !{!374, !375}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !372, file: !365, line: 636, baseType: !49, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !372, file: !365, line: 636, baseType: !49, size: 64, offset: 64)
!376 = !{!377}
!377 = !DISubrange(count: 7)
!378 = !DILocation(line: 636, column: 67, scope: !364)
!379 = !DILocalVariable(name: "node", scope: !364, file: !365, line: 646, type: !49)
!380 = !DILocation(line: 646, column: 15, scope: !364)
!381 = !DILocation(line: 646, column: 22, scope: !364)
!382 = !DILocalVariable(name: "map_prog", scope: !364, file: !365, line: 647, type: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!384 = !DILocation(line: 647, column: 25, scope: !364)
!385 = !DILocation(line: 647, column: 36, scope: !364)
!386 = !DILocation(line: 649, column: 3, scope: !364)
!387 = !DILocation(line: 649, column: 10, scope: !364)
!388 = !DILocation(line: 649, column: 20, scope: !364)
!389 = !DILocation(line: 649, column: 28, scope: !364)
!390 = !DILocation(line: 649, column: 33, scope: !364)
!391 = !DILocation(line: 649, column: 31, scope: !364)
!392 = !DILocation(line: 0, scope: !364)
!393 = !DILocation(line: 650, column: 13, scope: !364)
!394 = distinct !{!394, !386, !393}
!395 = !DILocation(line: 652, column: 7, scope: !396)
!396 = distinct !DILexicalBlock(scope: !364, file: !365, line: 652, column: 7)
!397 = !DILocation(line: 652, column: 17, scope: !396)
!398 = !DILocation(line: 652, column: 7, scope: !364)
!399 = !DILocation(line: 653, column: 12, scope: !396)
!400 = !DILocation(line: 653, column: 22, scope: !396)
!401 = !DILocation(line: 653, column: 10, scope: !396)
!402 = !DILocation(line: 653, column: 5, scope: !396)
!403 = !DILocation(line: 655, column: 11, scope: !364)
!404 = !DILocation(line: 655, column: 3, scope: !364)
!405 = !DILocalVariable(name: "lc_messages", scope: !364, file: !365, line: 659, type: !49)
!406 = !DILocation(line: 659, column: 15, scope: !364)
!407 = !DILocation(line: 659, column: 29, scope: !364)
!408 = !DILocation(line: 660, column: 7, scope: !409)
!409 = distinct !DILexicalBlock(scope: !364, file: !365, line: 660, column: 7)
!410 = !DILocation(line: 660, column: 19, scope: !409)
!411 = !DILocation(line: 660, column: 22, scope: !409)
!412 = !DILocation(line: 660, column: 7, scope: !364)
!413 = !DILocation(line: 666, column: 7, scope: !414)
!414 = distinct !DILexicalBlock(scope: !409, file: !365, line: 661, column: 5)
!415 = !DILocation(line: 668, column: 5, scope: !414)
!416 = !DILocation(line: 669, column: 11, scope: !364)
!417 = !DILocation(line: 670, column: 24, scope: !364)
!418 = !DILocation(line: 669, column: 3, scope: !364)
!419 = !DILocation(line: 671, column: 11, scope: !364)
!420 = !DILocation(line: 672, column: 11, scope: !364)
!421 = !DILocation(line: 672, column: 17, scope: !364)
!422 = !DILocation(line: 672, column: 25, scope: !364)
!423 = !DILocation(line: 672, column: 22, scope: !364)
!424 = !DILocation(line: 671, column: 3, scope: !364)
!425 = !DILocation(line: 673, column: 1, scope: !364)
!426 = !DILocalVariable(name: "argc", arg: 1, scope: !427, file: !3, line: 688, type: !53)
!427 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 688, type: !428, scopeLine: 689, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!428 = !DISubroutineType(types: !429)
!429 = !{!53, !53, !430}
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!431 = !DILocation(line: 688, column: 11, scope: !427)
!432 = !DILocalVariable(name: "argv", arg: 2, scope: !427, file: !3, line: 688, type: !430)
!433 = !DILocation(line: 688, column: 24, scope: !427)
!434 = !DILocalVariable(name: "optc", scope: !427, file: !3, line: 690, type: !53)
!435 = !DILocation(line: 690, column: 7, scope: !427)
!436 = !DILocalVariable(name: "assumptions", scope: !427, file: !3, line: 691, type: !18)
!437 = !DILocation(line: 691, column: 8, scope: !427)
!438 = !DILocation(line: 694, column: 21, scope: !427)
!439 = !DILocation(line: 694, column: 3, scope: !427)
!440 = !DILocation(line: 695, column: 3, scope: !427)
!441 = !DILocation(line: 696, column: 3, scope: !427)
!442 = !DILocation(line: 697, column: 3, scope: !427)
!443 = !DILocation(line: 699, column: 3, scope: !427)
!444 = !DILocation(line: 701, column: 3, scope: !427)
!445 = !DILocation(line: 701, column: 31, scope: !427)
!446 = !DILocation(line: 701, column: 37, scope: !427)
!447 = !DILocation(line: 701, column: 18, scope: !427)
!448 = !DILocation(line: 701, column: 16, scope: !427)
!449 = !DILocation(line: 702, column: 10, scope: !427)
!450 = !DILocation(line: 704, column: 15, scope: !451)
!451 = distinct !DILexicalBlock(scope: !427, file: !3, line: 703, column: 5)
!452 = !DILocation(line: 704, column: 7, scope: !451)
!453 = !DILocation(line: 707, column: 25, scope: !454)
!454 = distinct !DILexicalBlock(scope: !451, file: !3, line: 705, column: 9)
!455 = !DILocation(line: 708, column: 26, scope: !454)
!456 = !DILocation(line: 709, column: 22, scope: !454)
!457 = !DILocation(line: 710, column: 26, scope: !454)
!458 = !DILocation(line: 711, column: 25, scope: !454)
!459 = !DILocation(line: 712, column: 28, scope: !454)
!460 = !DILocation(line: 713, column: 22, scope: !454)
!461 = !DILocation(line: 714, column: 24, scope: !454)
!462 = !DILocation(line: 715, column: 24, scope: !454)
!463 = !DILocation(line: 716, column: 24, scope: !454)
!464 = !DILocation(line: 717, column: 23, scope: !454)
!465 = !DILocation(line: 718, column: 11, scope: !454)
!466 = !DILocation(line: 721, column: 25, scope: !454)
!467 = !DILocation(line: 722, column: 23, scope: !454)
!468 = !DILocation(line: 723, column: 11, scope: !454)
!469 = !DILocation(line: 726, column: 26, scope: !454)
!470 = !DILocation(line: 727, column: 24, scope: !454)
!471 = !DILocation(line: 728, column: 24, scope: !454)
!472 = !DILocation(line: 729, column: 23, scope: !454)
!473 = !DILocation(line: 730, column: 11, scope: !454)
!474 = !DILocation(line: 733, column: 27, scope: !454)
!475 = !DILocation(line: 734, column: 11, scope: !454)
!476 = !DILocation(line: 737, column: 22, scope: !454)
!477 = !DILocation(line: 738, column: 24, scope: !454)
!478 = !DILocation(line: 739, column: 23, scope: !454)
!479 = !DILocation(line: 740, column: 11, scope: !454)
!480 = !DILocation(line: 743, column: 24, scope: !454)
!481 = !DILocation(line: 744, column: 11, scope: !454)
!482 = !DILocation(line: 747, column: 26, scope: !454)
!483 = !DILocation(line: 748, column: 23, scope: !454)
!484 = !DILocation(line: 749, column: 11, scope: !454)
!485 = !DILocation(line: 752, column: 22, scope: !454)
!486 = !DILocation(line: 753, column: 11, scope: !454)
!487 = !DILocation(line: 756, column: 25, scope: !454)
!488 = !DILocation(line: 757, column: 24, scope: !454)
!489 = !DILocation(line: 758, column: 23, scope: !454)
!490 = !DILocation(line: 759, column: 11, scope: !454)
!491 = !DILocation(line: 762, column: 24, scope: !454)
!492 = !DILocation(line: 763, column: 11, scope: !454)
!493 = !DILocation(line: 766, column: 28, scope: !454)
!494 = !DILocation(line: 767, column: 23, scope: !454)
!495 = !DILocation(line: 768, column: 11, scope: !454)
!496 = !DILocation(line: 772, column: 24, scope: !454)
!497 = !DILocation(line: 773, column: 11, scope: !454)
!498 = !DILocation(line: 776, column: 22, scope: !454)
!499 = !DILocation(line: 777, column: 24, scope: !454)
!500 = !DILocation(line: 778, column: 23, scope: !454)
!501 = !DILocation(line: 779, column: 11, scope: !454)
!502 = !DILocation(line: 782, column: 21, scope: !454)
!503 = !DILocation(line: 783, column: 11, scope: !454)
!504 = !DILocation(line: 785, column: 9, scope: !454)
!505 = !DILocation(line: 787, column: 9, scope: !454)
!506 = !DILocation(line: 790, column: 11, scope: !454)
!507 = distinct !{!507, !444, !508}
!508 = !DILocation(line: 792, column: 5, scope: !427)
!509 = !DILocation(line: 794, column: 7, scope: !510)
!510 = distinct !DILexicalBlock(scope: !427, file: !3, line: 794, column: 7)
!511 = !DILocation(line: 794, column: 7, scope: !427)
!512 = !DILocation(line: 796, column: 18, scope: !513)
!513 = distinct !DILexicalBlock(scope: !510, file: !3, line: 795, column: 5)
!514 = !DILocation(line: 797, column: 20, scope: !513)
!515 = !DILocation(line: 798, column: 5, scope: !513)
!516 = !DILocation(line: 800, column: 7, scope: !517)
!517 = distinct !DILexicalBlock(scope: !427, file: !3, line: 800, column: 7)
!518 = !DILocation(line: 800, column: 7, scope: !427)
!519 = !DILocation(line: 802, column: 20, scope: !520)
!520 = distinct !DILexicalBlock(scope: !517, file: !3, line: 801, column: 5)
!521 = !DILocation(line: 803, column: 5, scope: !520)
!522 = !DILocation(line: 805, column: 7, scope: !523)
!523 = distinct !DILexicalBlock(scope: !427, file: !3, line: 805, column: 7)
!524 = !DILocation(line: 805, column: 7, scope: !427)
!525 = !DILocation(line: 807, column: 19, scope: !526)
!526 = distinct !DILexicalBlock(scope: !523, file: !3, line: 806, column: 5)
!527 = !DILocation(line: 808, column: 25, scope: !526)
!528 = !DILocation(line: 809, column: 5, scope: !526)
!529 = !DILocation(line: 812, column: 19, scope: !530)
!530 = distinct !DILexicalBlock(scope: !523, file: !3, line: 811, column: 5)
!531 = !DILocation(line: 813, column: 25, scope: !530)
!532 = !DILocation(line: 816, column: 11, scope: !427)
!533 = !DILocation(line: 816, column: 18, scope: !427)
!534 = !DILocation(line: 816, column: 16, scope: !427)
!535 = !DILocation(line: 816, column: 3, scope: !427)
!536 = !DILocation(line: 819, column: 20, scope: !537)
!537 = distinct !DILexicalBlock(scope: !427, file: !3, line: 817, column: 5)
!538 = !DILocation(line: 820, column: 7, scope: !537)
!539 = !DILocation(line: 823, column: 7, scope: !537)
!540 = !DILocation(line: 824, column: 7, scope: !537)
!541 = !DILocation(line: 827, column: 12, scope: !537)
!542 = !DILocation(line: 827, column: 17, scope: !537)
!543 = !DILocation(line: 827, column: 7, scope: !537)
!544 = !DILocation(line: 828, column: 7, scope: !537)
!545 = !DILocation(line: 831, column: 20, scope: !537)
!546 = !DILocation(line: 831, column: 50, scope: !537)
!547 = !DILocation(line: 831, column: 55, scope: !537)
!548 = !DILocation(line: 831, column: 62, scope: !537)
!549 = !DILocation(line: 831, column: 43, scope: !537)
!550 = !DILocation(line: 831, column: 7, scope: !537)
!551 = !DILocation(line: 832, column: 7, scope: !537)
!552 = !DILocation(line: 835, column: 3, scope: !427)
!553 = !DILocalVariable(name: "filename", arg: 1, scope: !554, file: !3, line: 621, type: !49)
!554 = distinct !DISubprogram(name: "who", scope: !3, file: !3, line: 621, type: !555, scopeLine: 622, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!555 = !DISubroutineType(types: !556)
!556 = !{null, !49, !53}
!557 = !DILocation(line: 621, column: 18, scope: !554)
!558 = !DILocalVariable(name: "options", arg: 2, scope: !554, file: !3, line: 621, type: !53)
!559 = !DILocation(line: 621, column: 32, scope: !554)
!560 = !DILocalVariable(name: "n_users", scope: !554, file: !3, line: 623, type: !110)
!561 = !DILocation(line: 623, column: 10, scope: !554)
!562 = !DILocalVariable(name: "utmp_buf", scope: !554, file: !3, line: 624, type: !563)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!564 = !DILocation(line: 624, column: 16, scope: !554)
!565 = !DILocation(line: 626, column: 18, scope: !566)
!566 = distinct !DILexicalBlock(scope: !554, file: !3, line: 626, column: 7)
!567 = !DILocation(line: 626, column: 49, scope: !566)
!568 = !DILocation(line: 626, column: 7, scope: !566)
!569 = !DILocation(line: 626, column: 58, scope: !566)
!570 = !DILocation(line: 626, column: 7, scope: !554)
!571 = !DILocation(line: 627, column: 5, scope: !566)
!572 = !DILocation(line: 629, column: 7, scope: !573)
!573 = distinct !DILexicalBlock(scope: !554, file: !3, line: 629, column: 7)
!574 = !DILocation(line: 629, column: 7, scope: !554)
!575 = !DILocation(line: 630, column: 23, scope: !573)
!576 = !DILocation(line: 630, column: 32, scope: !573)
!577 = !DILocation(line: 630, column: 5, scope: !573)
!578 = !DILocation(line: 632, column: 19, scope: !573)
!579 = !DILocation(line: 632, column: 28, scope: !573)
!580 = !DILocation(line: 632, column: 5, scope: !573)
!581 = !DILocation(line: 634, column: 9, scope: !554)
!582 = !DILocation(line: 634, column: 3, scope: !554)
!583 = !DILocation(line: 635, column: 1, scope: !554)
!584 = !DILocalVariable(name: "n", arg: 1, scope: !585, file: !3, line: 537, type: !110)
!585 = distinct !DISubprogram(name: "list_entries_who", scope: !3, file: !3, line: 537, type: !586, scopeLine: 538, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!586 = !DISubroutineType(types: !587)
!587 = !{null, !110, !67}
!588 = !DILocation(line: 537, column: 26, scope: !585)
!589 = !DILocalVariable(name: "utmp_buf", arg: 2, scope: !585, file: !3, line: 537, type: !67)
!590 = !DILocation(line: 537, column: 48, scope: !585)
!591 = !DILocalVariable(name: "entries", scope: !585, file: !3, line: 539, type: !112)
!592 = !DILocation(line: 539, column: 21, scope: !585)
!593 = !DILocalVariable(name: "separator", scope: !585, file: !3, line: 540, type: !49)
!594 = !DILocation(line: 540, column: 15, scope: !585)
!595 = !DILocation(line: 542, column: 3, scope: !585)
!596 = !DILocation(line: 542, column: 11, scope: !585)
!597 = !DILocation(line: 544, column: 11, scope: !598)
!598 = distinct !DILexicalBlock(scope: !599, file: !3, line: 544, column: 11)
!599 = distinct !DILexicalBlock(scope: !585, file: !3, line: 543, column: 5)
!600 = !DILocation(line: 544, column: 11, scope: !599)
!601 = !DILocalVariable(name: "trimmed_name", scope: !602, file: !3, line: 546, type: !6)
!602 = distinct !DILexicalBlock(scope: !598, file: !3, line: 545, column: 9)
!603 = !DILocation(line: 546, column: 17, scope: !602)
!604 = !DILocation(line: 548, column: 48, scope: !602)
!605 = !DILocation(line: 548, column: 26, scope: !602)
!606 = !DILocation(line: 548, column: 24, scope: !602)
!607 = !DILocation(line: 550, column: 27, scope: !602)
!608 = !DILocation(line: 550, column: 38, scope: !602)
!609 = !DILocation(line: 550, column: 11, scope: !602)
!610 = !DILocation(line: 551, column: 17, scope: !602)
!611 = !DILocation(line: 551, column: 11, scope: !602)
!612 = !DILocation(line: 552, column: 21, scope: !602)
!613 = !DILocation(line: 553, column: 18, scope: !602)
!614 = !DILocation(line: 554, column: 9, scope: !602)
!615 = !DILocation(line: 555, column: 15, scope: !599)
!616 = distinct !{!616, !595, !617}
!617 = !DILocation(line: 556, column: 5, scope: !585)
!618 = !DILocation(line: 557, column: 11, scope: !585)
!619 = !DILocation(line: 557, column: 33, scope: !585)
!620 = !DILocation(line: 557, column: 3, scope: !585)
!621 = !DILocation(line: 558, column: 1, scope: !585)
!622 = !DILocalVariable(name: "n", arg: 1, scope: !623, file: !3, line: 569, type: !110)
!623 = distinct !DISubprogram(name: "scan_entries", scope: !3, file: !3, line: 569, type: !586, scopeLine: 570, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!624 = !DILocation(line: 569, column: 22, scope: !623)
!625 = !DILocalVariable(name: "utmp_buf", arg: 2, scope: !623, file: !3, line: 569, type: !67)
!626 = !DILocation(line: 569, column: 44, scope: !623)
!627 = !DILocalVariable(name: "ttyname_b", scope: !623, file: !3, line: 571, type: !6)
!628 = !DILocation(line: 571, column: 9, scope: !623)
!629 = !DILocalVariable(name: "boottime", scope: !623, file: !3, line: 572, type: !9)
!630 = !DILocation(line: 572, column: 10, scope: !623)
!631 = !DILocation(line: 574, column: 7, scope: !632)
!632 = distinct !DILexicalBlock(scope: !623, file: !3, line: 574, column: 7)
!633 = !DILocation(line: 574, column: 7, scope: !623)
!634 = !DILocation(line: 575, column: 5, scope: !632)
!635 = !DILocation(line: 577, column: 7, scope: !636)
!636 = distinct !DILexicalBlock(scope: !623, file: !3, line: 577, column: 7)
!637 = !DILocation(line: 577, column: 7, scope: !623)
!638 = !DILocation(line: 579, column: 19, scope: !639)
!639 = distinct !DILexicalBlock(scope: !636, file: !3, line: 578, column: 5)
!640 = !DILocation(line: 579, column: 17, scope: !639)
!641 = !DILocation(line: 580, column: 12, scope: !642)
!642 = distinct !DILexicalBlock(scope: !639, file: !3, line: 580, column: 11)
!643 = !DILocation(line: 580, column: 11, scope: !639)
!644 = !DILocation(line: 581, column: 9, scope: !642)
!645 = !DILocation(line: 582, column: 11, scope: !646)
!646 = distinct !DILexicalBlock(scope: !639, file: !3, line: 582, column: 11)
!647 = !DILocation(line: 582, column: 64, scope: !646)
!648 = !DILocation(line: 583, column: 19, scope: !646)
!649 = !DILocation(line: 583, column: 9, scope: !646)
!650 = !DILocation(line: 584, column: 5, scope: !639)
!651 = !DILocation(line: 586, column: 3, scope: !623)
!652 = !DILocation(line: 586, column: 11, scope: !623)
!653 = !DILocation(line: 588, column: 12, scope: !654)
!654 = distinct !DILexicalBlock(scope: !655, file: !3, line: 588, column: 11)
!655 = distinct !DILexicalBlock(scope: !623, file: !3, line: 587, column: 5)
!656 = !DILocation(line: 589, column: 11, scope: !654)
!657 = !DILocation(line: 589, column: 14, scope: !654)
!658 = !DILocation(line: 588, column: 11, scope: !655)
!659 = !DILocation(line: 592, column: 15, scope: !660)
!660 = distinct !DILexicalBlock(scope: !661, file: !3, line: 592, column: 15)
!661 = distinct !DILexicalBlock(scope: !654, file: !3, line: 591, column: 9)
!662 = !DILocation(line: 592, column: 26, scope: !660)
!663 = !DILocation(line: 592, column: 29, scope: !660)
!664 = !DILocation(line: 592, column: 15, scope: !661)
!665 = !DILocation(line: 593, column: 25, scope: !660)
!666 = !DILocation(line: 593, column: 35, scope: !660)
!667 = !DILocation(line: 593, column: 13, scope: !660)
!668 = !DILocation(line: 594, column: 20, scope: !669)
!669 = distinct !DILexicalBlock(scope: !660, file: !3, line: 594, column: 20)
!670 = !DILocation(line: 594, column: 34, scope: !669)
!671 = !DILocation(line: 594, column: 37, scope: !669)
!672 = !DILocation(line: 594, column: 20, scope: !660)
!673 = !DILocation(line: 595, column: 29, scope: !669)
!674 = !DILocation(line: 595, column: 13, scope: !669)
!675 = !DILocation(line: 596, column: 20, scope: !676)
!676 = distinct !DILexicalBlock(scope: !669, file: !3, line: 596, column: 20)
!677 = !DILocation(line: 596, column: 34, scope: !676)
!678 = !DILocation(line: 596, column: 37, scope: !676)
!679 = !DILocation(line: 596, column: 20, scope: !669)
!680 = !DILocation(line: 597, column: 29, scope: !676)
!681 = !DILocation(line: 597, column: 13, scope: !676)
!682 = !DILocation(line: 601, column: 20, scope: !683)
!683 = distinct !DILexicalBlock(scope: !676, file: !3, line: 601, column: 20)
!684 = !DILocation(line: 601, column: 37, scope: !683)
!685 = !DILocation(line: 601, column: 40, scope: !683)
!686 = !DILocation(line: 601, column: 20, scope: !676)
!687 = !DILocation(line: 602, column: 32, scope: !683)
!688 = !DILocation(line: 602, column: 13, scope: !683)
!689 = !DILocation(line: 603, column: 20, scope: !690)
!690 = distinct !DILexicalBlock(scope: !683, file: !3, line: 603, column: 20)
!691 = !DILocation(line: 603, column: 35, scope: !690)
!692 = !DILocation(line: 603, column: 38, scope: !690)
!693 = !DILocation(line: 603, column: 20, scope: !683)
!694 = !DILocation(line: 604, column: 30, scope: !690)
!695 = !DILocation(line: 604, column: 13, scope: !690)
!696 = !DILocation(line: 605, column: 20, scope: !697)
!697 = distinct !DILexicalBlock(scope: !690, file: !3, line: 605, column: 20)
!698 = !DILocation(line: 605, column: 31, scope: !697)
!699 = !DILocation(line: 605, column: 34, scope: !697)
!700 = !DILocation(line: 605, column: 20, scope: !690)
!701 = !DILocation(line: 606, column: 26, scope: !697)
!702 = !DILocation(line: 606, column: 13, scope: !697)
!703 = !DILocation(line: 607, column: 20, scope: !704)
!704 = distinct !DILexicalBlock(scope: !697, file: !3, line: 607, column: 20)
!705 = !DILocation(line: 607, column: 35, scope: !704)
!706 = !DILocation(line: 607, column: 38, scope: !704)
!707 = !DILocation(line: 607, column: 20, scope: !697)
!708 = !DILocation(line: 608, column: 30, scope: !704)
!709 = !DILocation(line: 608, column: 13, scope: !704)
!710 = !DILocation(line: 609, column: 9, scope: !661)
!711 = !DILocation(line: 611, column: 11, scope: !712)
!712 = distinct !DILexicalBlock(scope: !655, file: !3, line: 611, column: 11)
!713 = !DILocation(line: 611, column: 11, scope: !655)
!714 = !DILocation(line: 612, column: 20, scope: !712)
!715 = !DILocation(line: 612, column: 18, scope: !712)
!716 = !DILocation(line: 612, column: 9, scope: !712)
!717 = !DILocation(line: 614, column: 15, scope: !655)
!718 = distinct !{!718, !651, !719}
!719 = !DILocation(line: 615, column: 5, scope: !623)
!720 = !DILocation(line: 616, column: 1, scope: !623)
!721 = !DILocation(line: 563, column: 19, scope: !722)
!722 = distinct !DISubprogram(name: "print_heading", scope: !3, file: !3, line: 561, type: !723, scopeLine: 562, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!723 = !DISubroutineType(types: !724)
!724 = !{null}
!725 = !DILocation(line: 563, column: 39, scope: !722)
!726 = !DILocation(line: 563, column: 50, scope: !722)
!727 = !DILocation(line: 563, column: 61, scope: !722)
!728 = !DILocation(line: 564, column: 15, scope: !722)
!729 = !DILocation(line: 564, column: 25, scope: !722)
!730 = !DILocation(line: 564, column: 39, scope: !722)
!731 = !DILocation(line: 563, column: 3, scope: !722)
!732 = !DILocation(line: 565, column: 1, scope: !722)
!733 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !64, file: !3, line: 333, type: !67)
!734 = !DILocation(line: 333, column: 32, scope: !64)
!735 = !DILocalVariable(name: "boottime", arg: 2, scope: !64, file: !3, line: 333, type: !9)
!736 = !DILocation(line: 333, column: 49, scope: !64)
!737 = !DILocalVariable(name: "stats", scope: !64, file: !3, line: 335, type: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !739, line: 46, size: 1152, elements: !740)
!739 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!740 = !{!741, !743, !745, !747, !749, !751, !753, !754, !755, !757, !759, !761, !768, !769, !770}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !738, file: !739, line: 48, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !12, line: 145, baseType: !112)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !738, file: !739, line: 53, baseType: !744, size: 64, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !12, line: 148, baseType: !112)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !738, file: !739, line: 61, baseType: !746, size: 64, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !12, line: 151, baseType: !112)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !738, file: !739, line: 62, baseType: !748, size: 32, offset: 192)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !12, line: 150, baseType: !180)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !738, file: !739, line: 64, baseType: !750, size: 32, offset: 224)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !12, line: 146, baseType: !180)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !738, file: !739, line: 65, baseType: !752, size: 32, offset: 256)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !12, line: 147, baseType: !180)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !738, file: !739, line: 67, baseType: !53, size: 32, offset: 288)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !738, file: !739, line: 69, baseType: !742, size: 64, offset: 320)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !738, file: !739, line: 74, baseType: !756, size: 64, offset: 384)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !12, line: 152, baseType: !13)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !738, file: !739, line: 78, baseType: !758, size: 64, offset: 448)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !12, line: 174, baseType: !13)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !738, file: !739, line: 80, baseType: !760, size: 64, offset: 512)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !12, line: 179, baseType: !13)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !738, file: !739, line: 91, baseType: !762, size: 128, offset: 576)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !763, line: 10, size: 128, elements: !764)
!763 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!764 = !{!765, !766}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !762, file: !763, line: 12, baseType: !11, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !762, file: !763, line: 16, baseType: !767, size: 64, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !12, line: 196, baseType: !13)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !738, file: !739, line: 92, baseType: !762, size: 128, offset: 704)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !738, file: !739, line: 93, baseType: !762, size: 128, offset: 832)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !738, file: !739, line: 106, baseType: !771, size: 192, offset: 960)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !767, size: 192, elements: !60)
!772 = !DILocation(line: 335, column: 15, scope: !64)
!773 = !DILocalVariable(name: "last_change", scope: !64, file: !3, line: 336, type: !9)
!774 = !DILocation(line: 336, column: 10, scope: !64)
!775 = !DILocalVariable(name: "mesg", scope: !64, file: !3, line: 337, type: !7)
!776 = !DILocation(line: 337, column: 8, scope: !64)
!777 = !DILocalVariable(name: "idlestr", scope: !64, file: !3, line: 338, type: !778)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 56, elements: !376)
!779 = !DILocation(line: 338, column: 8, scope: !64)
!780 = !DILocalVariable(name: "line", scope: !64, file: !3, line: 347, type: !781)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 304, elements: !782)
!782 = !{!783}
!783 = !DISubrange(count: 38)
!784 = !DILocation(line: 347, column: 8, scope: !64)
!785 = !DILocalVariable(name: "p", scope: !64, file: !3, line: 348, type: !6)
!786 = !DILocation(line: 348, column: 9, scope: !64)
!787 = !DILocation(line: 348, column: 13, scope: !64)
!788 = !DILocalVariable(name: "pidstr", scope: !64, file: !3, line: 349, type: !789)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !790)
!790 = !{!791}
!791 = !DISubrange(count: 12)
!792 = !DILocation(line: 349, column: 3, scope: !64)
!793 = !DILocation(line: 354, column: 10, scope: !794)
!794 = distinct !DILexicalBlock(scope: !64, file: !3, line: 354, column: 8)
!795 = !DILocation(line: 354, column: 8, scope: !64)
!796 = !DILocation(line: 355, column: 17, scope: !794)
!797 = !DILocation(line: 355, column: 9, scope: !794)
!798 = !DILocation(line: 355, column: 7, scope: !794)
!799 = !DILocation(line: 355, column: 5, scope: !794)
!800 = !DILocation(line: 356, column: 12, scope: !64)
!801 = !DILocation(line: 356, column: 15, scope: !64)
!802 = !DILocation(line: 356, column: 25, scope: !64)
!803 = !DILocation(line: 356, column: 3, scope: !64)
!804 = !DILocation(line: 358, column: 13, scope: !805)
!805 = distinct !DILexicalBlock(scope: !64, file: !3, line: 358, column: 7)
!806 = !DILocation(line: 358, column: 7, scope: !805)
!807 = !DILocation(line: 358, column: 27, scope: !805)
!808 = !DILocation(line: 358, column: 7, scope: !64)
!809 = !DILocation(line: 360, column: 14, scope: !810)
!810 = distinct !DILexicalBlock(scope: !805, file: !3, line: 359, column: 5)
!811 = !DILocation(line: 360, column: 12, scope: !810)
!812 = !DILocation(line: 361, column: 27, scope: !810)
!813 = !DILocation(line: 361, column: 19, scope: !810)
!814 = !DILocation(line: 362, column: 5, scope: !810)
!815 = !DILocation(line: 365, column: 12, scope: !816)
!816 = distinct !DILexicalBlock(scope: !805, file: !3, line: 364, column: 5)
!817 = !DILocation(line: 366, column: 19, scope: !816)
!818 = !DILocation(line: 369, column: 7, scope: !819)
!819 = distinct !DILexicalBlock(scope: !64, file: !3, line: 369, column: 7)
!820 = !DILocation(line: 369, column: 7, scope: !64)
!821 = !DILocation(line: 370, column: 14, scope: !819)
!822 = !DILocation(line: 370, column: 57, scope: !819)
!823 = !DILocation(line: 370, column: 70, scope: !819)
!824 = !DILocation(line: 370, column: 44, scope: !819)
!825 = !DILocation(line: 370, column: 5, scope: !819)
!826 = !DILocation(line: 372, column: 14, scope: !819)
!827 = !DILocation(line: 372, column: 5, scope: !819)
!828 = !DILocation(line: 375, column: 7, scope: !829)
!829 = distinct !DILexicalBlock(scope: !64, file: !3, line: 375, column: 7)
!830 = !DILocation(line: 375, column: 17, scope: !829)
!831 = !DILocation(line: 375, column: 7, scope: !64)
!832 = !DILocalVariable(name: "ut_host", scope: !833, file: !3, line: 377, type: !834)
!833 = distinct !DILexicalBlock(scope: !829, file: !3, line: 376, column: 5)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 2056, elements: !835)
!835 = !{!836}
!836 = !DISubrange(count: 257)
!837 = !DILocation(line: 377, column: 12, scope: !833)
!838 = !DILocalVariable(name: "host", scope: !833, file: !3, line: 378, type: !6)
!839 = !DILocation(line: 378, column: 13, scope: !833)
!840 = !DILocalVariable(name: "display", scope: !833, file: !3, line: 379, type: !6)
!841 = !DILocation(line: 379, column: 13, scope: !833)
!842 = !DILocation(line: 382, column: 16, scope: !833)
!843 = !DILocation(line: 382, column: 25, scope: !833)
!844 = !DILocation(line: 382, column: 35, scope: !833)
!845 = !DILocation(line: 382, column: 7, scope: !833)
!846 = !DILocation(line: 385, column: 25, scope: !833)
!847 = !DILocation(line: 385, column: 17, scope: !833)
!848 = !DILocation(line: 385, column: 15, scope: !833)
!849 = !DILocation(line: 386, column: 11, scope: !850)
!850 = distinct !DILexicalBlock(scope: !833, file: !3, line: 386, column: 11)
!851 = !DILocation(line: 386, column: 11, scope: !833)
!852 = !DILocation(line: 387, column: 17, scope: !850)
!853 = !DILocation(line: 387, column: 20, scope: !850)
!854 = !DILocation(line: 387, column: 9, scope: !850)
!855 = !DILocation(line: 389, column: 11, scope: !856)
!856 = distinct !DILexicalBlock(scope: !833, file: !3, line: 389, column: 11)
!857 = !DILocation(line: 389, column: 20, scope: !856)
!858 = !DILocation(line: 389, column: 23, scope: !856)
!859 = !DILocation(line: 389, column: 11, scope: !833)
!860 = !DILocation(line: 392, column: 30, scope: !861)
!861 = distinct !DILexicalBlock(scope: !856, file: !3, line: 390, column: 9)
!862 = !DILocation(line: 392, column: 18, scope: !861)
!863 = !DILocation(line: 392, column: 16, scope: !861)
!864 = !DILocation(line: 393, column: 9, scope: !861)
!865 = !DILocation(line: 395, column: 13, scope: !866)
!866 = distinct !DILexicalBlock(scope: !833, file: !3, line: 395, column: 11)
!867 = !DILocation(line: 395, column: 11, scope: !833)
!868 = !DILocation(line: 396, column: 16, scope: !866)
!869 = !DILocation(line: 396, column: 14, scope: !866)
!870 = !DILocation(line: 396, column: 9, scope: !866)
!871 = !DILocation(line: 398, column: 11, scope: !872)
!872 = distinct !DILexicalBlock(scope: !833, file: !3, line: 398, column: 11)
!873 = !DILocation(line: 398, column: 11, scope: !833)
!874 = !DILocation(line: 400, column: 15, scope: !875)
!875 = distinct !DILexicalBlock(scope: !876, file: !3, line: 400, column: 15)
!876 = distinct !DILexicalBlock(scope: !872, file: !3, line: 399, column: 9)
!877 = !DILocation(line: 400, column: 33, scope: !875)
!878 = !DILocation(line: 400, column: 25, scope: !875)
!879 = !DILocation(line: 400, column: 49, scope: !875)
!880 = !DILocation(line: 400, column: 41, scope: !875)
!881 = !DILocation(line: 400, column: 39, scope: !875)
!882 = !DILocation(line: 400, column: 58, scope: !875)
!883 = !DILocation(line: 400, column: 23, scope: !875)
!884 = !DILocation(line: 400, column: 15, scope: !876)
!885 = !DILocation(line: 402, column: 33, scope: !886)
!886 = distinct !DILexicalBlock(scope: !875, file: !3, line: 401, column: 13)
!887 = !DILocation(line: 402, column: 25, scope: !886)
!888 = !DILocation(line: 402, column: 49, scope: !886)
!889 = !DILocation(line: 402, column: 41, scope: !886)
!890 = !DILocation(line: 402, column: 39, scope: !886)
!891 = !DILocation(line: 402, column: 58, scope: !886)
!892 = !DILocation(line: 402, column: 23, scope: !886)
!893 = !DILocation(line: 403, column: 21, scope: !886)
!894 = !DILocation(line: 403, column: 15, scope: !886)
!895 = !DILocation(line: 404, column: 34, scope: !886)
!896 = !DILocation(line: 404, column: 25, scope: !886)
!897 = !DILocation(line: 404, column: 23, scope: !886)
!898 = !DILocation(line: 405, column: 13, scope: !886)
!899 = !DILocation(line: 406, column: 20, scope: !876)
!900 = !DILocation(line: 406, column: 40, scope: !876)
!901 = !DILocation(line: 406, column: 46, scope: !876)
!902 = !DILocation(line: 406, column: 11, scope: !876)
!903 = !DILocation(line: 407, column: 9, scope: !876)
!904 = !DILocation(line: 410, column: 15, scope: !905)
!905 = distinct !DILexicalBlock(scope: !906, file: !3, line: 410, column: 15)
!906 = distinct !DILexicalBlock(scope: !872, file: !3, line: 409, column: 9)
!907 = !DILocation(line: 410, column: 33, scope: !905)
!908 = !DILocation(line: 410, column: 25, scope: !905)
!909 = !DILocation(line: 410, column: 39, scope: !905)
!910 = !DILocation(line: 410, column: 23, scope: !905)
!911 = !DILocation(line: 410, column: 15, scope: !906)
!912 = !DILocation(line: 412, column: 33, scope: !913)
!913 = distinct !DILexicalBlock(scope: !905, file: !3, line: 411, column: 13)
!914 = !DILocation(line: 412, column: 25, scope: !913)
!915 = !DILocation(line: 412, column: 39, scope: !913)
!916 = !DILocation(line: 412, column: 23, scope: !913)
!917 = !DILocation(line: 413, column: 21, scope: !913)
!918 = !DILocation(line: 413, column: 15, scope: !913)
!919 = !DILocation(line: 414, column: 34, scope: !913)
!920 = !DILocation(line: 414, column: 25, scope: !913)
!921 = !DILocation(line: 414, column: 23, scope: !913)
!922 = !DILocation(line: 415, column: 13, scope: !913)
!923 = !DILocation(line: 416, column: 20, scope: !906)
!924 = !DILocation(line: 416, column: 37, scope: !906)
!925 = !DILocation(line: 416, column: 11, scope: !906)
!926 = !DILocation(line: 419, column: 11, scope: !927)
!927 = distinct !DILexicalBlock(scope: !833, file: !3, line: 419, column: 11)
!928 = !DILocation(line: 419, column: 19, scope: !927)
!929 = !DILocation(line: 419, column: 16, scope: !927)
!930 = !DILocation(line: 419, column: 11, scope: !833)
!931 = !DILocation(line: 420, column: 15, scope: !927)
!932 = !DILocation(line: 420, column: 9, scope: !927)
!933 = !DILocation(line: 421, column: 5, scope: !833)
!934 = !DILocation(line: 424, column: 11, scope: !935)
!935 = distinct !DILexicalBlock(scope: !936, file: !3, line: 424, column: 11)
!936 = distinct !DILexicalBlock(scope: !829, file: !3, line: 423, column: 5)
!937 = !DILocation(line: 424, column: 19, scope: !935)
!938 = !DILocation(line: 424, column: 11, scope: !936)
!939 = !DILocation(line: 426, column: 19, scope: !940)
!940 = distinct !DILexicalBlock(scope: !935, file: !3, line: 425, column: 9)
!941 = !DILocation(line: 427, column: 17, scope: !940)
!942 = !DILocation(line: 427, column: 11, scope: !940)
!943 = !DILocation(line: 428, column: 30, scope: !940)
!944 = !DILocation(line: 428, column: 21, scope: !940)
!945 = !DILocation(line: 428, column: 19, scope: !940)
!946 = !DILocation(line: 429, column: 9, scope: !940)
!947 = !DILocation(line: 430, column: 8, scope: !936)
!948 = !DILocation(line: 430, column: 16, scope: !936)
!949 = !DILocation(line: 434, column: 42, scope: !64)
!950 = !DILocation(line: 434, column: 62, scope: !64)
!951 = !DILocation(line: 435, column: 41, scope: !64)
!952 = !DILocation(line: 435, column: 51, scope: !64)
!953 = !DILocation(line: 436, column: 28, scope: !64)
!954 = !DILocation(line: 436, column: 15, scope: !64)
!955 = !DILocation(line: 436, column: 39, scope: !64)
!956 = !DILocation(line: 436, column: 48, scope: !64)
!957 = !DILocation(line: 437, column: 15, scope: !64)
!958 = !DILocation(line: 437, column: 25, scope: !64)
!959 = !DILocation(line: 434, column: 3, scope: !64)
!960 = !DILocation(line: 438, column: 1, scope: !64)
!961 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !133, file: !3, line: 514, type: !67)
!962 = !DILocation(line: 514, column: 36, scope: !133)
!963 = !DILocalVariable(name: "last", scope: !133, file: !3, line: 517, type: !317)
!964 = !DILocation(line: 517, column: 17, scope: !133)
!965 = !DILocation(line: 517, column: 24, scope: !133)
!966 = !DILocation(line: 517, column: 42, scope: !133)
!967 = !DILocalVariable(name: "curr", scope: !133, file: !3, line: 518, type: !317)
!968 = !DILocation(line: 518, column: 17, scope: !133)
!969 = !DILocation(line: 518, column: 24, scope: !133)
!970 = !DILocation(line: 518, column: 42, scope: !133)
!971 = !DILocation(line: 520, column: 8, scope: !972)
!972 = distinct !DILexicalBlock(scope: !133, file: !3, line: 520, column: 7)
!973 = !DILocation(line: 520, column: 7, scope: !133)
!974 = !DILocation(line: 521, column: 35, scope: !972)
!975 = !DILocation(line: 521, column: 27, scope: !972)
!976 = !DILocation(line: 521, column: 51, scope: !972)
!977 = !DILocation(line: 521, column: 18, scope: !972)
!978 = !DILocation(line: 521, column: 16, scope: !972)
!979 = !DILocation(line: 521, column: 5, scope: !972)
!980 = !DILocation(line: 522, column: 12, scope: !133)
!981 = !DILocation(line: 522, column: 33, scope: !133)
!982 = !DILocation(line: 522, column: 49, scope: !133)
!983 = !DILocation(line: 522, column: 3, scope: !133)
!984 = !DILocation(line: 524, column: 8, scope: !985)
!985 = distinct !DILexicalBlock(scope: !133, file: !3, line: 524, column: 7)
!986 = !DILocation(line: 524, column: 7, scope: !133)
!987 = !DILocation(line: 525, column: 32, scope: !985)
!988 = !DILocation(line: 525, column: 24, scope: !985)
!989 = !DILocation(line: 525, column: 44, scope: !985)
!990 = !DILocation(line: 525, column: 15, scope: !985)
!991 = !DILocation(line: 525, column: 13, scope: !985)
!992 = !DILocation(line: 525, column: 5, scope: !985)
!993 = !DILocation(line: 526, column: 12, scope: !133)
!994 = !DILocation(line: 526, column: 29, scope: !133)
!995 = !DILocation(line: 526, column: 42, scope: !133)
!996 = !DILocation(line: 526, column: 47, scope: !133)
!997 = !DILocation(line: 526, column: 41, scope: !133)
!998 = !DILocation(line: 526, column: 63, scope: !133)
!999 = !DILocation(line: 526, column: 3, scope: !133)
!1000 = !DILocation(line: 528, column: 32, scope: !133)
!1001 = !DILocation(line: 528, column: 57, scope: !133)
!1002 = !DILocation(line: 528, column: 44, scope: !133)
!1003 = !DILocation(line: 529, column: 34, scope: !133)
!1004 = !DILocation(line: 529, column: 23, scope: !133)
!1005 = !DILocation(line: 529, column: 42, scope: !133)
!1006 = !DILocation(line: 528, column: 3, scope: !133)
!1007 = !DILocation(line: 531, column: 3, scope: !133)
!1008 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !1009, file: !3, line: 441, type: !67)
!1009 = distinct !DISubprogram(name: "print_boottime", scope: !3, file: !3, line: 441, type: !134, scopeLine: 442, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1010 = !DILocation(line: 441, column: 36, scope: !1009)
!1011 = !DILocation(line: 443, column: 32, scope: !1009)
!1012 = !DILocation(line: 444, column: 28, scope: !1009)
!1013 = !DILocation(line: 444, column: 15, scope: !1009)
!1014 = !DILocation(line: 443, column: 3, scope: !1009)
!1015 = !DILocation(line: 445, column: 1, scope: !1009)
!1016 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !1017, file: !3, line: 506, type: !67)
!1017 = distinct !DISubprogram(name: "print_clockchange", scope: !3, file: !3, line: 506, type: !134, scopeLine: 507, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1018 = !DILocation(line: 506, column: 39, scope: !1017)
!1019 = !DILocation(line: 509, column: 32, scope: !1017)
!1020 = !DILocation(line: 510, column: 28, scope: !1017)
!1021 = !DILocation(line: 510, column: 15, scope: !1017)
!1022 = !DILocation(line: 509, column: 3, scope: !1017)
!1023 = !DILocation(line: 511, column: 1, scope: !1017)
!1024 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !1025, file: !3, line: 495, type: !67)
!1025 = distinct !DISubprogram(name: "print_initspawn", scope: !3, file: !3, line: 495, type: !134, scopeLine: 496, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1026 = !DILocation(line: 495, column: 37, scope: !1025)
!1027 = !DILocalVariable(name: "comment", scope: !1025, file: !3, line: 497, type: !6)
!1028 = !DILocation(line: 497, column: 9, scope: !1025)
!1029 = !DILocation(line: 497, column: 43, scope: !1025)
!1030 = !DILocation(line: 497, column: 19, scope: !1025)
!1031 = !DILocalVariable(name: "pidstr", scope: !1025, file: !3, line: 498, type: !789)
!1032 = !DILocation(line: 498, column: 3, scope: !1025)
!1033 = !DILocation(line: 500, column: 54, scope: !1025)
!1034 = !DILocation(line: 500, column: 64, scope: !1025)
!1035 = !DILocation(line: 501, column: 28, scope: !1025)
!1036 = !DILocation(line: 501, column: 15, scope: !1025)
!1037 = !DILocation(line: 501, column: 43, scope: !1025)
!1038 = !DILocation(line: 501, column: 51, scope: !1025)
!1039 = !DILocation(line: 500, column: 3, scope: !1025)
!1040 = !DILocation(line: 502, column: 9, scope: !1025)
!1041 = !DILocation(line: 502, column: 3, scope: !1025)
!1042 = !DILocation(line: 503, column: 1, scope: !1025)
!1043 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !1044, file: !3, line: 482, type: !67)
!1044 = distinct !DISubprogram(name: "print_login", scope: !3, file: !3, line: 482, type: !134, scopeLine: 483, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1045 = !DILocation(line: 482, column: 33, scope: !1044)
!1046 = !DILocalVariable(name: "comment", scope: !1044, file: !3, line: 484, type: !6)
!1047 = !DILocation(line: 484, column: 9, scope: !1044)
!1048 = !DILocation(line: 484, column: 43, scope: !1044)
!1049 = !DILocation(line: 484, column: 19, scope: !1044)
!1050 = !DILocalVariable(name: "pidstr", scope: !1044, file: !3, line: 485, type: !789)
!1051 = !DILocation(line: 485, column: 3, scope: !1044)
!1052 = !DILocation(line: 489, column: 19, scope: !1044)
!1053 = !DILocation(line: 489, column: 62, scope: !1044)
!1054 = !DILocation(line: 489, column: 72, scope: !1044)
!1055 = !DILocation(line: 490, column: 28, scope: !1044)
!1056 = !DILocation(line: 490, column: 15, scope: !1044)
!1057 = !DILocation(line: 490, column: 43, scope: !1044)
!1058 = !DILocation(line: 490, column: 51, scope: !1044)
!1059 = !DILocation(line: 489, column: 3, scope: !1044)
!1060 = !DILocation(line: 491, column: 9, scope: !1044)
!1061 = !DILocation(line: 491, column: 3, scope: !1044)
!1062 = !DILocation(line: 492, column: 1, scope: !1044)
!1063 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !140, file: !3, line: 459, type: !67)
!1064 = !DILocation(line: 459, column: 37, scope: !140)
!1065 = !DILocalVariable(name: "comment", scope: !140, file: !3, line: 462, type: !6)
!1066 = !DILocation(line: 462, column: 9, scope: !140)
!1067 = !DILocation(line: 462, column: 43, scope: !140)
!1068 = !DILocation(line: 462, column: 19, scope: !140)
!1069 = !DILocalVariable(name: "pidstr", scope: !140, file: !3, line: 463, type: !789)
!1070 = !DILocation(line: 463, column: 3, scope: !140)
!1071 = !DILocation(line: 465, column: 8, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !140, file: !3, line: 465, column: 7)
!1073 = !DILocation(line: 465, column: 7, scope: !140)
!1074 = !DILocation(line: 466, column: 32, scope: !1072)
!1075 = !DILocation(line: 466, column: 24, scope: !1072)
!1076 = !DILocation(line: 467, column: 24, scope: !1072)
!1077 = !DILocation(line: 467, column: 78, scope: !1072)
!1078 = !DILocation(line: 468, column: 34, scope: !1072)
!1079 = !DILocation(line: 468, column: 26, scope: !1072)
!1080 = !DILocation(line: 468, column: 24, scope: !1072)
!1081 = !DILocation(line: 469, column: 24, scope: !1072)
!1082 = !DILocation(line: 470, column: 24, scope: !1072)
!1083 = !DILocation(line: 466, column: 15, scope: !1072)
!1084 = !DILocation(line: 466, column: 13, scope: !1072)
!1085 = !DILocation(line: 466, column: 5, scope: !1072)
!1086 = !DILocation(line: 471, column: 12, scope: !140)
!1087 = !DILocation(line: 471, column: 34, scope: !140)
!1088 = !DILocation(line: 471, column: 46, scope: !140)
!1089 = !DILocation(line: 472, column: 12, scope: !140)
!1090 = !DILocation(line: 472, column: 24, scope: !140)
!1091 = !DILocation(line: 471, column: 3, scope: !140)
!1092 = !DILocation(line: 476, column: 54, scope: !140)
!1093 = !DILocation(line: 476, column: 64, scope: !140)
!1094 = !DILocation(line: 477, column: 28, scope: !140)
!1095 = !DILocation(line: 477, column: 15, scope: !140)
!1096 = !DILocation(line: 477, column: 43, scope: !140)
!1097 = !DILocation(line: 477, column: 51, scope: !140)
!1098 = !DILocation(line: 477, column: 60, scope: !140)
!1099 = !DILocation(line: 476, column: 3, scope: !140)
!1100 = !DILocation(line: 478, column: 9, scope: !140)
!1101 = !DILocation(line: 478, column: 3, scope: !140)
!1102 = !DILocation(line: 479, column: 1, scope: !140)
!1103 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !1104, file: !3, line: 448, type: !67)
!1104 = distinct !DISubprogram(name: "make_id_equals_comment", scope: !3, file: !3, line: 448, type: !1105, scopeLine: 449, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!6, !67}
!1107 = !DILocation(line: 448, column: 44, scope: !1104)
!1108 = !DILocalVariable(name: "utmpsize", scope: !1104, file: !3, line: 450, type: !110)
!1109 = !DILocation(line: 450, column: 10, scope: !1104)
!1110 = !DILocalVariable(name: "comment", scope: !1104, file: !3, line: 451, type: !6)
!1111 = !DILocation(line: 451, column: 9, scope: !1104)
!1112 = !DILocation(line: 451, column: 36, scope: !1104)
!1113 = !DILocation(line: 451, column: 28, scope: !1104)
!1114 = !DILocation(line: 451, column: 48, scope: !1104)
!1115 = !DILocation(line: 451, column: 46, scope: !1104)
!1116 = !DILocation(line: 451, column: 57, scope: !1104)
!1117 = !DILocation(line: 451, column: 19, scope: !1104)
!1118 = !DILocation(line: 453, column: 11, scope: !1104)
!1119 = !DILocation(line: 453, column: 20, scope: !1104)
!1120 = !DILocation(line: 453, column: 3, scope: !1104)
!1121 = !DILocation(line: 454, column: 12, scope: !1104)
!1122 = !DILocation(line: 454, column: 21, scope: !1104)
!1123 = !DILocation(line: 454, column: 39, scope: !1104)
!1124 = !DILocation(line: 454, column: 3, scope: !1104)
!1125 = !DILocation(line: 455, column: 10, scope: !1104)
!1126 = !DILocation(line: 455, column: 3, scope: !1104)
!1127 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !125, file: !3, line: 218, type: !67)
!1128 = !DILocation(line: 218, column: 33, scope: !125)
!1129 = !DILocalVariable(name: "t", scope: !125, file: !3, line: 228, type: !9)
!1130 = !DILocation(line: 228, column: 10, scope: !125)
!1131 = !DILocation(line: 228, column: 14, scope: !125)
!1132 = !DILocalVariable(name: "tmp", scope: !125, file: !3, line: 229, type: !1133)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !1135, line: 7, size: 448, elements: !1136)
!1135 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h", directory: "")
!1136 = !{!1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !1134, file: !1135, line: 9, baseType: !53, size: 32)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !1134, file: !1135, line: 10, baseType: !53, size: 32, offset: 32)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !1134, file: !1135, line: 11, baseType: !53, size: 32, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !1134, file: !1135, line: 12, baseType: !53, size: 32, offset: 96)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !1134, file: !1135, line: 13, baseType: !53, size: 32, offset: 128)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !1134, file: !1135, line: 14, baseType: !53, size: 32, offset: 160)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !1134, file: !1135, line: 15, baseType: !53, size: 32, offset: 192)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !1134, file: !1135, line: 16, baseType: !53, size: 32, offset: 224)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !1134, file: !1135, line: 17, baseType: !53, size: 32, offset: 256)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !1134, file: !1135, line: 20, baseType: !13, size: 64, offset: 320)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !1134, file: !1135, line: 21, baseType: !49, size: 64, offset: 384)
!1148 = !DILocation(line: 229, column: 14, scope: !125)
!1149 = !DILocation(line: 229, column: 20, scope: !125)
!1150 = !DILocation(line: 231, column: 7, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !125, file: !3, line: 231, column: 7)
!1152 = !DILocation(line: 231, column: 7, scope: !125)
!1153 = !DILocation(line: 233, column: 34, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !1151, file: !3, line: 232, column: 5)
!1155 = !DILocation(line: 233, column: 47, scope: !1154)
!1156 = !DILocation(line: 233, column: 7, scope: !1154)
!1157 = !DILocation(line: 234, column: 7, scope: !1154)
!1158 = !DILocation(line: 237, column: 23, scope: !1151)
!1159 = !DILocation(line: 237, column: 12, scope: !1151)
!1160 = !DILocation(line: 237, column: 5, scope: !1151)
!1161 = !DILocation(line: 238, column: 1, scope: !125)
!1162 = !DILocalVariable(name: "userlen", arg: 1, scope: !56, file: !3, line: 244, type: !53)
!1163 = !DILocation(line: 244, column: 17, scope: !56)
!1164 = !DILocalVariable(name: "user", arg: 2, scope: !56, file: !3, line: 244, type: !49)
!1165 = !DILocation(line: 244, column: 38, scope: !56)
!1166 = !DILocalVariable(name: "state", arg: 3, scope: !56, file: !3, line: 244, type: !50)
!1167 = !DILocation(line: 244, column: 55, scope: !56)
!1168 = !DILocalVariable(name: "linelen", arg: 4, scope: !56, file: !3, line: 245, type: !53)
!1169 = !DILocation(line: 245, column: 17, scope: !56)
!1170 = !DILocalVariable(name: "line", arg: 5, scope: !56, file: !3, line: 245, type: !49)
!1171 = !DILocation(line: 245, column: 38, scope: !56)
!1172 = !DILocalVariable(name: "time_str", arg: 6, scope: !56, file: !3, line: 246, type: !49)
!1173 = !DILocation(line: 246, column: 25, scope: !56)
!1174 = !DILocalVariable(name: "idle", arg: 7, scope: !56, file: !3, line: 246, type: !49)
!1175 = !DILocation(line: 246, column: 47, scope: !56)
!1176 = !DILocalVariable(name: "pid", arg: 8, scope: !56, file: !3, line: 246, type: !49)
!1177 = !DILocation(line: 246, column: 65, scope: !56)
!1178 = !DILocalVariable(name: "comment", arg: 9, scope: !56, file: !3, line: 247, type: !49)
!1179 = !DILocation(line: 247, column: 25, scope: !56)
!1180 = !DILocalVariable(name: "exitstr", arg: 10, scope: !56, file: !3, line: 247, type: !49)
!1181 = !DILocation(line: 247, column: 46, scope: !56)
!1182 = !DILocalVariable(name: "buf", scope: !56, file: !3, line: 250, type: !6)
!1183 = !DILocation(line: 250, column: 9, scope: !56)
!1184 = !DILocalVariable(name: "x_idle", scope: !56, file: !3, line: 251, type: !1185)
!1185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !260)
!1186 = !DILocation(line: 251, column: 8, scope: !56)
!1187 = !DILocalVariable(name: "x_pid", scope: !56, file: !3, line: 252, type: !1188)
!1188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 104, elements: !1189)
!1189 = !{!1190}
!1190 = !DISubrange(count: 13)
!1191 = !DILocation(line: 252, column: 8, scope: !56)
!1192 = !DILocalVariable(name: "x_exitstr", scope: !56, file: !3, line: 253, type: !6)
!1193 = !DILocation(line: 253, column: 9, scope: !56)
!1194 = !DILocalVariable(name: "err", scope: !56, file: !3, line: 254, type: !53)
!1195 = !DILocation(line: 254, column: 7, scope: !56)
!1196 = !DILocation(line: 256, column: 13, scope: !56)
!1197 = !DILocation(line: 256, column: 11, scope: !56)
!1198 = !DILocation(line: 258, column: 7, scope: !1199)
!1199 = distinct !DILexicalBlock(scope: !56, file: !3, line: 258, column: 7)
!1200 = !DILocation(line: 258, column: 20, scope: !1199)
!1201 = !DILocation(line: 258, column: 24, scope: !1199)
!1202 = !DILocation(line: 258, column: 37, scope: !1199)
!1203 = !DILocation(line: 258, column: 48, scope: !1199)
!1204 = !DILocation(line: 258, column: 40, scope: !1199)
!1205 = !DILocation(line: 258, column: 54, scope: !1199)
!1206 = !DILocation(line: 258, column: 7, scope: !56)
!1207 = !DILocation(line: 259, column: 14, scope: !1199)
!1208 = !DILocation(line: 259, column: 31, scope: !1199)
!1209 = !DILocation(line: 259, column: 5, scope: !1199)
!1210 = !DILocation(line: 261, column: 5, scope: !1199)
!1211 = !DILocation(line: 261, column: 13, scope: !1199)
!1212 = !DILocation(line: 263, column: 8, scope: !1213)
!1213 = distinct !DILexicalBlock(scope: !56, file: !3, line: 263, column: 7)
!1214 = !DILocation(line: 263, column: 21, scope: !1213)
!1215 = !DILocation(line: 263, column: 32, scope: !1213)
!1216 = !DILocation(line: 263, column: 24, scope: !1213)
!1217 = !DILocation(line: 263, column: 37, scope: !1213)
!1218 = !DILocation(line: 263, column: 7, scope: !56)
!1219 = !DILocation(line: 264, column: 14, scope: !1213)
!1220 = !DILocation(line: 264, column: 30, scope: !1213)
!1221 = !DILocation(line: 264, column: 5, scope: !1213)
!1222 = !DILocation(line: 266, column: 5, scope: !1213)
!1223 = !DILocation(line: 266, column: 12, scope: !1213)
!1224 = !DILocation(line: 268, column: 24, scope: !56)
!1225 = !DILocation(line: 268, column: 43, scope: !56)
!1226 = !DILocation(line: 268, column: 41, scope: !56)
!1227 = !DILocation(line: 268, column: 70, scope: !56)
!1228 = !DILocation(line: 268, column: 15, scope: !56)
!1229 = !DILocation(line: 268, column: 13, scope: !56)
!1230 = !DILocation(line: 269, column: 7, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !56, file: !3, line: 269, column: 7)
!1232 = !DILocation(line: 269, column: 7, scope: !56)
!1233 = !DILocation(line: 270, column: 14, scope: !1231)
!1234 = !DILocation(line: 270, column: 35, scope: !1231)
!1235 = !DILocation(line: 270, column: 5, scope: !1231)
!1236 = !DILocation(line: 272, column: 6, scope: !1231)
!1237 = !DILocation(line: 272, column: 16, scope: !1231)
!1238 = !DILocation(line: 284, column: 19, scope: !56)
!1239 = !DILocation(line: 284, column: 28, scope: !56)
!1240 = !DILocation(line: 284, column: 35, scope: !56)
!1241 = !DILocation(line: 285, column: 19, scope: !56)
!1242 = !DILocation(line: 286, column: 19, scope: !56)
!1243 = !DILocation(line: 286, column: 28, scope: !56)
!1244 = !DILocation(line: 287, column: 19, scope: !56)
!1245 = !DILocation(line: 288, column: 19, scope: !56)
!1246 = !DILocation(line: 289, column: 19, scope: !56)
!1247 = !DILocation(line: 290, column: 19, scope: !56)
!1248 = !DILocation(line: 295, column: 19, scope: !56)
!1249 = !DILocation(line: 296, column: 19, scope: !56)
!1250 = !DILocation(line: 274, column: 9, scope: !56)
!1251 = !DILocation(line: 274, column: 7, scope: !56)
!1252 = !DILocation(line: 298, column: 7, scope: !1253)
!1253 = distinct !DILexicalBlock(scope: !56, file: !3, line: 298, column: 7)
!1254 = !DILocation(line: 298, column: 11, scope: !1253)
!1255 = !DILocation(line: 299, column: 5, scope: !1253)
!1256 = !DILocalVariable(name: "p", scope: !1257, file: !3, line: 303, type: !6)
!1257 = distinct !DILexicalBlock(scope: !56, file: !3, line: 301, column: 3)
!1258 = !DILocation(line: 303, column: 11, scope: !1257)
!1259 = !DILocation(line: 303, column: 15, scope: !1257)
!1260 = !DILocation(line: 303, column: 29, scope: !1257)
!1261 = !DILocation(line: 303, column: 21, scope: !1257)
!1262 = !DILocation(line: 303, column: 19, scope: !1257)
!1263 = !DILocation(line: 304, column: 5, scope: !1257)
!1264 = !DILocation(line: 304, column: 13, scope: !1257)
!1265 = !DILocation(line: 304, column: 12, scope: !1257)
!1266 = !DILocation(line: 304, column: 17, scope: !1257)
!1267 = distinct !{!1267, !1263, !1268}
!1268 = !DILocation(line: 305, column: 18, scope: !1257)
!1269 = !DILocation(line: 306, column: 7, scope: !1257)
!1270 = !DILocation(line: 306, column: 9, scope: !1257)
!1271 = !DILocation(line: 306, column: 14, scope: !1257)
!1272 = !DILocation(line: 309, column: 9, scope: !56)
!1273 = !DILocation(line: 309, column: 3, scope: !56)
!1274 = !DILocation(line: 310, column: 9, scope: !56)
!1275 = !DILocation(line: 310, column: 3, scope: !56)
!1276 = !DILocation(line: 311, column: 9, scope: !56)
!1277 = !DILocation(line: 311, column: 3, scope: !56)
!1278 = !DILocation(line: 312, column: 1, scope: !56)
!1279 = !DILocalVariable(name: "t", arg: 1, scope: !1280, file: !365, line: 690, type: !9)
!1280 = distinct !DISubprogram(name: "timetostr", scope: !365, file: !365, line: 690, type: !1281, scopeLine: 691, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{!6, !9, !6}
!1283 = !DILocation(line: 690, column: 19, scope: !1280)
!1284 = !DILocalVariable(name: "buf", arg: 2, scope: !1280, file: !365, line: 690, type: !6)
!1285 = !DILocation(line: 690, column: 28, scope: !1280)
!1286 = !DILocation(line: 693, column: 24, scope: !1280)
!1287 = !DILocation(line: 693, column: 27, scope: !1280)
!1288 = !DILocation(line: 693, column: 13, scope: !1280)
!1289 = !DILocation(line: 692, column: 3, scope: !1280)
!1290 = !DILocalVariable(name: "dest", arg: 1, scope: !1291, file: !365, line: 741, type: !1294)
!1291 = distinct !DISubprogram(name: "stzncpy", scope: !365, file: !365, line: 741, type: !1292, scopeLine: 742, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1292 = !DISubroutineType(types: !1293)
!1293 = !{!6, !1294, !1295, !110}
!1294 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !6)
!1295 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !49)
!1296 = !DILocation(line: 741, column: 25, scope: !1291)
!1297 = !DILocalVariable(name: "src", arg: 2, scope: !1291, file: !365, line: 741, type: !1295)
!1298 = !DILocation(line: 741, column: 52, scope: !1291)
!1299 = !DILocalVariable(name: "len", arg: 3, scope: !1291, file: !365, line: 741, type: !110)
!1300 = !DILocation(line: 741, column: 64, scope: !1291)
!1301 = !DILocalVariable(name: "src_end", scope: !1291, file: !365, line: 743, type: !49)
!1302 = !DILocation(line: 743, column: 15, scope: !1291)
!1303 = !DILocation(line: 743, column: 25, scope: !1291)
!1304 = !DILocation(line: 743, column: 31, scope: !1291)
!1305 = !DILocation(line: 743, column: 29, scope: !1291)
!1306 = !DILocation(line: 744, column: 3, scope: !1291)
!1307 = !DILocation(line: 744, column: 10, scope: !1291)
!1308 = !DILocation(line: 744, column: 16, scope: !1291)
!1309 = !DILocation(line: 744, column: 14, scope: !1291)
!1310 = !DILocation(line: 744, column: 24, scope: !1291)
!1311 = !DILocation(line: 744, column: 28, scope: !1291)
!1312 = !DILocation(line: 744, column: 27, scope: !1291)
!1313 = !DILocation(line: 0, scope: !1291)
!1314 = !DILocation(line: 745, column: 19, scope: !1291)
!1315 = !DILocation(line: 745, column: 15, scope: !1291)
!1316 = !DILocation(line: 745, column: 10, scope: !1291)
!1317 = !DILocation(line: 745, column: 13, scope: !1291)
!1318 = distinct !{!1318, !1306, !1314}
!1319 = !DILocation(line: 746, column: 4, scope: !1291)
!1320 = !DILocation(line: 746, column: 9, scope: !1291)
!1321 = !DILocation(line: 747, column: 10, scope: !1291)
!1322 = !DILocation(line: 747, column: 3, scope: !1291)
!1323 = !DILocalVariable(name: "pstat", arg: 1, scope: !1324, file: !3, line: 317, type: !1327)
!1324 = distinct !DISubprogram(name: "is_tty_writable", scope: !3, file: !3, line: 317, type: !1325, scopeLine: 318, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1325 = !DISubroutineType(types: !1326)
!1326 = !{!18, !1327}
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64)
!1328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !738)
!1329 = !DILocation(line: 317, column: 37, scope: !1324)
!1330 = !DILocation(line: 327, column: 10, scope: !1324)
!1331 = !DILocation(line: 327, column: 17, scope: !1324)
!1332 = !DILocation(line: 327, column: 25, scope: !1324)
!1333 = !DILocation(line: 327, column: 3, scope: !1324)
!1334 = !DILocalVariable(name: "when", arg: 1, scope: !115, file: !3, line: 188, type: !9)
!1335 = !DILocation(line: 188, column: 21, scope: !115)
!1336 = !DILocalVariable(name: "boottime", arg: 2, scope: !115, file: !3, line: 188, type: !9)
!1337 = !DILocation(line: 188, column: 34, scope: !115)
!1338 = !DILocation(line: 192, column: 7, scope: !1339)
!1339 = distinct !DILexicalBlock(scope: !115, file: !3, line: 192, column: 7)
!1340 = !DILocation(line: 192, column: 11, scope: !1339)
!1341 = !DILocation(line: 192, column: 7, scope: !115)
!1342 = !DILocation(line: 193, column: 5, scope: !1339)
!1343 = !DILocation(line: 195, column: 7, scope: !1344)
!1344 = distinct !DILexicalBlock(scope: !115, file: !3, line: 195, column: 7)
!1345 = !DILocation(line: 195, column: 18, scope: !1344)
!1346 = !DILocation(line: 195, column: 16, scope: !1344)
!1347 = !DILocation(line: 195, column: 23, scope: !1344)
!1348 = !DILocation(line: 195, column: 26, scope: !1344)
!1349 = !DILocation(line: 195, column: 30, scope: !1344)
!1350 = !DILocation(line: 195, column: 47, scope: !1344)
!1351 = !DILocation(line: 195, column: 45, scope: !1344)
!1352 = !DILocation(line: 195, column: 52, scope: !1344)
!1353 = !DILocation(line: 195, column: 55, scope: !1344)
!1354 = !DILocation(line: 195, column: 63, scope: !1344)
!1355 = !DILocation(line: 195, column: 60, scope: !1344)
!1356 = !DILocation(line: 195, column: 7, scope: !115)
!1357 = !DILocalVariable(name: "seconds_idle", scope: !1358, file: !3, line: 197, type: !53)
!1358 = distinct !DILexicalBlock(scope: !1344, file: !3, line: 196, column: 5)
!1359 = !DILocation(line: 197, column: 11, scope: !1358)
!1360 = !DILocation(line: 197, column: 26, scope: !1358)
!1361 = !DILocation(line: 197, column: 32, scope: !1358)
!1362 = !DILocation(line: 197, column: 30, scope: !1358)
!1363 = !DILocation(line: 198, column: 11, scope: !1364)
!1364 = distinct !DILexicalBlock(scope: !1358, file: !3, line: 198, column: 11)
!1365 = !DILocation(line: 198, column: 24, scope: !1364)
!1366 = !DILocation(line: 198, column: 11, scope: !1358)
!1367 = !DILocation(line: 199, column: 9, scope: !1364)
!1368 = !DILocation(line: 205, column: 11, scope: !1369)
!1369 = distinct !DILexicalBlock(scope: !1370, file: !3, line: 205, column: 11)
!1370 = distinct !DILexicalBlock(scope: !1371, file: !3, line: 205, column: 11)
!1371 = distinct !DILexicalBlock(scope: !1364, file: !3, line: 201, column: 9)
!1372 = !DILocation(line: 205, column: 11, scope: !1370)
!1373 = !DILocation(line: 207, column: 20, scope: !1371)
!1374 = !DILocation(line: 207, column: 33, scope: !1371)
!1375 = !DILocation(line: 208, column: 21, scope: !1371)
!1376 = !DILocation(line: 208, column: 34, scope: !1371)
!1377 = !DILocation(line: 208, column: 47, scope: !1371)
!1378 = !DILocation(line: 206, column: 11, scope: !1371)
!1379 = !DILocation(line: 209, column: 11, scope: !1371)
