; ModuleID = '<stdin>'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.addrinfo = type { i32, i32, i32, i32, i32, %struct.sockaddr*, i8*, %struct.addrinfo* }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.utmpx = type { i16, i32, [32 x i8], [4 x i8], [32 x i8], [256 x i8], %struct.__exit_status, i32, %struct.anon, [4 x i32], [20 x i8] }
%struct.__exit_status = type { i16, i16 }
%struct.anon = type { i32, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }


!10 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !12, line: 160, baseType: !13)
!12 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!13 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!14 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!15 = !{!16, !19, !21, !23, !25, !27, !29, !31, !33, !35, !37, !39, !41, !43, !45, !47, !51, !0, !54, !62, !108, !113, !118, !123, !131, !136, !138}
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "do_lookup", scope: !2, file: !3, line: 102, type: !18, isLocal: true, isDefinition: true)
!18 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "short_list", scope: !2, file: !3, line: 107, type: !18, isLocal: true, isDefinition: true)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "short_output", scope: !2, file: !3, line: 110, type: !18, isLocal: true, isDefinition: true)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "include_idle", scope: !2, file: !3, line: 115, type: !18, isLocal: true, isDefinition: true)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "include_heading", scope: !2, file: !3, line: 118, type: !18, isLocal: true, isDefinition: true)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "include_mesg", scope: !2, file: !3, line: 122, type: !18, isLocal: true, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "include_exit", scope: !2, file: !3, line: 125, type: !18, isLocal: true, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "need_boottime", scope: !2, file: !3, line: 128, type: !18, isLocal: true, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "need_deadprocs", scope: !2, file: !3, line: 131, type: !18, isLocal: true, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "need_login", scope: !2, file: !3, line: 134, type: !18, isLocal: true, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "need_initspawn", scope: !2, file: !3, line: 137, type: !18, isLocal: true, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "need_clockchange", scope: !2, file: !3, line: 140, type: !18, isLocal: true, isDefinition: true)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "need_runlevel", scope: !2, file: !3, line: 143, type: !18, isLocal: true, isDefinition: true)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "need_users", scope: !2, file: !3, line: 146, type: !18, isLocal: true, isDefinition: true)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "my_line_only", scope: !2, file: !3, line: 149, type: !18, isLocal: true, isDefinition: true)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "time_format", scope: !2, file: !3, line: 153, type: !49, isLocal: true, isDefinition: true)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "time_format_width", scope: !2, file: !3, line: 154, type: !53, isLocal: true, isDefinition: true)
!53 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "mesg", scope: !56, file: !3, line: 249, type: !59, isLocal: true, isDefinition: true)
!56 = distinct !DISubprogram(name: "print_line", scope: !3, file: !3, line: 244, type: !57, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!57 = !DISubroutineType(types: !58)
!58 = !{null, !53, !49, !50, !53, !49, !49, !49, !49, !49, !49}
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 24, elements: !60)
!60 = !{!61}
!61 = !DISubrange(count: 3)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "hoststr", scope: !64, file: !3, line: 339, type: !6, isLocal: true, isDefinition: true)
!64 = distinct !DISubprogram(name: "print_user", scope: !3, file: !3, line: 333, type: !65, scopeLine: 334, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!65 = !DISubroutineType(types: !66)
!66 = !{null, !67, !9}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !70, line: 146, baseType: !71)
!70 = !DIFile(filename: "./lib/readutmp.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !72, line: 55, size: 3072, elements: !73)
!72 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/utmpx.h", directory: "")
!73 = !{!74, !75, !77, !81, !85, !86, !90, !95, !97, !102, !104}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !71, file: !72, line: 57, baseType: !14, size: 16)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !71, file: !72, line: 58, baseType: !76, size: 32, offset: 32)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !12, line: 154, baseType: !53)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !71, file: !72, line: 59, baseType: !78, size: 256, offset: 64)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !71, file: !72, line: 61, baseType: !82, size: 32, offset: 320)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 4)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !71, file: !72, line: 63, baseType: !78, size: 256, offset: 352)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !71, file: !72, line: 65, baseType: !87, size: 2048, offset: 608)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 2048, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 256)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !71, file: !72, line: 67, baseType: !91, size: 32, offset: 2656)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !72, line: 42, size: 32, elements: !92)
!92 = !{!93, !94}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !91, file: !72, line: 45, baseType: !14, size: 16)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !91, file: !72, line: 46, baseType: !14, size: 16, offset: 16)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !71, file: !72, line: 74, baseType: !96, size: 32, offset: 2688)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !12, line: 41, baseType: !53)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !71, file: !72, line: 79, baseType: !98, size: 64, offset: 2720)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !71, file: !72, line: 75, size: 64, elements: !99)
!99 = !{!100, !101}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !98, file: !72, line: 77, baseType: !96, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !98, file: !72, line: 78, baseType: !96, size: 32, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !71, file: !72, line: 84, baseType: !103, size: 128, offset: 2784)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 128, elements: !83)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !71, file: !72, line: 85, baseType: !105, size: 160, offset: 2912)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 160, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 20)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "hostlen", scope: !64, file: !3, line: 341, type: !110, isLocal: true, isDefinition: true)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !111, line: 46, baseType: !112)
!111 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.1/include/stddef.h", directory: "")
!112 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "now", scope: !115, file: !3, line: 190, type: !9, isLocal: true, isDefinition: true)
!115 = distinct !DISubprogram(name: "idle_string", scope: !3, file: !3, line: 188, type: !116, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!116 = !DISubroutineType(types: !117)
!117 = !{!49, !9, !9}
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "idle_hhmm", scope: !115, file: !3, line: 202, type: !120, isLocal: true, isDefinition: true)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 48, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 6)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "buf", scope: !125, file: !3, line: 220, type: !128, isLocal: true, isDefinition: true)
!125 = distinct !DISubprogram(name: "time_string", scope: !3, file: !3, line: 218, type: !126, scopeLine: 219, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!126 = !DISubroutineType(types: !127)
!127 = !{!49, !67}
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 264, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 33)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "runlevline", scope: !133, file: !3, line: 516, type: !6, isLocal: true, isDefinition: true)
!133 = distinct !DISubprogram(name: "print_runlevel", scope: !3, file: !3, line: 514, type: !134, scopeLine: 515, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!134 = !DISubroutineType(types: !135)
!135 = !{null, !67}
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "comment", scope: !133, file: !3, line: 516, type: !6, isLocal: true, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "exitstr", scope: !140, file: !3, line: 461, type: !6, isLocal: true, isDefinition: true)
!140 = distinct !DISubprogram(name: "print_deadprocs", scope: !3, file: !3, line: 459, type: !134, scopeLine: 460, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 4608, elements: !151)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !144, line: 50, size: 256, elements: !145)
!144 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "")
!145 = !{!146, !147, !148, !150}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !143, file: !144, line: 52, baseType: !49, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !143, file: !144, line: 55, baseType: !53, size: 32, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !143, file: !144, line: 56, baseType: !149, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !143, file: !144, line: 57, baseType: !53, size: 32, offset: 192)
!151 = !{!152}
!152 = !DISubrange(count: 18)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "Version", scope: !155, file: !156, line: 2, type: !49, isLocal: false, isDefinition: true)
!155 = distinct !DICompileUnit(language: DW_LANG_C99, file: !156, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !157, nameTableKind: None)
!156 = !DIFile(filename: "src/version.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!157 = !{!153}
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "last_cherror", scope: !160, file: !166, line: 28, type: !53, isLocal: true, isDefinition: true)
!160 = distinct !DICompileUnit(language: DW_LANG_C99, file: !161, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !162, nameTableKind: None)
!161 = !DIFile(filename: "./lib/canon-host.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!162 = !{!163, !158}
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "hints", scope: !165, file: !166, line: 64, type: !169, isLocal: true, isDefinition: true)
!165 = distinct !DISubprogram(name: "canon_host_r", scope: !166, file: !166, line: 61, type: !167, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !160, retainedNodes: !4)
!166 = !DIFile(filename: "lib/canon-host.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!167 = !DISubroutineType(types: !168)
!168 = !{!6, !49, !149}
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !170, line: 565, size: 384, elements: !171)
!170 = !DIFile(filename: "/usr/include/netdb.h", directory: "")
!171 = !{!172, !173, !174, !175, !176, !181, !193, !194}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !169, file: !170, line: 567, baseType: !53, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !169, file: !170, line: 568, baseType: !53, size: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !169, file: !170, line: 569, baseType: !53, size: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !169, file: !170, line: 570, baseType: !53, size: 32, offset: 96)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !169, file: !170, line: 571, baseType: !177, size: 32, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !178, line: 33, baseType: !179)
!178 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "")
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !12, line: 209, baseType: !180)
!180 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !169, file: !170, line: 572, baseType: !182, size: 64, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !178, line: 178, size: 128, elements: !184)
!184 = !{!185, !189}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !183, file: !178, line: 180, baseType: !186, size: 16)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !187, line: 28, baseType: !188)
!187 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "")
!188 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !183, file: !178, line: 181, baseType: !190, size: 112, offset: 16)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 112, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 14)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !169, file: !170, line: 573, baseType: !6, size: 64, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !169, file: !170, line: 574, baseType: !195, size: 64, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !198, file: !203, line: 56, type: !18, isLocal: true, isDefinition: true)
!198 = distinct !DICompileUnit(language: DW_LANG_C99, file: !199, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !200, nameTableKind: None)
!199 = !DIFile(filename: "./lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!200 = !{!201, !196}
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "file_name", scope: !198, file: !203, line: 46, type: !49, isLocal: true, isDefinition: true)
!203 = !DIFile(filename: "lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "exit_failure", scope: !206, file: !209, line: 24, type: !210, isLocal: false, isDefinition: true)
!206 = distinct !DICompileUnit(language: DW_LANG_C99, file: !207, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !208, nameTableKind: None)
!207 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!208 = !{!204}
!209 = !DIFile(filename: "lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!210 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !53)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "program_name", scope: !213, file: !217, line: 33, type: !49, isLocal: false, isDefinition: true)
!213 = distinct !DICompileUnit(language: DW_LANG_C99, file: !214, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !215, globals: !216, nameTableKind: None)
!214 = !DIFile(filename: "./lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!215 = !{!8, !6}
!216 = !{!211}
!217 = !DIFile(filename: "lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !220, file: !241, line: 116, type: !254, isLocal: true, isDefinition: true)
!220 = distinct !DICompileUnit(language: DW_LANG_C99, file: !221, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !222, retainedTypes: !237, globals: !238, nameTableKind: None)
!221 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!222 = !{!223}
!223 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !224, line: 32, baseType: !180, size: 32, elements: !225)
!224 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!225 = !{!226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236}
!226 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!227 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!228 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!229 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!230 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!231 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!232 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!233 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!234 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!235 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!236 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!237 = !{!53, !188, !110}
!238 = !{!239, !246, !252, !218, !264, !266, !273, !275}
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !220, file: !241, line: 85, type: !242, isLocal: false, isDefinition: true)
!241 = !DIFile(filename: "lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 704, elements: !244)
!243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!244 = !{!245}
!245 = !DISubrange(count: 11)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !220, file: !241, line: 101, type: !248, isLocal: false, isDefinition: true)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 320, elements: !250)
!249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !223)
!250 = !{!251}
!251 = !DISubrange(count: 10)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !220, file: !241, line: 1052, type: !254, isLocal: false, isDefinition: true)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !241, line: 65, size: 448, elements: !255)
!255 = !{!256, !257, !258, !262, !263}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !254, file: !241, line: 68, baseType: !223, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !254, file: !241, line: 71, baseType: !53, size: 32, offset: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !254, file: !241, line: 75, baseType: !259, size: 256, offset: 64)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 256, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 8)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !254, file: !241, line: 78, baseType: !49, size: 64, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !254, file: !241, line: 81, baseType: !49, size: 64, offset: 384)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "slot0", scope: !220, file: !241, line: 842, type: !87, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "slotvec", scope: !220, file: !241, line: 845, type: !268, isLocal: true, isDefinition: true)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !241, line: 834, size: 128, elements: !270)
!270 = !{!271, !272}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !269, file: !241, line: 836, baseType: !110, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !269, file: !241, line: 837, baseType: !6, size: 64, offset: 64)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "nslots", scope: !220, file: !241, line: 843, type: !53, isLocal: true, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "slotvec0", scope: !220, file: !241, line: 844, type: !269, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !279, file: !282, line: 26, type: !283, isLocal: false, isDefinition: true)
!279 = distinct !DICompileUnit(language: DW_LANG_C99, file: !280, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !281, nameTableKind: None)
!280 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!281 = !{!277}
!282 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 376, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 47)
!286 = distinct !DICompileUnit(language: DW_LANG_C99, file: !287, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!287 = !DIFile(filename: "./lib/c-ctype.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!288 = distinct !DICompileUnit(language: DW_LANG_C99, file: !289, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!289 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!290 = distinct !DICompileUnit(language: DW_LANG_C99, file: !291, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !292, nameTableKind: None)
!291 = !DIFile(filename: "./lib/imaxtostr.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!292 = !{!293}
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !294, line: 101, baseType: !295)
!294 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !12, line: 72, baseType: !13)
!296 = distinct !DICompileUnit(language: DW_LANG_C99, file: !297, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !298, nameTableKind: None)
!297 = !DIFile(filename: "./lib/setlocale_null.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!298 = !{!8}
!299 = distinct !DICompileUnit(language: DW_LANG_C99, file: !300, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !298, nameTableKind: None)
!300 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!301 = distinct !DICompileUnit(language: DW_LANG_C99, file: !302, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !303, nameTableKind: None)
!302 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!303 = !{!110, !6, !8}
!304 = distinct !DICompileUnit(language: DW_LANG_C99, file: !305, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!305 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!306 = distinct !DICompileUnit(language: DW_LANG_C99, file: !307, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !308, nameTableKind: None)
!307 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!308 = !{!110}
!309 = distinct !DICompileUnit(language: DW_LANG_C99, file: !310, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !311, nameTableKind: None)
!310 = !DIFile(filename: "./lib/readutmp.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!311 = !{!6, !8}
!312 = distinct !DICompileUnit(language: DW_LANG_C99, file: !313, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !314, nameTableKind: None)
!313 = !DIFile(filename: "./lib/c-strcasecmp.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!314 = !{!315}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !317)
!317 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!318 = distinct !DICompileUnit(language: DW_LANG_C99, file: !319, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!319 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!320 = distinct !DICompileUnit(language: DW_LANG_C99, file: !321, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !298, nameTableKind: None)
!321 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!322 = distinct !DICompileUnit(language: DW_LANG_C99, file: !323, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!323 = !DIFile(filename: "./lib/fclose.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!324 = distinct !DICompileUnit(language: DW_LANG_C99, file: !325, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !298, nameTableKind: None)
!325 = !DIFile(filename: "./lib/fflush.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!326 = distinct !DICompileUnit(language: DW_LANG_C99, file: !327, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !298, nameTableKind: None)
!327 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!328 = !{!"clang version 9.0.1-12 "}
!329 = !{i32 2, !"Dwarf Version", i32 4}
!330 = !{i32 2, !"Debug Info Version", i32 3}
!331 = !{i32 1, !"wchar_size", i32 4}
!332 = !{i32 1, !"ThinLTO", i32 0}
!333 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!334 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 638, type: !335, scopeLine: 639, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !53}
!337 = !DILocalVariable(name: "status", arg: 1, scope: !334, file: !3, line: 638, type: !53)
!338 = !DILocation(line: 638, column: 12, scope: !334)
!339 = !DILocation(line: 640, column: 7, scope: !340)
!340 = distinct !DILexicalBlock(scope: !334, file: !3, line: 640, column: 7)
!341 = !DILocation(line: 640, column: 14, scope: !340)
!342 = !DILocation(line: 640, column: 7, scope: !334)
!343 = !DILocation(line: 641, column: 5, scope: !340)
!344 = !DILocation(line: 641, column: 5, scope: !345)
!345 = distinct !DILexicalBlock(scope: !340, file: !3, line: 641, column: 5)
!346 = !DILocation(line: 644, column: 15, scope: !347)
!347 = distinct !DILexicalBlock(scope: !340, file: !3, line: 643, column: 5)
!348 = !DILocation(line: 644, column: 66, scope: !347)
!349 = !DILocation(line: 644, column: 7, scope: !347)
!350 = !DILocation(line: 645, column: 7, scope: !347)
!351 = !DILocation(line: 648, column: 7, scope: !347)
!352 = !DILocation(line: 655, column: 7, scope: !347)
!353 = !DILocation(line: 658, column: 7, scope: !347)
!354 = !DILocation(line: 663, column: 7, scope: !347)
!355 = !DILocation(line: 669, column: 7, scope: !347)
!356 = !DILocation(line: 675, column: 7, scope: !347)
!357 = !DILocation(line: 676, column: 7, scope: !347)
!358 = !DILocation(line: 677, column: 15, scope: !347)
!359 = !DILocation(line: 677, column: 7, scope: !347)
!360 = !DILocation(line: 682, column: 7, scope: !347)
!361 = !DILocation(line: 684, column: 9, scope: !334)
!362 = !DILocation(line: 684, column: 3, scope: !334)
!363 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !364, file: !364, line: 634, type: !365, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!364 = !DIFile(filename: "src/system.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!365 = !DISubroutineType(types: !366)
!366 = !{null, !49}
!367 = !DILocalVariable(name: "program", arg: 1, scope: !363, file: !364, line: 634, type: !49)
!368 = !DILocation(line: 634, column: 34, scope: !363)
!369 = !DILocalVariable(name: "infomap", scope: !363, file: !364, line: 636, type: !370)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !371, size: 896, elements: !376)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !363, file: !364, line: 636, size: 128, elements: !373)
!373 = !{!374, !375}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !372, file: !364, line: 636, baseType: !49, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !372, file: !364, line: 636, baseType: !49, size: 64, offset: 64)
!376 = !{!377}
!377 = !DISubrange(count: 7)
!378 = !DILocation(line: 636, column: 67, scope: !363)
!379 = !DILocalVariable(name: "node", scope: !363, file: !364, line: 646, type: !49)
!380 = !DILocation(line: 646, column: 15, scope: !363)
!381 = !DILocation(line: 646, column: 22, scope: !363)
!382 = !DILocalVariable(name: "map_prog", scope: !363, file: !364, line: 647, type: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!384 = !DILocation(line: 647, column: 25, scope: !363)
!385 = !DILocation(line: 647, column: 36, scope: !363)
!386 = !DILocation(line: 649, column: 3, scope: !363)
!387 = !DILocation(line: 649, column: 10, scope: !363)
!388 = !DILocation(line: 649, column: 20, scope: !363)
!389 = !DILocation(line: 649, column: 28, scope: !363)
!390 = !DILocation(line: 649, column: 33, scope: !363)
!391 = !DILocation(line: 649, column: 31, scope: !363)
!392 = !DILocation(line: 0, scope: !363)
!393 = !DILocation(line: 650, column: 13, scope: !363)
!394 = distinct !{!394, !386, !393}
!395 = !DILocation(line: 652, column: 7, scope: !396)
!396 = distinct !DILexicalBlock(scope: !363, file: !364, line: 652, column: 7)
!397 = !DILocation(line: 652, column: 17, scope: !396)
!398 = !DILocation(line: 652, column: 7, scope: !363)
!399 = !DILocation(line: 653, column: 12, scope: !396)
!400 = !DILocation(line: 653, column: 22, scope: !396)
!401 = !DILocation(line: 653, column: 10, scope: !396)
!402 = !DILocation(line: 653, column: 5, scope: !396)
!403 = !DILocation(line: 655, column: 11, scope: !363)
!404 = !DILocation(line: 655, column: 3, scope: !363)
!405 = !DILocalVariable(name: "lc_messages", scope: !363, file: !364, line: 659, type: !49)
!406 = !DILocation(line: 659, column: 15, scope: !363)
!407 = !DILocation(line: 659, column: 29, scope: !363)
!408 = !DILocation(line: 660, column: 7, scope: !409)
!409 = distinct !DILexicalBlock(scope: !363, file: !364, line: 660, column: 7)
!410 = !DILocation(line: 660, column: 19, scope: !409)
!411 = !DILocation(line: 660, column: 22, scope: !409)
!412 = !DILocation(line: 660, column: 7, scope: !363)
!413 = !DILocation(line: 666, column: 7, scope: !414)
!414 = distinct !DILexicalBlock(scope: !409, file: !364, line: 661, column: 5)
!415 = !DILocation(line: 668, column: 5, scope: !414)
!416 = !DILocation(line: 669, column: 11, scope: !363)
!417 = !DILocation(line: 670, column: 24, scope: !363)
!418 = !DILocation(line: 669, column: 3, scope: !363)
!419 = !DILocation(line: 671, column: 11, scope: !363)
!420 = !DILocation(line: 672, column: 11, scope: !363)
!421 = !DILocation(line: 672, column: 17, scope: !363)
!422 = !DILocation(line: 672, column: 25, scope: !363)
!423 = !DILocation(line: 672, column: 22, scope: !363)
!424 = !DILocation(line: 671, column: 3, scope: !363)
!425 = !DILocation(line: 673, column: 1, scope: !363)
!426 = !DILocalVariable(name: "program", arg: 1, scope: !427, file: !364, line: 634, type: !49)
!427 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !364, file: !364, line: 634, type: !365, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !428, retainedNodes: !4)
!428 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !429, nameTableKind: None)
!429 = !{!430, !432, !434, !436, !438, !440, !442, !444, !446, !448, !450, !452, !454, !456, !458, !460, !462, !464, !474, !477, !506, !508, !511, !513, !518, !523, !525}
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "do_lookup", scope: !428, file: !3, line: 102, type: !18, isLocal: true, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "short_list", scope: !428, file: !3, line: 107, type: !18, isLocal: true, isDefinition: true)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "short_output", scope: !428, file: !3, line: 110, type: !18, isLocal: true, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "include_idle", scope: !428, file: !3, line: 115, type: !18, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "include_heading", scope: !428, file: !3, line: 118, type: !18, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "include_mesg", scope: !428, file: !3, line: 122, type: !18, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "include_exit", scope: !428, file: !3, line: 125, type: !18, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "need_boottime", scope: !428, file: !3, line: 128, type: !18, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "need_deadprocs", scope: !428, file: !3, line: 131, type: !18, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "need_login", scope: !428, file: !3, line: 134, type: !18, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "need_initspawn", scope: !428, file: !3, line: 137, type: !18, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "need_clockchange", scope: !428, file: !3, line: 140, type: !18, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "need_runlevel", scope: !428, file: !3, line: 143, type: !18, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "need_users", scope: !428, file: !3, line: 146, type: !18, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "my_line_only", scope: !428, file: !3, line: 149, type: !18, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "time_format", scope: !428, file: !3, line: 153, type: !49, isLocal: true, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "time_format_width", scope: !428, file: !3, line: 154, type: !53, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "longopts", scope: !428, file: !3, line: 162, type: !466, isLocal: true, isDefinition: true)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 4608, elements: !151)
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !144, line: 50, size: 256, elements: !469)
!469 = !{!470, !471, !472, !473}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !468, file: !144, line: 52, baseType: !49, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !468, file: !144, line: 55, baseType: !53, size: 32, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !468, file: !144, line: 56, baseType: !149, size: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !468, file: !144, line: 57, baseType: !53, size: 32, offset: 192)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "mesg", scope: !476, file: !3, line: 249, type: !59, isLocal: true, isDefinition: true)
!476 = distinct !DISubprogram(name: "print_line", scope: !3, file: !3, line: 244, type: !57, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !428, retainedNodes: !4)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "hoststr", scope: !479, file: !3, line: 339, type: !6, isLocal: true, isDefinition: true)
!479 = distinct !DISubprogram(name: "print_user", scope: !3, file: !3, line: 333, type: !480, scopeLine: 334, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !428, retainedNodes: !4)
!480 = !DISubroutineType(types: !481)
!481 = !{null, !482, !9}
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !70, line: 146, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !72, line: 55, size: 3072, elements: !486)
!486 = !{!487, !488, !489, !490, !491, !492, !493, !498, !499, !504, !505}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !485, file: !72, line: 57, baseType: !14, size: 16)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !485, file: !72, line: 58, baseType: !76, size: 32, offset: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !485, file: !72, line: 59, baseType: !78, size: 256, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !485, file: !72, line: 61, baseType: !82, size: 32, offset: 320)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !485, file: !72, line: 63, baseType: !78, size: 256, offset: 352)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !485, file: !72, line: 65, baseType: !87, size: 2048, offset: 608)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !485, file: !72, line: 67, baseType: !494, size: 32, offset: 2656)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !72, line: 42, size: 32, elements: !495)
!495 = !{!496, !497}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !494, file: !72, line: 45, baseType: !14, size: 16)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !494, file: !72, line: 46, baseType: !14, size: 16, offset: 16)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !485, file: !72, line: 74, baseType: !96, size: 32, offset: 2688)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !485, file: !72, line: 79, baseType: !500, size: 64, offset: 2720)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !485, file: !72, line: 75, size: 64, elements: !501)
!501 = !{!502, !503}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !500, file: !72, line: 77, baseType: !96, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !500, file: !72, line: 78, baseType: !96, size: 32, offset: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !485, file: !72, line: 84, baseType: !103, size: 128, offset: 2784)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !485, file: !72, line: 85, baseType: !105, size: 160, offset: 2912)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "hostlen", scope: !479, file: !3, line: 341, type: !110, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "now", scope: !510, file: !3, line: 190, type: !9, isLocal: true, isDefinition: true)
!510 = distinct !DISubprogram(name: "idle_string", scope: !3, file: !3, line: 188, type: !116, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !428, retainedNodes: !4)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "idle_hhmm", scope: !510, file: !3, line: 202, type: !120, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "buf", scope: !515, file: !3, line: 220, type: !128, isLocal: true, isDefinition: true)
!515 = distinct !DISubprogram(name: "time_string", scope: !3, file: !3, line: 218, type: !516, scopeLine: 219, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !428, retainedNodes: !4)
!516 = !DISubroutineType(types: !517)
!517 = !{!49, !482}
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "runlevline", scope: !520, file: !3, line: 516, type: !6, isLocal: true, isDefinition: true)
!520 = distinct !DISubprogram(name: "print_runlevel", scope: !3, file: !3, line: 514, type: !521, scopeLine: 515, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !428, retainedNodes: !4)
!521 = !DISubroutineType(types: !522)
!522 = !{null, !482}
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "comment", scope: !520, file: !3, line: 516, type: !6, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "exitstr", scope: !527, file: !3, line: 461, type: !6, isLocal: true, isDefinition: true)
!527 = distinct !DISubprogram(name: "print_deadprocs", scope: !3, file: !3, line: 459, type: !521, scopeLine: 460, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !428, retainedNodes: !4)
!528 = !DILocalVariable(name: "infomap", scope: !427, file: !364, line: 636, type: !529)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !530, size: 896, elements: !376)
!530 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !531)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !427, file: !364, line: 636, size: 128, elements: !532)
!532 = !{!533, !534}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !531, file: !364, line: 636, baseType: !49, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !531, file: !364, line: 636, baseType: !49, size: 64, offset: 64)
!535 = !DILocalVariable(name: "node", scope: !427, file: !364, line: 646, type: !49)
!536 = !DILocalVariable(name: "map_prog", scope: !427, file: !364, line: 647, type: !537)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!538 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 688, type: !539, scopeLine: 689, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!539 = !DISubroutineType(types: !540)
!540 = !{!53, !53, !541}
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!542 = !DILocalVariable(name: "argc", arg: 1, scope: !538, file: !3, line: 688, type: !53)
!543 = !DILocation(line: 688, column: 11, scope: !538)
!544 = !DILocalVariable(name: "argv", arg: 2, scope: !538, file: !3, line: 688, type: !541)
!545 = !DILocation(line: 688, column: 24, scope: !538)
!546 = !DILocalVariable(name: "optc", scope: !538, file: !3, line: 690, type: !53)
!547 = !DILocation(line: 690, column: 7, scope: !538)
!548 = !DILocalVariable(name: "assumptions", scope: !538, file: !3, line: 691, type: !18)
!549 = !DILocation(line: 691, column: 8, scope: !538)
!550 = !DILocation(line: 694, column: 21, scope: !538)
!551 = !DILocation(line: 694, column: 3, scope: !538)
!552 = !DILocation(line: 695, column: 3, scope: !538)
!553 = !DILocation(line: 696, column: 3, scope: !538)
!554 = !DILocation(line: 697, column: 3, scope: !538)
!555 = !DILocation(line: 699, column: 3, scope: !538)
!556 = !DILocation(line: 701, column: 3, scope: !538)
!557 = !DILocation(line: 701, column: 31, scope: !538)
!558 = !DILocation(line: 701, column: 37, scope: !538)
!559 = !DILocation(line: 701, column: 18, scope: !538)
!560 = !DILocation(line: 701, column: 16, scope: !538)
!561 = !DILocation(line: 702, column: 10, scope: !538)
!562 = !DILocation(line: 704, column: 15, scope: !563)
!563 = distinct !DILexicalBlock(scope: !538, file: !3, line: 703, column: 5)
!564 = !DILocation(line: 704, column: 7, scope: !563)
!565 = !DILocation(line: 707, column: 25, scope: !566)
!566 = distinct !DILexicalBlock(scope: !563, file: !3, line: 705, column: 9)
!567 = !DILocation(line: 708, column: 26, scope: !566)
!568 = !DILocation(line: 709, column: 22, scope: !566)
!569 = !DILocation(line: 710, column: 26, scope: !566)
!570 = !DILocation(line: 711, column: 25, scope: !566)
!571 = !DILocation(line: 712, column: 28, scope: !566)
!572 = !DILocation(line: 713, column: 22, scope: !566)
!573 = !DILocation(line: 714, column: 24, scope: !566)
!574 = !DILocation(line: 715, column: 24, scope: !566)
!575 = !DILocation(line: 716, column: 24, scope: !566)
!576 = !DILocation(line: 717, column: 23, scope: !566)
!577 = !DILocation(line: 718, column: 11, scope: !566)
!578 = !DILocation(line: 721, column: 25, scope: !566)
!579 = !DILocation(line: 722, column: 23, scope: !566)
!580 = !DILocation(line: 723, column: 11, scope: !566)
!581 = !DILocation(line: 726, column: 26, scope: !566)
!582 = !DILocation(line: 727, column: 24, scope: !566)
!583 = !DILocation(line: 728, column: 24, scope: !566)
!584 = !DILocation(line: 729, column: 23, scope: !566)
!585 = !DILocation(line: 730, column: 11, scope: !566)
!586 = !DILocation(line: 733, column: 27, scope: !566)
!587 = !DILocation(line: 734, column: 11, scope: !566)
!588 = !DILocation(line: 737, column: 22, scope: !566)
!589 = !DILocation(line: 738, column: 24, scope: !566)
!590 = !DILocation(line: 739, column: 23, scope: !566)
!591 = !DILocation(line: 740, column: 11, scope: !566)
!592 = !DILocation(line: 743, column: 24, scope: !566)
!593 = !DILocation(line: 744, column: 11, scope: !566)
!594 = !DILocation(line: 747, column: 26, scope: !566)
!595 = !DILocation(line: 748, column: 23, scope: !566)
!596 = !DILocation(line: 749, column: 11, scope: !566)
!597 = !DILocation(line: 752, column: 22, scope: !566)
!598 = !DILocation(line: 753, column: 11, scope: !566)
!599 = !DILocation(line: 756, column: 25, scope: !566)
!600 = !DILocation(line: 757, column: 24, scope: !566)
!601 = !DILocation(line: 758, column: 23, scope: !566)
!602 = !DILocation(line: 759, column: 11, scope: !566)
!603 = !DILocation(line: 762, column: 24, scope: !566)
!604 = !DILocation(line: 763, column: 11, scope: !566)
!605 = !DILocation(line: 766, column: 28, scope: !566)
!606 = !DILocation(line: 767, column: 23, scope: !566)
!607 = !DILocation(line: 768, column: 11, scope: !566)
!608 = !DILocation(line: 772, column: 24, scope: !566)
!609 = !DILocation(line: 773, column: 11, scope: !566)
!610 = !DILocation(line: 776, column: 22, scope: !566)
!611 = !DILocation(line: 777, column: 24, scope: !566)
!612 = !DILocation(line: 778, column: 23, scope: !566)
!613 = !DILocation(line: 779, column: 11, scope: !566)
!614 = !DILocation(line: 782, column: 21, scope: !566)
!615 = !DILocation(line: 783, column: 11, scope: !566)
!616 = !DILocation(line: 785, column: 9, scope: !566)
!617 = !DILocation(line: 787, column: 9, scope: !566)
!618 = !DILocation(line: 790, column: 11, scope: !566)
!619 = distinct !{!619, !556, !620}
!620 = !DILocation(line: 792, column: 5, scope: !538)
!621 = !DILocation(line: 794, column: 7, scope: !622)
!622 = distinct !DILexicalBlock(scope: !538, file: !3, line: 794, column: 7)
!623 = !DILocation(line: 794, column: 7, scope: !538)
!624 = !DILocation(line: 796, column: 18, scope: !625)
!625 = distinct !DILexicalBlock(scope: !622, file: !3, line: 795, column: 5)
!626 = !DILocation(line: 797, column: 20, scope: !625)
!627 = !DILocation(line: 798, column: 5, scope: !625)
!628 = !DILocation(line: 800, column: 7, scope: !629)
!629 = distinct !DILexicalBlock(scope: !538, file: !3, line: 800, column: 7)
!630 = !DILocation(line: 800, column: 7, scope: !538)
!631 = !DILocation(line: 802, column: 20, scope: !632)
!632 = distinct !DILexicalBlock(scope: !629, file: !3, line: 801, column: 5)
!633 = !DILocation(line: 803, column: 5, scope: !632)
!634 = !DILocation(line: 805, column: 7, scope: !635)
!635 = distinct !DILexicalBlock(scope: !538, file: !3, line: 805, column: 7)
!636 = !DILocation(line: 805, column: 7, scope: !538)
!637 = !DILocation(line: 807, column: 19, scope: !638)
!638 = distinct !DILexicalBlock(scope: !635, file: !3, line: 806, column: 5)
!639 = !DILocation(line: 808, column: 25, scope: !638)
!640 = !DILocation(line: 809, column: 5, scope: !638)
!641 = !DILocation(line: 812, column: 19, scope: !642)
!642 = distinct !DILexicalBlock(scope: !635, file: !3, line: 811, column: 5)
!643 = !DILocation(line: 813, column: 25, scope: !642)
!644 = !DILocation(line: 816, column: 11, scope: !538)
!645 = !DILocation(line: 816, column: 18, scope: !538)
!646 = !DILocation(line: 816, column: 16, scope: !538)
!647 = !DILocation(line: 816, column: 3, scope: !538)
!648 = !DILocation(line: 819, column: 20, scope: !649)
!649 = distinct !DILexicalBlock(scope: !538, file: !3, line: 817, column: 5)
!650 = !DILocation(line: 820, column: 7, scope: !649)
!651 = !DILocation(line: 823, column: 7, scope: !649)
!652 = !DILocation(line: 824, column: 7, scope: !649)
!653 = !DILocation(line: 827, column: 12, scope: !649)
!654 = !DILocation(line: 827, column: 17, scope: !649)
!655 = !DILocation(line: 827, column: 7, scope: !649)
!656 = !DILocation(line: 828, column: 7, scope: !649)
!657 = !DILocation(line: 831, column: 20, scope: !649)
!658 = !DILocation(line: 831, column: 50, scope: !649)
!659 = !DILocation(line: 831, column: 55, scope: !649)
!660 = !DILocation(line: 831, column: 62, scope: !649)
!661 = !DILocation(line: 831, column: 43, scope: !649)
!662 = !DILocation(line: 831, column: 7, scope: !649)
!663 = !DILocation(line: 832, column: 7, scope: !649)
!664 = !DILocation(line: 835, column: 3, scope: !538)
!665 = distinct !DISubprogram(name: "who", scope: !3, file: !3, line: 621, type: !666, scopeLine: 622, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!666 = !DISubroutineType(types: !667)
!667 = !{null, !49, !53}
!668 = !DILocalVariable(name: "filename", arg: 1, scope: !665, file: !3, line: 621, type: !49)
!669 = !DILocation(line: 621, column: 18, scope: !665)
!670 = !DILocalVariable(name: "options", arg: 2, scope: !665, file: !3, line: 621, type: !53)
!671 = !DILocation(line: 621, column: 32, scope: !665)
!672 = !DILocalVariable(name: "n_users", scope: !665, file: !3, line: 623, type: !110)
!673 = !DILocation(line: 623, column: 10, scope: !665)
!674 = !DILocalVariable(name: "utmp_buf", scope: !665, file: !3, line: 624, type: !675)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!676 = !DILocation(line: 624, column: 16, scope: !665)
!677 = !DILocation(line: 626, column: 18, scope: !678)
!678 = distinct !DILexicalBlock(scope: !665, file: !3, line: 626, column: 7)
!679 = !DILocation(line: 626, column: 49, scope: !678)
!680 = !DILocation(line: 626, column: 7, scope: !678)
!681 = !DILocation(line: 626, column: 58, scope: !678)
!682 = !DILocation(line: 626, column: 7, scope: !665)
!683 = !DILocation(line: 627, column: 5, scope: !678)
!684 = !DILocation(line: 629, column: 7, scope: !685)
!685 = distinct !DILexicalBlock(scope: !665, file: !3, line: 629, column: 7)
!686 = !DILocation(line: 629, column: 7, scope: !665)
!687 = !DILocation(line: 630, column: 23, scope: !685)
!688 = !DILocation(line: 630, column: 32, scope: !685)
!689 = !DILocation(line: 630, column: 5, scope: !685)
!690 = !DILocation(line: 632, column: 19, scope: !685)
!691 = !DILocation(line: 632, column: 28, scope: !685)
!692 = !DILocation(line: 632, column: 5, scope: !685)
!693 = !DILocation(line: 634, column: 9, scope: !665)
!694 = !DILocation(line: 634, column: 3, scope: !665)
!695 = !DILocation(line: 635, column: 1, scope: !665)
!696 = distinct !DISubprogram(name: "list_entries_who", scope: !3, file: !3, line: 537, type: !697, scopeLine: 538, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!697 = !DISubroutineType(types: !698)
!698 = !{null, !110, !67}
!699 = !DILocalVariable(name: "n", arg: 1, scope: !696, file: !3, line: 537, type: !110)
!700 = !DILocation(line: 537, column: 26, scope: !696)
!701 = !DILocalVariable(name: "utmp_buf", arg: 2, scope: !696, file: !3, line: 537, type: !67)
!702 = !DILocation(line: 537, column: 48, scope: !696)
!703 = !DILocalVariable(name: "entries", scope: !696, file: !3, line: 539, type: !112)
!704 = !DILocation(line: 539, column: 21, scope: !696)
!705 = !DILocalVariable(name: "separator", scope: !696, file: !3, line: 540, type: !49)
!706 = !DILocation(line: 540, column: 15, scope: !696)
!707 = !DILocation(line: 542, column: 3, scope: !696)
!708 = !DILocation(line: 542, column: 11, scope: !696)
!709 = !DILocation(line: 544, column: 11, scope: !710)
!710 = distinct !DILexicalBlock(scope: !711, file: !3, line: 544, column: 11)
!711 = distinct !DILexicalBlock(scope: !696, file: !3, line: 543, column: 5)
!712 = !DILocation(line: 544, column: 11, scope: !711)
!713 = !DILocalVariable(name: "trimmed_name", scope: !714, file: !3, line: 546, type: !6)
!714 = distinct !DILexicalBlock(scope: !710, file: !3, line: 545, column: 9)
!715 = !DILocation(line: 546, column: 17, scope: !714)
!716 = !DILocation(line: 548, column: 48, scope: !714)
!717 = !DILocation(line: 548, column: 26, scope: !714)
!718 = !DILocation(line: 548, column: 24, scope: !714)
!719 = !DILocation(line: 550, column: 27, scope: !714)
!720 = !DILocation(line: 550, column: 38, scope: !714)
!721 = !DILocation(line: 550, column: 11, scope: !714)
!722 = !DILocation(line: 551, column: 17, scope: !714)
!723 = !DILocation(line: 551, column: 11, scope: !714)
!724 = !DILocation(line: 552, column: 21, scope: !714)
!725 = !DILocation(line: 553, column: 18, scope: !714)
!726 = !DILocation(line: 554, column: 9, scope: !714)
!727 = !DILocation(line: 555, column: 15, scope: !711)
!728 = distinct !{!728, !707, !729}
!729 = !DILocation(line: 556, column: 5, scope: !696)
!730 = !DILocation(line: 557, column: 11, scope: !696)
!731 = !DILocation(line: 557, column: 33, scope: !696)
!732 = !DILocation(line: 557, column: 3, scope: !696)
!733 = !DILocation(line: 558, column: 1, scope: !696)
!734 = !DILocalVariable(name: "n", arg: 1, scope: !735, file: !3, line: 537, type: !110)
!735 = distinct !DISubprogram(name: "list_entries_who", scope: !3, file: !3, line: 537, type: !736, scopeLine: 538, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !762, retainedNodes: !4)
!736 = !DISubroutineType(types: !737)
!737 = !{null, !110, !738}
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !740)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !70, line: 146, baseType: !741)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !72, line: 55, size: 3072, elements: !742)
!742 = !{!743, !744, !745, !746, !747, !748, !749, !754, !755, !760, !761}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !741, file: !72, line: 57, baseType: !14, size: 16)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !741, file: !72, line: 58, baseType: !76, size: 32, offset: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !741, file: !72, line: 59, baseType: !78, size: 256, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !741, file: !72, line: 61, baseType: !82, size: 32, offset: 320)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !741, file: !72, line: 63, baseType: !78, size: 256, offset: 352)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !741, file: !72, line: 65, baseType: !87, size: 2048, offset: 608)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !741, file: !72, line: 67, baseType: !750, size: 32, offset: 2656)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !72, line: 42, size: 32, elements: !751)
!751 = !{!752, !753}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !750, file: !72, line: 45, baseType: !14, size: 16)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !750, file: !72, line: 46, baseType: !14, size: 16, offset: 16)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !741, file: !72, line: 74, baseType: !96, size: 32, offset: 2688)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !741, file: !72, line: 79, baseType: !756, size: 64, offset: 2720)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !741, file: !72, line: 75, size: 64, elements: !757)
!757 = !{!758, !759}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !756, file: !72, line: 77, baseType: !96, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !756, file: !72, line: 78, baseType: !96, size: 32, offset: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !741, file: !72, line: 84, baseType: !103, size: 128, offset: 2784)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !741, file: !72, line: 85, baseType: !105, size: 160, offset: 2912)
!762 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !763, nameTableKind: None)
!763 = !{!764, !766, !768, !770, !772, !774, !776, !778, !780, !782, !784, !786, !788, !790, !792, !794, !796, !798, !808, !811, !816, !818, !821, !823, !828, !833, !835}
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "do_lookup", scope: !762, file: !3, line: 102, type: !18, isLocal: true, isDefinition: true)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "short_list", scope: !762, file: !3, line: 107, type: !18, isLocal: true, isDefinition: true)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(name: "short_output", scope: !762, file: !3, line: 110, type: !18, isLocal: true, isDefinition: true)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(name: "include_idle", scope: !762, file: !3, line: 115, type: !18, isLocal: true, isDefinition: true)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(name: "include_heading", scope: !762, file: !3, line: 118, type: !18, isLocal: true, isDefinition: true)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(name: "include_mesg", scope: !762, file: !3, line: 122, type: !18, isLocal: true, isDefinition: true)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(name: "include_exit", scope: !762, file: !3, line: 125, type: !18, isLocal: true, isDefinition: true)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(name: "need_boottime", scope: !762, file: !3, line: 128, type: !18, isLocal: true, isDefinition: true)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(name: "need_deadprocs", scope: !762, file: !3, line: 131, type: !18, isLocal: true, isDefinition: true)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(name: "need_login", scope: !762, file: !3, line: 134, type: !18, isLocal: true, isDefinition: true)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(name: "need_initspawn", scope: !762, file: !3, line: 137, type: !18, isLocal: true, isDefinition: true)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "need_clockchange", scope: !762, file: !3, line: 140, type: !18, isLocal: true, isDefinition: true)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(name: "need_runlevel", scope: !762, file: !3, line: 143, type: !18, isLocal: true, isDefinition: true)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(name: "need_users", scope: !762, file: !3, line: 146, type: !18, isLocal: true, isDefinition: true)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(name: "my_line_only", scope: !762, file: !3, line: 149, type: !18, isLocal: true, isDefinition: true)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(name: "time_format", scope: !762, file: !3, line: 153, type: !49, isLocal: true, isDefinition: true)
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(name: "time_format_width", scope: !762, file: !3, line: 154, type: !53, isLocal: true, isDefinition: true)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(name: "longopts", scope: !762, file: !3, line: 162, type: !800, isLocal: true, isDefinition: true)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !801, size: 4608, elements: !151)
!801 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !802)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !144, line: 50, size: 256, elements: !803)
!803 = !{!804, !805, !806, !807}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !802, file: !144, line: 52, baseType: !49, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !802, file: !144, line: 55, baseType: !53, size: 32, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !802, file: !144, line: 56, baseType: !149, size: 64, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !802, file: !144, line: 57, baseType: !53, size: 32, offset: 192)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(name: "mesg", scope: !810, file: !3, line: 249, type: !59, isLocal: true, isDefinition: true)
!810 = distinct !DISubprogram(name: "print_line", scope: !3, file: !3, line: 244, type: !57, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !762, retainedNodes: !4)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(name: "hoststr", scope: !813, file: !3, line: 339, type: !6, isLocal: true, isDefinition: true)
!813 = distinct !DISubprogram(name: "print_user", scope: !3, file: !3, line: 333, type: !814, scopeLine: 334, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !762, retainedNodes: !4)
!814 = !DISubroutineType(types: !815)
!815 = !{null, !738, !9}
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(name: "hostlen", scope: !813, file: !3, line: 341, type: !110, isLocal: true, isDefinition: true)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(name: "now", scope: !820, file: !3, line: 190, type: !9, isLocal: true, isDefinition: true)
!820 = distinct !DISubprogram(name: "idle_string", scope: !3, file: !3, line: 188, type: !116, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !762, retainedNodes: !4)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(name: "idle_hhmm", scope: !820, file: !3, line: 202, type: !120, isLocal: true, isDefinition: true)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(name: "buf", scope: !825, file: !3, line: 220, type: !128, isLocal: true, isDefinition: true)
!825 = distinct !DISubprogram(name: "time_string", scope: !3, file: !3, line: 218, type: !826, scopeLine: 219, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !762, retainedNodes: !4)
!826 = !DISubroutineType(types: !827)
!827 = !{!49, !738}
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(name: "runlevline", scope: !830, file: !3, line: 516, type: !6, isLocal: true, isDefinition: true)
!830 = distinct !DISubprogram(name: "print_runlevel", scope: !3, file: !3, line: 514, type: !831, scopeLine: 515, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !762, retainedNodes: !4)
!831 = !DISubroutineType(types: !832)
!832 = !{null, !738}
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(name: "comment", scope: !830, file: !3, line: 516, type: !6, isLocal: true, isDefinition: true)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(name: "exitstr", scope: !837, file: !3, line: 461, type: !6, isLocal: true, isDefinition: true)
!837 = distinct !DISubprogram(name: "print_deadprocs", scope: !3, file: !3, line: 459, type: !831, scopeLine: 460, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !762, retainedNodes: !4)
!838 = !DILocalVariable(name: "utmp_buf", arg: 2, scope: !735, file: !3, line: 537, type: !738)
!839 = !DILocalVariable(name: "entries", scope: !735, file: !3, line: 539, type: !112)
!840 = !DILocalVariable(name: "separator", scope: !735, file: !3, line: 540, type: !49)
!841 = distinct !DISubprogram(name: "scan_entries", scope: !3, file: !3, line: 569, type: !697, scopeLine: 570, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!842 = !DILocalVariable(name: "n", arg: 1, scope: !841, file: !3, line: 569, type: !110)
!843 = !DILocation(line: 569, column: 22, scope: !841)
!844 = !DILocalVariable(name: "utmp_buf", arg: 2, scope: !841, file: !3, line: 569, type: !67)
!845 = !DILocation(line: 569, column: 44, scope: !841)
!846 = !DILocalVariable(name: "ttyname_b", scope: !841, file: !3, line: 571, type: !6)
!847 = !DILocation(line: 571, column: 9, scope: !841)
!848 = !DILocalVariable(name: "boottime", scope: !841, file: !3, line: 572, type: !9)
!849 = !DILocation(line: 572, column: 10, scope: !841)
!850 = !DILocation(line: 574, column: 7, scope: !851)
!851 = distinct !DILexicalBlock(scope: !841, file: !3, line: 574, column: 7)
!852 = !DILocation(line: 574, column: 7, scope: !841)
!853 = !DILocation(line: 575, column: 5, scope: !851)
!854 = !DILocation(line: 577, column: 7, scope: !855)
!855 = distinct !DILexicalBlock(scope: !841, file: !3, line: 577, column: 7)
!856 = !DILocation(line: 577, column: 7, scope: !841)
!857 = !DILocation(line: 579, column: 19, scope: !858)
!858 = distinct !DILexicalBlock(scope: !855, file: !3, line: 578, column: 5)
!859 = !DILocation(line: 579, column: 17, scope: !858)
!860 = !DILocation(line: 580, column: 12, scope: !861)
!861 = distinct !DILexicalBlock(scope: !858, file: !3, line: 580, column: 11)
!862 = !DILocation(line: 580, column: 11, scope: !858)
!863 = !DILocation(line: 581, column: 9, scope: !861)
!864 = !DILocation(line: 582, column: 11, scope: !865)
!865 = distinct !DILexicalBlock(scope: !858, file: !3, line: 582, column: 11)
!866 = !DILocation(line: 582, column: 64, scope: !865)
!867 = !DILocation(line: 583, column: 19, scope: !865)
!868 = !DILocation(line: 583, column: 9, scope: !865)
!869 = !DILocation(line: 584, column: 5, scope: !858)
!870 = !DILocation(line: 586, column: 3, scope: !841)
!871 = !DILocation(line: 586, column: 11, scope: !841)
!872 = !DILocation(line: 588, column: 12, scope: !873)
!873 = distinct !DILexicalBlock(scope: !874, file: !3, line: 588, column: 11)
!874 = distinct !DILexicalBlock(scope: !841, file: !3, line: 587, column: 5)
!875 = !DILocation(line: 589, column: 11, scope: !873)
!876 = !DILocation(line: 589, column: 14, scope: !873)
!877 = !DILocation(line: 588, column: 11, scope: !874)
!878 = !DILocation(line: 592, column: 15, scope: !879)
!879 = distinct !DILexicalBlock(scope: !880, file: !3, line: 592, column: 15)
!880 = distinct !DILexicalBlock(scope: !873, file: !3, line: 591, column: 9)
!881 = !DILocation(line: 592, column: 26, scope: !879)
!882 = !DILocation(line: 592, column: 29, scope: !879)
!883 = !DILocation(line: 592, column: 15, scope: !880)
!884 = !DILocation(line: 593, column: 25, scope: !879)
!885 = !DILocation(line: 593, column: 35, scope: !879)
!886 = !DILocation(line: 593, column: 13, scope: !879)
!887 = !DILocation(line: 594, column: 20, scope: !888)
!888 = distinct !DILexicalBlock(scope: !879, file: !3, line: 594, column: 20)
!889 = !DILocation(line: 594, column: 34, scope: !888)
!890 = !DILocation(line: 594, column: 37, scope: !888)
!891 = !DILocation(line: 594, column: 20, scope: !879)
!892 = !DILocation(line: 595, column: 29, scope: !888)
!893 = !DILocation(line: 595, column: 13, scope: !888)
!894 = !DILocation(line: 596, column: 20, scope: !895)
!895 = distinct !DILexicalBlock(scope: !888, file: !3, line: 596, column: 20)
!896 = !DILocation(line: 596, column: 34, scope: !895)
!897 = !DILocation(line: 596, column: 37, scope: !895)
!898 = !DILocation(line: 596, column: 20, scope: !888)
!899 = !DILocation(line: 597, column: 29, scope: !895)
!900 = !DILocation(line: 597, column: 13, scope: !895)
!901 = !DILocation(line: 601, column: 20, scope: !902)
!902 = distinct !DILexicalBlock(scope: !895, file: !3, line: 601, column: 20)
!903 = !DILocation(line: 601, column: 37, scope: !902)
!904 = !DILocation(line: 601, column: 40, scope: !902)
!905 = !DILocation(line: 601, column: 20, scope: !895)
!906 = !DILocation(line: 602, column: 32, scope: !902)
!907 = !DILocation(line: 602, column: 13, scope: !902)
!908 = !DILocation(line: 603, column: 20, scope: !909)
!909 = distinct !DILexicalBlock(scope: !902, file: !3, line: 603, column: 20)
!910 = !DILocation(line: 603, column: 35, scope: !909)
!911 = !DILocation(line: 603, column: 38, scope: !909)
!912 = !DILocation(line: 603, column: 20, scope: !902)
!913 = !DILocation(line: 604, column: 30, scope: !909)
!914 = !DILocation(line: 604, column: 13, scope: !909)
!915 = !DILocation(line: 605, column: 20, scope: !916)
!916 = distinct !DILexicalBlock(scope: !909, file: !3, line: 605, column: 20)
!917 = !DILocation(line: 605, column: 31, scope: !916)
!918 = !DILocation(line: 605, column: 34, scope: !916)
!919 = !DILocation(line: 605, column: 20, scope: !909)
!920 = !DILocation(line: 606, column: 26, scope: !916)
!921 = !DILocation(line: 606, column: 13, scope: !916)
!922 = !DILocation(line: 607, column: 20, scope: !923)
!923 = distinct !DILexicalBlock(scope: !916, file: !3, line: 607, column: 20)
!924 = !DILocation(line: 607, column: 35, scope: !923)
!925 = !DILocation(line: 607, column: 38, scope: !923)
!926 = !DILocation(line: 607, column: 20, scope: !916)
!927 = !DILocation(line: 608, column: 30, scope: !923)
!928 = !DILocation(line: 608, column: 13, scope: !923)
!929 = !DILocation(line: 609, column: 9, scope: !880)
!930 = !DILocation(line: 611, column: 11, scope: !931)
!931 = distinct !DILexicalBlock(scope: !874, file: !3, line: 611, column: 11)
!932 = !DILocation(line: 611, column: 11, scope: !874)
!933 = !DILocation(line: 612, column: 20, scope: !931)
!934 = !DILocation(line: 612, column: 18, scope: !931)
!935 = !DILocation(line: 612, column: 9, scope: !931)
!936 = !DILocation(line: 614, column: 15, scope: !874)
!937 = distinct !{!937, !870, !938}
!938 = !DILocation(line: 615, column: 5, scope: !841)
!939 = !DILocation(line: 616, column: 1, scope: !841)
!940 = !DILocalVariable(name: "n", arg: 1, scope: !941, file: !3, line: 569, type: !110)
!941 = distinct !DISubprogram(name: "scan_entries", scope: !3, file: !3, line: 569, type: !942, scopeLine: 570, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !968, retainedNodes: !4)
!942 = !DISubroutineType(types: !943)
!943 = !{null, !110, !944}
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !70, line: 146, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !72, line: 55, size: 3072, elements: !948)
!948 = !{!949, !950, !951, !952, !953, !954, !955, !960, !961, !966, !967}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !947, file: !72, line: 57, baseType: !14, size: 16)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !947, file: !72, line: 58, baseType: !76, size: 32, offset: 32)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !947, file: !72, line: 59, baseType: !78, size: 256, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !947, file: !72, line: 61, baseType: !82, size: 32, offset: 320)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !947, file: !72, line: 63, baseType: !78, size: 256, offset: 352)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !947, file: !72, line: 65, baseType: !87, size: 2048, offset: 608)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !947, file: !72, line: 67, baseType: !956, size: 32, offset: 2656)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !72, line: 42, size: 32, elements: !957)
!957 = !{!958, !959}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !956, file: !72, line: 45, baseType: !14, size: 16)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !956, file: !72, line: 46, baseType: !14, size: 16, offset: 16)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !947, file: !72, line: 74, baseType: !96, size: 32, offset: 2688)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !947, file: !72, line: 79, baseType: !962, size: 64, offset: 2720)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !947, file: !72, line: 75, size: 64, elements: !963)
!963 = !{!964, !965}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !962, file: !72, line: 77, baseType: !96, size: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !962, file: !72, line: 78, baseType: !96, size: 32, offset: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !947, file: !72, line: 84, baseType: !103, size: 128, offset: 2784)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !947, file: !72, line: 85, baseType: !105, size: 160, offset: 2912)
!968 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !969, nameTableKind: None)
!969 = !{!970, !972, !974, !976, !978, !980, !982, !984, !986, !988, !990, !992, !994, !996, !998, !1000, !1002, !1004, !1014, !1017, !1022, !1024, !1027, !1029, !1034, !1039, !1041}
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(name: "do_lookup", scope: !968, file: !3, line: 102, type: !18, isLocal: true, isDefinition: true)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(name: "short_list", scope: !968, file: !3, line: 107, type: !18, isLocal: true, isDefinition: true)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(name: "short_output", scope: !968, file: !3, line: 110, type: !18, isLocal: true, isDefinition: true)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(name: "include_idle", scope: !968, file: !3, line: 115, type: !18, isLocal: true, isDefinition: true)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(name: "include_heading", scope: !968, file: !3, line: 118, type: !18, isLocal: true, isDefinition: true)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(name: "include_mesg", scope: !968, file: !3, line: 122, type: !18, isLocal: true, isDefinition: true)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(name: "include_exit", scope: !968, file: !3, line: 125, type: !18, isLocal: true, isDefinition: true)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(name: "need_boottime", scope: !968, file: !3, line: 128, type: !18, isLocal: true, isDefinition: true)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(name: "need_deadprocs", scope: !968, file: !3, line: 131, type: !18, isLocal: true, isDefinition: true)
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(name: "need_login", scope: !968, file: !3, line: 134, type: !18, isLocal: true, isDefinition: true)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(name: "need_initspawn", scope: !968, file: !3, line: 137, type: !18, isLocal: true, isDefinition: true)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(name: "need_clockchange", scope: !968, file: !3, line: 140, type: !18, isLocal: true, isDefinition: true)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(name: "need_runlevel", scope: !968, file: !3, line: 143, type: !18, isLocal: true, isDefinition: true)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(name: "need_users", scope: !968, file: !3, line: 146, type: !18, isLocal: true, isDefinition: true)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(name: "my_line_only", scope: !968, file: !3, line: 149, type: !18, isLocal: true, isDefinition: true)
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(name: "time_format", scope: !968, file: !3, line: 153, type: !49, isLocal: true, isDefinition: true)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(name: "time_format_width", scope: !968, file: !3, line: 154, type: !53, isLocal: true, isDefinition: true)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(name: "longopts", scope: !968, file: !3, line: 162, type: !1006, isLocal: true, isDefinition: true)
!1006 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1007, size: 4608, elements: !151)
!1007 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1008)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !144, line: 50, size: 256, elements: !1009)
!1009 = !{!1010, !1011, !1012, !1013}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1008, file: !144, line: 52, baseType: !49, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !1008, file: !144, line: 55, baseType: !53, size: 32, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1008, file: !144, line: 56, baseType: !149, size: 64, offset: 128)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1008, file: !144, line: 57, baseType: !53, size: 32, offset: 192)
!1014 = !DIGlobalVariableExpression(var: !1015, expr: !DIExpression())
!1015 = distinct !DIGlobalVariable(name: "mesg", scope: !1016, file: !3, line: 249, type: !59, isLocal: true, isDefinition: true)
!1016 = distinct !DISubprogram(name: "print_line", scope: !3, file: !3, line: 244, type: !57, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !968, retainedNodes: !4)
!1017 = !DIGlobalVariableExpression(var: !1018, expr: !DIExpression())
!1018 = distinct !DIGlobalVariable(name: "hoststr", scope: !1019, file: !3, line: 339, type: !6, isLocal: true, isDefinition: true)
!1019 = distinct !DISubprogram(name: "print_user", scope: !3, file: !3, line: 333, type: !1020, scopeLine: 334, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !968, retainedNodes: !4)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{null, !944, !9}
!1022 = !DIGlobalVariableExpression(var: !1023, expr: !DIExpression())
!1023 = distinct !DIGlobalVariable(name: "hostlen", scope: !1019, file: !3, line: 341, type: !110, isLocal: true, isDefinition: true)
!1024 = !DIGlobalVariableExpression(var: !1025, expr: !DIExpression())
!1025 = distinct !DIGlobalVariable(name: "now", scope: !1026, file: !3, line: 190, type: !9, isLocal: true, isDefinition: true)
!1026 = distinct !DISubprogram(name: "idle_string", scope: !3, file: !3, line: 188, type: !116, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !968, retainedNodes: !4)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(name: "idle_hhmm", scope: !1026, file: !3, line: 202, type: !120, isLocal: true, isDefinition: true)
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
!1030 = distinct !DIGlobalVariable(name: "buf", scope: !1031, file: !3, line: 220, type: !128, isLocal: true, isDefinition: true)
!1031 = distinct !DISubprogram(name: "time_string", scope: !3, file: !3, line: 218, type: !1032, scopeLine: 219, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !968, retainedNodes: !4)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!49, !944}
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(name: "runlevline", scope: !1036, file: !3, line: 516, type: !6, isLocal: true, isDefinition: true)
!1036 = distinct !DISubprogram(name: "print_runlevel", scope: !3, file: !3, line: 514, type: !1037, scopeLine: 515, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !968, retainedNodes: !4)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{null, !944}
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(name: "comment", scope: !1036, file: !3, line: 516, type: !6, isLocal: true, isDefinition: true)
!1041 = !DIGlobalVariableExpression(var: !1042, expr: !DIExpression())
!1042 = distinct !DIGlobalVariable(name: "exitstr", scope: !1043, file: !3, line: 461, type: !6, isLocal: true, isDefinition: true)
!1043 = distinct !DISubprogram(name: "print_deadprocs", scope: !3, file: !3, line: 459, type: !1037, scopeLine: 460, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !968, retainedNodes: !4)
!1044 = !DILocalVariable(name: "utmp_buf", arg: 2, scope: !941, file: !3, line: 569, type: !944)
!1045 = !DILocalVariable(name: "ttyname_b", scope: !941, file: !3, line: 571, type: !6)
!1046 = !DILocalVariable(name: "boottime", scope: !941, file: !3, line: 572, type: !9)
!1047 = distinct !DISubprogram(name: "print_heading", scope: !3, file: !3, line: 561, type: !1048, scopeLine: 562, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{null}
!1050 = !DILocation(line: 563, column: 19, scope: !1047)
!1051 = !DILocation(line: 563, column: 39, scope: !1047)
!1052 = !DILocation(line: 563, column: 50, scope: !1047)
!1053 = !DILocation(line: 563, column: 61, scope: !1047)
!1054 = !DILocation(line: 564, column: 15, scope: !1047)
!1055 = !DILocation(line: 564, column: 25, scope: !1047)
!1056 = !DILocation(line: 564, column: 39, scope: !1047)
!1057 = !DILocation(line: 563, column: 3, scope: !1047)
!1058 = !DILocation(line: 565, column: 1, scope: !1047)
!1059 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !64, file: !3, line: 333, type: !67)
!1060 = !DILocation(line: 333, column: 32, scope: !64)
!1061 = !DILocalVariable(name: "boottime", arg: 2, scope: !64, file: !3, line: 333, type: !9)
!1062 = !DILocation(line: 333, column: 49, scope: !64)
!1063 = !DILocalVariable(name: "stats", scope: !64, file: !3, line: 335, type: !1064)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1065, line: 46, size: 1152, elements: !1066)
!1065 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!1066 = !{!1067, !1069, !1071, !1073, !1075, !1077, !1079, !1080, !1081, !1083, !1085, !1087, !1094, !1095, !1096}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1064, file: !1065, line: 48, baseType: !1068, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !12, line: 145, baseType: !112)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1064, file: !1065, line: 53, baseType: !1070, size: 64, offset: 64)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !12, line: 148, baseType: !112)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1064, file: !1065, line: 61, baseType: !1072, size: 64, offset: 128)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !12, line: 151, baseType: !112)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1064, file: !1065, line: 62, baseType: !1074, size: 32, offset: 192)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !12, line: 150, baseType: !180)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1064, file: !1065, line: 64, baseType: !1076, size: 32, offset: 224)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !12, line: 146, baseType: !180)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1064, file: !1065, line: 65, baseType: !1078, size: 32, offset: 256)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !12, line: 147, baseType: !180)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1064, file: !1065, line: 67, baseType: !53, size: 32, offset: 288)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1064, file: !1065, line: 69, baseType: !1068, size: 64, offset: 320)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1064, file: !1065, line: 74, baseType: !1082, size: 64, offset: 384)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !12, line: 152, baseType: !13)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1064, file: !1065, line: 78, baseType: !1084, size: 64, offset: 448)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !12, line: 174, baseType: !13)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1064, file: !1065, line: 80, baseType: !1086, size: 64, offset: 512)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !12, line: 179, baseType: !13)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1064, file: !1065, line: 91, baseType: !1088, size: 128, offset: 576)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1089, line: 10, size: 128, elements: !1090)
!1089 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!1090 = !{!1091, !1092}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1088, file: !1089, line: 12, baseType: !11, size: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1088, file: !1089, line: 16, baseType: !1093, size: 64, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !12, line: 196, baseType: !13)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1064, file: !1065, line: 92, baseType: !1088, size: 128, offset: 704)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1064, file: !1065, line: 93, baseType: !1088, size: 128, offset: 832)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1064, file: !1065, line: 106, baseType: !1097, size: 192, offset: 960)
!1097 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1093, size: 192, elements: !60)
!1098 = !DILocation(line: 335, column: 15, scope: !64)
!1099 = !DILocalVariable(name: "last_change", scope: !64, file: !3, line: 336, type: !9)
!1100 = !DILocation(line: 336, column: 10, scope: !64)
!1101 = !DILocalVariable(name: "mesg", scope: !64, file: !3, line: 337, type: !7)
!1102 = !DILocation(line: 337, column: 8, scope: !64)
!1103 = !DILocalVariable(name: "idlestr", scope: !64, file: !3, line: 338, type: !1104)
!1104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 56, elements: !376)
!1105 = !DILocation(line: 338, column: 8, scope: !64)
!1106 = !DILocalVariable(name: "line", scope: !64, file: !3, line: 347, type: !1107)
!1107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 304, elements: !1108)
!1108 = !{!1109}
!1109 = !DISubrange(count: 38)
!1110 = !DILocation(line: 347, column: 8, scope: !64)
!1111 = !DILocalVariable(name: "p", scope: !64, file: !3, line: 348, type: !6)
!1112 = !DILocation(line: 348, column: 9, scope: !64)
!1113 = !DILocation(line: 348, column: 13, scope: !64)
!1114 = !DILocalVariable(name: "pidstr", scope: !64, file: !3, line: 349, type: !1115)
!1115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !1116)
!1116 = !{!1117}
!1117 = !DISubrange(count: 12)
!1118 = !DILocation(line: 349, column: 3, scope: !64)
!1119 = !DILocation(line: 354, column: 10, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !64, file: !3, line: 354, column: 8)
!1121 = !DILocation(line: 354, column: 8, scope: !64)
!1122 = !DILocation(line: 355, column: 17, scope: !1120)
!1123 = !DILocation(line: 355, column: 9, scope: !1120)
!1124 = !DILocation(line: 355, column: 7, scope: !1120)
!1125 = !DILocation(line: 355, column: 5, scope: !1120)
!1126 = !DILocation(line: 356, column: 12, scope: !64)
!1127 = !DILocation(line: 356, column: 15, scope: !64)
!1128 = !DILocation(line: 356, column: 25, scope: !64)
!1129 = !DILocation(line: 356, column: 3, scope: !64)
!1130 = !DILocation(line: 358, column: 13, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !64, file: !3, line: 358, column: 7)
!1132 = !DILocation(line: 358, column: 7, scope: !1131)
!1133 = !DILocation(line: 358, column: 27, scope: !1131)
!1134 = !DILocation(line: 358, column: 7, scope: !64)
!1135 = !DILocation(line: 360, column: 14, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1131, file: !3, line: 359, column: 5)
!1137 = !DILocation(line: 360, column: 12, scope: !1136)
!1138 = !DILocation(line: 361, column: 27, scope: !1136)
!1139 = !DILocation(line: 361, column: 19, scope: !1136)
!1140 = !DILocation(line: 362, column: 5, scope: !1136)
!1141 = !DILocation(line: 365, column: 12, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !1131, file: !3, line: 364, column: 5)
!1143 = !DILocation(line: 366, column: 19, scope: !1142)
!1144 = !DILocation(line: 369, column: 7, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !64, file: !3, line: 369, column: 7)
!1146 = !DILocation(line: 369, column: 7, scope: !64)
!1147 = !DILocation(line: 370, column: 14, scope: !1145)
!1148 = !DILocation(line: 370, column: 57, scope: !1145)
!1149 = !DILocation(line: 370, column: 70, scope: !1145)
!1150 = !DILocation(line: 370, column: 44, scope: !1145)
!1151 = !DILocation(line: 370, column: 5, scope: !1145)
