; ModuleID = 'whodir/who-O1-inserted.ll'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.option = type { i8*, i32, i32*, i32 }
%struct.addrinfo = type { i32, i32, i32, i32, i32, %struct.sockaddr*, i8*, %struct.addrinfo* }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.utmpx = type { i16, i32, [32 x i8], [4 x i8], [32 x i8], [256 x i8], %struct.__exit_status, i32, %struct.anon, [4 x i32], [20 x i8] }
%struct.__exit_status = type { i16, i16 }
%struct.anon = type { i32, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8

!10 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !12, line: 160, baseType: !13)
!12 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!13 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!14 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!15 = !{!16, !19, !21, !23, !25, !27, !29, !31, !33, !35, !37, !39, !41, !43, !45, !47, !51, !0, !54, !62, !108, !113, !118, !123, !131, !136, !138}
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "do_lookup", scope: !2, file: !3, line: 102, type: !18, isLocal: true, isDefinition: true)
!18 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "short_list", scope: !2, file: !3, line: 107, type: !18, isLocal: true, isDefinition: true)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "short_output", scope: !2, file: !3, line: 110, type: !18, isLocal: true, isDefinition: true)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "include_idle", scope: !2, file: !3, line: 115, type: !18, isLocal: true, isDefinition: true)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "include_heading", scope: !2, file: !3, line: 118, type: !18, isLocal: true, isDefinition: true)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "include_mesg", scope: !2, file: !3, line: 122, type: !18, isLocal: true, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "include_exit", scope: !2, file: !3, line: 125, type: !18, isLocal: true, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "need_boottime", scope: !2, file: !3, line: 128, type: !18, isLocal: true, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "need_deadprocs", scope: !2, file: !3, line: 131, type: !18, isLocal: true, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "need_login", scope: !2, file: !3, line: 134, type: !18, isLocal: true, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "need_initspawn", scope: !2, file: !3, line: 137, type: !18, isLocal: true, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "need_clockchange", scope: !2, file: !3, line: 140, type: !18, isLocal: true, isDefinition: true)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "need_runlevel", scope: !2, file: !3, line: 143, type: !18, isLocal: true, isDefinition: true)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "need_users", scope: !2, file: !3, line: 146, type: !18, isLocal: true, isDefinition: true)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "my_line_only", scope: !2, file: !3, line: 149, type: !18, isLocal: true, isDefinition: true)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "time_format", scope: !2, file: !3, line: 153, type: !49, isLocal: true, isDefinition: true)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "time_format_width", scope: !2, file: !3, line: 154, type: !53, isLocal: true, isDefinition: true)
!53 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "mesg", scope: !56, file: !3, line: 249, type: !59, isLocal: true, isDefinition: true)
!56 = distinct !DISubprogram(name: "print_line", scope: !3, file: !3, line: 244, type: !57, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!57 = !DISubroutineType(types: !58)
!58 = !{null, !53, !49, !50, !53, !49, !49, !49, !49, !49, !49}
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 24, elements: !60)
!60 = !{!61}
!61 = !DISubrange(count: 3)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "hoststr", scope: !64, file: !3, line: 339, type: !6, isLocal: true, isDefinition: true)
!64 = distinct !DISubprogram(name: "print_user", scope: !3, file: !3, line: 333, type: !65, scopeLine: 334, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!65 = !DISubroutineType(types: !66)
!66 = !{null, !67, !9}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !70, line: 146, baseType: !71)
!70 = !DIFile(filename: "./lib/readutmp.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !72, line: 55, size: 3072, elements: !73)
!72 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/utmpx.h", directory: "")
!73 = !{!74, !75, !77, !81, !85, !86, !90, !95, !97, !102, !104}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !71, file: !72, line: 57, baseType: !14, size: 16)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !71, file: !72, line: 58, baseType: !76, size: 32, offset: 32)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !12, line: 154, baseType: !53)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !71, file: !72, line: 59, baseType: !78, size: 256, offset: 64)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !71, file: !72, line: 61, baseType: !82, size: 32, offset: 320)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 4)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !71, file: !72, line: 63, baseType: !78, size: 256, offset: 352)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !71, file: !72, line: 65, baseType: !87, size: 2048, offset: 608)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 2048, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 256)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !71, file: !72, line: 67, baseType: !91, size: 32, offset: 2656)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !72, line: 42, size: 32, elements: !92)
!92 = !{!93, !94}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !91, file: !72, line: 45, baseType: !14, size: 16)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !91, file: !72, line: 46, baseType: !14, size: 16, offset: 16)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !71, file: !72, line: 74, baseType: !96, size: 32, offset: 2688)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !12, line: 41, baseType: !53)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !71, file: !72, line: 79, baseType: !98, size: 64, offset: 2720)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !71, file: !72, line: 75, size: 64, elements: !99)
!99 = !{!100, !101}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !98, file: !72, line: 77, baseType: !96, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !98, file: !72, line: 78, baseType: !96, size: 32, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !71, file: !72, line: 84, baseType: !103, size: 128, offset: 2784)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 128, elements: !83)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !71, file: !72, line: 85, baseType: !105, size: 160, offset: 2912)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 160, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 20)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "hostlen", scope: !64, file: !3, line: 341, type: !110, isLocal: true, isDefinition: true)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !111, line: 46, baseType: !112)
!111 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.1/include/stddef.h", directory: "")
!112 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "now", scope: !115, file: !3, line: 190, type: !9, isLocal: true, isDefinition: true)
!115 = distinct !DISubprogram(name: "idle_string", scope: !3, file: !3, line: 188, type: !116, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!116 = !DISubroutineType(types: !117)
!117 = !{!49, !9, !9}
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "idle_hhmm", scope: !115, file: !3, line: 202, type: !120, isLocal: true, isDefinition: true)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 48, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 6)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "buf", scope: !125, file: !3, line: 220, type: !128, isLocal: true, isDefinition: true)
!125 = distinct !DISubprogram(name: "time_string", scope: !3, file: !3, line: 218, type: !126, scopeLine: 219, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!126 = !DISubroutineType(types: !127)
!127 = !{!49, !67}
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 264, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 33)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "runlevline", scope: !133, file: !3, line: 516, type: !6, isLocal: true, isDefinition: true)
!133 = distinct !DISubprogram(name: "print_runlevel", scope: !3, file: !3, line: 514, type: !134, scopeLine: 515, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!134 = !DISubroutineType(types: !135)
!135 = !{null, !67}
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "comment", scope: !133, file: !3, line: 516, type: !6, isLocal: true, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "exitstr", scope: !140, file: !3, line: 461, type: !6, isLocal: true, isDefinition: true)
!140 = distinct !DISubprogram(name: "print_deadprocs", scope: !3, file: !3, line: 459, type: !134, scopeLine: 460, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 4608, elements: !151)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !144, line: 50, size: 256, elements: !145)
!144 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "")
!145 = !{!146, !147, !148, !150}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !143, file: !144, line: 52, baseType: !49, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !143, file: !144, line: 55, baseType: !53, size: 32, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !143, file: !144, line: 56, baseType: !149, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !143, file: !144, line: 57, baseType: !53, size: 32, offset: 192)
!151 = !{!152}
!152 = !DISubrange(count: 18)
!153 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!154 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!155 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!156 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!157 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!158 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!159 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!160 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!161 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!162 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!163 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!164 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!165 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!166 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!167 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "hints", scope: !170, file: !171, line: 64, type: !179, isLocal: true, isDefinition: true)
!170 = distinct !DISubprogram(name: "canon_host_r", scope: !171, file: !171, line: 61, type: !172, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !174, retainedNodes: !4)
!171 = !DIFile(filename: "lib/canon-host.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!172 = !DISubroutineType(types: !173)
!173 = !{!6, !49, !149}
!174 = distinct !DICompileUnit(language: DW_LANG_C99, file: !175, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !176, nameTableKind: None)
!175 = !DIFile(filename: "./lib/canon-host.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!176 = !{!168, !177}
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "last_cherror", scope: !174, file: !171, line: 28, type: !53, isLocal: true, isDefinition: true)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !180, line: 565, size: 384, elements: !181)
!180 = !DIFile(filename: "/usr/include/netdb.h", directory: "")
!181 = !{!182, !183, !184, !185, !186, !191, !203, !204}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !179, file: !180, line: 567, baseType: !53, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !179, file: !180, line: 568, baseType: !53, size: 32, offset: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !179, file: !180, line: 569, baseType: !53, size: 32, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !179, file: !180, line: 570, baseType: !53, size: 32, offset: 96)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !179, file: !180, line: 571, baseType: !187, size: 32, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !188, line: 33, baseType: !189)
!188 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "")
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !12, line: 209, baseType: !190)
!190 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !179, file: !180, line: 572, baseType: !192, size: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !188, line: 178, size: 128, elements: !194)
!194 = !{!195, !199}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !193, file: !188, line: 180, baseType: !196, size: 16)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !197, line: 28, baseType: !198)
!197 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "")
!198 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !193, file: !188, line: 181, baseType: !200, size: 112, offset: 16)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 112, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 14)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !179, file: !180, line: 573, baseType: !6, size: 64, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !179, file: !180, line: 574, baseType: !205, size: 64, offset: 320)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "exit_failure", scope: !208, file: !211, line: 24, type: !212, isLocal: false, isDefinition: true)
!208 = distinct !DICompileUnit(language: DW_LANG_C99, file: !209, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !210, nameTableKind: None)
!209 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!210 = !{!206}
!211 = !DIFile(filename: "lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!212 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !53)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "program_name", scope: !215, file: !219, line: 33, type: !49, isLocal: false, isDefinition: true)
!215 = distinct !DICompileUnit(language: DW_LANG_C99, file: !216, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !217, globals: !218, nameTableKind: None)
!216 = !DIFile(filename: "./lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!217 = !{!8, !6}
!218 = !{!213}
!219 = !DIFile(filename: "lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "slot0", scope: !222, file: !243, line: 842, type: !87, isLocal: true, isDefinition: true)
!222 = distinct !DICompileUnit(language: DW_LANG_C99, file: !223, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !224, retainedTypes: !239, globals: !240, nameTableKind: None)
!223 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!224 = !{!225}
!225 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !226, line: 32, baseType: !190, size: 32, elements: !227)
!226 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!227 = !{!228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238}
!228 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!229 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!230 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!231 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!232 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!233 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!234 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!235 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!236 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!237 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!238 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!239 = !{!53, !198, !110}
!240 = !{!241, !248, !254, !266, !220, !268, !275, !277}
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !222, file: !243, line: 85, type: !244, isLocal: false, isDefinition: true)
!243 = !DIFile(filename: "lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 704, elements: !246)
!245 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!246 = !{!247}
!247 = !DISubrange(count: 11)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !222, file: !243, line: 101, type: !250, isLocal: false, isDefinition: true)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 320, elements: !252)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !225)
!252 = !{!253}
!253 = !DISubrange(count: 10)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !222, file: !243, line: 1052, type: !256, isLocal: false, isDefinition: true)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !243, line: 65, size: 448, elements: !257)
!257 = !{!258, !259, !260, !264, !265}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !256, file: !243, line: 68, baseType: !225, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !256, file: !243, line: 71, baseType: !53, size: 32, offset: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !256, file: !243, line: 75, baseType: !261, size: 256, offset: 64)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 256, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 8)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !256, file: !243, line: 78, baseType: !49, size: 64, offset: 320)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !256, file: !243, line: 81, baseType: !49, size: 64, offset: 384)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !222, file: !243, line: 116, type: !256, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "slotvec", scope: !222, file: !243, line: 845, type: !270, isLocal: true, isDefinition: true)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !243, line: 834, size: 128, elements: !272)
!272 = !{!273, !274}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !271, file: !243, line: 836, baseType: !110, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !271, file: !243, line: 837, baseType: !6, size: 64, offset: 64)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "nslots", scope: !222, file: !243, line: 843, type: !53, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "slotvec0", scope: !222, file: !243, line: 844, type: !271, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !281, file: !284, line: 26, type: !285, isLocal: false, isDefinition: true)
!281 = distinct !DICompileUnit(language: DW_LANG_C99, file: !282, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !283, nameTableKind: None)
!282 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!283 = !{!279}
!284 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 376, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 47)
!288 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 64))
!289 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression(DW_OP_LLVM_fragment, 64, 64))
!290 = distinct !DICompileUnit(language: DW_LANG_C99, file: !291, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !292, nameTableKind: None)
!291 = !DIFile(filename: "src/version.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!292 = !{!293}
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "Version", scope: !290, file: !291, line: 2, type: !49, isLocal: false, isDefinition: true)
!295 = distinct !DICompileUnit(language: DW_LANG_C99, file: !296, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!296 = !DIFile(filename: "./lib/c-ctype.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!297 = distinct !DICompileUnit(language: DW_LANG_C99, file: !298, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !299, nameTableKind: None)
!298 = !DIFile(filename: "./lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!299 = !{!300, !303}
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "file_name", scope: !297, file: !302, line: 46, type: !49, isLocal: true, isDefinition: true)
!302 = !DIFile(filename: "lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !297, file: !302, line: 56, type: !18, isLocal: true, isDefinition: true)
!305 = distinct !DICompileUnit(language: DW_LANG_C99, file: !306, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!306 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!307 = distinct !DICompileUnit(language: DW_LANG_C99, file: !308, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !309, nameTableKind: None)
!308 = !DIFile(filename: "./lib/imaxtostr.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!309 = !{!310}
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !311, line: 101, baseType: !312)
!311 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !12, line: 72, baseType: !13)
!313 = distinct !DICompileUnit(language: DW_LANG_C99, file: !314, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !315, nameTableKind: None)
!314 = !DIFile(filename: "./lib/setlocale_null.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!315 = !{!8}
!316 = distinct !DICompileUnit(language: DW_LANG_C99, file: !317, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !315, nameTableKind: None)
!317 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!318 = distinct !DICompileUnit(language: DW_LANG_C99, file: !319, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !320, nameTableKind: None)
!319 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!320 = !{!110, !6, !8}
!321 = distinct !DICompileUnit(language: DW_LANG_C99, file: !322, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!322 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!323 = distinct !DICompileUnit(language: DW_LANG_C99, file: !324, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !325, nameTableKind: None)
!324 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!325 = !{!110}
!326 = distinct !DICompileUnit(language: DW_LANG_C99, file: !327, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !328, nameTableKind: None)
!327 = !DIFile(filename: "./lib/readutmp.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!328 = !{!6, !8}
!329 = distinct !DICompileUnit(language: DW_LANG_C99, file: !330, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !331, nameTableKind: None)
!330 = !DIFile(filename: "./lib/c-strcasecmp.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!331 = !{!332}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !334)
!334 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!335 = distinct !DICompileUnit(language: DW_LANG_C99, file: !336, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!336 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!337 = distinct !DICompileUnit(language: DW_LANG_C99, file: !338, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !315, nameTableKind: None)
!338 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!339 = distinct !DICompileUnit(language: DW_LANG_C99, file: !340, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!340 = !DIFile(filename: "./lib/fclose.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!341 = distinct !DICompileUnit(language: DW_LANG_C99, file: !342, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !315, nameTableKind: None)
!342 = !DIFile(filename: "./lib/fflush.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!343 = distinct !DICompileUnit(language: DW_LANG_C99, file: !344, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !315, nameTableKind: None)
!344 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!345 = !{!"clang version 9.0.1-12 "}
!346 = !{i32 2, !"Dwarf Version", i32 4}
!347 = !{i32 2, !"Debug Info Version", i32 3}
!348 = !{i32 1, !"wchar_size", i32 4}
!349 = !{i32 1, !"ThinLTO", i32 0}
!350 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!351 = !DILocalVariable(name: "argc", arg: 1, scope: !352, file: !3, line: 688, type: !53)
!352 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 688, type: !353, scopeLine: 689, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!353 = !DISubroutineType(types: !354)
!354 = !{!53, !53, !355}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!356 = !DILocation(line: 0, scope: !352)
!357 = !DILocalVariable(name: "argv", arg: 2, scope: !352, file: !3, line: 688, type: !355)
!358 = !DILocalVariable(name: "assumptions", scope: !352, file: !3, line: 691, type: !18)
!359 = !DILocation(line: 694, column: 21, scope: !352)
!360 = !DILocation(line: 694, column: 3, scope: !352)
!361 = !DILocation(line: 695, column: 3, scope: !352)
!362 = !DILocation(line: 696, column: 3, scope: !352)
!363 = !DILocation(line: 697, column: 3, scope: !352)
!364 = !DILocation(line: 699, column: 3, scope: !352)
!365 = !DILocation(line: 701, column: 3, scope: !352)
!366 = !DILocation(line: 691, column: 8, scope: !352)
!367 = !DILocation(line: 701, column: 18, scope: !352)
!368 = !DILocalVariable(name: "optc", scope: !352, file: !3, line: 690, type: !53)
!369 = !DILocation(line: 707, column: 25, scope: !370)
!370 = distinct !DILexicalBlock(scope: !371, file: !3, line: 705, column: 9)
!371 = distinct !DILexicalBlock(scope: !352, file: !3, line: 703, column: 5)
!372 = !DILocation(line: 708, column: 26, scope: !370)
!373 = !DILocation(line: 709, column: 22, scope: !370)
!374 = !DILocation(line: 710, column: 26, scope: !370)
!375 = !DILocation(line: 711, column: 25, scope: !370)
!376 = !DILocation(line: 712, column: 28, scope: !370)
!377 = !DILocation(line: 713, column: 22, scope: !370)
!378 = !DILocation(line: 714, column: 24, scope: !370)
!379 = !DILocation(line: 715, column: 24, scope: !370)
!380 = !DILocation(line: 718, column: 11, scope: !370)
!381 = !DILocation(line: 726, column: 26, scope: !370)
!382 = !DILocation(line: 727, column: 24, scope: !370)
!383 = !DILocation(line: 730, column: 11, scope: !370)
!384 = !DILocation(line: 734, column: 11, scope: !370)
!385 = !DILocation(line: 737, column: 22, scope: !370)
!386 = !DILocation(line: 740, column: 11, scope: !370)
!387 = !DILocation(line: 744, column: 11, scope: !370)
!388 = !DILocation(line: 749, column: 11, scope: !370)
!389 = !DILocation(line: 753, column: 11, scope: !370)
!390 = !DILocation(line: 756, column: 25, scope: !370)
!391 = !DILocation(line: 759, column: 11, scope: !370)
!392 = !DILocation(line: 763, column: 11, scope: !370)
!393 = !DILocation(line: 768, column: 11, scope: !370)
!394 = !DILocation(line: 773, column: 11, scope: !370)
!395 = !DILocation(line: 776, column: 22, scope: !370)
!396 = !DILocation(line: 779, column: 11, scope: !370)
!397 = !DILocation(line: 783, column: 11, scope: !370)
!398 = !DILocation(line: 787, column: 9, scope: !370)
!399 = !DILocation(line: 790, column: 11, scope: !370)
!400 = !DILocation(line: 0, scope: !370)
!401 = distinct !{!401, !365, !402}
!402 = !DILocation(line: 792, column: 5, scope: !352)
!403 = !DILocation(line: 794, column: 7, scope: !404)
!404 = distinct !DILexicalBlock(scope: !352, file: !3, line: 794, column: 7)
!405 = !DILocation(line: 794, column: 7, scope: !352)
!406 = !DILocation(line: 796, column: 18, scope: !407)
!407 = distinct !DILexicalBlock(scope: !404, file: !3, line: 795, column: 5)
!408 = !DILocation(line: 797, column: 20, scope: !407)
!409 = !DILocation(line: 798, column: 5, scope: !407)
!410 = !DILocation(line: 800, column: 7, scope: !411)
!411 = distinct !DILexicalBlock(scope: !352, file: !3, line: 800, column: 7)
!412 = !DILocation(line: 800, column: 7, scope: !352)
!413 = !DILocation(line: 802, column: 20, scope: !414)
!414 = distinct !DILexicalBlock(scope: !411, file: !3, line: 801, column: 5)
!415 = !DILocation(line: 803, column: 5, scope: !414)
!416 = !DILocation(line: 805, column: 7, scope: !417)
!417 = distinct !DILexicalBlock(scope: !352, file: !3, line: 805, column: 7)
!418 = !DILocation(line: 0, scope: !417)
!419 = !DILocation(line: 816, column: 18, scope: !352)
!420 = !DILocation(line: 816, column: 16, scope: !352)
!421 = !DILocation(line: 816, column: 3, scope: !352)
!422 = !DILocation(line: 819, column: 20, scope: !423)
!423 = distinct !DILexicalBlock(scope: !352, file: !3, line: 817, column: 5)
!424 = !DILocation(line: 820, column: 7, scope: !423)
!425 = !DILocation(line: 823, column: 7, scope: !423)
!426 = !DILocation(line: 824, column: 7, scope: !423)
!427 = !DILocation(line: 827, column: 12, scope: !423)
!428 = !DILocation(line: 827, column: 7, scope: !423)
!429 = !DILocation(line: 828, column: 7, scope: !423)
!430 = !DILocation(line: 831, column: 20, scope: !423)
!431 = !DILocation(line: 831, column: 55, scope: !423)
!432 = !DILocation(line: 831, column: 62, scope: !423)
!433 = !DILocation(line: 831, column: 50, scope: !423)
!434 = !DILocation(line: 831, column: 43, scope: !423)
!435 = !DILocation(line: 831, column: 7, scope: !423)
!436 = !DILocation(line: 832, column: 7, scope: !423)
!437 = !DILocation(line: 835, column: 3, scope: !352)
!438 = !DILocalVariable(name: "filename", arg: 1, scope: !439, file: !3, line: 621, type: !49)
!439 = distinct !DISubprogram(name: "who", scope: !3, file: !3, line: 621, type: !440, scopeLine: 622, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!440 = !DISubroutineType(types: !441)
!441 = !{null, !49, !53}
!442 = !DILocation(line: 0, scope: !439)
!443 = !DILocalVariable(name: "options", arg: 2, scope: !439, file: !3, line: 621, type: !53)
!444 = !DILocalVariable(name: "n_users", scope: !439, file: !3, line: 623, type: !110)
!445 = !DILocalVariable(name: "utmp_buf", scope: !439, file: !3, line: 624, type: !446)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!447 = !DILocation(line: 626, column: 7, scope: !448)
!448 = distinct !DILexicalBlock(scope: !439, file: !3, line: 626, column: 7)
!449 = !DILocation(line: 629, column: 7, scope: !450)
!450 = distinct !DILexicalBlock(scope: !439, file: !3, line: 629, column: 7)
!451 = !DILocation(line: 0, scope: !450)
!452 = !DILocation(line: 629, column: 7, scope: !439)
!453 = !DILocation(line: 630, column: 5, scope: !450)
!454 = !DILocation(line: 632, column: 5, scope: !450)
!455 = !DILocation(line: 634, column: 9, scope: !439)
!456 = !DILocation(line: 634, column: 3, scope: !439)
!457 = !DILocation(line: 635, column: 1, scope: !439)
!458 = !DILocalVariable(name: "n", arg: 1, scope: !459, file: !3, line: 537, type: !110)
!459 = distinct !DISubprogram(name: "list_entries_who", scope: !3, file: !3, line: 537, type: !460, scopeLine: 538, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!460 = !DISubroutineType(types: !461)
!461 = !{null, !110, !67}
!462 = !DILocation(line: 0, scope: !459)
!463 = !DILocalVariable(name: "utmp_buf", arg: 2, scope: !459, file: !3, line: 537, type: !67)
!464 = !DILocalVariable(name: "entries", scope: !459, file: !3, line: 539, type: !112)
!465 = !DILocalVariable(name: "separator", scope: !459, file: !3, line: 540, type: !49)
!466 = !DILocation(line: 542, column: 3, scope: !459)
!467 = !DILocation(line: 542, column: 11, scope: !459)
!468 = !DILocation(line: 544, column: 11, scope: !469)
!469 = distinct !DILexicalBlock(scope: !470, file: !3, line: 544, column: 11)
!470 = distinct !DILexicalBlock(scope: !459, file: !3, line: 543, column: 5)
!471 = !DILocation(line: 544, column: 11, scope: !470)
!472 = !DILocation(line: 548, column: 26, scope: !473)
!473 = distinct !DILexicalBlock(scope: !469, file: !3, line: 545, column: 9)
!474 = !DILocalVariable(name: "trimmed_name", scope: !473, file: !3, line: 546, type: !6)
!475 = !DILocation(line: 0, scope: !473)
!476 = !DILocation(line: 550, column: 11, scope: !473)
!477 = !DILocation(line: 551, column: 11, scope: !473)
!478 = !DILocation(line: 553, column: 18, scope: !473)
!479 = !DILocation(line: 554, column: 9, scope: !473)
!480 = !DILocation(line: 555, column: 15, scope: !470)
!481 = distinct !{!481, !466, !482}
!482 = !DILocation(line: 556, column: 5, scope: !459)
!483 = !DILocation(line: 557, column: 11, scope: !459)
!484 = !DILocation(line: 557, column: 3, scope: !459)
!485 = !DILocation(line: 558, column: 1, scope: !459)
!486 = !DILocalVariable(name: "n", arg: 1, scope: !487, file: !3, line: 569, type: !110)
!487 = distinct !DISubprogram(name: "scan_entries", scope: !3, file: !3, line: 569, type: !460, scopeLine: 570, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!488 = !DILocation(line: 0, scope: !487)
!489 = !DILocalVariable(name: "utmp_buf", arg: 2, scope: !487, file: !3, line: 569, type: !67)
!490 = !DILocalVariable(name: "boottime", scope: !487, file: !3, line: 572, type: !9)
!491 = !DILocation(line: 574, column: 7, scope: !492)
!492 = distinct !DILexicalBlock(scope: !487, file: !3, line: 574, column: 7)
!493 = !DILocation(line: 574, column: 7, scope: !487)
!494 = !DILocation(line: 575, column: 5, scope: !492)
!495 = !DILocation(line: 577, column: 7, scope: !496)
!496 = distinct !DILexicalBlock(scope: !487, file: !3, line: 577, column: 7)
!497 = !DILocation(line: 577, column: 7, scope: !487)
!498 = !DILocation(line: 579, column: 19, scope: !499)
!499 = distinct !DILexicalBlock(scope: !496, file: !3, line: 578, column: 5)
!500 = !DILocalVariable(name: "ttyname_b", scope: !487, file: !3, line: 571, type: !6)
!501 = !DILocation(line: 580, column: 12, scope: !502)
!502 = distinct !DILexicalBlock(scope: !499, file: !3, line: 580, column: 11)
!503 = !DILocation(line: 580, column: 11, scope: !499)
!504 = !DILocation(line: 582, column: 11, scope: !505)
!505 = distinct !DILexicalBlock(scope: !499, file: !3, line: 582, column: 11)
!506 = !DILocation(line: 583, column: 19, scope: !505)
!507 = !DILocation(line: 583, column: 9, scope: !505)
!508 = !DILocation(line: 586, column: 3, scope: !487)
!509 = !DILocation(line: 586, column: 11, scope: !487)
!510 = !DILocation(line: 588, column: 12, scope: !511)
!511 = distinct !DILexicalBlock(scope: !512, file: !3, line: 588, column: 11)
!512 = distinct !DILexicalBlock(scope: !487, file: !3, line: 587, column: 5)
!513 = !DILocation(line: 589, column: 11, scope: !511)
!514 = !DILocation(line: 589, column: 14, scope: !511)
!515 = !DILocation(line: 588, column: 11, scope: !512)
!516 = !DILocation(line: 592, column: 15, scope: !517)
!517 = distinct !DILexicalBlock(scope: !518, file: !3, line: 592, column: 15)
!518 = distinct !DILexicalBlock(scope: !511, file: !3, line: 591, column: 9)
!519 = !DILocation(line: 592, column: 26, scope: !517)
!520 = !DILocation(line: 592, column: 29, scope: !517)
!521 = !DILocation(line: 592, column: 15, scope: !518)
!522 = !DILocation(line: 593, column: 13, scope: !517)
!523 = !DILocation(line: 594, column: 20, scope: !524)
!524 = distinct !DILexicalBlock(scope: !517, file: !3, line: 594, column: 20)
!525 = !DILocation(line: 594, column: 34, scope: !524)
!526 = !DILocation(line: 594, column: 37, scope: !524)
!527 = !DILocation(line: 594, column: 20, scope: !517)
!528 = !DILocation(line: 595, column: 13, scope: !524)
!529 = !DILocation(line: 596, column: 20, scope: !530)
!530 = distinct !DILexicalBlock(scope: !524, file: !3, line: 596, column: 20)
!531 = !DILocation(line: 596, column: 34, scope: !530)
!532 = !DILocation(line: 596, column: 37, scope: !530)
!533 = !DILocation(line: 596, column: 20, scope: !524)
!534 = !DILocation(line: 597, column: 13, scope: !530)
!535 = !DILocation(line: 601, column: 20, scope: !536)
!536 = distinct !DILexicalBlock(scope: !530, file: !3, line: 601, column: 20)
!537 = !DILocation(line: 601, column: 37, scope: !536)
!538 = !DILocation(line: 601, column: 40, scope: !536)
!539 = !DILocation(line: 601, column: 20, scope: !530)
!540 = !DILocation(line: 602, column: 13, scope: !536)
!541 = !DILocation(line: 603, column: 20, scope: !542)
!542 = distinct !DILexicalBlock(scope: !536, file: !3, line: 603, column: 20)
!543 = !DILocation(line: 603, column: 35, scope: !542)
!544 = !DILocation(line: 603, column: 38, scope: !542)
!545 = !DILocation(line: 603, column: 20, scope: !536)
!546 = !DILocation(line: 604, column: 13, scope: !542)
!547 = !DILocation(line: 605, column: 20, scope: !548)
!548 = distinct !DILexicalBlock(scope: !542, file: !3, line: 605, column: 20)
!549 = !DILocation(line: 605, column: 31, scope: !548)
!550 = !DILocation(line: 605, column: 34, scope: !548)
!551 = !DILocation(line: 605, column: 20, scope: !542)
!552 = !DILocation(line: 606, column: 13, scope: !548)
!553 = !DILocation(line: 607, column: 20, scope: !554)
!554 = distinct !DILexicalBlock(scope: !548, file: !3, line: 607, column: 20)
!555 = !DILocation(line: 607, column: 35, scope: !554)
!556 = !DILocation(line: 607, column: 38, scope: !554)
!557 = !DILocation(line: 607, column: 20, scope: !548)
!558 = !DILocation(line: 608, column: 13, scope: !554)
!559 = !DILocation(line: 611, column: 11, scope: !560)
!560 = distinct !DILexicalBlock(scope: !512, file: !3, line: 611, column: 11)
!561 = !DILocation(line: 611, column: 11, scope: !512)
!562 = !DILocation(line: 612, column: 20, scope: !560)
!563 = !DILocation(line: 612, column: 9, scope: !560)
!564 = !DILocation(line: 614, column: 15, scope: !512)
!565 = distinct !{!565, !508, !566}
!566 = !DILocation(line: 615, column: 5, scope: !487)
!567 = !DILocation(line: 616, column: 1, scope: !487)
!568 = !DILocation(line: 563, column: 19, scope: !569)
!569 = distinct !DISubprogram(name: "print_heading", scope: !3, file: !3, line: 561, type: !570, scopeLine: 562, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!570 = !DISubroutineType(types: !571)
!571 = !{null}
!572 = !DILocation(line: 563, column: 39, scope: !569)
!573 = !DILocation(line: 563, column: 50, scope: !569)
!574 = !DILocation(line: 563, column: 61, scope: !569)
!575 = !DILocation(line: 564, column: 15, scope: !569)
!576 = !DILocation(line: 564, column: 25, scope: !569)
!577 = !DILocation(line: 564, column: 39, scope: !569)
!578 = !DILocation(line: 563, column: 3, scope: !569)
!579 = !DILocation(line: 565, column: 1, scope: !569)
!580 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !64, file: !3, line: 333, type: !67)
!581 = !DILocation(line: 0, scope: !64)
!582 = !DILocalVariable(name: "boottime", arg: 2, scope: !64, file: !3, line: 333, type: !9)
!583 = !DILocalVariable(name: "idlestr", scope: !64, file: !3, line: 338, type: !584)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 56, elements: !585)
!585 = !{!586}
!586 = !DISubrange(count: 7)
!587 = !DILocation(line: 338, column: 8, scope: !64)
!588 = !DILocalVariable(name: "line", scope: !64, file: !3, line: 347, type: !589)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 304, elements: !590)
!590 = !{!591}
!591 = !DISubrange(count: 38)
!592 = !DILocation(line: 347, column: 8, scope: !64)
!593 = !DILocation(line: 348, column: 13, scope: !64)
!594 = !DILocalVariable(name: "p", scope: !64, file: !3, line: 348, type: !6)
!595 = !DILocalVariable(name: "pidstr", scope: !64, file: !3, line: 349, type: !596)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !597)
!597 = !{!598}
!598 = !DISubrange(count: 12)
!599 = !DILocation(line: 349, column: 3, scope: !64)
!600 = !DILocation(line: 354, column: 10, scope: !601)
!601 = distinct !DILexicalBlock(scope: !64, file: !3, line: 354, column: 8)
!602 = !DILocation(line: 354, column: 8, scope: !64)
!603 = !DILocation(line: 355, column: 9, scope: !601)
!604 = !DILocation(line: 355, column: 5, scope: !601)
!605 = !DILocation(line: 356, column: 3, scope: !64)
!606 = !DILocalVariable(name: "stats", scope: !64, file: !3, line: 335, type: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !608, line: 46, size: 1152, elements: !609)
!608 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!609 = !{!610, !612, !614, !616, !618, !620, !622, !623, !624, !626, !628, !630, !637, !638, !639}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !607, file: !608, line: 48, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !12, line: 145, baseType: !112)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !607, file: !608, line: 53, baseType: !613, size: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !12, line: 148, baseType: !112)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !607, file: !608, line: 61, baseType: !615, size: 64, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !12, line: 151, baseType: !112)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !607, file: !608, line: 62, baseType: !617, size: 32, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !12, line: 150, baseType: !190)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !607, file: !608, line: 64, baseType: !619, size: 32, offset: 224)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !12, line: 146, baseType: !190)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !607, file: !608, line: 65, baseType: !621, size: 32, offset: 256)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !12, line: 147, baseType: !190)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !607, file: !608, line: 67, baseType: !53, size: 32, offset: 288)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !607, file: !608, line: 69, baseType: !611, size: 64, offset: 320)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !607, file: !608, line: 74, baseType: !625, size: 64, offset: 384)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !12, line: 152, baseType: !13)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !607, file: !608, line: 78, baseType: !627, size: 64, offset: 448)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !12, line: 174, baseType: !13)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !607, file: !608, line: 80, baseType: !629, size: 64, offset: 512)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !12, line: 179, baseType: !13)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !607, file: !608, line: 91, baseType: !631, size: 128, offset: 576)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !632, line: 10, size: 128, elements: !633)
!632 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!633 = !{!634, !635}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !631, file: !632, line: 12, baseType: !11, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !631, file: !632, line: 16, baseType: !636, size: 64, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !12, line: 196, baseType: !13)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !607, file: !608, line: 92, baseType: !631, size: 128, offset: 704)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !607, file: !608, line: 93, baseType: !631, size: 128, offset: 832)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !607, file: !608, line: 106, baseType: !640, size: 192, offset: 960)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !636, size: 192, elements: !60)
!641 = !DILocation(line: 358, column: 7, scope: !642)
!642 = distinct !DILexicalBlock(scope: !64, file: !3, line: 358, column: 7)
!643 = !DILocation(line: 358, column: 27, scope: !642)
!644 = !DILocation(line: 358, column: 7, scope: !64)
!645 = !DILocalVariable(name: "mesg", scope: !64, file: !3, line: 337, type: !7)
!646 = !DILocalVariable(name: "last_change", scope: !64, file: !3, line: 336, type: !9)
!647 = !DILocation(line: 0, scope: !648)
!648 = distinct !DILexicalBlock(scope: !64, file: !3, line: 369, column: 7)
!649 = !DILocation(line: 369, column: 7, scope: !64)
!650 = !DILocation(line: 360, column: 14, scope: !651)
!651 = distinct !DILexicalBlock(scope: !642, file: !3, line: 359, column: 5)
!652 = !DILocation(line: 361, column: 27, scope: !651)
!653 = !DILocation(line: 369, column: 7, scope: !648)
!654 = !DILocation(line: 370, column: 44, scope: !648)
!655 = !DILocation(line: 370, column: 5, scope: !648)
!656 = !DILocation(line: 372, column: 5, scope: !648)
!657 = !DILocation(line: 375, column: 7, scope: !658)
!658 = distinct !DILexicalBlock(scope: !64, file: !3, line: 375, column: 7)
!659 = !DILocation(line: 375, column: 7, scope: !64)
!660 = !DILocalVariable(name: "ut_host", scope: !661, file: !3, line: 377, type: !662)
!661 = distinct !DILexicalBlock(scope: !658, file: !3, line: 376, column: 5)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 2056, elements: !663)
!663 = !{!664}
!664 = !DISubrange(count: 257)
!665 = !DILocation(line: 377, column: 12, scope: !661)
!666 = !DILocalVariable(name: "host", scope: !661, file: !3, line: 378, type: !6)
!667 = !DILocation(line: 0, scope: !661)
!668 = !DILocalVariable(name: "display", scope: !661, file: !3, line: 379, type: !6)
!669 = !DILocation(line: 382, column: 16, scope: !661)
!670 = !DILocation(line: 382, column: 7, scope: !661)
!671 = !DILocation(line: 385, column: 17, scope: !661)
!672 = !DILocation(line: 386, column: 11, scope: !673)
!673 = distinct !DILexicalBlock(scope: !661, file: !3, line: 386, column: 11)
!674 = !DILocation(line: 386, column: 11, scope: !661)
!675 = !DILocation(line: 387, column: 17, scope: !673)
!676 = !DILocation(line: 387, column: 20, scope: !673)
!677 = !DILocation(line: 387, column: 9, scope: !673)
!678 = !DILocation(line: 389, column: 11, scope: !679)
!679 = distinct !DILexicalBlock(scope: !661, file: !3, line: 389, column: 11)
!680 = !DILocation(line: 389, column: 20, scope: !679)
!681 = !DILocation(line: 389, column: 23, scope: !679)
!682 = !DILocation(line: 389, column: 11, scope: !661)
!683 = !DILocation(line: 392, column: 18, scope: !684)
!684 = distinct !DILexicalBlock(scope: !679, file: !3, line: 390, column: 9)
!685 = !DILocation(line: 393, column: 9, scope: !684)
!686 = !DILocation(line: 395, column: 13, scope: !687)
!687 = distinct !DILexicalBlock(scope: !661, file: !3, line: 395, column: 11)
!688 = !DILocation(line: 395, column: 11, scope: !661)
!689 = !DILocation(line: 398, column: 11, scope: !690)
!690 = distinct !DILexicalBlock(scope: !661, file: !3, line: 398, column: 11)
!691 = !DILocation(line: 0, scope: !690)
!692 = !DILocation(line: 398, column: 11, scope: !661)
!693 = !DILocation(line: 400, column: 41, scope: !694)
!694 = distinct !DILexicalBlock(scope: !695, file: !3, line: 400, column: 15)
!695 = distinct !DILexicalBlock(scope: !690, file: !3, line: 399, column: 9)
!696 = !DILocation(line: 400, column: 39, scope: !694)
!697 = !DILocation(line: 400, column: 58, scope: !694)
!698 = !DILocation(line: 400, column: 23, scope: !694)
!699 = !DILocation(line: 400, column: 15, scope: !695)
!700 = !DILocation(line: 402, column: 23, scope: !701)
!701 = distinct !DILexicalBlock(scope: !694, file: !3, line: 401, column: 13)
!702 = !DILocation(line: 403, column: 21, scope: !701)
!703 = !DILocation(line: 403, column: 15, scope: !701)
!704 = !DILocation(line: 404, column: 34, scope: !701)
!705 = !DILocation(line: 404, column: 25, scope: !701)
!706 = !DILocation(line: 404, column: 23, scope: !701)
!707 = !DILocation(line: 405, column: 13, scope: !701)
!708 = !DILocation(line: 406, column: 20, scope: !695)
!709 = !DILocation(line: 406, column: 11, scope: !695)
!710 = !DILocation(line: 407, column: 9, scope: !695)
!711 = !DILocation(line: 410, column: 39, scope: !712)
!712 = distinct !DILexicalBlock(scope: !713, file: !3, line: 410, column: 15)
!713 = distinct !DILexicalBlock(scope: !690, file: !3, line: 409, column: 9)
!714 = !DILocation(line: 410, column: 23, scope: !712)
!715 = !DILocation(line: 410, column: 15, scope: !713)
!716 = !DILocation(line: 412, column: 23, scope: !717)
!717 = distinct !DILexicalBlock(scope: !712, file: !3, line: 411, column: 13)
!718 = !DILocation(line: 413, column: 21, scope: !717)
!719 = !DILocation(line: 413, column: 15, scope: !717)
!720 = !DILocation(line: 414, column: 34, scope: !717)
!721 = !DILocation(line: 414, column: 25, scope: !717)
!722 = !DILocation(line: 414, column: 23, scope: !717)
!723 = !DILocation(line: 415, column: 13, scope: !717)
!724 = !DILocation(line: 416, column: 20, scope: !713)
!725 = !DILocation(line: 416, column: 11, scope: !713)
!726 = !DILocation(line: 419, column: 11, scope: !661)
!727 = !DILocation(line: 420, column: 9, scope: !728)
!728 = distinct !DILexicalBlock(scope: !661, file: !3, line: 419, column: 11)
!729 = !DILocation(line: 424, column: 11, scope: !730)
!730 = distinct !DILexicalBlock(scope: !731, file: !3, line: 424, column: 11)
!731 = distinct !DILexicalBlock(scope: !658, file: !3, line: 423, column: 5)
!732 = !DILocation(line: 424, column: 19, scope: !730)
!733 = !DILocation(line: 424, column: 11, scope: !731)
!734 = !DILocation(line: 426, column: 19, scope: !735)
!735 = distinct !DILexicalBlock(scope: !730, file: !3, line: 425, column: 9)
!736 = !DILocation(line: 427, column: 17, scope: !735)
!737 = !DILocation(line: 427, column: 11, scope: !735)
!738 = !DILocation(line: 428, column: 30, scope: !735)
!739 = !DILocation(line: 428, column: 21, scope: !735)
!740 = !DILocation(line: 428, column: 19, scope: !735)
!741 = !DILocation(line: 429, column: 9, scope: !735)
!742 = !DILocation(line: 430, column: 8, scope: !731)
!743 = !DILocation(line: 430, column: 16, scope: !731)
!744 = !DILocation(line: 434, column: 42, scope: !64)
!745 = !DILocation(line: 436, column: 15, scope: !64)
!746 = !DILocation(line: 437, column: 15, scope: !64)
!747 = !DILocation(line: 434, column: 3, scope: !64)
!748 = !DILocation(line: 438, column: 1, scope: !64)
!749 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !133, file: !3, line: 514, type: !67)
!750 = !DILocation(line: 0, scope: !133)
!751 = !DILocation(line: 517, column: 24, scope: !133)
!752 = !DILocation(line: 517, column: 42, scope: !133)
!753 = !DILocation(line: 520, column: 8, scope: !754)
!754 = distinct !DILexicalBlock(scope: !133, file: !3, line: 520, column: 7)
!755 = !DILocation(line: 520, column: 7, scope: !133)
!756 = !DILocation(line: 521, column: 35, scope: !754)
!757 = !DILocation(line: 521, column: 27, scope: !754)
!758 = !DILocation(line: 521, column: 51, scope: !754)
!759 = !DILocation(line: 521, column: 18, scope: !754)
!760 = !DILocation(line: 521, column: 16, scope: !754)
!761 = !DILocation(line: 521, column: 5, scope: !754)
!762 = !DILocation(line: 522, column: 12, scope: !133)
!763 = !DILocation(line: 522, column: 33, scope: !133)
!764 = !DILocation(line: 522, column: 49, scope: !133)
!765 = !DILocation(line: 522, column: 3, scope: !133)
!766 = !DILocation(line: 524, column: 8, scope: !767)
!767 = distinct !DILexicalBlock(scope: !133, file: !3, line: 524, column: 7)
!768 = !DILocation(line: 524, column: 7, scope: !133)
!769 = !DILocation(line: 525, column: 32, scope: !767)
!770 = !DILocation(line: 525, column: 24, scope: !767)
!771 = !DILocation(line: 525, column: 44, scope: !767)
!772 = !DILocation(line: 525, column: 15, scope: !767)
!773 = !DILocation(line: 525, column: 13, scope: !767)
!774 = !DILocation(line: 525, column: 5, scope: !767)
!775 = !DILocation(line: 526, column: 12, scope: !133)
!776 = !DILocation(line: 526, column: 29, scope: !133)
!777 = !DILocation(line: 526, column: 42, scope: !133)
!778 = !DILocation(line: 526, column: 47, scope: !133)
!779 = !DILocation(line: 526, column: 41, scope: !133)
!780 = !DILocation(line: 526, column: 3, scope: !133)
!781 = !DILocation(line: 528, column: 32, scope: !133)
!782 = !DILocation(line: 528, column: 44, scope: !133)
!783 = !DILocation(line: 529, column: 23, scope: !133)
!784 = !DILocation(line: 528, column: 3, scope: !133)
!785 = !DILocation(line: 531, column: 3, scope: !133)
!786 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !787, file: !3, line: 441, type: !67)
!787 = distinct !DISubprogram(name: "print_boottime", scope: !3, file: !3, line: 441, type: !134, scopeLine: 442, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!788 = !DILocation(line: 0, scope: !787)
!789 = !DILocation(line: 443, column: 32, scope: !787)
!790 = !DILocation(line: 444, column: 15, scope: !787)
!791 = !DILocation(line: 443, column: 3, scope: !787)
!792 = !DILocation(line: 445, column: 1, scope: !787)
!793 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !794, file: !3, line: 506, type: !67)
!794 = distinct !DISubprogram(name: "print_clockchange", scope: !3, file: !3, line: 506, type: !134, scopeLine: 507, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!795 = !DILocation(line: 0, scope: !794)
!796 = !DILocation(line: 509, column: 32, scope: !794)
!797 = !DILocation(line: 510, column: 15, scope: !794)
!798 = !DILocation(line: 509, column: 3, scope: !794)
!799 = !DILocation(line: 511, column: 1, scope: !794)
!800 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !801, file: !3, line: 495, type: !67)
!801 = distinct !DISubprogram(name: "print_initspawn", scope: !3, file: !3, line: 495, type: !134, scopeLine: 496, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!802 = !DILocation(line: 0, scope: !801)
!803 = !DILocation(line: 497, column: 19, scope: !801)
!804 = !DILocalVariable(name: "comment", scope: !801, file: !3, line: 497, type: !6)
!805 = !DILocalVariable(name: "pidstr", scope: !801, file: !3, line: 498, type: !596)
!806 = !DILocation(line: 498, column: 3, scope: !801)
!807 = !DILocation(line: 500, column: 54, scope: !801)
!808 = !DILocation(line: 501, column: 15, scope: !801)
!809 = !DILocation(line: 500, column: 3, scope: !801)
!810 = !DILocation(line: 502, column: 3, scope: !801)
!811 = !DILocation(line: 503, column: 1, scope: !801)
!812 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !813, file: !3, line: 482, type: !67)
!813 = distinct !DISubprogram(name: "print_login", scope: !3, file: !3, line: 482, type: !134, scopeLine: 483, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!814 = !DILocation(line: 0, scope: !813)
!815 = !DILocation(line: 484, column: 19, scope: !813)
!816 = !DILocalVariable(name: "comment", scope: !813, file: !3, line: 484, type: !6)
!817 = !DILocalVariable(name: "pidstr", scope: !813, file: !3, line: 485, type: !596)
!818 = !DILocation(line: 485, column: 3, scope: !813)
!819 = !DILocation(line: 489, column: 19, scope: !813)
!820 = !DILocation(line: 489, column: 62, scope: !813)
!821 = !DILocation(line: 490, column: 15, scope: !813)
!822 = !DILocation(line: 489, column: 3, scope: !813)
!823 = !DILocation(line: 491, column: 3, scope: !813)
!824 = !DILocation(line: 492, column: 1, scope: !813)
!825 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !140, file: !3, line: 459, type: !67)
!826 = !DILocation(line: 0, scope: !140)
!827 = !DILocation(line: 462, column: 19, scope: !140)
!828 = !DILocalVariable(name: "comment", scope: !140, file: !3, line: 462, type: !6)
!829 = !DILocalVariable(name: "pidstr", scope: !140, file: !3, line: 463, type: !596)
!830 = !DILocation(line: 463, column: 3, scope: !140)
!831 = !DILocation(line: 465, column: 8, scope: !832)
!832 = distinct !DILexicalBlock(scope: !140, file: !3, line: 465, column: 7)
!833 = !DILocation(line: 465, column: 7, scope: !140)
!834 = !DILocation(line: 466, column: 32, scope: !832)
!835 = !DILocation(line: 466, column: 24, scope: !832)
!836 = !DILocation(line: 468, column: 34, scope: !832)
!837 = !DILocation(line: 468, column: 26, scope: !832)
!838 = !DILocation(line: 468, column: 24, scope: !832)
!839 = !DILocation(line: 470, column: 24, scope: !832)
!840 = !DILocation(line: 466, column: 15, scope: !832)
!841 = !DILocation(line: 466, column: 13, scope: !832)
!842 = !DILocation(line: 466, column: 5, scope: !832)
!843 = !DILocation(line: 471, column: 12, scope: !140)
!844 = !DILocation(line: 471, column: 34, scope: !140)
!845 = !DILocation(line: 471, column: 46, scope: !140)
!846 = !DILocation(line: 472, column: 12, scope: !140)
!847 = !DILocation(line: 472, column: 24, scope: !140)
!848 = !DILocation(line: 471, column: 3, scope: !140)
!849 = !DILocation(line: 476, column: 54, scope: !140)
!850 = !DILocation(line: 477, column: 15, scope: !140)
!851 = !DILocation(line: 477, column: 60, scope: !140)
!852 = !DILocation(line: 476, column: 3, scope: !140)
!853 = !DILocation(line: 478, column: 3, scope: !140)
!854 = !DILocation(line: 479, column: 1, scope: !140)
!855 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !856, file: !3, line: 448, type: !67)
!856 = distinct !DISubprogram(name: "make_id_equals_comment", scope: !3, file: !3, line: 448, type: !857, scopeLine: 449, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!857 = !DISubroutineType(types: !858)
!858 = !{!6, !67}
!859 = !DILocation(line: 0, scope: !856)
!860 = !DILocalVariable(name: "utmpsize", scope: !856, file: !3, line: 450, type: !110)
!861 = !DILocation(line: 451, column: 36, scope: !856)
!862 = !DILocation(line: 451, column: 28, scope: !856)
!863 = !DILocation(line: 451, column: 57, scope: !856)
!864 = !DILocation(line: 451, column: 19, scope: !856)
!865 = !DILocalVariable(name: "comment", scope: !856, file: !3, line: 451, type: !6)
!866 = !DILocation(line: 453, column: 20, scope: !856)
!867 = !DILocation(line: 453, column: 3, scope: !856)
!868 = !DILocation(line: 454, column: 21, scope: !856)
!869 = !DILocation(line: 454, column: 3, scope: !856)
!870 = !DILocation(line: 455, column: 3, scope: !856)
!871 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !125, file: !3, line: 218, type: !67)
!872 = !DILocation(line: 0, scope: !125)
!873 = !DILocation(line: 228, column: 14, scope: !125)
!874 = !DILocalVariable(name: "t", scope: !125, file: !3, line: 228, type: !9)
!875 = !DILocation(line: 228, column: 10, scope: !125)
!876 = !DILocation(line: 229, column: 20, scope: !125)
!877 = !DILocalVariable(name: "tmp", scope: !125, file: !3, line: 229, type: !878)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !880, line: 7, size: 448, elements: !881)
!880 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h", directory: "")
!881 = !{!882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !879, file: !880, line: 9, baseType: !53, size: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !879, file: !880, line: 10, baseType: !53, size: 32, offset: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !879, file: !880, line: 11, baseType: !53, size: 32, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !879, file: !880, line: 12, baseType: !53, size: 32, offset: 96)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !879, file: !880, line: 13, baseType: !53, size: 32, offset: 128)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !879, file: !880, line: 14, baseType: !53, size: 32, offset: 160)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !879, file: !880, line: 15, baseType: !53, size: 32, offset: 192)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !879, file: !880, line: 16, baseType: !53, size: 32, offset: 224)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !879, file: !880, line: 17, baseType: !53, size: 32, offset: 256)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !879, file: !880, line: 20, baseType: !13, size: 64, offset: 320)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !879, file: !880, line: 21, baseType: !49, size: 64, offset: 384)
!893 = !DILocation(line: 231, column: 7, scope: !894)
!894 = distinct !DILexicalBlock(scope: !125, file: !3, line: 231, column: 7)
!895 = !DILocation(line: 231, column: 7, scope: !125)
!896 = !DILocation(line: 233, column: 34, scope: !897)
!897 = distinct !DILexicalBlock(scope: !894, file: !3, line: 232, column: 5)
!898 = !DILocation(line: 233, column: 7, scope: !897)
!899 = !DILocation(line: 234, column: 7, scope: !897)
!900 = !DILocation(line: 237, column: 23, scope: !894)
!901 = !DILocation(line: 237, column: 12, scope: !894)
!902 = !DILocation(line: 237, column: 5, scope: !894)
!903 = !DILocation(line: 0, scope: !894)
!904 = !DILocation(line: 238, column: 1, scope: !125)
!905 = !DILocalVariable(name: "userlen", arg: 1, scope: !56, file: !3, line: 244, type: !53)
!906 = !DILocation(line: 0, scope: !56)
!907 = !DILocalVariable(name: "user", arg: 2, scope: !56, file: !3, line: 244, type: !49)
!908 = !DILocalVariable(name: "state", arg: 3, scope: !56, file: !3, line: 244, type: !50)
!909 = !DILocalVariable(name: "linelen", arg: 4, scope: !56, file: !3, line: 245, type: !53)
!910 = !DILocalVariable(name: "line", arg: 5, scope: !56, file: !3, line: 245, type: !49)
!911 = !DILocalVariable(name: "time_str", arg: 6, scope: !56, file: !3, line: 246, type: !49)
!912 = !DILocalVariable(name: "idle", arg: 7, scope: !56, file: !3, line: 246, type: !49)
!913 = !DILocalVariable(name: "pid", arg: 8, scope: !56, file: !3, line: 246, type: !49)
!914 = !DILocalVariable(name: "comment", arg: 9, scope: !56, file: !3, line: 247, type: !49)
!915 = !DILocalVariable(name: "exitstr", arg: 10, scope: !56, file: !3, line: 247, type: !49)
!916 = !DILocalVariable(name: "x_idle", scope: !56, file: !3, line: 251, type: !917)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !262)
!918 = !DILocation(line: 251, column: 8, scope: !56)
!919 = !DILocalVariable(name: "x_pid", scope: !56, file: !3, line: 252, type: !920)
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 104, elements: !921)
!921 = !{!922}
!922 = !DISubrange(count: 13)
!923 = !DILocation(line: 252, column: 8, scope: !56)
!924 = !DILocation(line: 256, column: 11, scope: !56)
!925 = !DILocation(line: 258, column: 7, scope: !926)
!926 = distinct !DILexicalBlock(scope: !56, file: !3, line: 258, column: 7)
!927 = !DILocation(line: 258, column: 20, scope: !926)
!928 = !DILocation(line: 258, column: 24, scope: !926)
!929 = !DILocation(line: 258, column: 37, scope: !926)
!930 = !DILocation(line: 258, column: 40, scope: !926)
!931 = !DILocation(line: 258, column: 54, scope: !926)
!932 = !DILocation(line: 258, column: 7, scope: !56)
!933 = !DILocation(line: 259, column: 14, scope: !926)
!934 = !DILocation(line: 259, column: 5, scope: !926)
!935 = !DILocation(line: 261, column: 5, scope: !926)
!936 = !DILocation(line: 261, column: 13, scope: !926)
!937 = !DILocation(line: 263, column: 8, scope: !938)
!938 = distinct !DILexicalBlock(scope: !56, file: !3, line: 263, column: 7)
!939 = !DILocation(line: 263, column: 21, scope: !938)
!940 = !DILocation(line: 263, column: 24, scope: !938)
!941 = !DILocation(line: 263, column: 37, scope: !938)
!942 = !DILocation(line: 263, column: 7, scope: !56)
!943 = !DILocation(line: 264, column: 14, scope: !938)
!944 = !DILocation(line: 264, column: 5, scope: !938)
!945 = !DILocation(line: 266, column: 5, scope: !938)
!946 = !DILocation(line: 266, column: 12, scope: !938)
!947 = !DILocation(line: 268, column: 24, scope: !56)
!948 = !DILocation(line: 268, column: 43, scope: !56)
!949 = !DILocation(line: 268, column: 15, scope: !56)
!950 = !DILocalVariable(name: "x_exitstr", scope: !56, file: !3, line: 253, type: !6)
!951 = !DILocation(line: 269, column: 7, scope: !952)
!952 = distinct !DILexicalBlock(scope: !56, file: !3, line: 269, column: 7)
!953 = !DILocation(line: 269, column: 7, scope: !56)
!954 = !DILocation(line: 270, column: 5, scope: !952)
!955 = !DILocation(line: 272, column: 16, scope: !952)
!956 = !DILocation(line: 284, column: 28, scope: !56)
!957 = !DILocation(line: 285, column: 19, scope: !56)
!958 = !DILocation(line: 287, column: 19, scope: !56)
!959 = !DILocation(line: 289, column: 19, scope: !56)
!960 = !DILocation(line: 290, column: 19, scope: !56)
!961 = !DILocalVariable(name: "buf", scope: !56, file: !3, line: 250, type: !6)
!962 = !DILocation(line: 274, column: 9, scope: !56)
!963 = !DILocalVariable(name: "err", scope: !56, file: !3, line: 254, type: !53)
!964 = !DILocation(line: 303, column: 15, scope: !965)
!965 = distinct !DILexicalBlock(scope: !56, file: !3, line: 301, column: 3)
!966 = !DILocation(line: 303, column: 21, scope: !965)
!967 = !DILocation(line: 303, column: 19, scope: !965)
!968 = !DILocalVariable(name: "p", scope: !965, file: !3, line: 303, type: !6)
!969 = !DILocation(line: 0, scope: !965)
!970 = !DILocation(line: 304, column: 5, scope: !965)
!971 = !DILocation(line: 304, column: 13, scope: !965)
!972 = !DILocation(line: 304, column: 12, scope: !965)
!973 = !DILocation(line: 304, column: 17, scope: !965)
!974 = distinct !{!974, !970, !975}
!975 = !DILocation(line: 305, column: 18, scope: !965)
!976 = !DILocation(line: 306, column: 14, scope: !965)
!977 = !DILocation(line: 309, column: 9, scope: !56)
!978 = !DILocation(line: 309, column: 3, scope: !56)
!979 = !DILocation(line: 310, column: 9, scope: !56)
!980 = !DILocation(line: 310, column: 3, scope: !56)
!981 = !DILocation(line: 311, column: 3, scope: !56)
!982 = !DILocation(line: 312, column: 1, scope: !56)
!983 = distinct !DISubprogram(name: "timetostr", scope: !984, file: !984, line: 690, type: !985, scopeLine: 691, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!984 = !DIFile(filename: "src/system.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!985 = !DISubroutineType(types: !986)
!986 = !{!6, !9, !6}
!987 = !DILocalVariable(name: "t", arg: 1, scope: !983, file: !984, line: 690, type: !9)
!988 = !DILocation(line: 0, scope: !983)
!989 = !DILocalVariable(name: "buf", arg: 2, scope: !983, file: !984, line: 690, type: !6)
!990 = !DILocation(line: 693, column: 13, scope: !983)
!991 = !DILocation(line: 692, column: 3, scope: !983)
!992 = !DILocalVariable(name: "dest", arg: 1, scope: !993, file: !984, line: 741, type: !996)
!993 = distinct !DISubprogram(name: "stzncpy", scope: !984, file: !984, line: 741, type: !994, scopeLine: 742, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!994 = !DISubroutineType(types: !995)
!995 = !{!6, !996, !997, !110}
!996 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !6)
!997 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !49)
!998 = !DILocation(line: 0, scope: !993)
!999 = !DILocalVariable(name: "src", arg: 2, scope: !993, file: !984, line: 741, type: !997)
!1000 = !DILocalVariable(name: "len", arg: 3, scope: !993, file: !984, line: 741, type: !110)
!1001 = !DILocation(line: 743, column: 29, scope: !993)
!1002 = !DILocalVariable(name: "src_end", scope: !993, file: !984, line: 743, type: !49)
!1003 = !DILocation(line: 744, column: 14, scope: !993)
!1004 = !DILocation(line: 744, column: 24, scope: !993)
!1005 = !DILocation(line: 744, column: 27, scope: !993)
!1006 = !DILocation(line: 744, column: 3, scope: !993)
!1007 = !DILocation(line: 745, column: 19, scope: !993)
!1008 = !DILocation(line: 745, column: 10, scope: !993)
!1009 = !DILocation(line: 745, column: 13, scope: !993)
!1010 = distinct !{!1010, !1006, !1007}
!1011 = !DILocation(line: 746, column: 9, scope: !993)
!1012 = !DILocalVariable(name: "pstat", arg: 1, scope: !1013, file: !3, line: 317, type: !1016)
!1013 = distinct !DISubprogram(name: "is_tty_writable", scope: !3, file: !3, line: 317, type: !1014, scopeLine: 318, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!18, !1016}
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !607)
!1018 = !DILocation(line: 0, scope: !1013)
!1019 = !DILocation(line: 327, column: 17, scope: !1013)
!1020 = !DILocation(line: 327, column: 25, scope: !1013)
!1021 = !DILocation(line: 327, column: 10, scope: !1013)
!1022 = !DILocation(line: 327, column: 3, scope: !1013)
!1023 = !DILocalVariable(name: "when", arg: 1, scope: !115, file: !3, line: 188, type: !9)
!1024 = !DILocation(line: 0, scope: !115)
!1025 = !DILocalVariable(name: "boottime", arg: 2, scope: !115, file: !3, line: 188, type: !9)
!1026 = !DILocation(line: 192, column: 7, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !115, file: !3, line: 192, column: 7)
!1028 = !DILocation(line: 192, column: 11, scope: !1027)
!1029 = !DILocation(line: 192, column: 7, scope: !115)
!1030 = !DILocation(line: 193, column: 5, scope: !1027)
!1031 = !DILocation(line: 195, column: 16, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !115, file: !3, line: 195, column: 7)
!1033 = !DILocation(line: 195, column: 23, scope: !1032)
!1034 = !DILocation(line: 195, column: 26, scope: !1032)
!1035 = !DILocation(line: 195, column: 30, scope: !1032)
!1036 = !DILocation(line: 195, column: 45, scope: !1032)
!1037 = !DILocation(line: 195, column: 60, scope: !1032)
!1038 = !DILocation(line: 195, column: 52, scope: !1032)
!1039 = !DILocation(line: 197, column: 30, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 196, column: 5)
!1041 = !DILocation(line: 197, column: 26, scope: !1040)
!1042 = !DILocalVariable(name: "seconds_idle", scope: !1040, file: !3, line: 197, type: !53)
!1043 = !DILocation(line: 0, scope: !1040)
!1044 = !DILocation(line: 198, column: 24, scope: !1045)
!1045 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 198, column: 11)
!1046 = !DILocation(line: 198, column: 11, scope: !1040)
!1047 = !DILocation(line: 205, column: 11, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !1049, file: !3, line: 205, column: 11)
!1049 = distinct !DILexicalBlock(scope: !1050, file: !3, line: 205, column: 11)
!1050 = distinct !DILexicalBlock(scope: !1045, file: !3, line: 201, column: 9)
!1051 = !DILocation(line: 205, column: 11, scope: !1049)
!1052 = !DILocation(line: 208, column: 34, scope: !1050)
!1053 = !DILocation(line: 208, column: 47, scope: !1050)
!1054 = !DILocation(line: 206, column: 11, scope: !1050)
!1055 = !DILocation(line: 209, column: 11, scope: !1050)
!1056 = !DILocation(line: 213, column: 10, scope: !115)
!1057 = !DILocation(line: 213, column: 3, scope: !115)
!1058 = !DILocation(line: 214, column: 1, scope: !115)
!1059 = !DILocalVariable(name: "c", arg: 1, scope: !1060, file: !1061, line: 272, type: !53)
!1060 = distinct !DISubprogram(name: "c_isprint", scope: !1061, file: !1061, line: 272, type: !1062, scopeLine: 273, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !295, retainedNodes: !4)
!1061 = !DIFile(filename: "./lib/c-ctype.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!18, !53}
!1064 = !DILocation(line: 0, scope: !1060)
!1065 = !DILocation(line: 274, column: 3, scope: !1060)
!1066 = !DILocation(line: 285, column: 1, scope: !1060)
!1067 = distinct !DISubprogram(name: "c_tolower", scope: !1061, file: !1061, line: 337, type: !1068, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !295, retainedNodes: !4)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!53, !53}
!1070 = !DILocalVariable(name: "c", arg: 1, scope: !1067, file: !1061, line: 337, type: !53)
!1071 = !DILocation(line: 0, scope: !1067)
!1072 = !DILocation(line: 339, column: 3, scope: !1067)
!1073 = !DILocation(line: 346, column: 1, scope: !1067)
!1074 = !DILocalVariable(name: "host", arg: 1, scope: !1075, file: !171, line: 33, type: !49)
!1075 = distinct !DISubprogram(name: "canon_host", scope: !171, file: !171, line: 33, type: !1076, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !174, retainedNodes: !4)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!6, !49}
!1078 = !DILocation(line: 0, scope: !1075)
!1079 = !DILocation(line: 35, column: 10, scope: !1075)
!1080 = !DILocation(line: 35, column: 3, scope: !1075)
!1081 = !DILocalVariable(name: "host", arg: 1, scope: !170, file: !171, line: 61, type: !49)
!1082 = !DILocation(line: 0, scope: !170)
!1083 = !DILocalVariable(name: "retval", scope: !170, file: !171, line: 63, type: !6)
!1084 = !DILocalVariable(name: "res", scope: !170, file: !171, line: 65, type: !205)
!1085 = !DILocation(line: 65, column: 20, scope: !170)
!1086 = !DILocation(line: 68, column: 18, scope: !170)
!1087 = !DILocation(line: 69, column: 12, scope: !170)
!1088 = !DILocalVariable(name: "status", scope: !170, file: !171, line: 66, type: !53)
!1089 = !DILocation(line: 70, column: 8, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !170, file: !171, line: 70, column: 7)
!1091 = !DILocation(line: 70, column: 7, scope: !170)
!1092 = !DILocation(line: 75, column: 24, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1090, file: !171, line: 71, column: 5)
!1094 = !DILocation(line: 75, column: 29, scope: !1093)
!1095 = !DILocation(line: 75, column: 16, scope: !1093)
!1096 = !DILocation(line: 78, column: 21, scope: !1093)
!1097 = !DILocation(line: 78, column: 7, scope: !1093)
!1098 = !DILocation(line: 79, column: 5, scope: !1093)
!1099 = !DILocation(line: 83, column: 3, scope: !170)
!1100 = !DILocation(line: 119, column: 21, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1102, file: !302, line: 119, column: 7)
!1102 = distinct !DISubprogram(name: "close_stdout", scope: !302, file: !302, line: 117, type: !570, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !297, retainedNodes: !4)
!1103 = !DILocation(line: 119, column: 7, scope: !1101)
!1104 = !DILocation(line: 119, column: 29, scope: !1101)
!1105 = !DILocation(line: 120, column: 7, scope: !1101)
!1106 = !DILocation(line: 122, column: 33, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1101, file: !302, line: 121, column: 5)
!1108 = !DILocalVariable(name: "write_error", scope: !1107, file: !302, line: 122, type: !49)
!1109 = !DILocation(line: 0, scope: !1107)
!1110 = !DILocation(line: 0, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !1107, file: !302, line: 123, column: 11)
!1112 = !DILocation(line: 127, column: 9, scope: !1111)
!1113 = !DILocation(line: 129, column: 14, scope: !1107)
!1114 = !DILocation(line: 129, column: 7, scope: !1107)
!1115 = !DILocation(line: 134, column: 42, scope: !1116)
!1116 = distinct !DILexicalBlock(scope: !1102, file: !302, line: 134, column: 7)
!1117 = !DILocation(line: 134, column: 28, scope: !1116)
!1118 = !DILocation(line: 134, column: 50, scope: !1116)
!1119 = !DILocation(line: 134, column: 7, scope: !1102)
!1120 = !DILocation(line: 135, column: 12, scope: !1116)
!1121 = !DILocation(line: 135, column: 5, scope: !1116)
!1122 = !DILocation(line: 136, column: 1, scope: !1102)
!1123 = !DILocalVariable(name: "category", arg: 1, scope: !1124, file: !1125, line: 27, type: !53)
!1124 = distinct !DISubprogram(name: "hard_locale", scope: !1125, file: !1125, line: 27, type: !1062, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !305, retainedNodes: !4)
!1125 = !DIFile(filename: "lib/hard-locale.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!1126 = !DILocation(line: 0, scope: !1124)
!1127 = !DILocalVariable(name: "locale", scope: !1124, file: !1125, line: 29, type: !662)
!1128 = !DILocation(line: 29, column: 8, scope: !1124)
!1129 = !DILocation(line: 31, column: 35, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !1124, file: !1125, line: 31, column: 7)
!1131 = !DILocation(line: 31, column: 7, scope: !1130)
!1132 = !DILocation(line: 31, column: 7, scope: !1124)
!1133 = !DILocation(line: 34, column: 12, scope: !1124)
!1134 = !DILocation(line: 34, column: 41, scope: !1124)
!1135 = !DILocation(line: 34, column: 66, scope: !1124)
!1136 = !DILocation(line: 34, column: 38, scope: !1124)
!1137 = !DILocation(line: 35, column: 1, scope: !1124)
!1138 = !DILocalVariable(name: "i", arg: 1, scope: !1139, file: !1140, line: 36, type: !310)
!1139 = distinct !DISubprogram(name: "imaxtostr", scope: !1140, file: !1140, line: 36, type: !1141, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !307, retainedNodes: !4)
!1140 = !DIFile(filename: "./lib/anytostr.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!6, !310, !6}
!1143 = !DILocation(line: 0, scope: !1139)
!1144 = !DILocalVariable(name: "buf", arg: 2, scope: !1139, file: !1140, line: 36, type: !6)
!1145 = !DILocalVariable(name: "p", scope: !1139, file: !1140, line: 38, type: !6)
!1146 = !DILocation(line: 39, column: 6, scope: !1139)
!1147 = !DILocation(line: 41, column: 9, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1139, file: !1140, line: 41, column: 7)
!1149 = !DILocation(line: 41, column: 7, scope: !1139)
!1150 = !DILocation(line: 44, column: 24, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1148, file: !1140, line: 42, column: 5)
!1152 = !DILocation(line: 44, column: 16, scope: !1151)
!1153 = !DILocation(line: 44, column: 10, scope: !1151)
!1154 = !DILocation(line: 44, column: 14, scope: !1151)
!1155 = !DILocation(line: 45, column: 17, scope: !1151)
!1156 = !DILocation(line: 45, column: 24, scope: !1151)
!1157 = !DILocation(line: 44, column: 9, scope: !1151)
!1158 = distinct !{!1158, !1159, !1160}
!1159 = !DILocation(line: 43, column: 7, scope: !1151)
!1160 = !DILocation(line: 45, column: 28, scope: !1151)
!1161 = !DILocation(line: 47, column: 8, scope: !1151)
!1162 = !DILocation(line: 47, column: 12, scope: !1151)
!1163 = !DILocation(line: 48, column: 5, scope: !1151)
!1164 = !DILocation(line: 52, column: 24, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !1148, file: !1140, line: 50, column: 5)
!1166 = !DILocation(line: 52, column: 16, scope: !1165)
!1167 = !DILocation(line: 52, column: 10, scope: !1165)
!1168 = !DILocation(line: 52, column: 14, scope: !1165)
!1169 = !DILocation(line: 53, column: 17, scope: !1165)
!1170 = !DILocation(line: 53, column: 24, scope: !1165)
!1171 = !DILocation(line: 52, column: 9, scope: !1165)
!1172 = distinct !{!1172, !1173, !1174}
!1173 = !DILocation(line: 51, column: 7, scope: !1165)
!1174 = !DILocation(line: 53, column: 28, scope: !1165)
!1175 = !DILocation(line: 0, scope: !1148)
!1176 = !DILocation(line: 56, column: 3, scope: !1139)
!1177 = !DILocalVariable(name: "argv0", arg: 1, scope: !1178, file: !219, line: 39, type: !49)
!1178 = distinct !DISubprogram(name: "set_program_name", scope: !219, file: !219, line: 39, type: !1179, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !215, retainedNodes: !4)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{null, !49}
!1181 = !DILocation(line: 0, scope: !1178)
!1182 = !DILocation(line: 51, column: 13, scope: !1183)
!1183 = distinct !DILexicalBlock(scope: !1178, file: !219, line: 51, column: 7)
!1184 = !DILocation(line: 51, column: 7, scope: !1178)
!1185 = !DILocation(line: 55, column: 14, scope: !1186)
!1186 = distinct !DILexicalBlock(scope: !1183, file: !219, line: 52, column: 5)
!1187 = !DILocation(line: 54, column: 7, scope: !1186)
!1188 = !DILocation(line: 56, column: 7, scope: !1186)
!1189 = !DILocation(line: 59, column: 11, scope: !1178)
!1190 = !DILocalVariable(name: "slash", scope: !1178, file: !219, line: 46, type: !49)
!1191 = !DILocation(line: 60, column: 17, scope: !1178)
!1192 = !DILocation(line: 60, column: 11, scope: !1178)
!1193 = !DILocalVariable(name: "base", scope: !1178, file: !219, line: 47, type: !49)
!1194 = !DILocation(line: 61, column: 12, scope: !1195)
!1195 = distinct !DILexicalBlock(scope: !1178, file: !219, line: 61, column: 7)
!1196 = !DILocation(line: 61, column: 20, scope: !1195)
!1197 = !DILocation(line: 61, column: 25, scope: !1195)
!1198 = !DILocation(line: 61, column: 42, scope: !1195)
!1199 = !DILocation(line: 61, column: 28, scope: !1195)
!1200 = !DILocation(line: 61, column: 61, scope: !1195)
!1201 = !DILocation(line: 61, column: 7, scope: !1178)
!1202 = !DILocation(line: 64, column: 11, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1204, file: !219, line: 64, column: 11)
!1204 = distinct !DILexicalBlock(scope: !1195, file: !219, line: 62, column: 5)
!1205 = !DILocation(line: 64, column: 36, scope: !1203)
!1206 = !DILocation(line: 64, column: 11, scope: !1204)
!1207 = !DILocation(line: 66, column: 24, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !1203, file: !219, line: 65, column: 9)
!1209 = !DILocation(line: 70, column: 41, scope: !1208)
!1210 = !DILocation(line: 72, column: 9, scope: !1208)
!1211 = !DILocation(line: 84, column: 16, scope: !1178)
!1212 = !DILocation(line: 90, column: 27, scope: !1178)
!1213 = !DILocation(line: 92, column: 1, scope: !1178)
!1214 = !DILocalVariable(name: "n", arg: 1, scope: !1215, file: !243, line: 877, type: !53)
!1215 = distinct !DISubprogram(name: "quotearg_n_options", scope: !243, file: !243, line: 877, type: !1216, scopeLine: 879, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !222, retainedNodes: !4)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{!6, !53, !49, !110, !1218}
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64)
!1219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !256)
!1220 = !DILocation(line: 0, scope: !1215)
!1221 = !DILocalVariable(name: "arg", arg: 2, scope: !1215, file: !243, line: 877, type: !49)
!1222 = !DILocalVariable(name: "argsize", arg: 3, scope: !1215, file: !243, line: 877, type: !110)
!1223 = !DILocalVariable(name: "options", arg: 4, scope: !1215, file: !243, line: 878, type: !1218)
!1224 = !DILocation(line: 880, column: 11, scope: !1215)
!1225 = !DILocalVariable(name: "e", scope: !1215, file: !243, line: 880, type: !53)
!1226 = !DILocation(line: 903, column: 25, scope: !1227)
!1227 = distinct !DILexicalBlock(scope: !1215, file: !243, line: 902, column: 3)
!1228 = !DILocalVariable(name: "size", scope: !1227, file: !243, line: 903, type: !110)
!1229 = !DILocation(line: 0, scope: !1227)
!1230 = !DILocation(line: 904, column: 23, scope: !1227)
!1231 = !DILocalVariable(name: "val", scope: !1227, file: !243, line: 904, type: !6)
!1232 = !DILocation(line: 906, column: 26, scope: !1227)
!1233 = !DILocation(line: 906, column: 32, scope: !1227)
!1234 = !DILocalVariable(name: "flags", scope: !1227, file: !243, line: 906, type: !53)
!1235 = !DILocation(line: 908, column: 55, scope: !1227)
!1236 = !DILocation(line: 910, column: 55, scope: !1227)
!1237 = !DILocation(line: 911, column: 55, scope: !1227)
!1238 = !DILocation(line: 907, column: 20, scope: !1227)
!1239 = !DILocalVariable(name: "qsize", scope: !1227, file: !243, line: 907, type: !110)
!1240 = !DILocation(line: 913, column: 14, scope: !1241)
!1241 = distinct !DILexicalBlock(scope: !1227, file: !243, line: 913, column: 9)
!1242 = !DILocation(line: 913, column: 9, scope: !1227)
!1243 = !DILocation(line: 915, column: 35, scope: !1244)
!1244 = distinct !DILexicalBlock(scope: !1241, file: !243, line: 914, column: 7)
!1245 = !DILocation(line: 915, column: 20, scope: !1244)
!1246 = !DILocation(line: 916, column: 17, scope: !1247)
!1247 = distinct !DILexicalBlock(scope: !1244, file: !243, line: 916, column: 13)
!1248 = !DILocation(line: 916, column: 13, scope: !1244)
!1249 = !DILocation(line: 917, column: 11, scope: !1247)
!1250 = !DILocation(line: 918, column: 27, scope: !1244)
!1251 = !DILocation(line: 918, column: 19, scope: !1244)
!1252 = !DILocation(line: 919, column: 69, scope: !1244)
!1253 = !DILocation(line: 921, column: 44, scope: !1244)
!1254 = !DILocation(line: 922, column: 44, scope: !1244)
!1255 = !DILocation(line: 919, column: 9, scope: !1244)
!1256 = !DILocation(line: 923, column: 7, scope: !1244)
!1257 = !DILocation(line: 925, column: 11, scope: !1227)
!1258 = !DILocation(line: 926, column: 5, scope: !1227)
!1259 = !DILocalVariable(name: "buffer", arg: 1, scope: !1260, file: !243, line: 256, type: !6)
!1260 = distinct !DISubprogram(name: "quotearg_buffer_restyled", scope: !243, file: !243, line: 256, type: !1261, scopeLine: 262, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !222, retainedNodes: !4)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{!110, !6, !110, !49, !110, !225, !53, !1263, !49, !49}
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64)
!1264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !190)
!1265 = !DILocation(line: 0, scope: !1260)
!1266 = !DILocalVariable(name: "buffersize", arg: 2, scope: !1260, file: !243, line: 256, type: !110)
!1267 = !DILocalVariable(name: "arg", arg: 3, scope: !1260, file: !243, line: 257, type: !49)
!1268 = !DILocalVariable(name: "argsize", arg: 4, scope: !1260, file: !243, line: 257, type: !110)
!1269 = !DILocalVariable(name: "quoting_style", arg: 5, scope: !1260, file: !243, line: 258, type: !225)
!1270 = !DILocalVariable(name: "flags", arg: 6, scope: !1260, file: !243, line: 258, type: !53)
!1271 = !DILocalVariable(name: "quote_these_too", arg: 7, scope: !1260, file: !243, line: 259, type: !1263)
!1272 = !DILocalVariable(name: "left_quote", arg: 8, scope: !1260, file: !243, line: 260, type: !49)
!1273 = !DILocalVariable(name: "right_quote", arg: 9, scope: !1260, file: !243, line: 261, type: !49)
!1274 = !DILocalVariable(name: "len", scope: !1260, file: !243, line: 264, type: !110)
!1275 = !DILocalVariable(name: "orig_buffersize", scope: !1260, file: !243, line: 265, type: !110)
!1276 = !DILocalVariable(name: "quote_string", scope: !1260, file: !243, line: 266, type: !49)
!1277 = !DILocalVariable(name: "quote_string_len", scope: !1260, file: !243, line: 267, type: !110)
!1278 = !DILocalVariable(name: "backslash_escapes", scope: !1260, file: !243, line: 268, type: !18)
!1279 = !DILocation(line: 269, column: 25, scope: !1260)
!1280 = !DILocation(line: 269, column: 36, scope: !1260)
!1281 = !DILocalVariable(name: "unibyte_locale", scope: !1260, file: !243, line: 269, type: !18)
!1282 = !DILocation(line: 270, column: 8, scope: !1260)
!1283 = !DILocalVariable(name: "elide_outer_quotes", scope: !1260, file: !243, line: 270, type: !18)
!1284 = !DILocalVariable(name: "pending_shell_escape_end", scope: !1260, file: !243, line: 271, type: !18)
!1285 = !DILocalVariable(name: "encountered_single_quote", scope: !1260, file: !243, line: 272, type: !18)
!1286 = !DILocalVariable(name: "all_c_and_shell_quote_compat", scope: !1260, file: !243, line: 273, type: !18)
!1287 = !DILocation(line: 0, scope: !1288)
!1288 = distinct !DILexicalBlock(scope: !1289, file: !243, line: 526, column: 15)
!1289 = distinct !DILexicalBlock(scope: !1290, file: !243, line: 426, column: 9)
!1290 = distinct !DILexicalBlock(scope: !1291, file: !243, line: 401, column: 5)
!1291 = distinct !DILexicalBlock(scope: !1292, file: !243, line: 400, column: 3)
!1292 = distinct !DILexicalBlock(scope: !1260, file: !243, line: 400, column: 3)
!1293 = !DILocation(line: 0, scope: !1294)
!1294 = distinct !DILexicalBlock(scope: !1295, file: !243, line: 462, column: 19)
!1295 = distinct !DILexicalBlock(scope: !1289, file: !243, line: 455, column: 13)
!1296 = !DILocation(line: 0, scope: !1297)
!1297 = distinct !DILexicalBlock(scope: !1298, file: !243, line: 449, column: 20)
!1298 = distinct !DILexicalBlock(scope: !1289, file: !243, line: 428, column: 15)
!1299 = !DILocation(line: 0, scope: !1300)
!1300 = distinct !DILexicalBlock(scope: !1290, file: !243, line: 712, column: 11)
!1301 = !DILocation(line: 273, column: 3, scope: !1260)
!1302 = !DILocation(line: 265, column: 10, scope: !1260)
!1303 = !DILocation(line: 266, column: 15, scope: !1260)
!1304 = !DILocation(line: 267, column: 10, scope: !1260)
!1305 = !DILocation(line: 268, column: 8, scope: !1260)
!1306 = !DILocation(line: 271, column: 8, scope: !1260)
!1307 = !DILocation(line: 272, column: 8, scope: !1260)
!1308 = !DILocation(line: 273, column: 8, scope: !1260)
!1309 = !DILabel(scope: !1260, name: "process_input", file: !243, line: 314)
!1310 = !DILocation(line: 314, column: 2, scope: !1260)
!1311 = !DILocation(line: 316, column: 3, scope: !1260)
!1312 = !DILocation(line: 323, column: 11, scope: !1313)
