; ModuleID = 'whodir/who-O3-inserted.ll'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.addrinfo = type { i32, i32, i32, i32, i32, %struct.sockaddr*, i8*, %struct.addrinfo* }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.utmpx = type { i16, i32, [32 x i8], [4 x i8], [32 x i8], [256 x i8], %struct.__exit_status, i32, %struct.anon, [4 x i32], [20 x i8] }
%struct.__exit_status = type { i16, i16 }
%struct.anon = type { i32, i32 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }


!10 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !12, line: 160, baseType: !13)
!12 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!13 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!14 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!15 = !{!16, !19, !21, !23, !25, !27, !29, !31, !33, !35, !37, !39, !41, !43, !45, !47, !51, !0, !54, !62, !108, !113, !118, !123, !131, !136, !138}
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "do_lookup", scope: !2, file: !3, line: 102, type: !18, isLocal: true, isDefinition: true)
!18 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "short_list", scope: !2, file: !3, line: 107, type: !18, isLocal: true, isDefinition: true)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "short_output", scope: !2, file: !3, line: 110, type: !18, isLocal: true, isDefinition: true)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "include_idle", scope: !2, file: !3, line: 115, type: !18, isLocal: true, isDefinition: true)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "include_heading", scope: !2, file: !3, line: 118, type: !18, isLocal: true, isDefinition: true)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "include_mesg", scope: !2, file: !3, line: 122, type: !18, isLocal: true, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "include_exit", scope: !2, file: !3, line: 125, type: !18, isLocal: true, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "need_boottime", scope: !2, file: !3, line: 128, type: !18, isLocal: true, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "need_deadprocs", scope: !2, file: !3, line: 131, type: !18, isLocal: true, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "need_login", scope: !2, file: !3, line: 134, type: !18, isLocal: true, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "need_initspawn", scope: !2, file: !3, line: 137, type: !18, isLocal: true, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "need_clockchange", scope: !2, file: !3, line: 140, type: !18, isLocal: true, isDefinition: true)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "need_runlevel", scope: !2, file: !3, line: 143, type: !18, isLocal: true, isDefinition: true)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "need_users", scope: !2, file: !3, line: 146, type: !18, isLocal: true, isDefinition: true)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "my_line_only", scope: !2, file: !3, line: 149, type: !18, isLocal: true, isDefinition: true)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "time_format", scope: !2, file: !3, line: 153, type: !49, isLocal: true, isDefinition: true)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "time_format_width", scope: !2, file: !3, line: 154, type: !53, isLocal: true, isDefinition: true)
!53 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "mesg", scope: !56, file: !3, line: 249, type: !59, isLocal: true, isDefinition: true)
!56 = distinct !DISubprogram(name: "print_line", scope: !3, file: !3, line: 244, type: !57, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!57 = !DISubroutineType(types: !58)
!58 = !{null, !53, !49, !50, !53, !49, !49, !49, !49, !49, !49}
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 24, elements: !60)
!60 = !{!61}
!61 = !DISubrange(count: 3)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "hoststr", scope: !64, file: !3, line: 339, type: !6, isLocal: true, isDefinition: true)
!64 = distinct !DISubprogram(name: "print_user", scope: !3, file: !3, line: 333, type: !65, scopeLine: 334, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!65 = !DISubroutineType(types: !66)
!66 = !{null, !67, !9}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !70, line: 146, baseType: !71)
!70 = !DIFile(filename: "./lib/readutmp.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !72, line: 55, size: 3072, elements: !73)
!72 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/utmpx.h", directory: "")
!73 = !{!74, !75, !77, !81, !85, !86, !90, !95, !97, !102, !104}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !71, file: !72, line: 57, baseType: !14, size: 16)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !71, file: !72, line: 58, baseType: !76, size: 32, offset: 32)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !12, line: 154, baseType: !53)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !71, file: !72, line: 59, baseType: !78, size: 256, offset: 64)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !71, file: !72, line: 61, baseType: !82, size: 32, offset: 320)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 4)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !71, file: !72, line: 63, baseType: !78, size: 256, offset: 352)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !71, file: !72, line: 65, baseType: !87, size: 2048, offset: 608)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 2048, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 256)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !71, file: !72, line: 67, baseType: !91, size: 32, offset: 2656)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !72, line: 42, size: 32, elements: !92)
!92 = !{!93, !94}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !91, file: !72, line: 45, baseType: !14, size: 16)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !91, file: !72, line: 46, baseType: !14, size: 16, offset: 16)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !71, file: !72, line: 74, baseType: !96, size: 32, offset: 2688)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !12, line: 41, baseType: !53)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !71, file: !72, line: 79, baseType: !98, size: 64, offset: 2720)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !71, file: !72, line: 75, size: 64, elements: !99)
!99 = !{!100, !101}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !98, file: !72, line: 77, baseType: !96, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !98, file: !72, line: 78, baseType: !96, size: 32, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !71, file: !72, line: 84, baseType: !103, size: 128, offset: 2784)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 128, elements: !83)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !71, file: !72, line: 85, baseType: !105, size: 160, offset: 2912)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 160, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 20)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "hostlen", scope: !64, file: !3, line: 341, type: !110, isLocal: true, isDefinition: true)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !111, line: 46, baseType: !112)
!111 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.1/include/stddef.h", directory: "")
!112 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "now", scope: !115, file: !3, line: 190, type: !9, isLocal: true, isDefinition: true)
!115 = distinct !DISubprogram(name: "idle_string", scope: !3, file: !3, line: 188, type: !116, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!116 = !DISubroutineType(types: !117)
!117 = !{!49, !9, !9}
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "idle_hhmm", scope: !115, file: !3, line: 202, type: !120, isLocal: true, isDefinition: true)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 48, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 6)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "buf", scope: !125, file: !3, line: 220, type: !128, isLocal: true, isDefinition: true)
!125 = distinct !DISubprogram(name: "time_string", scope: !3, file: !3, line: 218, type: !126, scopeLine: 219, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!126 = !DISubroutineType(types: !127)
!127 = !{!49, !67}
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 264, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 33)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "runlevline", scope: !133, file: !3, line: 516, type: !6, isLocal: true, isDefinition: true)
!133 = distinct !DISubprogram(name: "print_runlevel", scope: !3, file: !3, line: 514, type: !134, scopeLine: 515, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!134 = !DISubroutineType(types: !135)
!135 = !{null, !67}
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "comment", scope: !133, file: !3, line: 516, type: !6, isLocal: true, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "exitstr", scope: !140, file: !3, line: 461, type: !6, isLocal: true, isDefinition: true)
!140 = distinct !DISubprogram(name: "print_deadprocs", scope: !3, file: !3, line: 459, type: !134, scopeLine: 460, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 4608, elements: !151)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !144, line: 50, size: 256, elements: !145)
!144 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "")
!145 = !{!146, !147, !148, !150}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !143, file: !144, line: 52, baseType: !49, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !143, file: !144, line: 55, baseType: !53, size: 32, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !143, file: !144, line: 56, baseType: !149, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !143, file: !144, line: 57, baseType: !53, size: 32, offset: 192)
!151 = !{!152}
!152 = !DISubrange(count: 18)
!153 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!154 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!155 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!156 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!157 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!158 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!159 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!160 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!161 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!162 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!163 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!164 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!165 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!166 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!167 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "hints", scope: !170, file: !171, line: 64, type: !179, isLocal: true, isDefinition: true)
!170 = distinct !DISubprogram(name: "canon_host_r", scope: !171, file: !171, line: 61, type: !172, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !174, retainedNodes: !4)
!171 = !DIFile(filename: "lib/canon-host.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!172 = !DISubroutineType(types: !173)
!173 = !{!6, !49, !149}
!174 = distinct !DICompileUnit(language: DW_LANG_C99, file: !175, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !176, nameTableKind: None)
!175 = !DIFile(filename: "./lib/canon-host.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!176 = !{!168, !177}
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "last_cherror", scope: !174, file: !171, line: 28, type: !53, isLocal: true, isDefinition: true)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !180, line: 565, size: 384, elements: !181)
!180 = !DIFile(filename: "/usr/include/netdb.h", directory: "")
!181 = !{!182, !183, !184, !185, !186, !191, !203, !204}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !179, file: !180, line: 567, baseType: !53, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !179, file: !180, line: 568, baseType: !53, size: 32, offset: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !179, file: !180, line: 569, baseType: !53, size: 32, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !179, file: !180, line: 570, baseType: !53, size: 32, offset: 96)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !179, file: !180, line: 571, baseType: !187, size: 32, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !188, line: 33, baseType: !189)
!188 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "")
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !12, line: 209, baseType: !190)
!190 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !179, file: !180, line: 572, baseType: !192, size: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !188, line: 178, size: 128, elements: !194)
!194 = !{!195, !199}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !193, file: !188, line: 180, baseType: !196, size: 16)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !197, line: 28, baseType: !198)
!197 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "")
!198 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !193, file: !188, line: 181, baseType: !200, size: 112, offset: 16)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 112, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 14)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !179, file: !180, line: 573, baseType: !6, size: 64, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !179, file: !180, line: 574, baseType: !205, size: 64, offset: 320)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "exit_failure", scope: !208, file: !211, line: 24, type: !212, isLocal: false, isDefinition: true)
!208 = distinct !DICompileUnit(language: DW_LANG_C99, file: !209, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !210, nameTableKind: None)
!209 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!210 = !{!206}
!211 = !DIFile(filename: "lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!212 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !53)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "program_name", scope: !215, file: !219, line: 33, type: !49, isLocal: false, isDefinition: true)
!215 = distinct !DICompileUnit(language: DW_LANG_C99, file: !216, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !217, globals: !218, nameTableKind: None)
!216 = !DIFile(filename: "./lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!217 = !{!8, !6}
!218 = !{!213}
!219 = !DIFile(filename: "lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "slot0", scope: !222, file: !243, line: 842, type: !87, isLocal: true, isDefinition: true)
!222 = distinct !DICompileUnit(language: DW_LANG_C99, file: !223, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !224, retainedTypes: !239, globals: !240, nameTableKind: None)
!223 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!224 = !{!225}
!225 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !226, line: 32, baseType: !190, size: 32, elements: !227)
!226 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!227 = !{!228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238}
!228 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!229 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!230 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!231 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!232 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!233 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!234 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!235 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!236 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!237 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!238 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!239 = !{!53, !198, !110}
!240 = !{!241, !248, !254, !266, !220, !268, !275, !277}
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !222, file: !243, line: 85, type: !244, isLocal: false, isDefinition: true)
!243 = !DIFile(filename: "lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 704, elements: !246)
!245 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!246 = !{!247}
!247 = !DISubrange(count: 11)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !222, file: !243, line: 101, type: !250, isLocal: false, isDefinition: true)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 320, elements: !252)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !225)
!252 = !{!253}
!253 = !DISubrange(count: 10)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !222, file: !243, line: 1052, type: !256, isLocal: false, isDefinition: true)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !243, line: 65, size: 448, elements: !257)
!257 = !{!258, !259, !260, !264, !265}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !256, file: !243, line: 68, baseType: !225, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !256, file: !243, line: 71, baseType: !53, size: 32, offset: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !256, file: !243, line: 75, baseType: !261, size: 256, offset: 64)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 256, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 8)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !256, file: !243, line: 78, baseType: !49, size: 64, offset: 320)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !256, file: !243, line: 81, baseType: !49, size: 64, offset: 384)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !222, file: !243, line: 116, type: !256, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "slotvec", scope: !222, file: !243, line: 845, type: !270, isLocal: true, isDefinition: true)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !243, line: 834, size: 128, elements: !272)
!272 = !{!273, !274}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !271, file: !243, line: 836, baseType: !110, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !271, file: !243, line: 837, baseType: !6, size: 64, offset: 64)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "nslots", scope: !222, file: !243, line: 843, type: !53, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "slotvec0", scope: !222, file: !243, line: 844, type: !271, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !281, file: !284, line: 26, type: !285, isLocal: false, isDefinition: true)
!281 = distinct !DICompileUnit(language: DW_LANG_C99, file: !282, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !283, nameTableKind: None)
!282 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!283 = !{!279}
!284 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 376, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 47)
!288 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 64))
!289 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression(DW_OP_LLVM_fragment, 64, 64))
!290 = distinct !DICompileUnit(language: DW_LANG_C99, file: !291, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !292, nameTableKind: None)
!291 = !DIFile(filename: "src/version.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!292 = !{!293}
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "Version", scope: !290, file: !291, line: 2, type: !49, isLocal: false, isDefinition: true)
!295 = distinct !DICompileUnit(language: DW_LANG_C99, file: !296, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!296 = !DIFile(filename: "./lib/c-ctype.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!297 = distinct !DICompileUnit(language: DW_LANG_C99, file: !298, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !299, nameTableKind: None)
!298 = !DIFile(filename: "./lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!299 = !{!300, !303}
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "file_name", scope: !297, file: !302, line: 46, type: !49, isLocal: true, isDefinition: true)
!302 = !DIFile(filename: "lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !297, file: !302, line: 56, type: !18, isLocal: true, isDefinition: true)
!305 = distinct !DICompileUnit(language: DW_LANG_C99, file: !306, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!306 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!307 = distinct !DICompileUnit(language: DW_LANG_C99, file: !308, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !309, nameTableKind: None)
!308 = !DIFile(filename: "./lib/imaxtostr.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!309 = !{!310}
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !311, line: 101, baseType: !312)
!311 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !12, line: 72, baseType: !13)
!313 = distinct !DICompileUnit(language: DW_LANG_C99, file: !314, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !315, nameTableKind: None)
!314 = !DIFile(filename: "./lib/setlocale_null.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!315 = !{!8}
!316 = distinct !DICompileUnit(language: DW_LANG_C99, file: !317, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !315, nameTableKind: None)
!317 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!318 = distinct !DICompileUnit(language: DW_LANG_C99, file: !319, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !320, nameTableKind: None)
!319 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!320 = !{!110, !6, !8}
!321 = distinct !DICompileUnit(language: DW_LANG_C99, file: !322, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!322 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!323 = distinct !DICompileUnit(language: DW_LANG_C99, file: !324, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !325, nameTableKind: None)
!324 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!325 = !{!110}
!326 = distinct !DICompileUnit(language: DW_LANG_C99, file: !327, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !328, nameTableKind: None)
!327 = !DIFile(filename: "./lib/readutmp.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!328 = !{!6, !8}
!329 = distinct !DICompileUnit(language: DW_LANG_C99, file: !330, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !331, nameTableKind: None)
!330 = !DIFile(filename: "./lib/c-strcasecmp.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!331 = !{!332}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !334)
!334 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!335 = distinct !DICompileUnit(language: DW_LANG_C99, file: !336, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!336 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!337 = distinct !DICompileUnit(language: DW_LANG_C99, file: !338, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !315, nameTableKind: None)
!338 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!339 = distinct !DICompileUnit(language: DW_LANG_C99, file: !340, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!340 = !DIFile(filename: "./lib/fclose.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!341 = distinct !DICompileUnit(language: DW_LANG_C99, file: !342, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !315, nameTableKind: None)
!342 = !DIFile(filename: "./lib/fflush.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!343 = distinct !DICompileUnit(language: DW_LANG_C99, file: !344, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !315, nameTableKind: None)
!344 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!345 = !{!"clang version 9.0.1-12 "}
!346 = !{i32 2, !"Dwarf Version", i32 4}
!347 = !{i32 2, !"Debug Info Version", i32 3}
!348 = !{i32 1, !"wchar_size", i32 4}
!349 = !{i32 1, !"ThinLTO", i32 0}
!350 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!351 = !DILocalVariable(name: "infomap", scope: !352, file: !353, line: 636, type: !356)
!352 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !353, file: !353, line: 634, type: !354, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!353 = !DIFile(filename: "src/system.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!354 = !DISubroutineType(types: !355)
!355 = !{null, !49}
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 896, elements: !362)
!357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !352, file: !353, line: 636, size: 128, elements: !359)
!359 = !{!360, !361}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !358, file: !353, line: 636, baseType: !49, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !358, file: !353, line: 636, baseType: !49, size: 64, offset: 64)
!362 = !{!363}
!363 = !DISubrange(count: 7)
!364 = !DILocation(line: 636, column: 67, scope: !352, inlinedAt: !365)
!365 = distinct !DILocation(line: 682, column: 7, scope: !366)
!366 = distinct !DILexicalBlock(scope: !367, file: !3, line: 643, column: 5)
!367 = distinct !DILexicalBlock(scope: !368, file: !3, line: 640, column: 7)
!368 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 638, type: !369, scopeLine: 639, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!369 = !DISubroutineType(types: !370)
!370 = !{null, !53}
!371 = !DILocalVariable(name: "status", arg: 1, scope: !368, file: !3, line: 638, type: !53)
!372 = !DILocation(line: 0, scope: !368)
!373 = !DILocation(line: 640, column: 14, scope: !367)
!374 = !DILocation(line: 640, column: 7, scope: !368)
!375 = !DILocation(line: 641, column: 5, scope: !376)
!376 = distinct !DILexicalBlock(scope: !367, file: !3, line: 641, column: 5)
!377 = !DILocation(line: 644, column: 15, scope: !366)
!378 = !DILocation(line: 644, column: 66, scope: !366)
!379 = !DILocation(line: 644, column: 7, scope: !366)
!380 = !DILocation(line: 645, column: 7, scope: !366)
!381 = !DILocation(line: 648, column: 7, scope: !366)
!382 = !DILocation(line: 655, column: 7, scope: !366)
!383 = !DILocation(line: 658, column: 7, scope: !366)
!384 = !DILocation(line: 663, column: 7, scope: !366)
!385 = !DILocation(line: 669, column: 7, scope: !366)
!386 = !DILocation(line: 675, column: 7, scope: !366)
!387 = !DILocation(line: 676, column: 7, scope: !366)
!388 = !DILocation(line: 677, column: 15, scope: !366)
!389 = !DILocation(line: 677, column: 7, scope: !366)
!390 = !DILocation(line: 0, scope: !352, inlinedAt: !365)
!391 = !DILocalVariable(name: "program", arg: 1, scope: !352, file: !353, line: 634, type: !49)
!392 = !DILocalVariable(name: "node", scope: !352, file: !353, line: 646, type: !49)
!393 = !DILocalVariable(name: "map_prog", scope: !352, file: !353, line: 647, type: !394)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!395 = !DILocation(line: 647, column: 36, scope: !352, inlinedAt: !365)
!396 = !DILocation(line: 649, column: 3, scope: !352, inlinedAt: !365)
!397 = !DILocation(line: 649, column: 33, scope: !352, inlinedAt: !365)
!398 = !DILocation(line: 650, column: 13, scope: !352, inlinedAt: !365)
!399 = !DILocation(line: 649, column: 20, scope: !352, inlinedAt: !365)
!400 = !DILocation(line: 649, column: 10, scope: !352, inlinedAt: !365)
!401 = !DILocation(line: 649, column: 28, scope: !352, inlinedAt: !365)
!402 = distinct !{!402, !396, !398}
!403 = !DILocation(line: 652, column: 17, scope: !404, inlinedAt: !365)
!404 = distinct !DILexicalBlock(scope: !352, file: !353, line: 652, column: 7)
!405 = !DILocation(line: 652, column: 7, scope: !404, inlinedAt: !365)
!406 = !DILocation(line: 652, column: 7, scope: !352, inlinedAt: !365)
!407 = !DILocation(line: 655, column: 11, scope: !352, inlinedAt: !365)
!408 = !DILocation(line: 655, column: 3, scope: !352, inlinedAt: !365)
!409 = !DILocation(line: 659, column: 29, scope: !352, inlinedAt: !365)
!410 = !DILocalVariable(name: "lc_messages", scope: !352, file: !353, line: 659, type: !49)
!411 = !DILocation(line: 660, column: 7, scope: !412, inlinedAt: !365)
!412 = distinct !DILexicalBlock(scope: !352, file: !353, line: 660, column: 7)
!413 = !DILocation(line: 660, column: 19, scope: !412, inlinedAt: !365)
!414 = !DILocation(line: 660, column: 22, scope: !412, inlinedAt: !365)
!415 = !DILocation(line: 660, column: 7, scope: !352, inlinedAt: !365)
!416 = !DILocation(line: 666, column: 7, scope: !417, inlinedAt: !365)
!417 = distinct !DILexicalBlock(scope: !412, file: !353, line: 661, column: 5)
!418 = !DILocation(line: 668, column: 5, scope: !417, inlinedAt: !365)
!419 = !DILocation(line: 669, column: 11, scope: !352, inlinedAt: !365)
!420 = !DILocation(line: 669, column: 3, scope: !352, inlinedAt: !365)
!421 = !DILocation(line: 671, column: 11, scope: !352, inlinedAt: !365)
!422 = !DILocation(line: 672, column: 22, scope: !352, inlinedAt: !365)
!423 = !DILocation(line: 672, column: 17, scope: !352, inlinedAt: !365)
!424 = !DILocation(line: 671, column: 3, scope: !352, inlinedAt: !365)
!425 = !DILocation(line: 673, column: 1, scope: !352, inlinedAt: !365)
!426 = !DILocation(line: 684, column: 3, scope: !368)
!427 = !DILocalVariable(name: "argc", arg: 1, scope: !428, file: !3, line: 688, type: !53)
!428 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 688, type: !429, scopeLine: 689, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!429 = !DISubroutineType(types: !430)
!430 = !{!53, !53, !431}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!432 = !DILocation(line: 0, scope: !428)
!433 = !DILocalVariable(name: "argv", arg: 2, scope: !428, file: !3, line: 688, type: !431)
!434 = !DILocalVariable(name: "assumptions", scope: !428, file: !3, line: 691, type: !18)
!435 = !DILocation(line: 694, column: 21, scope: !428)
!436 = !DILocalVariable(name: "argv0", arg: 1, scope: !437, file: !219, line: 39, type: !49)
!437 = distinct !DISubprogram(name: "set_program_name", scope: !219, file: !219, line: 39, type: !354, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !215, retainedNodes: !4)
!438 = !DILocation(line: 0, scope: !437, inlinedAt: !439)
!439 = distinct !DILocation(line: 694, column: 3, scope: !428)
!440 = !DILocation(line: 51, column: 13, scope: !441, inlinedAt: !439)
!441 = distinct !DILexicalBlock(scope: !437, file: !219, line: 51, column: 7)
!442 = !DILocation(line: 51, column: 7, scope: !437, inlinedAt: !439)
!443 = !DILocation(line: 55, column: 14, scope: !444, inlinedAt: !439)
!444 = distinct !DILexicalBlock(scope: !441, file: !219, line: 52, column: 5)
!445 = !DILocation(line: 54, column: 7, scope: !444, inlinedAt: !439)
!446 = !DILocation(line: 56, column: 7, scope: !444, inlinedAt: !439)
!447 = !DILocation(line: 59, column: 11, scope: !437, inlinedAt: !439)
!448 = !DILocalVariable(name: "slash", scope: !437, file: !219, line: 46, type: !49)
!449 = !DILocation(line: 60, column: 17, scope: !437, inlinedAt: !439)
!450 = !DILocation(line: 60, column: 11, scope: !437, inlinedAt: !439)
!451 = !DILocalVariable(name: "base", scope: !437, file: !219, line: 47, type: !49)
!452 = !DILocation(line: 61, column: 12, scope: !453, inlinedAt: !439)
!453 = distinct !DILexicalBlock(scope: !437, file: !219, line: 61, column: 7)
!454 = !DILocation(line: 61, column: 20, scope: !453, inlinedAt: !439)
!455 = !DILocation(line: 61, column: 25, scope: !453, inlinedAt: !439)
!456 = !DILocation(line: 61, column: 42, scope: !453, inlinedAt: !439)
!457 = !DILocation(line: 61, column: 28, scope: !453, inlinedAt: !439)
!458 = !DILocation(line: 61, column: 61, scope: !453, inlinedAt: !439)
!459 = !DILocation(line: 61, column: 7, scope: !437, inlinedAt: !439)
!460 = !DILocation(line: 64, column: 11, scope: !461, inlinedAt: !439)
!461 = distinct !DILexicalBlock(scope: !462, file: !219, line: 64, column: 11)
!462 = distinct !DILexicalBlock(scope: !453, file: !219, line: 62, column: 5)
!463 = !DILocation(line: 64, column: 36, scope: !461, inlinedAt: !439)
!464 = !DILocation(line: 64, column: 11, scope: !462, inlinedAt: !439)
!465 = !DILocation(line: 66, column: 24, scope: !466, inlinedAt: !439)
!466 = distinct !DILexicalBlock(scope: !461, file: !219, line: 65, column: 9)
!467 = !DILocation(line: 70, column: 41, scope: !466, inlinedAt: !439)
!468 = !DILocation(line: 72, column: 9, scope: !466, inlinedAt: !439)
!469 = !DILocation(line: 694, column: 3, scope: !428)
!470 = !DILocation(line: 84, column: 16, scope: !437, inlinedAt: !439)
!471 = !DILocation(line: 90, column: 27, scope: !437, inlinedAt: !439)
!472 = !DILocation(line: 701, column: 3, scope: !428)
!473 = !DILocalVariable(name: "optc", scope: !428, file: !3, line: 690, type: !53)
!474 = distinct !{!474, !472, !475}
!475 = !DILocation(line: 792, column: 5, scope: !428)
!476 = !DILocation(line: 726, column: 26, scope: !477)
!477 = distinct !DILexicalBlock(scope: !478, file: !3, line: 705, column: 9)
!478 = distinct !DILexicalBlock(scope: !428, file: !3, line: 703, column: 5)
!479 = !DILocation(line: 727, column: 24, scope: !477)
!480 = !DILocation(line: 730, column: 11, scope: !477)
!481 = !DILocation(line: 734, column: 11, scope: !477)
!482 = !DILocation(line: 737, column: 22, scope: !477)
!483 = !DILocation(line: 740, column: 11, scope: !477)
!484 = !DILocation(line: 744, column: 11, scope: !477)
!485 = !DILocation(line: 749, column: 11, scope: !477)
!486 = !DILocation(line: 753, column: 11, scope: !477)
!487 = !DILocation(line: 756, column: 25, scope: !477)
!488 = !DILocation(line: 759, column: 11, scope: !477)
!489 = !DILocation(line: 763, column: 11, scope: !477)
!490 = !DILocation(line: 768, column: 11, scope: !477)
!491 = !DILocation(line: 773, column: 11, scope: !477)
!492 = !DILocation(line: 776, column: 22, scope: !477)
!493 = !DILocation(line: 779, column: 11, scope: !477)
!494 = !DILocation(line: 783, column: 11, scope: !477)
!495 = !DILocation(line: 785, column: 9, scope: !477)
!496 = !DILocation(line: 787, column: 9, scope: !477)
!497 = !DILocation(line: 790, column: 11, scope: !477)
!498 = !DILocation(line: 0, scope: !477)
!499 = !DILocation(line: 796, column: 18, scope: !500)
!500 = distinct !DILexicalBlock(scope: !501, file: !3, line: 795, column: 5)
!501 = distinct !DILexicalBlock(scope: !428, file: !3, line: 794, column: 7)
!502 = !DILocation(line: 797, column: 20, scope: !500)
!503 = !DILocation(line: 800, column: 7, scope: !504)
!504 = distinct !DILexicalBlock(scope: !428, file: !3, line: 800, column: 7)
!505 = !DILocation(line: 800, column: 7, scope: !428)
!506 = !DILocation(line: 805, column: 7, scope: !507)
!507 = distinct !DILexicalBlock(scope: !428, file: !3, line: 805, column: 7)
!508 = !DILocation(line: 0, scope: !507)
!509 = !DILocation(line: 816, column: 18, scope: !428)
!510 = !DILocation(line: 816, column: 16, scope: !428)
!511 = !DILocation(line: 816, column: 3, scope: !428)
!512 = !DILocation(line: 819, column: 20, scope: !513)
!513 = distinct !DILexicalBlock(scope: !428, file: !3, line: 817, column: 5)
!514 = !DILocation(line: 820, column: 7, scope: !513)
!515 = !DILocation(line: 823, column: 7, scope: !513)
!516 = !DILocation(line: 824, column: 7, scope: !513)
!517 = !DILocation(line: 827, column: 12, scope: !513)
!518 = !DILocation(line: 827, column: 7, scope: !513)
!519 = !DILocation(line: 828, column: 7, scope: !513)
!520 = !DILocation(line: 831, column: 20, scope: !513)
!521 = !DILocation(line: 831, column: 62, scope: !513)
!522 = !DILocation(line: 831, column: 50, scope: !513)
!523 = !DILocation(line: 831, column: 43, scope: !513)
!524 = !DILocation(line: 831, column: 7, scope: !513)
!525 = !DILocation(line: 832, column: 7, scope: !513)
!526 = !DILocation(line: 835, column: 3, scope: !428)
!527 = !DILocalVariable(name: "idlestr", scope: !64, file: !3, line: 338, type: !528)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 56, elements: !362)
!529 = !DILocation(line: 338, column: 8, scope: !64, inlinedAt: !530)
!530 = distinct !DILocation(line: 593, column: 13, scope: !531, inlinedAt: !538)
!531 = distinct !DILexicalBlock(scope: !532, file: !3, line: 592, column: 15)
!532 = distinct !DILexicalBlock(scope: !533, file: !3, line: 591, column: 9)
!533 = distinct !DILexicalBlock(scope: !534, file: !3, line: 588, column: 11)
!534 = distinct !DILexicalBlock(scope: !535, file: !3, line: 587, column: 5)
!535 = distinct !DISubprogram(name: "scan_entries", scope: !3, file: !3, line: 569, type: !536, scopeLine: 570, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!536 = !DISubroutineType(types: !537)
!537 = !{null, !110, !67}
!538 = distinct !DILocation(line: 632, column: 5, scope: !539)
!539 = distinct !DILexicalBlock(scope: !540, file: !3, line: 629, column: 7)
!540 = distinct !DISubprogram(name: "who", scope: !3, file: !3, line: 621, type: !541, scopeLine: 622, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!541 = !DISubroutineType(types: !542)
!542 = !{null, !49, !53}
!543 = !DILocalVariable(name: "line", scope: !64, file: !3, line: 347, type: !544)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 304, elements: !545)
!545 = !{!546}
!546 = !DISubrange(count: 38)
!547 = !DILocation(line: 347, column: 8, scope: !64, inlinedAt: !530)
!548 = !DILocalVariable(name: "pidstr", scope: !64, file: !3, line: 349, type: !549)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !550)
!550 = !{!551}
!551 = !DISubrange(count: 12)
!552 = !DILocation(line: 349, column: 3, scope: !64, inlinedAt: !530)
!553 = !DILocalVariable(name: "pidstr", scope: !554, file: !3, line: 498, type: !549)
!554 = distinct !DISubprogram(name: "print_initspawn", scope: !3, file: !3, line: 495, type: !134, scopeLine: 496, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!555 = !DILocation(line: 498, column: 3, scope: !554, inlinedAt: !556)
!556 = distinct !DILocation(line: 604, column: 13, scope: !557, inlinedAt: !538)
!557 = distinct !DILexicalBlock(scope: !558, file: !3, line: 603, column: 20)
!558 = distinct !DILexicalBlock(scope: !559, file: !3, line: 601, column: 20)
!559 = distinct !DILexicalBlock(scope: !560, file: !3, line: 596, column: 20)
!560 = distinct !DILexicalBlock(scope: !531, file: !3, line: 594, column: 20)
!561 = !DILocalVariable(name: "pidstr", scope: !562, file: !3, line: 485, type: !549)
!562 = distinct !DISubprogram(name: "print_login", scope: !3, file: !3, line: 482, type: !134, scopeLine: 483, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!563 = !DILocation(line: 485, column: 3, scope: !562, inlinedAt: !564)
!564 = distinct !DILocation(line: 606, column: 13, scope: !565, inlinedAt: !538)
!565 = distinct !DILexicalBlock(scope: !557, file: !3, line: 605, column: 20)
!566 = !DILocalVariable(name: "pidstr", scope: !140, file: !3, line: 463, type: !549)
!567 = !DILocation(line: 463, column: 3, scope: !140, inlinedAt: !568)
!568 = distinct !DILocation(line: 608, column: 13, scope: !569, inlinedAt: !538)
!569 = distinct !DILexicalBlock(scope: !565, file: !3, line: 607, column: 20)
!570 = !DILocalVariable(name: "ut_host", scope: !571, file: !3, line: 377, type: !573)
!571 = distinct !DILexicalBlock(scope: !572, file: !3, line: 376, column: 5)
!572 = distinct !DILexicalBlock(scope: !64, file: !3, line: 375, column: 7)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 2056, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 257)
!576 = !DILocation(line: 377, column: 12, scope: !571, inlinedAt: !530)
!577 = !DILocalVariable(name: "filename", arg: 1, scope: !540, file: !3, line: 621, type: !49)
!578 = !DILocation(line: 0, scope: !540)
!579 = !DILocalVariable(name: "options", arg: 2, scope: !540, file: !3, line: 621, type: !53)
!580 = !DILocalVariable(name: "file", arg: 1, scope: !581, file: !582, line: 92, type: !49)
!581 = distinct !DISubprogram(name: "read_utmp", scope: !582, file: !582, line: 92, type: !583, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !326, retainedNodes: !4)
!582 = !DIFile(filename: "lib/readutmp.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!583 = !DISubroutineType(types: !584)
!584 = !{!53, !49, !585, !586, !53}
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !70, line: 146, baseType: !589)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !72, line: 55, size: 3072, elements: !590)
!590 = !{!591, !592, !593, !594, !595, !596, !597, !602, !603, !608, !609}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !589, file: !72, line: 57, baseType: !14, size: 16)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !589, file: !72, line: 58, baseType: !76, size: 32, offset: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !589, file: !72, line: 59, baseType: !78, size: 256, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !589, file: !72, line: 61, baseType: !82, size: 32, offset: 320)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !589, file: !72, line: 63, baseType: !78, size: 256, offset: 352)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !589, file: !72, line: 65, baseType: !87, size: 2048, offset: 608)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !589, file: !72, line: 67, baseType: !598, size: 32, offset: 2656)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !72, line: 42, size: 32, elements: !599)
!599 = !{!600, !601}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !598, file: !72, line: 45, baseType: !14, size: 16)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !598, file: !72, line: 46, baseType: !14, size: 16, offset: 16)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !589, file: !72, line: 74, baseType: !96, size: 32, offset: 2688)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !589, file: !72, line: 79, baseType: !604, size: 64, offset: 2720)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !589, file: !72, line: 75, size: 64, elements: !605)
!605 = !{!606, !607}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !604, file: !72, line: 77, baseType: !96, size: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !604, file: !72, line: 78, baseType: !96, size: 32, offset: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !589, file: !72, line: 84, baseType: !103, size: 128, offset: 2784)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !589, file: !72, line: 85, baseType: !105, size: 160, offset: 2912)
!610 = !DILocation(line: 0, scope: !581, inlinedAt: !611)
!611 = distinct !DILocation(line: 626, column: 7, scope: !612)
!612 = distinct !DILexicalBlock(scope: !540, file: !3, line: 626, column: 7)
!613 = !DILocalVariable(name: "options", arg: 4, scope: !581, file: !582, line: 93, type: !53)
!614 = !DILocalVariable(name: "n_read", scope: !581, file: !582, line: 95, type: !110)
!615 = !DILocalVariable(name: "n_alloc", scope: !581, file: !582, line: 96, type: !110)
!616 = !DILocalVariable(name: "utmp", scope: !581, file: !582, line: 97, type: !587)
!617 = !DILocation(line: 104, column: 3, scope: !581, inlinedAt: !611)
!618 = !DILocation(line: 106, column: 3, scope: !581, inlinedAt: !611)
!619 = !DILocation(line: 108, column: 15, scope: !581, inlinedAt: !611)
!620 = !DILocalVariable(name: "u", scope: !581, file: !582, line: 98, type: !587)
!621 = !DILocation(line: 108, column: 32, scope: !581, inlinedAt: !611)
!622 = !DILocation(line: 108, column: 3, scope: !581, inlinedAt: !611)
!623 = !DILocation(line: 0, scope: !624, inlinedAt: !630)
!624 = distinct !DILexicalBlock(scope: !625, file: !582, line: 74, column: 7)
!625 = distinct !DISubprogram(name: "desirable_utmp_entry", scope: !582, file: !582, line: 69, type: !626, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !326, retainedNodes: !4)
!626 = !DISubroutineType(types: !627)
!627 = !{!18, !628, !53}
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !588)
!630 = distinct !DILocation(line: 109, column: 9, scope: !631, inlinedAt: !611)
!631 = distinct !DILexicalBlock(scope: !581, file: !582, line: 109, column: 9)
!632 = !DILocation(line: 0, scope: !633, inlinedAt: !630)
!633 = distinct !DILexicalBlock(scope: !625, file: !582, line: 72, column: 7)
!634 = !DILocation(line: 626, column: 7, scope: !612)
!635 = !DILocalVariable(name: "u", arg: 1, scope: !625, file: !582, line: 69, type: !628)
!636 = !DILocation(line: 0, scope: !625, inlinedAt: !630)
!637 = !DILocalVariable(name: "options", arg: 2, scope: !625, file: !582, line: 69, type: !53)
!638 = !DILocation(line: 71, column: 20, scope: !625, inlinedAt: !630)
!639 = !DILocalVariable(name: "user_proc", scope: !625, file: !582, line: 71, type: !18)
!640 = !DILocation(line: 76, column: 14, scope: !624, inlinedAt: !630)
!641 = !DILocation(line: 76, column: 12, scope: !624, inlinedAt: !630)
!642 = !DILocation(line: 77, column: 7, scope: !624, inlinedAt: !630)
!643 = !DILocation(line: 77, column: 11, scope: !624, inlinedAt: !630)
!644 = !DILocation(line: 77, column: 32, scope: !624, inlinedAt: !630)
!645 = !DILocation(line: 77, column: 36, scope: !624, inlinedAt: !630)
!646 = !DILocation(line: 77, column: 39, scope: !624, inlinedAt: !630)
!647 = !DILocation(line: 77, column: 45, scope: !624, inlinedAt: !630)
!648 = !DILocation(line: 74, column: 7, scope: !625, inlinedAt: !630)
!649 = !DILocation(line: 111, column: 20, scope: !650, inlinedAt: !611)
!650 = distinct !DILexicalBlock(scope: !651, file: !582, line: 111, column: 13)
!651 = distinct !DILexicalBlock(scope: !631, file: !582, line: 110, column: 7)
!652 = !DILocation(line: 111, column: 13, scope: !651, inlinedAt: !611)
!653 = !DILocalVariable(name: "p", arg: 1, scope: !654, file: !655, line: 174, type: !8)
!654 = distinct !DISubprogram(name: "x2nrealloc", scope: !655, file: !655, line: 174, type: !656, scopeLine: 175, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !318, retainedNodes: !4)
!655 = !DIFile(filename: "./lib/xalloc.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!656 = !DISubroutineType(types: !657)
!657 = !{!8, !8, !585, !110}
!658 = !DILocation(line: 0, scope: !654, inlinedAt: !659)
!659 = distinct !DILocation(line: 112, column: 18, scope: !650, inlinedAt: !611)
!660 = !DILocalVariable(name: "s", arg: 3, scope: !654, file: !655, line: 174, type: !110)
!661 = !DILocalVariable(name: "n", scope: !654, file: !655, line: 176, type: !110)
!662 = !DILocation(line: 178, column: 9, scope: !663, inlinedAt: !659)
!663 = distinct !DILexicalBlock(scope: !654, file: !655, line: 178, column: 7)
!664 = !DILocation(line: 178, column: 7, scope: !654, inlinedAt: !659)
!665 = !DILocation(line: 201, column: 11, scope: !666, inlinedAt: !659)
!666 = distinct !DILexicalBlock(scope: !667, file: !655, line: 200, column: 11)
!667 = distinct !DILexicalBlock(scope: !663, file: !655, line: 195, column: 5)
!668 = !DILocation(line: 200, column: 11, scope: !667, inlinedAt: !659)
!669 = !DILocation(line: 203, column: 14, scope: !667, inlinedAt: !659)
!670 = !DILocation(line: 203, column: 18, scope: !667, inlinedAt: !659)
!671 = !DILocation(line: 203, column: 9, scope: !667, inlinedAt: !659)
!672 = !DILocation(line: 207, column: 25, scope: !654, inlinedAt: !659)
!673 = !DILocalVariable(name: "p", arg: 1, scope: !674, file: !675, line: 51, type: !8)
!674 = distinct !DISubprogram(name: "xrealloc", scope: !675, file: !675, line: 51, type: !676, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !318, retainedNodes: !4)
!675 = !DIFile(filename: "lib/xmalloc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!676 = !DISubroutineType(types: !677)
!677 = !{!8, !8, !110}
!678 = !DILocation(line: 0, scope: !674, inlinedAt: !679)
!679 = distinct !DILocation(line: 207, column: 10, scope: !654, inlinedAt: !659)
!680 = !DILocalVariable(name: "n", arg: 2, scope: !674, file: !675, line: 51, type: !110)
!681 = !DILocation(line: 53, column: 8, scope: !682, inlinedAt: !679)
!682 = distinct !DILexicalBlock(scope: !674, file: !675, line: 53, column: 7)
!683 = !DILocation(line: 53, column: 10, scope: !682, inlinedAt: !679)
!684 = !DILocation(line: 61, column: 7, scope: !674, inlinedAt: !679)
!685 = !DILocation(line: 62, column: 8, scope: !686, inlinedAt: !679)
!686 = distinct !DILexicalBlock(scope: !674, file: !675, line: 62, column: 7)
!687 = !DILocation(line: 62, column: 10, scope: !686, inlinedAt: !679)
!688 = !DILocation(line: 180, column: 13, scope: !689, inlinedAt: !659)
!689 = distinct !DILexicalBlock(scope: !690, file: !655, line: 180, column: 11)
!690 = distinct !DILexicalBlock(scope: !663, file: !655, line: 179, column: 5)
!691 = !DILocation(line: 180, column: 11, scope: !690, inlinedAt: !659)
!692 = !DILocation(line: 191, column: 11, scope: !693, inlinedAt: !659)
!693 = distinct !DILexicalBlock(scope: !690, file: !655, line: 191, column: 11)
!694 = !DILocation(line: 191, column: 11, scope: !690, inlinedAt: !659)
!695 = !DILocation(line: 0, scope: !674, inlinedAt: !696)
!696 = distinct !DILocation(line: 207, column: 10, scope: !654, inlinedAt: !659)
!697 = !DILocation(line: 61, column: 7, scope: !674, inlinedAt: !696)
!698 = !DILocation(line: 62, column: 8, scope: !686, inlinedAt: !696)
!699 = !DILocation(line: 62, column: 13, scope: !686, inlinedAt: !696)
!700 = !DILocation(line: 62, column: 10, scope: !686, inlinedAt: !696)
!701 = !DILocation(line: 206, column: 7, scope: !654, inlinedAt: !659)
!702 = !DILocation(line: 207, column: 10, scope: !654, inlinedAt: !659)
!703 = !DILocation(line: 112, column: 18, scope: !650, inlinedAt: !611)
!704 = !DILocation(line: 112, column: 11, scope: !650, inlinedAt: !611)
!705 = !DILocation(line: 114, column: 20, scope: !651, inlinedAt: !611)
!706 = !DILocation(line: 114, column: 9, scope: !651, inlinedAt: !611)
!707 = !DILocation(line: 114, column: 26, scope: !651, inlinedAt: !611)
!708 = !DILocation(line: 115, column: 7, scope: !651, inlinedAt: !611)
!709 = distinct !{!709, !622, !710}
!710 = !DILocation(line: 115, column: 7, scope: !581, inlinedAt: !611)
!711 = distinct !{!711, !622, !710}
!712 = !DILocation(line: 63, column: 5, scope: !686, inlinedAt: !696)
!713 = !DILocation(line: 192, column: 9, scope: !693, inlinedAt: !659)
!714 = !DILocation(line: 202, column: 9, scope: !666, inlinedAt: !659)
!715 = !DILocation(line: 63, column: 5, scope: !686, inlinedAt: !679)
!716 = !DILocation(line: 117, column: 3, scope: !581, inlinedAt: !611)
!717 = !DILocation(line: 120, column: 13, scope: !581, inlinedAt: !611)
!718 = !DILocation(line: 629, column: 7, scope: !539)
!719 = !DILocalVariable(name: "n_users", scope: !540, file: !3, line: 623, type: !110)
!720 = !DILocalVariable(name: "utmp_buf", scope: !540, file: !3, line: 624, type: !721)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!722 = !DILocation(line: 629, column: 7, scope: !540)
!723 = !DILocalVariable(name: "n", arg: 1, scope: !724, file: !3, line: 537, type: !110)
!724 = distinct !DISubprogram(name: "list_entries_who", scope: !3, file: !3, line: 537, type: !536, scopeLine: 538, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!725 = !DILocation(line: 0, scope: !724, inlinedAt: !726)
!726 = distinct !DILocation(line: 630, column: 5, scope: !539)
!727 = !DILocalVariable(name: "utmp_buf", arg: 2, scope: !724, file: !3, line: 537, type: !67)
!728 = !DILocalVariable(name: "entries", scope: !724, file: !3, line: 539, type: !112)
!729 = !DILocalVariable(name: "separator", scope: !724, file: !3, line: 540, type: !49)
!730 = !DILocation(line: 542, column: 3, scope: !724, inlinedAt: !726)
!731 = !DILocation(line: 542, column: 11, scope: !724, inlinedAt: !726)
!732 = !DILocation(line: 544, column: 11, scope: !733, inlinedAt: !726)
!733 = distinct !DILexicalBlock(scope: !734, file: !3, line: 544, column: 11)
!734 = distinct !DILexicalBlock(scope: !724, file: !3, line: 543, column: 5)
!735 = !DILocation(line: 544, column: 11, scope: !734, inlinedAt: !726)
!736 = !DILocalVariable(name: "ut", arg: 1, scope: !737, file: !582, line: 49, type: !628)
!737 = distinct !DISubprogram(name: "extract_trimmed_name", scope: !582, file: !582, line: 49, type: !738, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !326, retainedNodes: !4)
!738 = !DISubroutineType(types: !739)
!739 = !{!6, !628}
!740 = !DILocation(line: 0, scope: !737, inlinedAt: !741)
!741 = distinct !DILocation(line: 548, column: 26, scope: !742, inlinedAt: !726)
!742 = distinct !DILexicalBlock(scope: !733, file: !3, line: 545, column: 9)
!743 = !DILocalVariable(name: "n", arg: 1, scope: !744, file: !675, line: 39, type: !110)
!744 = distinct !DISubprogram(name: "xmalloc", scope: !675, file: !675, line: 39, type: !745, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !318, retainedNodes: !4)
!745 = !DISubroutineType(types: !746)
!746 = !{!8, !110}
!747 = !DILocation(line: 0, scope: !744, inlinedAt: !748)
!748 = distinct !DILocation(line: 53, column: 18, scope: !737, inlinedAt: !741)
!749 = !DILocation(line: 41, column: 13, scope: !744, inlinedAt: !748)
!750 = !DILocalVariable(name: "p", scope: !744, file: !675, line: 41, type: !8)
!751 = !DILocation(line: 42, column: 8, scope: !752, inlinedAt: !748)
!752 = distinct !DILexicalBlock(scope: !744, file: !675, line: 42, column: 7)
!753 = !DILocation(line: 42, column: 10, scope: !752, inlinedAt: !748)
!754 = !DILocation(line: 43, column: 5, scope: !752, inlinedAt: !748)
!755 = !DILocalVariable(name: "trimmed_name", scope: !737, file: !582, line: 51, type: !6)
!756 = !DILocation(line: 58, column: 3, scope: !737, inlinedAt: !741)
!757 = !DILocation(line: 58, column: 39, scope: !737, inlinedAt: !741)
!758 = !DILocation(line: 59, column: 27, scope: !759, inlinedAt: !741)
!759 = distinct !DILexicalBlock(scope: !737, file: !582, line: 59, column: 3)
!760 = !DILocalVariable(name: "p", scope: !737, file: !582, line: 51, type: !6)
!761 = !DILocation(line: 60, column: 21, scope: !762, inlinedAt: !741)
!762 = distinct !DILexicalBlock(scope: !759, file: !582, line: 59, column: 3)
!763 = !DILocation(line: 60, column: 25, scope: !762, inlinedAt: !741)
!764 = !DILocation(line: 59, column: 25, scope: !759, inlinedAt: !741)
!765 = !DILocation(line: 59, column: 3, scope: !759, inlinedAt: !741)
!766 = !DILocation(line: 548, column: 26, scope: !742, inlinedAt: !726)
!767 = !DILocation(line: 60, column: 28, scope: !762, inlinedAt: !741)
!768 = !DILocation(line: 60, column: 34, scope: !762, inlinedAt: !741)
!769 = !DILocation(line: 61, column: 13, scope: !762, inlinedAt: !741)
!770 = distinct !{!770, !765, !771}
!771 = !DILocation(line: 62, column: 5, scope: !759, inlinedAt: !741)
!772 = !DILocalVariable(name: "trimmed_name", scope: !742, file: !3, line: 546, type: !6)
!773 = !DILocation(line: 0, scope: !742, inlinedAt: !726)
!774 = !DILocation(line: 550, column: 11, scope: !742, inlinedAt: !726)
!775 = !DILocation(line: 553, column: 18, scope: !742, inlinedAt: !726)
!776 = !DILocation(line: 554, column: 9, scope: !742, inlinedAt: !726)
!777 = !DILocation(line: 555, column: 15, scope: !734, inlinedAt: !726)
!778 = distinct !{!778, !730, !779}
!779 = !DILocation(line: 556, column: 5, scope: !724, inlinedAt: !726)
!780 = !DILocation(line: 557, column: 11, scope: !724, inlinedAt: !726)
!781 = !DILocation(line: 557, column: 3, scope: !724, inlinedAt: !726)
!782 = !DILocation(line: 630, column: 5, scope: !539)
!783 = !DILocalVariable(name: "n", arg: 1, scope: !535, file: !3, line: 569, type: !110)
!784 = !DILocation(line: 0, scope: !535, inlinedAt: !538)
!785 = !DILocalVariable(name: "utmp_buf", arg: 2, scope: !535, file: !3, line: 569, type: !67)
!786 = !DILocalVariable(name: "boottime", scope: !535, file: !3, line: 572, type: !9)
!787 = !DILocation(line: 574, column: 7, scope: !788, inlinedAt: !538)
!788 = distinct !DILexicalBlock(scope: !535, file: !3, line: 574, column: 7)
!789 = !DILocation(line: 574, column: 7, scope: !535, inlinedAt: !538)
!790 = !DILocation(line: 563, column: 19, scope: !791, inlinedAt: !794)
!791 = distinct !DISubprogram(name: "print_heading", scope: !3, file: !3, line: 561, type: !792, scopeLine: 562, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!792 = !DISubroutineType(types: !793)
!793 = !{null}
!794 = distinct !DILocation(line: 575, column: 5, scope: !788, inlinedAt: !538)
!795 = !DILocation(line: 563, column: 39, scope: !791, inlinedAt: !794)
!796 = !DILocation(line: 563, column: 50, scope: !791, inlinedAt: !794)
!797 = !DILocation(line: 563, column: 61, scope: !791, inlinedAt: !794)
!798 = !DILocation(line: 564, column: 15, scope: !791, inlinedAt: !794)
!799 = !DILocation(line: 564, column: 25, scope: !791, inlinedAt: !794)
!800 = !DILocation(line: 564, column: 39, scope: !791, inlinedAt: !794)
!801 = !DILocation(line: 563, column: 3, scope: !791, inlinedAt: !794)
!802 = !DILocation(line: 575, column: 5, scope: !788, inlinedAt: !538)
!803 = !DILocation(line: 577, column: 7, scope: !804, inlinedAt: !538)
!804 = distinct !DILexicalBlock(scope: !535, file: !3, line: 577, column: 7)
!805 = !DILocation(line: 577, column: 7, scope: !535, inlinedAt: !538)
!806 = !DILocation(line: 579, column: 19, scope: !807, inlinedAt: !538)
!807 = distinct !DILexicalBlock(scope: !804, file: !3, line: 578, column: 5)
!808 = !DILocalVariable(name: "ttyname_b", scope: !535, file: !3, line: 571, type: !6)
!809 = !DILocation(line: 580, column: 12, scope: !810, inlinedAt: !538)
!810 = distinct !DILexicalBlock(scope: !807, file: !3, line: 580, column: 11)
!811 = !DILocation(line: 580, column: 11, scope: !807, inlinedAt: !538)
!812 = !DILocation(line: 582, column: 11, scope: !813, inlinedAt: !538)
!813 = distinct !DILexicalBlock(scope: !807, file: !3, line: 582, column: 11)
!814 = !DILocation(line: 583, column: 19, scope: !813, inlinedAt: !538)
!815 = !DILocation(line: 583, column: 9, scope: !813, inlinedAt: !538)
!816 = !DILocation(line: 586, column: 3, scope: !535, inlinedAt: !538)
!817 = !DILocation(line: 0, scope: !64, inlinedAt: !530)
!818 = !DILocation(line: 0, scope: !819, inlinedAt: !530)
!819 = distinct !DILexicalBlock(scope: !64, file: !3, line: 354, column: 8)
!820 = !DILocation(line: 0, scope: !821, inlinedAt: !530)
!821 = distinct !DILexicalBlock(scope: !822, file: !3, line: 359, column: 5)
!822 = distinct !DILexicalBlock(scope: !64, file: !3, line: 358, column: 7)
!823 = !DILocation(line: 0, scope: !170, inlinedAt: !824)
!824 = distinct !DILocation(line: 35, column: 10, scope: !825, inlinedAt: !828)
!825 = distinct !DISubprogram(name: "canon_host", scope: !171, file: !171, line: 33, type: !826, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !174, retainedNodes: !4)
!826 = !DISubroutineType(types: !827)
!827 = !{!6, !49}
!828 = distinct !DILocation(line: 392, column: 18, scope: !829, inlinedAt: !530)
!829 = distinct !DILexicalBlock(scope: !830, file: !3, line: 390, column: 9)
!830 = distinct !DILexicalBlock(scope: !571, file: !3, line: 389, column: 11)
!831 = !DILocation(line: 0, scope: !125, inlinedAt: !832)
!832 = distinct !DILocation(line: 436, column: 15, scope: !64, inlinedAt: !530)
!833 = !DILocation(line: 0, scope: !125, inlinedAt: !834)
!834 = distinct !DILocation(line: 477, column: 15, scope: !140, inlinedAt: !568)
!835 = !DILocation(line: 0, scope: !125, inlinedAt: !836)
!836 = distinct !DILocation(line: 490, column: 15, scope: !562, inlinedAt: !564)
!837 = !DILocation(line: 0, scope: !125, inlinedAt: !838)
!838 = distinct !DILocation(line: 501, column: 15, scope: !554, inlinedAt: !556)
!839 = !DILocation(line: 0, scope: !125, inlinedAt: !840)
!840 = distinct !DILocation(line: 510, column: 15, scope: !841, inlinedAt: !842)
!841 = distinct !DISubprogram(name: "print_clockchange", scope: !3, file: !3, line: 506, type: !134, scopeLine: 507, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!842 = distinct !DILocation(line: 602, column: 13, scope: !558, inlinedAt: !538)
!843 = !DILocation(line: 0, scope: !125, inlinedAt: !844)
!844 = distinct !DILocation(line: 444, column: 15, scope: !845, inlinedAt: !846)
!845 = distinct !DISubprogram(name: "print_boottime", scope: !3, file: !3, line: 441, type: !134, scopeLine: 442, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!846 = distinct !DILocation(line: 597, column: 13, scope: !559, inlinedAt: !538)
!847 = !DILocation(line: 0, scope: !125, inlinedAt: !848)
!848 = distinct !DILocation(line: 528, column: 44, scope: !133, inlinedAt: !849)
!849 = distinct !DILocation(line: 595, column: 13, scope: !560, inlinedAt: !538)
!850 = !DILocation(line: 586, column: 11, scope: !535, inlinedAt: !538)
!851 = !DILocation(line: 588, column: 12, scope: !533, inlinedAt: !538)
!852 = !DILocation(line: 589, column: 11, scope: !533, inlinedAt: !538)
!853 = !DILocation(line: 589, column: 14, scope: !533, inlinedAt: !538)
!854 = !DILocation(line: 588, column: 11, scope: !534, inlinedAt: !538)
!855 = !DILocation(line: 592, column: 15, scope: !531, inlinedAt: !538)
!856 = !DILocation(line: 592, column: 26, scope: !531, inlinedAt: !538)
!857 = !DILocation(line: 592, column: 29, scope: !531, inlinedAt: !538)
!858 = !DILocation(line: 592, column: 15, scope: !532, inlinedAt: !538)
!859 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !64, file: !3, line: 333, type: !67)
!860 = !DILocalVariable(name: "boottime", arg: 2, scope: !64, file: !3, line: 333, type: !9)
!861 = !DILocalVariable(name: "p", scope: !64, file: !3, line: 348, type: !6)
!862 = !DILocation(line: 354, column: 10, scope: !819, inlinedAt: !530)
!863 = !DILocation(line: 354, column: 8, scope: !64, inlinedAt: !530)
!864 = !DILocation(line: 355, column: 9, scope: !819, inlinedAt: !530)
!865 = !DILocalVariable(name: "dest", arg: 1, scope: !866, file: !353, line: 741, type: !869)
!866 = distinct !DISubprogram(name: "stzncpy", scope: !353, file: !353, line: 741, type: !867, scopeLine: 742, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!867 = !DISubroutineType(types: !868)
!868 = !{!6, !869, !870, !110}
!869 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !6)
!870 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !49)
!871 = !DILocation(line: 0, scope: !866, inlinedAt: !872)
!872 = distinct !DILocation(line: 356, column: 3, scope: !64, inlinedAt: !530)
!873 = !DILocalVariable(name: "src", arg: 2, scope: !866, file: !353, line: 741, type: !870)
!874 = !DILocalVariable(name: "len", arg: 3, scope: !866, file: !353, line: 741, type: !110)
!875 = !DILocalVariable(name: "src_end", scope: !866, file: !353, line: 743, type: !49)
!876 = !DILocation(line: 744, column: 24, scope: !866, inlinedAt: !872)
!877 = !DILocation(line: 744, column: 3, scope: !866, inlinedAt: !872)
!878 = !DILocation(line: 743, column: 29, scope: !866, inlinedAt: !872)
!879 = !DILocation(line: 745, column: 19, scope: !866, inlinedAt: !872)
!880 = !DILocation(line: 745, column: 10, scope: !866, inlinedAt: !872)
!881 = !DILocation(line: 745, column: 13, scope: !866, inlinedAt: !872)
!882 = !{!883}
!883 = distinct !{!883, !884, !"stzncpy: argument 0"}
!884 = distinct !{!884, !"stzncpy"}
!885 = !{!886}
!886 = distinct !{!886, !884, !"stzncpy: argument 1"}
!887 = !DILocation(line: 744, column: 14, scope: !866, inlinedAt: !872)
!888 = distinct !{!888, !877, !879}
!889 = !DILocation(line: 744, column: 27, scope: !866, inlinedAt: !872)
!890 = !DILocation(line: 746, column: 9, scope: !866, inlinedAt: !872)
!891 = !DILocalVariable(name: "stats", scope: !64, file: !3, line: 335, type: !892)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !893, line: 46, size: 1152, elements: !894)
!893 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!894 = !{!895, !897, !899, !901, !903, !905, !907, !908, !909, !911, !913, !915, !922, !923, !924}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !892, file: !893, line: 48, baseType: !896, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !12, line: 145, baseType: !112)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !892, file: !893, line: 53, baseType: !898, size: 64, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !12, line: 148, baseType: !112)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !892, file: !893, line: 61, baseType: !900, size: 64, offset: 128)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !12, line: 151, baseType: !112)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !892, file: !893, line: 62, baseType: !902, size: 32, offset: 192)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !12, line: 150, baseType: !190)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !892, file: !893, line: 64, baseType: !904, size: 32, offset: 224)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !12, line: 146, baseType: !190)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !892, file: !893, line: 65, baseType: !906, size: 32, offset: 256)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !12, line: 147, baseType: !190)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !892, file: !893, line: 67, baseType: !53, size: 32, offset: 288)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !892, file: !893, line: 69, baseType: !896, size: 64, offset: 320)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !892, file: !893, line: 74, baseType: !910, size: 64, offset: 384)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !12, line: 152, baseType: !13)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !892, file: !893, line: 78, baseType: !912, size: 64, offset: 448)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !12, line: 174, baseType: !13)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !892, file: !893, line: 80, baseType: !914, size: 64, offset: 512)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !12, line: 179, baseType: !13)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !892, file: !893, line: 91, baseType: !916, size: 128, offset: 576)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !917, line: 10, size: 128, elements: !918)
!917 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!918 = !{!919, !920}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !916, file: !917, line: 12, baseType: !11, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !916, file: !917, line: 16, baseType: !921, size: 64, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !12, line: 196, baseType: !13)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !892, file: !893, line: 92, baseType: !916, size: 128, offset: 704)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !892, file: !893, line: 93, baseType: !916, size: 128, offset: 832)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !892, file: !893, line: 106, baseType: !925, size: 192, offset: 960)
!925 = !DICompositeType(tag: DW_TAG_array_type, baseType: !921, size: 192, elements: !60)
!926 = !DILocation(line: 358, column: 7, scope: !822, inlinedAt: !530)
!927 = !DILocation(line: 358, column: 27, scope: !822, inlinedAt: !530)
!928 = !DILocation(line: 358, column: 7, scope: !64, inlinedAt: !530)
!929 = !DILocation(line: 360, column: 14, scope: !821, inlinedAt: !530)
!930 = !DILocation(line: 327, column: 25, scope: !931, inlinedAt: !936)
!931 = distinct !DISubprogram(name: "is_tty_writable", scope: !3, file: !3, line: 317, type: !932, scopeLine: 318, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!932 = !DISubroutineType(types: !933)
!933 = !{!18, !934}
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !892)
!936 = distinct !DILocation(line: 360, column: 14, scope: !821, inlinedAt: !530)
!937 = !DILocation(line: 327, column: 10, scope: !931, inlinedAt: !936)
!938 = !DILocalVariable(name: "mesg", scope: !64, file: !3, line: 337, type: !7)
!939 = !DILocation(line: 369, column: 7, scope: !64, inlinedAt: !530)
!940 = !DILocation(line: 375, column: 7, scope: !572, inlinedAt: !530)
!941 = !DILocation(line: 375, column: 7, scope: !64, inlinedAt: !530)
!942 = !DILocalVariable(name: "host", scope: !571, file: !3, line: 378, type: !6)
!943 = !DILocation(line: 0, scope: !571, inlinedAt: !530)
!944 = !DILocalVariable(name: "display", scope: !571, file: !3, line: 379, type: !6)
!945 = !DILocation(line: 0, scope: !866, inlinedAt: !946)
!946 = distinct !DILocation(line: 382, column: 7, scope: !571, inlinedAt: !530)
!947 = !DILocation(line: 743, column: 29, scope: !866, inlinedAt: !946)
!948 = !DILocation(line: 744, column: 3, scope: !866, inlinedAt: !946)
!949 = !DILocation(line: 744, column: 27, scope: !866, inlinedAt: !946)
!950 = !{!951}
!951 = distinct !{!951, !952, !"stzncpy: argument 1"}
!952 = distinct !{!952, !"stzncpy"}
!953 = !{!954}
!954 = distinct !{!954, !952, !"stzncpy: argument 0"}
!955 = !DILocation(line: 744, column: 24, scope: !866, inlinedAt: !946)
!956 = !DILocation(line: 745, column: 19, scope: !866, inlinedAt: !946)
!957 = !DILocation(line: 745, column: 10, scope: !866, inlinedAt: !946)
!958 = !DILocation(line: 745, column: 13, scope: !866, inlinedAt: !946)
!959 = !DILocation(line: 744, column: 14, scope: !866, inlinedAt: !946)
!960 = distinct !{!960, !948, !956}
!961 = !DILocation(line: 746, column: 9, scope: !866, inlinedAt: !946)
!962 = !DILocation(line: 385, column: 17, scope: !571, inlinedAt: !530)
!963 = !DILocation(line: 386, column: 11, scope: !964, inlinedAt: !530)
!964 = distinct !DILexicalBlock(scope: !571, file: !3, line: 386, column: 11)
!965 = !DILocation(line: 386, column: 11, scope: !571, inlinedAt: !530)
!966 = !DILocation(line: 387, column: 17, scope: !964, inlinedAt: !530)
!967 = !DILocation(line: 387, column: 20, scope: !964, inlinedAt: !530)
!968 = !DILocation(line: 387, column: 9, scope: !964, inlinedAt: !530)
!969 = !DILocation(line: 389, column: 11, scope: !830, inlinedAt: !530)
!970 = !DILocation(line: 389, column: 20, scope: !830, inlinedAt: !530)
!971 = !DILocation(line: 389, column: 23, scope: !830, inlinedAt: !530)
!972 = !DILocation(line: 389, column: 11, scope: !571, inlinedAt: !530)
!973 = !DILocalVariable(name: "host", arg: 1, scope: !825, file: !171, line: 33, type: !49)
!974 = !DILocation(line: 0, scope: !825, inlinedAt: !828)
!975 = !DILocalVariable(name: "host", arg: 1, scope: !170, file: !171, line: 61, type: !49)
!976 = !DILocalVariable(name: "retval", scope: !170, file: !171, line: 63, type: !6)
!977 = !DILocalVariable(name: "res", scope: !170, file: !171, line: 65, type: !205)
!978 = !DILocation(line: 65, column: 20, scope: !170, inlinedAt: !824)
!979 = !DILocation(line: 68, column: 18, scope: !170, inlinedAt: !824)
!980 = !DILocation(line: 69, column: 12, scope: !170, inlinedAt: !824)
!981 = !DILocalVariable(name: "status", scope: !170, file: !171, line: 66, type: !53)
!982 = !DILocation(line: 70, column: 8, scope: !983, inlinedAt: !824)
!983 = distinct !DILexicalBlock(scope: !170, file: !171, line: 70, column: 7)
!984 = !DILocation(line: 70, column: 7, scope: !170, inlinedAt: !824)
!985 = !DILocation(line: 75, column: 24, scope: !986, inlinedAt: !824)
!986 = distinct !DILexicalBlock(scope: !983, file: !171, line: 71, column: 5)
!987 = !DILocation(line: 75, column: 29, scope: !986, inlinedAt: !824)
!988 = !DILocation(line: 75, column: 16, scope: !986, inlinedAt: !824)
!989 = !DILocation(line: 76, column: 19, scope: !990, inlinedAt: !824)
!990 = distinct !DILexicalBlock(scope: !986, file: !171, line: 76, column: 11)
!991 = !DILocation(line: 83, column: 3, scope: !170, inlinedAt: !824)
!992 = !DILocation(line: 393, column: 9, scope: !829, inlinedAt: !530)
!993 = !DILocation(line: 395, column: 13, scope: !994, inlinedAt: !530)
!994 = distinct !DILexicalBlock(scope: !571, file: !3, line: 395, column: 11)
!995 = !DILocation(line: 395, column: 11, scope: !571, inlinedAt: !530)
!996 = !DILocation(line: 398, column: 11, scope: !997, inlinedAt: !530)
!997 = distinct !DILexicalBlock(scope: !571, file: !3, line: 398, column: 11)
!998 = !DILocation(line: 0, scope: !997, inlinedAt: !530)
!999 = !DILocation(line: 398, column: 11, scope: !571, inlinedAt: !530)
!1000 = !DILocation(line: 400, column: 41, scope: !1001, inlinedAt: !530)
!1001 = distinct !DILexicalBlock(scope: !1002, file: !3, line: 400, column: 15)
!1002 = distinct !DILexicalBlock(scope: !997, file: !3, line: 399, column: 9)
!1003 = !DILocation(line: 400, column: 39, scope: !1001, inlinedAt: !530)
!1004 = !DILocation(line: 400, column: 58, scope: !1001, inlinedAt: !530)
!1005 = !DILocation(line: 400, column: 23, scope: !1001, inlinedAt: !530)
!1006 = !DILocation(line: 400, column: 15, scope: !1002, inlinedAt: !530)
!1007 = !DILocation(line: 402, column: 23, scope: !1008, inlinedAt: !530)
!1008 = distinct !DILexicalBlock(scope: !1001, file: !3, line: 401, column: 13)
!1009 = !DILocation(line: 0, scope: !744, inlinedAt: !1010)
!1010 = distinct !DILocation(line: 404, column: 25, scope: !1008, inlinedAt: !530)
!1011 = !DILocation(line: 41, column: 13, scope: !744, inlinedAt: !1010)
!1012 = !DILocation(line: 42, column: 8, scope: !752, inlinedAt: !1010)
!1013 = !DILocation(line: 42, column: 10, scope: !752, inlinedAt: !1010)
!1014 = !DILocation(line: 43, column: 5, scope: !752, inlinedAt: !1010)
!1015 = !DILocation(line: 404, column: 23, scope: !1008, inlinedAt: !530)
!1016 = !DILocation(line: 405, column: 13, scope: !1008, inlinedAt: !530)
!1017 = !DILocation(line: 410, column: 39, scope: !1018, inlinedAt: !530)
!1018 = distinct !DILexicalBlock(scope: !1019, file: !3, line: 410, column: 15)
!1019 = distinct !DILexicalBlock(scope: !997, file: !3, line: 409, column: 9)
!1020 = !DILocation(line: 410, column: 23, scope: !1018, inlinedAt: !530)
!1021 = !DILocation(line: 410, column: 15, scope: !1019, inlinedAt: !530)
!1022 = !DILocation(line: 412, column: 23, scope: !1023, inlinedAt: !530)
!1023 = distinct !DILexicalBlock(scope: !1018, file: !3, line: 411, column: 13)
!1024 = !DILocation(line: 0, scope: !744, inlinedAt: !1025)
!1025 = distinct !DILocation(line: 414, column: 25, scope: !1023, inlinedAt: !530)
!1026 = !DILocation(line: 41, column: 13, scope: !744, inlinedAt: !1025)
!1027 = !DILocation(line: 42, column: 8, scope: !752, inlinedAt: !1025)
!1028 = !DILocation(line: 42, column: 10, scope: !752, inlinedAt: !1025)
!1029 = !DILocation(line: 43, column: 5, scope: !752, inlinedAt: !1025)
!1030 = !DILocation(line: 414, column: 23, scope: !1023, inlinedAt: !530)
!1031 = !DILocation(line: 415, column: 13, scope: !1023, inlinedAt: !530)
!1032 = !DILocation(line: 424, column: 11, scope: !1033, inlinedAt: !530)
!1033 = distinct !DILexicalBlock(scope: !1034, file: !3, line: 424, column: 11)
!1034 = distinct !DILexicalBlock(scope: !572, file: !3, line: 423, column: 5)
!1035 = !DILocation(line: 424, column: 19, scope: !1033, inlinedAt: !530)
!1036 = !DILocation(line: 424, column: 11, scope: !1034, inlinedAt: !530)
!1037 = !DILocation(line: 430, column: 8, scope: !1034, inlinedAt: !530)
!1038 = !DILocation(line: 426, column: 19, scope: !1039, inlinedAt: !530)
!1039 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 425, column: 9)
!1040 = !DILocation(line: 0, scope: !744, inlinedAt: !1041)
!1041 = distinct !DILocation(line: 428, column: 21, scope: !1039, inlinedAt: !530)
!1042 = !DILocation(line: 41, column: 13, scope: !744, inlinedAt: !1041)
!1043 = !DILocation(line: 42, column: 8, scope: !752, inlinedAt: !1041)
!1044 = !DILocation(line: 42, column: 10, scope: !752, inlinedAt: !1041)
!1045 = !DILocation(line: 43, column: 5, scope: !752, inlinedAt: !1041)
!1046 = !DILocation(line: 428, column: 19, scope: !1039, inlinedAt: !530)
!1047 = !DILocation(line: 429, column: 9, scope: !1039, inlinedAt: !530)
!1048 = !DILocation(line: 430, column: 16, scope: !1034, inlinedAt: !530)
!1049 = !DILocation(line: 436, column: 15, scope: !64, inlinedAt: !530)
!1050 = !DILocation(line: 228, column: 14, scope: !125, inlinedAt: !832)
!1051 = !DILocalVariable(name: "t", scope: !125, file: !3, line: 228, type: !9)
!1052 = !DILocation(line: 228, column: 10, scope: !125, inlinedAt: !832)
!1053 = !DILocation(line: 229, column: 20, scope: !125, inlinedAt: !832)
!1054 = !DILocalVariable(name: "tmp", scope: !125, file: !3, line: 229, type: !1055)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !1057, line: 7, size: 448, elements: !1058)
!1057 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h", directory: "")
!1058 = !{!1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !1056, file: !1057, line: 9, baseType: !53, size: 32)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !1056, file: !1057, line: 10, baseType: !53, size: 32, offset: 32)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !1056, file: !1057, line: 11, baseType: !53, size: 32, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !1056, file: !1057, line: 12, baseType: !53, size: 32, offset: 96)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !1056, file: !1057, line: 13, baseType: !53, size: 32, offset: 128)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !1056, file: !1057, line: 14, baseType: !53, size: 32, offset: 160)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !1056, file: !1057, line: 15, baseType: !53, size: 32, offset: 192)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !1056, file: !1057, line: 16, baseType: !53, size: 32, offset: 224)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !1056, file: !1057, line: 17, baseType: !53, size: 32, offset: 256)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !1056, file: !1057, line: 20, baseType: !13, size: 64, offset: 320)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !1056, file: !1057, line: 21, baseType: !49, size: 64, offset: 384)
!1070 = !DILocation(line: 231, column: 7, scope: !1071, inlinedAt: !832)
!1071 = distinct !DILexicalBlock(scope: !125, file: !3, line: 231, column: 7)
!1072 = !DILocation(line: 231, column: 7, scope: !125, inlinedAt: !832)
!1073 = !DILocalVariable(name: "t", arg: 1, scope: !1074, file: !353, line: 690, type: !9)
!1074 = distinct !DISubprogram(name: "timetostr", scope: !353, file: !353, line: 690, type: !1075, scopeLine: 691, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!6, !9, !6}
!1077 = !DILocation(line: 0, scope: !1074, inlinedAt: !1078)
!1078 = distinct !DILocation(line: 237, column: 12, scope: !1071, inlinedAt: !832)
!1079 = !DILocalVariable(name: "buf", arg: 2, scope: !1074, file: !353, line: 690, type: !6)
!1080 = !DILocalVariable(name: "i", arg: 1, scope: !1081, file: !1082, line: 36, type: !310)
!1081 = distinct !DISubprogram(name: "imaxtostr", scope: !1082, file: !1082, line: 36, type: !1083, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !307, retainedNodes: !4)
!1082 = !DIFile(filename: "./lib/anytostr.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!6, !310, !6}
!1085 = !DILocation(line: 0, scope: !1081, inlinedAt: !1086)
!1086 = distinct !DILocation(line: 693, column: 13, scope: !1074, inlinedAt: !1078)
!1087 = !DILocalVariable(name: "buf", arg: 2, scope: !1081, file: !1082, line: 36, type: !6)
!1088 = !DILocalVariable(name: "p", scope: !1081, file: !1082, line: 38, type: !6)
!1089 = !DILocation(line: 39, column: 6, scope: !1081, inlinedAt: !1086)
!1090 = !DILocation(line: 41, column: 9, scope: !1091, inlinedAt: !1086)
!1091 = distinct !DILexicalBlock(scope: !1081, file: !1082, line: 41, column: 7)
!1092 = !DILocation(line: 41, column: 7, scope: !1081, inlinedAt: !1086)
!1093 = !DILocation(line: 693, column: 13, scope: !1074, inlinedAt: !1078)
!1094 = !DILocation(line: 44, column: 24, scope: !1095, inlinedAt: !1086)
!1095 = distinct !DILexicalBlock(scope: !1091, file: !1082, line: 42, column: 5)
!1096 = !DILocation(line: 44, column: 16, scope: !1095, inlinedAt: !1086)
!1097 = !DILocation(line: 44, column: 10, scope: !1095, inlinedAt: !1086)
!1098 = !DILocation(line: 44, column: 14, scope: !1095, inlinedAt: !1086)
!1099 = !DILocation(line: 45, column: 17, scope: !1095, inlinedAt: !1086)
!1100 = !DILocation(line: 45, column: 24, scope: !1095, inlinedAt: !1086)
!1101 = !DILocation(line: 44, column: 9, scope: !1095, inlinedAt: !1086)
!1102 = distinct !{!1102, !1103, !1104}
!1103 = !DILocation(line: 43, column: 7, scope: !1095, inlinedAt: !1086)
!1104 = !DILocation(line: 45, column: 28, scope: !1095, inlinedAt: !1086)
!1105 = !DILocation(line: 47, column: 8, scope: !1095, inlinedAt: !1086)
!1106 = !DILocation(line: 47, column: 12, scope: !1095, inlinedAt: !1086)
!1107 = !DILocation(line: 48, column: 5, scope: !1095, inlinedAt: !1086)
!1108 = !DILocation(line: 52, column: 24, scope: !1109, inlinedAt: !1086)
!1109 = distinct !DILexicalBlock(scope: !1091, file: !1082, line: 50, column: 5)
!1110 = !DILocation(line: 52, column: 16, scope: !1109, inlinedAt: !1086)
!1111 = !DILocation(line: 52, column: 10, scope: !1109, inlinedAt: !1086)
!1112 = !DILocation(line: 52, column: 14, scope: !1109, inlinedAt: !1086)
!1113 = !DILocation(line: 53, column: 17, scope: !1109, inlinedAt: !1086)
!1114 = !DILocation(line: 53, column: 24, scope: !1109, inlinedAt: !1086)
!1115 = !DILocation(line: 52, column: 9, scope: !1109, inlinedAt: !1086)
!1116 = distinct !{!1116, !1117, !1118}
!1117 = !DILocation(line: 51, column: 7, scope: !1109, inlinedAt: !1086)
!1118 = !DILocation(line: 53, column: 28, scope: !1109, inlinedAt: !1086)
!1119 = !DILocation(line: 0, scope: !1071, inlinedAt: !832)
!1120 = !DILocation(line: 238, column: 1, scope: !125, inlinedAt: !832)
!1121 = !DILocation(line: 437, column: 15, scope: !64, inlinedAt: !530)
!1122 = !DILocation(line: 434, column: 3, scope: !64, inlinedAt: !530)
!1123 = !DILocation(line: 438, column: 1, scope: !64, inlinedAt: !530)
!1124 = !DILocation(line: 593, column: 13, scope: !531, inlinedAt: !538)
!1125 = !DILocation(line: 594, column: 20, scope: !560, inlinedAt: !538)
!1126 = !DILocation(line: 594, column: 34, scope: !560, inlinedAt: !538)
!1127 = !DILocation(line: 594, column: 37, scope: !560, inlinedAt: !538)
!1128 = !DILocation(line: 594, column: 20, scope: !531, inlinedAt: !538)
!1129 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !133, file: !3, line: 514, type: !67)
!1130 = !DILocation(line: 0, scope: !133, inlinedAt: !849)
!1131 = !DILocation(line: 517, column: 24, scope: !133, inlinedAt: !849)
!1132 = !DILocation(line: 517, column: 42, scope: !133, inlinedAt: !849)
!1133 = !DILocation(line: 520, column: 8, scope: !1134, inlinedAt: !849)
!1134 = distinct !DILexicalBlock(scope: !133, file: !3, line: 520, column: 7)
!1135 = !DILocation(line: 520, column: 7, scope: !133, inlinedAt: !849)
!1136 = !DILocation(line: 521, column: 35, scope: !1134, inlinedAt: !849)
!1137 = !DILocation(line: 521, column: 27, scope: !1134, inlinedAt: !849)
!1138 = !DILocation(line: 521, column: 51, scope: !1134, inlinedAt: !849)
!1139 = !DILocation(line: 0, scope: !744, inlinedAt: !1140)
!1140 = distinct !DILocation(line: 521, column: 18, scope: !1134, inlinedAt: !849)
!1141 = !DILocation(line: 41, column: 13, scope: !744, inlinedAt: !1140)
!1142 = !DILocation(line: 42, column: 8, scope: !752, inlinedAt: !1140)
!1143 = !DILocation(line: 42, column: 15, scope: !752, inlinedAt: !1140)
!1144 = !DILocation(line: 42, column: 10, scope: !752, inlinedAt: !1140)
!1145 = !DILocation(line: 43, column: 5, scope: !752, inlinedAt: !1140)
!1146 = !DILocation(line: 521, column: 16, scope: !1134, inlinedAt: !849)
!1147 = !DILocation(line: 521, column: 5, scope: !1134, inlinedAt: !849)
!1148 = !DILocation(line: 524, column: 8, scope: !1149, inlinedAt: !849)
!1149 = distinct !DILexicalBlock(scope: !133, file: !3, line: 524, column: 7)
!1150 = !DILocation(line: 524, column: 7, scope: !133, inlinedAt: !849)
!1151 = !DILocation(line: 525, column: 32, scope: !1149, inlinedAt: !849)
!1152 = !DILocation(line: 525, column: 24, scope: !1149, inlinedAt: !849)
!1153 = !DILocation(line: 525, column: 44, scope: !1149, inlinedAt: !849)
!1154 = !DILocation(line: 0, scope: !744, inlinedAt: !1155)
!1155 = distinct !DILocation(line: 525, column: 15, scope: !1149, inlinedAt: !849)
!1156 = !DILocation(line: 41, column: 13, scope: !744, inlinedAt: !1155)
!1157 = !DILocation(line: 42, column: 8, scope: !752, inlinedAt: !1155)
!1158 = !DILocation(line: 42, column: 15, scope: !752, inlinedAt: !1155)
!1159 = !DILocation(line: 42, column: 10, scope: !752, inlinedAt: !1155)
!1160 = !DILocation(line: 43, column: 5, scope: !752, inlinedAt: !1155)
!1161 = !DILocation(line: 525, column: 13, scope: !1149, inlinedAt: !849)
!1162 = !DILocation(line: 525, column: 5, scope: !1149, inlinedAt: !849)
!1163 = !DILocation(line: 526, column: 42, scope: !133, inlinedAt: !849)
!1164 = !DILocation(line: 528, column: 44, scope: !133, inlinedAt: !849)
!1165 = !DILocation(line: 228, column: 14, scope: !125, inlinedAt: !848)
!1166 = !DILocation(line: 228, column: 10, scope: !125, inlinedAt: !848)
!1167 = !DILocation(line: 229, column: 20, scope: !125, inlinedAt: !848)
!1168 = !DILocation(line: 231, column: 7, scope: !1071, inlinedAt: !848)
!1169 = !DILocation(line: 231, column: 7, scope: !125, inlinedAt: !848)
!1170 = !DILocation(line: 0, scope: !1074, inlinedAt: !1171)
!1171 = distinct !DILocation(line: 237, column: 12, scope: !1071, inlinedAt: !848)
!1172 = !DILocation(line: 0, scope: !1081, inlinedAt: !1173)
!1173 = distinct !DILocation(line: 693, column: 13, scope: !1074, inlinedAt: !1171)
!1174 = !DILocation(line: 39, column: 6, scope: !1081, inlinedAt: !1173)
!1175 = !DILocation(line: 41, column: 9, scope: !1091, inlinedAt: !1173)
!1176 = !DILocation(line: 41, column: 7, scope: !1081, inlinedAt: !1173)
!1177 = !DILocation(line: 693, column: 13, scope: !1074, inlinedAt: !1171)
!1178 = !DILocation(line: 44, column: 24, scope: !1095, inlinedAt: !1173)
!1179 = !DILocation(line: 44, column: 16, scope: !1095, inlinedAt: !1173)
!1180 = !DILocation(line: 44, column: 10, scope: !1095, inlinedAt: !1173)
!1181 = !DILocation(line: 44, column: 14, scope: !1095, inlinedAt: !1173)
!1182 = !DILocation(line: 45, column: 17, scope: !1095, inlinedAt: !1173)
!1183 = !DILocation(line: 45, column: 24, scope: !1095, inlinedAt: !1173)
!1184 = !DILocation(line: 44, column: 9, scope: !1095, inlinedAt: !1173)
!1185 = distinct !{!1185, !1186, !1187}
!1186 = !DILocation(line: 43, column: 7, scope: !1095, inlinedAt: !1173)
!1187 = !DILocation(line: 45, column: 28, scope: !1095, inlinedAt: !1173)
!1188 = !DILocation(line: 47, column: 8, scope: !1095, inlinedAt: !1173)
!1189 = !DILocation(line: 47, column: 12, scope: !1095, inlinedAt: !1173)
!1190 = !DILocation(line: 48, column: 5, scope: !1095, inlinedAt: !1173)
