; ModuleID = '<stdin>'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.addrinfo = type { i32, i32, i32, i32, i32, %struct.sockaddr*, i8*, %struct.addrinfo* }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.utmpx = type { i16, i32, [32 x i8], [4 x i8], [32 x i8], [256 x i8], %struct.__exit_status, i32, %struct.anon, [4 x i32], [20 x i8] }
%struct.__exit_status = type { i16, i16 }
%struct.anon = type { i32, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }


!10 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !12, line: 160, baseType: !13)
!12 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!13 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!14 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!15 = !{!16, !19, !21, !23, !25, !27, !29, !31, !33, !35, !37, !39, !41, !43, !45, !47, !51, !0, !54, !62, !108, !113, !118, !123, !131, !136, !138}
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "do_lookup", scope: !2, file: !3, line: 102, type: !18, isLocal: true, isDefinition: true)
!18 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "short_list", scope: !2, file: !3, line: 107, type: !18, isLocal: true, isDefinition: true)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "short_output", scope: !2, file: !3, line: 110, type: !18, isLocal: true, isDefinition: true)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "include_idle", scope: !2, file: !3, line: 115, type: !18, isLocal: true, isDefinition: true)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "include_heading", scope: !2, file: !3, line: 118, type: !18, isLocal: true, isDefinition: true)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "include_mesg", scope: !2, file: !3, line: 122, type: !18, isLocal: true, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "include_exit", scope: !2, file: !3, line: 125, type: !18, isLocal: true, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "need_boottime", scope: !2, file: !3, line: 128, type: !18, isLocal: true, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "need_deadprocs", scope: !2, file: !3, line: 131, type: !18, isLocal: true, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "need_login", scope: !2, file: !3, line: 134, type: !18, isLocal: true, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "need_initspawn", scope: !2, file: !3, line: 137, type: !18, isLocal: true, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "need_clockchange", scope: !2, file: !3, line: 140, type: !18, isLocal: true, isDefinition: true)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "need_runlevel", scope: !2, file: !3, line: 143, type: !18, isLocal: true, isDefinition: true)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "need_users", scope: !2, file: !3, line: 146, type: !18, isLocal: true, isDefinition: true)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "my_line_only", scope: !2, file: !3, line: 149, type: !18, isLocal: true, isDefinition: true)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "time_format", scope: !2, file: !3, line: 153, type: !49, isLocal: true, isDefinition: true)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "time_format_width", scope: !2, file: !3, line: 154, type: !53, isLocal: true, isDefinition: true)
!53 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "mesg", scope: !56, file: !3, line: 249, type: !59, isLocal: true, isDefinition: true)
!56 = distinct !DISubprogram(name: "print_line", scope: !3, file: !3, line: 244, type: !57, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!57 = !DISubroutineType(types: !58)
!58 = !{null, !53, !49, !50, !53, !49, !49, !49, !49, !49, !49}
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 24, elements: !60)
!60 = !{!61}
!61 = !DISubrange(count: 3)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "hoststr", scope: !64, file: !3, line: 339, type: !6, isLocal: true, isDefinition: true)
!64 = distinct !DISubprogram(name: "print_user", scope: !3, file: !3, line: 333, type: !65, scopeLine: 334, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!65 = !DISubroutineType(types: !66)
!66 = !{null, !67, !9}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !70, line: 146, baseType: !71)
!70 = !DIFile(filename: "./lib/readutmp.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !72, line: 55, size: 3072, elements: !73)
!72 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/utmpx.h", directory: "")
!73 = !{!74, !75, !77, !81, !85, !86, !90, !95, !97, !102, !104}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !71, file: !72, line: 57, baseType: !14, size: 16)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !71, file: !72, line: 58, baseType: !76, size: 32, offset: 32)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !12, line: 154, baseType: !53)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !71, file: !72, line: 59, baseType: !78, size: 256, offset: 64)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !71, file: !72, line: 61, baseType: !82, size: 32, offset: 320)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 4)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !71, file: !72, line: 63, baseType: !78, size: 256, offset: 352)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !71, file: !72, line: 65, baseType: !87, size: 2048, offset: 608)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 2048, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 256)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !71, file: !72, line: 67, baseType: !91, size: 32, offset: 2656)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !72, line: 42, size: 32, elements: !92)
!92 = !{!93, !94}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !91, file: !72, line: 45, baseType: !14, size: 16)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !91, file: !72, line: 46, baseType: !14, size: 16, offset: 16)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !71, file: !72, line: 74, baseType: !96, size: 32, offset: 2688)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !12, line: 41, baseType: !53)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !71, file: !72, line: 79, baseType: !98, size: 64, offset: 2720)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !71, file: !72, line: 75, size: 64, elements: !99)
!99 = !{!100, !101}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !98, file: !72, line: 77, baseType: !96, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !98, file: !72, line: 78, baseType: !96, size: 32, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !71, file: !72, line: 84, baseType: !103, size: 128, offset: 2784)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 128, elements: !83)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !71, file: !72, line: 85, baseType: !105, size: 160, offset: 2912)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 160, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 20)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "hostlen", scope: !64, file: !3, line: 341, type: !110, isLocal: true, isDefinition: true)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !111, line: 46, baseType: !112)
!111 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.1/include/stddef.h", directory: "")
!112 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "now", scope: !115, file: !3, line: 190, type: !9, isLocal: true, isDefinition: true)
!115 = distinct !DISubprogram(name: "idle_string", scope: !3, file: !3, line: 188, type: !116, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!116 = !DISubroutineType(types: !117)
!117 = !{!49, !9, !9}
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "idle_hhmm", scope: !115, file: !3, line: 202, type: !120, isLocal: true, isDefinition: true)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 48, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 6)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "buf", scope: !125, file: !3, line: 220, type: !128, isLocal: true, isDefinition: true)
!125 = distinct !DISubprogram(name: "time_string", scope: !3, file: !3, line: 218, type: !126, scopeLine: 219, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!126 = !DISubroutineType(types: !127)
!127 = !{!49, !67}
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 264, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 33)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "runlevline", scope: !133, file: !3, line: 516, type: !6, isLocal: true, isDefinition: true)
!133 = distinct !DISubprogram(name: "print_runlevel", scope: !3, file: !3, line: 514, type: !134, scopeLine: 515, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!134 = !DISubroutineType(types: !135)
!135 = !{null, !67}
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "comment", scope: !133, file: !3, line: 516, type: !6, isLocal: true, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "exitstr", scope: !140, file: !3, line: 461, type: !6, isLocal: true, isDefinition: true)
!140 = distinct !DISubprogram(name: "print_deadprocs", scope: !3, file: !3, line: 459, type: !134, scopeLine: 460, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 4608, elements: !151)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !144, line: 50, size: 256, elements: !145)
!144 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "")
!145 = !{!146, !147, !148, !150}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !143, file: !144, line: 52, baseType: !49, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !143, file: !144, line: 55, baseType: !53, size: 32, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !143, file: !144, line: 56, baseType: !149, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !143, file: !144, line: 57, baseType: !53, size: 32, offset: 192)
!151 = !{!152}
!152 = !DISubrange(count: 18)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "Version", scope: !155, file: !156, line: 2, type: !49, isLocal: false, isDefinition: true)
!155 = distinct !DICompileUnit(language: DW_LANG_C99, file: !156, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !157, nameTableKind: None)
!156 = !DIFile(filename: "src/version.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!157 = !{!153}
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "last_cherror", scope: !160, file: !166, line: 28, type: !53, isLocal: true, isDefinition: true)
!160 = distinct !DICompileUnit(language: DW_LANG_C99, file: !161, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !162, nameTableKind: None)
!161 = !DIFile(filename: "./lib/canon-host.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!162 = !{!163, !158}
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "hints", scope: !165, file: !166, line: 64, type: !169, isLocal: true, isDefinition: true)
!165 = distinct !DISubprogram(name: "canon_host_r", scope: !166, file: !166, line: 61, type: !167, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !160, retainedNodes: !4)
!166 = !DIFile(filename: "lib/canon-host.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!167 = !DISubroutineType(types: !168)
!168 = !{!6, !49, !149}
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !170, line: 565, size: 384, elements: !171)
!170 = !DIFile(filename: "/usr/include/netdb.h", directory: "")
!171 = !{!172, !173, !174, !175, !176, !181, !193, !194}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !169, file: !170, line: 567, baseType: !53, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !169, file: !170, line: 568, baseType: !53, size: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !169, file: !170, line: 569, baseType: !53, size: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !169, file: !170, line: 570, baseType: !53, size: 32, offset: 96)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !169, file: !170, line: 571, baseType: !177, size: 32, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !178, line: 33, baseType: !179)
!178 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "")
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !12, line: 209, baseType: !180)
!180 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !169, file: !170, line: 572, baseType: !182, size: 64, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !178, line: 178, size: 128, elements: !184)
!184 = !{!185, !189}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !183, file: !178, line: 180, baseType: !186, size: 16)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !187, line: 28, baseType: !188)
!187 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "")
!188 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !183, file: !178, line: 181, baseType: !190, size: 112, offset: 16)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 112, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 14)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !169, file: !170, line: 573, baseType: !6, size: 64, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !169, file: !170, line: 574, baseType: !195, size: 64, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !198, file: !203, line: 56, type: !18, isLocal: true, isDefinition: true)
!198 = distinct !DICompileUnit(language: DW_LANG_C99, file: !199, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !200, nameTableKind: None)
!199 = !DIFile(filename: "./lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!200 = !{!201, !196}
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "file_name", scope: !198, file: !203, line: 46, type: !49, isLocal: true, isDefinition: true)
!203 = !DIFile(filename: "lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "exit_failure", scope: !206, file: !209, line: 24, type: !210, isLocal: false, isDefinition: true)
!206 = distinct !DICompileUnit(language: DW_LANG_C99, file: !207, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !208, nameTableKind: None)
!207 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!208 = !{!204}
!209 = !DIFile(filename: "lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!210 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !53)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "program_name", scope: !213, file: !217, line: 33, type: !49, isLocal: false, isDefinition: true)
!213 = distinct !DICompileUnit(language: DW_LANG_C99, file: !214, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !215, globals: !216, nameTableKind: None)
!214 = !DIFile(filename: "./lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!215 = !{!8, !6}
!216 = !{!211}
!217 = !DIFile(filename: "lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !220, file: !241, line: 116, type: !254, isLocal: true, isDefinition: true)
!220 = distinct !DICompileUnit(language: DW_LANG_C99, file: !221, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !222, retainedTypes: !237, globals: !238, nameTableKind: None)
!221 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!222 = !{!223}
!223 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !224, line: 32, baseType: !180, size: 32, elements: !225)
!224 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!225 = !{!226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236}
!226 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!227 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!228 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!229 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!230 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!231 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!232 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!233 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!234 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!235 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!236 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!237 = !{!53, !188, !110}
!238 = !{!239, !246, !252, !218, !264, !266, !273, !275}
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !220, file: !241, line: 85, type: !242, isLocal: false, isDefinition: true)
!241 = !DIFile(filename: "lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 704, elements: !244)
!243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!244 = !{!245}
!245 = !DISubrange(count: 11)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !220, file: !241, line: 101, type: !248, isLocal: false, isDefinition: true)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 320, elements: !250)
!249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !223)
!250 = !{!251}
!251 = !DISubrange(count: 10)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !220, file: !241, line: 1052, type: !254, isLocal: false, isDefinition: true)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !241, line: 65, size: 448, elements: !255)
!255 = !{!256, !257, !258, !262, !263}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !254, file: !241, line: 68, baseType: !223, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !254, file: !241, line: 71, baseType: !53, size: 32, offset: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !254, file: !241, line: 75, baseType: !259, size: 256, offset: 64)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 256, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 8)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !254, file: !241, line: 78, baseType: !49, size: 64, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !254, file: !241, line: 81, baseType: !49, size: 64, offset: 384)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "slot0", scope: !220, file: !241, line: 842, type: !87, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "slotvec", scope: !220, file: !241, line: 845, type: !268, isLocal: true, isDefinition: true)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !241, line: 834, size: 128, elements: !270)
!270 = !{!271, !272}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !269, file: !241, line: 836, baseType: !110, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !269, file: !241, line: 837, baseType: !6, size: 64, offset: 64)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "nslots", scope: !220, file: !241, line: 843, type: !53, isLocal: true, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "slotvec0", scope: !220, file: !241, line: 844, type: !269, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !279, file: !282, line: 26, type: !283, isLocal: false, isDefinition: true)
!279 = distinct !DICompileUnit(language: DW_LANG_C99, file: !280, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !281, nameTableKind: None)
!280 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!281 = !{!277}
!282 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 376, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 47)
!286 = distinct !DICompileUnit(language: DW_LANG_C99, file: !287, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!287 = !DIFile(filename: "./lib/c-ctype.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!288 = distinct !DICompileUnit(language: DW_LANG_C99, file: !289, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!289 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!290 = distinct !DICompileUnit(language: DW_LANG_C99, file: !291, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !292, nameTableKind: None)
!291 = !DIFile(filename: "./lib/imaxtostr.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!292 = !{!293}
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !294, line: 101, baseType: !295)
!294 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !12, line: 72, baseType: !13)
!296 = distinct !DICompileUnit(language: DW_LANG_C99, file: !297, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !298, nameTableKind: None)
!297 = !DIFile(filename: "./lib/setlocale_null.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!298 = !{!8}
!299 = distinct !DICompileUnit(language: DW_LANG_C99, file: !300, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !298, nameTableKind: None)
!300 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!301 = distinct !DICompileUnit(language: DW_LANG_C99, file: !302, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !303, nameTableKind: None)
!302 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!303 = !{!110, !6, !8}
!304 = distinct !DICompileUnit(language: DW_LANG_C99, file: !305, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!305 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!306 = distinct !DICompileUnit(language: DW_LANG_C99, file: !307, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !308, nameTableKind: None)
!307 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!308 = !{!110}
!309 = distinct !DICompileUnit(language: DW_LANG_C99, file: !310, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !311, nameTableKind: None)
!310 = !DIFile(filename: "./lib/readutmp.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!311 = !{!6, !8}
!312 = distinct !DICompileUnit(language: DW_LANG_C99, file: !313, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !314, nameTableKind: None)
!313 = !DIFile(filename: "./lib/c-strcasecmp.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!314 = !{!315}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !317)
!317 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!318 = distinct !DICompileUnit(language: DW_LANG_C99, file: !319, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!319 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!320 = distinct !DICompileUnit(language: DW_LANG_C99, file: !321, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !298, nameTableKind: None)
!321 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!322 = distinct !DICompileUnit(language: DW_LANG_C99, file: !323, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!323 = !DIFile(filename: "./lib/fclose.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!324 = distinct !DICompileUnit(language: DW_LANG_C99, file: !325, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !298, nameTableKind: None)
!325 = !DIFile(filename: "./lib/fflush.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!326 = distinct !DICompileUnit(language: DW_LANG_C99, file: !327, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !298, nameTableKind: None)
!327 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!328 = !{!"clang version 9.0.1-12 "}
!329 = !{i32 2, !"Dwarf Version", i32 4}
!330 = !{i32 2, !"Debug Info Version", i32 3}
!331 = !{i32 1, !"wchar_size", i32 4}
!332 = !{i32 1, !"ThinLTO", i32 0}
!333 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!334 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 638, type: !335, scopeLine: 639, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !53}
!337 = !DILocalVariable(name: "status", arg: 1, scope: !334, file: !3, line: 638, type: !53)
!338 = !DILocation(line: 638, column: 12, scope: !334)
!339 = !DILocation(line: 640, column: 7, scope: !340)
!340 = distinct !DILexicalBlock(scope: !334, file: !3, line: 640, column: 7)
!341 = !DILocation(line: 640, column: 14, scope: !340)
!342 = !DILocation(line: 640, column: 7, scope: !334)
!343 = !DILocation(line: 641, column: 5, scope: !340)
!344 = !DILocation(line: 641, column: 5, scope: !345)
!345 = distinct !DILexicalBlock(scope: !340, file: !3, line: 641, column: 5)
!346 = !DILocation(line: 644, column: 15, scope: !347)
!347 = distinct !DILexicalBlock(scope: !340, file: !3, line: 643, column: 5)
!348 = !DILocation(line: 644, column: 66, scope: !347)
!349 = !DILocation(line: 644, column: 7, scope: !347)
!350 = !DILocation(line: 645, column: 7, scope: !347)
!351 = !DILocation(line: 648, column: 7, scope: !347)
!352 = !DILocation(line: 655, column: 7, scope: !347)
!353 = !DILocation(line: 658, column: 7, scope: !347)
!354 = !DILocation(line: 663, column: 7, scope: !347)
!355 = !DILocation(line: 669, column: 7, scope: !347)
!356 = !DILocation(line: 675, column: 7, scope: !347)
!357 = !DILocation(line: 676, column: 7, scope: !347)
!358 = !DILocation(line: 677, column: 15, scope: !347)
!359 = !DILocation(line: 677, column: 7, scope: !347)
!360 = !DILocation(line: 682, column: 7, scope: !347)
!361 = !DILocation(line: 684, column: 9, scope: !334)
!362 = !DILocation(line: 684, column: 3, scope: !334)
!363 = !DILocalVariable(name: "status", arg: 1, scope: !364, file: !3, line: 638, type: !53)
!364 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 638, type: !335, scopeLine: 639, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !365, retainedNodes: !4)
!365 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !366, nameTableKind: None)
!366 = !{!367, !369, !371, !373, !375, !377, !379, !381, !383, !385, !387, !389, !391, !393, !395, !397, !399, !401, !411, !414, !443, !445, !448, !450, !455, !460, !462}
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "do_lookup", scope: !365, file: !3, line: 102, type: !18, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "short_list", scope: !365, file: !3, line: 107, type: !18, isLocal: true, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "short_output", scope: !365, file: !3, line: 110, type: !18, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "include_idle", scope: !365, file: !3, line: 115, type: !18, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "include_heading", scope: !365, file: !3, line: 118, type: !18, isLocal: true, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "include_mesg", scope: !365, file: !3, line: 122, type: !18, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "include_exit", scope: !365, file: !3, line: 125, type: !18, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "need_boottime", scope: !365, file: !3, line: 128, type: !18, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "need_deadprocs", scope: !365, file: !3, line: 131, type: !18, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "need_login", scope: !365, file: !3, line: 134, type: !18, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "need_initspawn", scope: !365, file: !3, line: 137, type: !18, isLocal: true, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "need_clockchange", scope: !365, file: !3, line: 140, type: !18, isLocal: true, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "need_runlevel", scope: !365, file: !3, line: 143, type: !18, isLocal: true, isDefinition: true)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "need_users", scope: !365, file: !3, line: 146, type: !18, isLocal: true, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "my_line_only", scope: !365, file: !3, line: 149, type: !18, isLocal: true, isDefinition: true)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "time_format", scope: !365, file: !3, line: 153, type: !49, isLocal: true, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "time_format_width", scope: !365, file: !3, line: 154, type: !53, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "longopts", scope: !365, file: !3, line: 162, type: !403, isLocal: true, isDefinition: true)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 4608, elements: !151)
!404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !144, line: 50, size: 256, elements: !406)
!406 = !{!407, !408, !409, !410}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !405, file: !144, line: 52, baseType: !49, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !405, file: !144, line: 55, baseType: !53, size: 32, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !405, file: !144, line: 56, baseType: !149, size: 64, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !405, file: !144, line: 57, baseType: !53, size: 32, offset: 192)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "mesg", scope: !413, file: !3, line: 249, type: !59, isLocal: true, isDefinition: true)
!413 = distinct !DISubprogram(name: "print_line", scope: !3, file: !3, line: 244, type: !57, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !365, retainedNodes: !4)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "hoststr", scope: !416, file: !3, line: 339, type: !6, isLocal: true, isDefinition: true)
!416 = distinct !DISubprogram(name: "print_user", scope: !3, file: !3, line: 333, type: !417, scopeLine: 334, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !365, retainedNodes: !4)
!417 = !DISubroutineType(types: !418)
!418 = !{null, !419, !9}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !421)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !70, line: 146, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !72, line: 55, size: 3072, elements: !423)
!423 = !{!424, !425, !426, !427, !428, !429, !430, !435, !436, !441, !442}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !422, file: !72, line: 57, baseType: !14, size: 16)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !422, file: !72, line: 58, baseType: !76, size: 32, offset: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !422, file: !72, line: 59, baseType: !78, size: 256, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !422, file: !72, line: 61, baseType: !82, size: 32, offset: 320)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !422, file: !72, line: 63, baseType: !78, size: 256, offset: 352)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !422, file: !72, line: 65, baseType: !87, size: 2048, offset: 608)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !422, file: !72, line: 67, baseType: !431, size: 32, offset: 2656)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !72, line: 42, size: 32, elements: !432)
!432 = !{!433, !434}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !431, file: !72, line: 45, baseType: !14, size: 16)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !431, file: !72, line: 46, baseType: !14, size: 16, offset: 16)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !422, file: !72, line: 74, baseType: !96, size: 32, offset: 2688)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !422, file: !72, line: 79, baseType: !437, size: 64, offset: 2720)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !422, file: !72, line: 75, size: 64, elements: !438)
!438 = !{!439, !440}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !437, file: !72, line: 77, baseType: !96, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !437, file: !72, line: 78, baseType: !96, size: 32, offset: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !422, file: !72, line: 84, baseType: !103, size: 128, offset: 2784)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !422, file: !72, line: 85, baseType: !105, size: 160, offset: 2912)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "hostlen", scope: !416, file: !3, line: 341, type: !110, isLocal: true, isDefinition: true)
!445 = !DIGlobalVariableExpression(var: !446, expr: !DIExpression())
!446 = distinct !DIGlobalVariable(name: "now", scope: !447, file: !3, line: 190, type: !9, isLocal: true, isDefinition: true)
!447 = distinct !DISubprogram(name: "idle_string", scope: !3, file: !3, line: 188, type: !116, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !365, retainedNodes: !4)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "idle_hhmm", scope: !447, file: !3, line: 202, type: !120, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "buf", scope: !452, file: !3, line: 220, type: !128, isLocal: true, isDefinition: true)
!452 = distinct !DISubprogram(name: "time_string", scope: !3, file: !3, line: 218, type: !453, scopeLine: 219, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !365, retainedNodes: !4)
!453 = !DISubroutineType(types: !454)
!454 = !{!49, !419}
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "runlevline", scope: !457, file: !3, line: 516, type: !6, isLocal: true, isDefinition: true)
!457 = distinct !DISubprogram(name: "print_runlevel", scope: !3, file: !3, line: 514, type: !458, scopeLine: 515, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !365, retainedNodes: !4)
!458 = !DISubroutineType(types: !459)
!459 = !{null, !419}
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "comment", scope: !457, file: !3, line: 516, type: !6, isLocal: true, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "exitstr", scope: !464, file: !3, line: 461, type: !6, isLocal: true, isDefinition: true)
!464 = distinct !DISubprogram(name: "print_deadprocs", scope: !3, file: !3, line: 459, type: !458, scopeLine: 460, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !365, retainedNodes: !4)
!465 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !466, file: !466, line: 634, type: !467, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!466 = !DIFile(filename: "src/system.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!467 = !DISubroutineType(types: !468)
!468 = !{null, !49}
!469 = !DILocalVariable(name: "program", arg: 1, scope: !465, file: !466, line: 634, type: !49)
!470 = !DILocation(line: 634, column: 34, scope: !465)
!471 = !DILocalVariable(name: "infomap", scope: !465, file: !466, line: 636, type: !472)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 896, elements: !478)
!473 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !465, file: !466, line: 636, size: 128, elements: !475)
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !474, file: !466, line: 636, baseType: !49, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !474, file: !466, line: 636, baseType: !49, size: 64, offset: 64)
!478 = !{!479}
!479 = !DISubrange(count: 7)
!480 = !DILocation(line: 636, column: 67, scope: !465)
!481 = !DILocalVariable(name: "node", scope: !465, file: !466, line: 646, type: !49)
!482 = !DILocation(line: 646, column: 15, scope: !465)
!483 = !DILocation(line: 646, column: 22, scope: !465)
!484 = !DILocalVariable(name: "map_prog", scope: !465, file: !466, line: 647, type: !485)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!486 = !DILocation(line: 647, column: 25, scope: !465)
!487 = !DILocation(line: 647, column: 36, scope: !465)
!488 = !DILocation(line: 649, column: 3, scope: !465)
!489 = !DILocation(line: 649, column: 10, scope: !465)
!490 = !DILocation(line: 649, column: 20, scope: !465)
!491 = !DILocation(line: 649, column: 28, scope: !465)
!492 = !DILocation(line: 649, column: 33, scope: !465)
!493 = !DILocation(line: 649, column: 31, scope: !465)
!494 = !DILocation(line: 0, scope: !465)
!495 = !DILocation(line: 650, column: 13, scope: !465)
!496 = distinct !{!496, !488, !495}
!497 = !DILocation(line: 652, column: 7, scope: !498)
!498 = distinct !DILexicalBlock(scope: !465, file: !466, line: 652, column: 7)
!499 = !DILocation(line: 652, column: 17, scope: !498)
!500 = !DILocation(line: 652, column: 7, scope: !465)
!501 = !DILocation(line: 653, column: 12, scope: !498)
!502 = !DILocation(line: 653, column: 22, scope: !498)
!503 = !DILocation(line: 653, column: 10, scope: !498)
!504 = !DILocation(line: 653, column: 5, scope: !498)
!505 = !DILocation(line: 655, column: 11, scope: !465)
!506 = !DILocation(line: 655, column: 3, scope: !465)
!507 = !DILocalVariable(name: "lc_messages", scope: !465, file: !466, line: 659, type: !49)
!508 = !DILocation(line: 659, column: 15, scope: !465)
!509 = !DILocation(line: 659, column: 29, scope: !465)
!510 = !DILocation(line: 660, column: 7, scope: !511)
!511 = distinct !DILexicalBlock(scope: !465, file: !466, line: 660, column: 7)
!512 = !DILocation(line: 660, column: 19, scope: !511)
!513 = !DILocation(line: 660, column: 22, scope: !511)
!514 = !DILocation(line: 660, column: 7, scope: !465)
!515 = !DILocation(line: 666, column: 7, scope: !516)
!516 = distinct !DILexicalBlock(scope: !511, file: !466, line: 661, column: 5)
!517 = !DILocation(line: 668, column: 5, scope: !516)
!518 = !DILocation(line: 669, column: 11, scope: !465)
!519 = !DILocation(line: 670, column: 24, scope: !465)
!520 = !DILocation(line: 669, column: 3, scope: !465)
!521 = !DILocation(line: 671, column: 11, scope: !465)
!522 = !DILocation(line: 672, column: 11, scope: !465)
!523 = !DILocation(line: 672, column: 17, scope: !465)
!524 = !DILocation(line: 672, column: 25, scope: !465)
!525 = !DILocation(line: 672, column: 22, scope: !465)
!526 = !DILocation(line: 671, column: 3, scope: !465)
!527 = !DILocation(line: 673, column: 1, scope: !465)
!528 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 688, type: !529, scopeLine: 689, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!529 = !DISubroutineType(types: !530)
!530 = !{!53, !53, !531}
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!532 = !DILocalVariable(name: "argc", arg: 1, scope: !528, file: !3, line: 688, type: !53)
!533 = !DILocation(line: 688, column: 11, scope: !528)
!534 = !DILocalVariable(name: "argv", arg: 2, scope: !528, file: !3, line: 688, type: !531)
!535 = !DILocation(line: 688, column: 24, scope: !528)
!536 = !DILocalVariable(name: "optc", scope: !528, file: !3, line: 690, type: !53)
!537 = !DILocation(line: 690, column: 7, scope: !528)
!538 = !DILocalVariable(name: "assumptions", scope: !528, file: !3, line: 691, type: !18)
!539 = !DILocation(line: 691, column: 8, scope: !528)
!540 = !DILocation(line: 694, column: 21, scope: !528)
!541 = !DILocation(line: 694, column: 3, scope: !528)
!542 = !DILocation(line: 695, column: 3, scope: !528)
!543 = !DILocation(line: 696, column: 3, scope: !528)
!544 = !DILocation(line: 697, column: 3, scope: !528)
!545 = !DILocation(line: 699, column: 3, scope: !528)
!546 = !DILocation(line: 701, column: 3, scope: !528)
!547 = !DILocation(line: 701, column: 31, scope: !528)
!548 = !DILocation(line: 701, column: 37, scope: !528)
!549 = !DILocation(line: 701, column: 18, scope: !528)
!550 = !DILocation(line: 701, column: 16, scope: !528)
!551 = !DILocation(line: 702, column: 10, scope: !528)
!552 = !DILocation(line: 704, column: 15, scope: !553)
!553 = distinct !DILexicalBlock(scope: !528, file: !3, line: 703, column: 5)
!554 = !DILocation(line: 704, column: 7, scope: !553)
!555 = !DILocation(line: 707, column: 25, scope: !556)
!556 = distinct !DILexicalBlock(scope: !553, file: !3, line: 705, column: 9)
!557 = !DILocation(line: 708, column: 26, scope: !556)
!558 = !DILocation(line: 709, column: 22, scope: !556)
!559 = !DILocation(line: 710, column: 26, scope: !556)
!560 = !DILocation(line: 711, column: 25, scope: !556)
!561 = !DILocation(line: 712, column: 28, scope: !556)
!562 = !DILocation(line: 713, column: 22, scope: !556)
!563 = !DILocation(line: 714, column: 24, scope: !556)
!564 = !DILocation(line: 715, column: 24, scope: !556)
!565 = !DILocation(line: 716, column: 24, scope: !556)
!566 = !DILocation(line: 717, column: 23, scope: !556)
!567 = !DILocation(line: 718, column: 11, scope: !556)
!568 = !DILocation(line: 721, column: 25, scope: !556)
!569 = !DILocation(line: 722, column: 23, scope: !556)
!570 = !DILocation(line: 723, column: 11, scope: !556)
!571 = !DILocation(line: 726, column: 26, scope: !556)
!572 = !DILocation(line: 727, column: 24, scope: !556)
!573 = !DILocation(line: 728, column: 24, scope: !556)
!574 = !DILocation(line: 729, column: 23, scope: !556)
!575 = !DILocation(line: 730, column: 11, scope: !556)
!576 = !DILocation(line: 733, column: 27, scope: !556)
!577 = !DILocation(line: 734, column: 11, scope: !556)
!578 = !DILocation(line: 737, column: 22, scope: !556)
!579 = !DILocation(line: 738, column: 24, scope: !556)
!580 = !DILocation(line: 739, column: 23, scope: !556)
!581 = !DILocation(line: 740, column: 11, scope: !556)
!582 = !DILocation(line: 743, column: 24, scope: !556)
!583 = !DILocation(line: 744, column: 11, scope: !556)
!584 = !DILocation(line: 747, column: 26, scope: !556)
!585 = !DILocation(line: 748, column: 23, scope: !556)
!586 = !DILocation(line: 749, column: 11, scope: !556)
!587 = !DILocation(line: 752, column: 22, scope: !556)
!588 = !DILocation(line: 753, column: 11, scope: !556)
!589 = !DILocation(line: 756, column: 25, scope: !556)
!590 = !DILocation(line: 757, column: 24, scope: !556)
!591 = !DILocation(line: 758, column: 23, scope: !556)
!592 = !DILocation(line: 759, column: 11, scope: !556)
!593 = !DILocation(line: 762, column: 24, scope: !556)
!594 = !DILocation(line: 763, column: 11, scope: !556)
!595 = !DILocation(line: 766, column: 28, scope: !556)
!596 = !DILocation(line: 767, column: 23, scope: !556)
!597 = !DILocation(line: 768, column: 11, scope: !556)
!598 = !DILocation(line: 772, column: 24, scope: !556)
!599 = !DILocation(line: 773, column: 11, scope: !556)
!600 = !DILocation(line: 776, column: 22, scope: !556)
!601 = !DILocation(line: 777, column: 24, scope: !556)
!602 = !DILocation(line: 778, column: 23, scope: !556)
!603 = !DILocation(line: 779, column: 11, scope: !556)
!604 = !DILocation(line: 782, column: 21, scope: !556)
!605 = !DILocation(line: 783, column: 11, scope: !556)
!606 = !DILocation(line: 785, column: 9, scope: !556)
!607 = !DILocation(line: 787, column: 9, scope: !556)
!608 = !DILocation(line: 790, column: 11, scope: !556)
!609 = distinct !{!609, !546, !610}
!610 = !DILocation(line: 792, column: 5, scope: !528)
!611 = !DILocation(line: 794, column: 7, scope: !612)
!612 = distinct !DILexicalBlock(scope: !528, file: !3, line: 794, column: 7)
!613 = !DILocation(line: 794, column: 7, scope: !528)
!614 = !DILocation(line: 796, column: 18, scope: !615)
!615 = distinct !DILexicalBlock(scope: !612, file: !3, line: 795, column: 5)
!616 = !DILocation(line: 797, column: 20, scope: !615)
!617 = !DILocation(line: 798, column: 5, scope: !615)
!618 = !DILocation(line: 800, column: 7, scope: !619)
!619 = distinct !DILexicalBlock(scope: !528, file: !3, line: 800, column: 7)
!620 = !DILocation(line: 800, column: 7, scope: !528)
!621 = !DILocation(line: 802, column: 20, scope: !622)
!622 = distinct !DILexicalBlock(scope: !619, file: !3, line: 801, column: 5)
!623 = !DILocation(line: 803, column: 5, scope: !622)
!624 = !DILocation(line: 805, column: 7, scope: !625)
!625 = distinct !DILexicalBlock(scope: !528, file: !3, line: 805, column: 7)
!626 = !DILocation(line: 805, column: 7, scope: !528)
!627 = !DILocation(line: 807, column: 19, scope: !628)
!628 = distinct !DILexicalBlock(scope: !625, file: !3, line: 806, column: 5)
!629 = !DILocation(line: 808, column: 25, scope: !628)
!630 = !DILocation(line: 809, column: 5, scope: !628)
!631 = !DILocation(line: 812, column: 19, scope: !632)
!632 = distinct !DILexicalBlock(scope: !625, file: !3, line: 811, column: 5)
!633 = !DILocation(line: 813, column: 25, scope: !632)
!634 = !DILocation(line: 816, column: 11, scope: !528)
!635 = !DILocation(line: 816, column: 18, scope: !528)
!636 = !DILocation(line: 816, column: 16, scope: !528)
!637 = !DILocation(line: 816, column: 3, scope: !528)
!638 = !DILocation(line: 819, column: 20, scope: !639)
!639 = distinct !DILexicalBlock(scope: !528, file: !3, line: 817, column: 5)
!640 = !DILocation(line: 820, column: 7, scope: !639)
!641 = !DILocation(line: 823, column: 7, scope: !639)
!642 = !DILocation(line: 824, column: 7, scope: !639)
!643 = !DILocation(line: 827, column: 12, scope: !639)
!644 = !DILocation(line: 827, column: 17, scope: !639)
!645 = !DILocation(line: 827, column: 7, scope: !639)
!646 = !DILocation(line: 828, column: 7, scope: !639)
!647 = !DILocation(line: 831, column: 20, scope: !639)
!648 = !DILocation(line: 831, column: 50, scope: !639)
!649 = !DILocation(line: 831, column: 55, scope: !639)
!650 = !DILocation(line: 831, column: 62, scope: !639)
!651 = !DILocation(line: 831, column: 43, scope: !639)
!652 = !DILocation(line: 831, column: 7, scope: !639)
!653 = !DILocation(line: 832, column: 7, scope: !639)
!654 = !DILocation(line: 835, column: 3, scope: !528)
!655 = !DILocalVariable(name: "argc", arg: 1, scope: !656, file: !3, line: 688, type: !53)
!656 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 688, type: !529, scopeLine: 689, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !657, retainedNodes: !4)
!657 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !658, nameTableKind: None)
!658 = !{!659, !661, !663, !665, !667, !669, !671, !673, !675, !677, !679, !681, !683, !685, !687, !689, !691, !693, !703, !706, !735, !737, !740, !742, !747, !752, !754}
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(name: "do_lookup", scope: !657, file: !3, line: 102, type: !18, isLocal: true, isDefinition: true)
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(name: "short_list", scope: !657, file: !3, line: 107, type: !18, isLocal: true, isDefinition: true)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(name: "short_output", scope: !657, file: !3, line: 110, type: !18, isLocal: true, isDefinition: true)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(name: "include_idle", scope: !657, file: !3, line: 115, type: !18, isLocal: true, isDefinition: true)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(name: "include_heading", scope: !657, file: !3, line: 118, type: !18, isLocal: true, isDefinition: true)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "include_mesg", scope: !657, file: !3, line: 122, type: !18, isLocal: true, isDefinition: true)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(name: "include_exit", scope: !657, file: !3, line: 125, type: !18, isLocal: true, isDefinition: true)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "need_boottime", scope: !657, file: !3, line: 128, type: !18, isLocal: true, isDefinition: true)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "need_deadprocs", scope: !657, file: !3, line: 131, type: !18, isLocal: true, isDefinition: true)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(name: "need_login", scope: !657, file: !3, line: 134, type: !18, isLocal: true, isDefinition: true)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(name: "need_initspawn", scope: !657, file: !3, line: 137, type: !18, isLocal: true, isDefinition: true)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "need_clockchange", scope: !657, file: !3, line: 140, type: !18, isLocal: true, isDefinition: true)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(name: "need_runlevel", scope: !657, file: !3, line: 143, type: !18, isLocal: true, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(name: "need_users", scope: !657, file: !3, line: 146, type: !18, isLocal: true, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "my_line_only", scope: !657, file: !3, line: 149, type: !18, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "time_format", scope: !657, file: !3, line: 153, type: !49, isLocal: true, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(name: "time_format_width", scope: !657, file: !3, line: 154, type: !53, isLocal: true, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(name: "longopts", scope: !657, file: !3, line: 162, type: !695, isLocal: true, isDefinition: true)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 4608, elements: !151)
!696 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !144, line: 50, size: 256, elements: !698)
!698 = !{!699, !700, !701, !702}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !697, file: !144, line: 52, baseType: !49, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !697, file: !144, line: 55, baseType: !53, size: 32, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !697, file: !144, line: 56, baseType: !149, size: 64, offset: 128)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !697, file: !144, line: 57, baseType: !53, size: 32, offset: 192)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "mesg", scope: !705, file: !3, line: 249, type: !59, isLocal: true, isDefinition: true)
!705 = distinct !DISubprogram(name: "print_line", scope: !3, file: !3, line: 244, type: !57, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !657, retainedNodes: !4)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(name: "hoststr", scope: !708, file: !3, line: 339, type: !6, isLocal: true, isDefinition: true)
!708 = distinct !DISubprogram(name: "print_user", scope: !3, file: !3, line: 333, type: !709, scopeLine: 334, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !657, retainedNodes: !4)
!709 = !DISubroutineType(types: !710)
!710 = !{null, !711, !9}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !70, line: 146, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !72, line: 55, size: 3072, elements: !715)
!715 = !{!716, !717, !718, !719, !720, !721, !722, !727, !728, !733, !734}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !714, file: !72, line: 57, baseType: !14, size: 16)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !714, file: !72, line: 58, baseType: !76, size: 32, offset: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !714, file: !72, line: 59, baseType: !78, size: 256, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !714, file: !72, line: 61, baseType: !82, size: 32, offset: 320)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !714, file: !72, line: 63, baseType: !78, size: 256, offset: 352)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !714, file: !72, line: 65, baseType: !87, size: 2048, offset: 608)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !714, file: !72, line: 67, baseType: !723, size: 32, offset: 2656)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !72, line: 42, size: 32, elements: !724)
!724 = !{!725, !726}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !723, file: !72, line: 45, baseType: !14, size: 16)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !723, file: !72, line: 46, baseType: !14, size: 16, offset: 16)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !714, file: !72, line: 74, baseType: !96, size: 32, offset: 2688)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !714, file: !72, line: 79, baseType: !729, size: 64, offset: 2720)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !714, file: !72, line: 75, size: 64, elements: !730)
!730 = !{!731, !732}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !729, file: !72, line: 77, baseType: !96, size: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !729, file: !72, line: 78, baseType: !96, size: 32, offset: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !714, file: !72, line: 84, baseType: !103, size: 128, offset: 2784)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !714, file: !72, line: 85, baseType: !105, size: 160, offset: 2912)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(name: "hostlen", scope: !708, file: !3, line: 341, type: !110, isLocal: true, isDefinition: true)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "now", scope: !739, file: !3, line: 190, type: !9, isLocal: true, isDefinition: true)
!739 = distinct !DISubprogram(name: "idle_string", scope: !3, file: !3, line: 188, type: !116, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !657, retainedNodes: !4)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(name: "idle_hhmm", scope: !739, file: !3, line: 202, type: !120, isLocal: true, isDefinition: true)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(name: "buf", scope: !744, file: !3, line: 220, type: !128, isLocal: true, isDefinition: true)
!744 = distinct !DISubprogram(name: "time_string", scope: !3, file: !3, line: 218, type: !745, scopeLine: 219, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !657, retainedNodes: !4)
!745 = !DISubroutineType(types: !746)
!746 = !{!49, !711}
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "runlevline", scope: !749, file: !3, line: 516, type: !6, isLocal: true, isDefinition: true)
!749 = distinct !DISubprogram(name: "print_runlevel", scope: !3, file: !3, line: 514, type: !750, scopeLine: 515, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !657, retainedNodes: !4)
!750 = !DISubroutineType(types: !751)
!751 = !{null, !711}
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(name: "comment", scope: !749, file: !3, line: 516, type: !6, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(name: "exitstr", scope: !756, file: !3, line: 461, type: !6, isLocal: true, isDefinition: true)
!756 = distinct !DISubprogram(name: "print_deadprocs", scope: !3, file: !3, line: 459, type: !750, scopeLine: 460, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !657, retainedNodes: !4)
!757 = !DILocalVariable(name: "argv", arg: 2, scope: !656, file: !3, line: 688, type: !531)
!758 = !DILocalVariable(name: "optc", scope: !656, file: !3, line: 690, type: !53)
!759 = !DILocalVariable(name: "assumptions", scope: !656, file: !3, line: 691, type: !18)
!760 = distinct !DISubprogram(name: "who", scope: !3, file: !3, line: 621, type: !761, scopeLine: 622, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!761 = !DISubroutineType(types: !762)
!762 = !{null, !49, !53}
!763 = !DILocalVariable(name: "filename", arg: 1, scope: !760, file: !3, line: 621, type: !49)
!764 = !DILocation(line: 621, column: 18, scope: !760)
!765 = !DILocalVariable(name: "options", arg: 2, scope: !760, file: !3, line: 621, type: !53)
!766 = !DILocation(line: 621, column: 32, scope: !760)
!767 = !DILocalVariable(name: "n_users", scope: !760, file: !3, line: 623, type: !110)
!768 = !DILocation(line: 623, column: 10, scope: !760)
!769 = !DILocalVariable(name: "utmp_buf", scope: !760, file: !3, line: 624, type: !770)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!771 = !DILocation(line: 624, column: 16, scope: !760)
!772 = !DILocation(line: 626, column: 18, scope: !773)
!773 = distinct !DILexicalBlock(scope: !760, file: !3, line: 626, column: 7)
!774 = !DILocation(line: 626, column: 49, scope: !773)
!775 = !DILocation(line: 626, column: 7, scope: !773)
!776 = !DILocation(line: 626, column: 58, scope: !773)
!777 = !DILocation(line: 626, column: 7, scope: !760)
!778 = !DILocation(line: 627, column: 5, scope: !773)
!779 = !DILocation(line: 629, column: 7, scope: !780)
!780 = distinct !DILexicalBlock(scope: !760, file: !3, line: 629, column: 7)
!781 = !DILocation(line: 629, column: 7, scope: !760)
!782 = !DILocation(line: 630, column: 23, scope: !780)
!783 = !DILocation(line: 630, column: 32, scope: !780)
!784 = !DILocation(line: 630, column: 5, scope: !780)
!785 = !DILocation(line: 632, column: 19, scope: !780)
!786 = !DILocation(line: 632, column: 28, scope: !780)
!787 = !DILocation(line: 632, column: 5, scope: !780)
!788 = !DILocation(line: 634, column: 9, scope: !760)
!789 = !DILocation(line: 634, column: 3, scope: !760)
!790 = !DILocation(line: 635, column: 1, scope: !760)
!791 = distinct !DISubprogram(name: "list_entries_who", scope: !3, file: !3, line: 537, type: !792, scopeLine: 538, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!792 = !DISubroutineType(types: !793)
!793 = !{null, !110, !67}
!794 = !DILocalVariable(name: "n", arg: 1, scope: !791, file: !3, line: 537, type: !110)
!795 = !DILocation(line: 537, column: 26, scope: !791)
!796 = !DILocalVariable(name: "utmp_buf", arg: 2, scope: !791, file: !3, line: 537, type: !67)
!797 = !DILocation(line: 537, column: 48, scope: !791)
!798 = !DILocalVariable(name: "entries", scope: !791, file: !3, line: 539, type: !112)
!799 = !DILocation(line: 539, column: 21, scope: !791)
!800 = !DILocalVariable(name: "separator", scope: !791, file: !3, line: 540, type: !49)
!801 = !DILocation(line: 540, column: 15, scope: !791)
!802 = !DILocation(line: 542, column: 3, scope: !791)
!803 = !DILocation(line: 542, column: 11, scope: !791)
!804 = !DILocation(line: 544, column: 11, scope: !805)
!805 = distinct !DILexicalBlock(scope: !806, file: !3, line: 544, column: 11)
!806 = distinct !DILexicalBlock(scope: !791, file: !3, line: 543, column: 5)
!807 = !DILocation(line: 544, column: 11, scope: !806)
!808 = !DILocalVariable(name: "trimmed_name", scope: !809, file: !3, line: 546, type: !6)
!809 = distinct !DILexicalBlock(scope: !805, file: !3, line: 545, column: 9)
!810 = !DILocation(line: 546, column: 17, scope: !809)
!811 = !DILocation(line: 548, column: 48, scope: !809)
!812 = !DILocation(line: 548, column: 26, scope: !809)
!813 = !DILocation(line: 548, column: 24, scope: !809)
!814 = !DILocation(line: 550, column: 27, scope: !809)
!815 = !DILocation(line: 550, column: 38, scope: !809)
!816 = !DILocation(line: 550, column: 11, scope: !809)
!817 = !DILocation(line: 551, column: 17, scope: !809)
!818 = !DILocation(line: 551, column: 11, scope: !809)
!819 = !DILocation(line: 552, column: 21, scope: !809)
!820 = !DILocation(line: 553, column: 18, scope: !809)
!821 = !DILocation(line: 554, column: 9, scope: !809)
!822 = !DILocation(line: 555, column: 15, scope: !806)
!823 = distinct !{!823, !802, !824}
!824 = !DILocation(line: 556, column: 5, scope: !791)
!825 = !DILocation(line: 557, column: 11, scope: !791)
!826 = !DILocation(line: 557, column: 33, scope: !791)
!827 = !DILocation(line: 557, column: 3, scope: !791)
!828 = !DILocation(line: 558, column: 1, scope: !791)
!829 = distinct !DISubprogram(name: "scan_entries", scope: !3, file: !3, line: 569, type: !792, scopeLine: 570, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!830 = !DILocalVariable(name: "n", arg: 1, scope: !829, file: !3, line: 569, type: !110)
!831 = !DILocation(line: 569, column: 22, scope: !829)
!832 = !DILocalVariable(name: "utmp_buf", arg: 2, scope: !829, file: !3, line: 569, type: !67)
!833 = !DILocation(line: 569, column: 44, scope: !829)
!834 = !DILocalVariable(name: "ttyname_b", scope: !829, file: !3, line: 571, type: !6)
!835 = !DILocation(line: 571, column: 9, scope: !829)
!836 = !DILocalVariable(name: "boottime", scope: !829, file: !3, line: 572, type: !9)
!837 = !DILocation(line: 572, column: 10, scope: !829)
!838 = !DILocation(line: 574, column: 7, scope: !839)
!839 = distinct !DILexicalBlock(scope: !829, file: !3, line: 574, column: 7)
!840 = !DILocation(line: 574, column: 7, scope: !829)
!841 = !DILocation(line: 575, column: 5, scope: !839)
!842 = !DILocation(line: 577, column: 7, scope: !843)
!843 = distinct !DILexicalBlock(scope: !829, file: !3, line: 577, column: 7)
!844 = !DILocation(line: 577, column: 7, scope: !829)
!845 = !DILocation(line: 579, column: 19, scope: !846)
!846 = distinct !DILexicalBlock(scope: !843, file: !3, line: 578, column: 5)
!847 = !DILocation(line: 579, column: 17, scope: !846)
!848 = !DILocation(line: 580, column: 12, scope: !849)
!849 = distinct !DILexicalBlock(scope: !846, file: !3, line: 580, column: 11)
!850 = !DILocation(line: 580, column: 11, scope: !846)
!851 = !DILocation(line: 581, column: 9, scope: !849)
!852 = !DILocation(line: 582, column: 11, scope: !853)
!853 = distinct !DILexicalBlock(scope: !846, file: !3, line: 582, column: 11)
!854 = !DILocation(line: 582, column: 64, scope: !853)
!855 = !DILocation(line: 583, column: 19, scope: !853)
!856 = !DILocation(line: 583, column: 9, scope: !853)
!857 = !DILocation(line: 584, column: 5, scope: !846)
!858 = !DILocation(line: 586, column: 3, scope: !829)
!859 = !DILocation(line: 586, column: 11, scope: !829)
!860 = !DILocation(line: 588, column: 12, scope: !861)
!861 = distinct !DILexicalBlock(scope: !862, file: !3, line: 588, column: 11)
!862 = distinct !DILexicalBlock(scope: !829, file: !3, line: 587, column: 5)
!863 = !DILocation(line: 589, column: 11, scope: !861)
!864 = !DILocation(line: 589, column: 14, scope: !861)
!865 = !DILocation(line: 588, column: 11, scope: !862)
!866 = !DILocation(line: 592, column: 15, scope: !867)
!867 = distinct !DILexicalBlock(scope: !868, file: !3, line: 592, column: 15)
!868 = distinct !DILexicalBlock(scope: !861, file: !3, line: 591, column: 9)
!869 = !DILocation(line: 592, column: 26, scope: !867)
!870 = !DILocation(line: 592, column: 29, scope: !867)
!871 = !DILocation(line: 592, column: 15, scope: !868)
!872 = !DILocation(line: 593, column: 25, scope: !867)
!873 = !DILocation(line: 593, column: 35, scope: !867)
!874 = !DILocation(line: 593, column: 13, scope: !867)
!875 = !DILocation(line: 594, column: 20, scope: !876)
!876 = distinct !DILexicalBlock(scope: !867, file: !3, line: 594, column: 20)
!877 = !DILocation(line: 594, column: 34, scope: !876)
!878 = !DILocation(line: 594, column: 37, scope: !876)
!879 = !DILocation(line: 594, column: 20, scope: !867)
!880 = !DILocation(line: 595, column: 29, scope: !876)
!881 = !DILocation(line: 595, column: 13, scope: !876)
!882 = !DILocation(line: 596, column: 20, scope: !883)
!883 = distinct !DILexicalBlock(scope: !876, file: !3, line: 596, column: 20)
!884 = !DILocation(line: 596, column: 34, scope: !883)
!885 = !DILocation(line: 596, column: 37, scope: !883)
!886 = !DILocation(line: 596, column: 20, scope: !876)
!887 = !DILocation(line: 597, column: 29, scope: !883)
!888 = !DILocation(line: 597, column: 13, scope: !883)
!889 = !DILocation(line: 601, column: 20, scope: !890)
!890 = distinct !DILexicalBlock(scope: !883, file: !3, line: 601, column: 20)
!891 = !DILocation(line: 601, column: 37, scope: !890)
!892 = !DILocation(line: 601, column: 40, scope: !890)
!893 = !DILocation(line: 601, column: 20, scope: !883)
!894 = !DILocation(line: 602, column: 32, scope: !890)
!895 = !DILocation(line: 602, column: 13, scope: !890)
!896 = !DILocation(line: 603, column: 20, scope: !897)
!897 = distinct !DILexicalBlock(scope: !890, file: !3, line: 603, column: 20)
!898 = !DILocation(line: 603, column: 35, scope: !897)
!899 = !DILocation(line: 603, column: 38, scope: !897)
!900 = !DILocation(line: 603, column: 20, scope: !890)
!901 = !DILocation(line: 604, column: 30, scope: !897)
!902 = !DILocation(line: 604, column: 13, scope: !897)
!903 = !DILocation(line: 605, column: 20, scope: !904)
!904 = distinct !DILexicalBlock(scope: !897, file: !3, line: 605, column: 20)
!905 = !DILocation(line: 605, column: 31, scope: !904)
!906 = !DILocation(line: 605, column: 34, scope: !904)
!907 = !DILocation(line: 605, column: 20, scope: !897)
!908 = !DILocation(line: 606, column: 26, scope: !904)
!909 = !DILocation(line: 606, column: 13, scope: !904)
!910 = !DILocation(line: 607, column: 20, scope: !911)
!911 = distinct !DILexicalBlock(scope: !904, file: !3, line: 607, column: 20)
!912 = !DILocation(line: 607, column: 35, scope: !911)
!913 = !DILocation(line: 607, column: 38, scope: !911)
!914 = !DILocation(line: 607, column: 20, scope: !904)
!915 = !DILocation(line: 608, column: 30, scope: !911)
!916 = !DILocation(line: 608, column: 13, scope: !911)
!917 = !DILocation(line: 609, column: 9, scope: !868)
!918 = !DILocation(line: 611, column: 11, scope: !919)
!919 = distinct !DILexicalBlock(scope: !862, file: !3, line: 611, column: 11)
!920 = !DILocation(line: 611, column: 11, scope: !862)
!921 = !DILocation(line: 612, column: 20, scope: !919)
!922 = !DILocation(line: 612, column: 18, scope: !919)
!923 = !DILocation(line: 612, column: 9, scope: !919)
!924 = !DILocation(line: 614, column: 15, scope: !862)
!925 = distinct !{!925, !858, !926}
!926 = !DILocation(line: 615, column: 5, scope: !829)
!927 = !DILocation(line: 616, column: 1, scope: !829)
!928 = distinct !DISubprogram(name: "print_heading", scope: !3, file: !3, line: 561, type: !929, scopeLine: 562, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!929 = !DISubroutineType(types: !930)
!930 = !{null}
!931 = !DILocation(line: 563, column: 19, scope: !928)
!932 = !DILocation(line: 563, column: 39, scope: !928)
!933 = !DILocation(line: 563, column: 50, scope: !928)
!934 = !DILocation(line: 563, column: 61, scope: !928)
!935 = !DILocation(line: 564, column: 15, scope: !928)
!936 = !DILocation(line: 564, column: 25, scope: !928)
!937 = !DILocation(line: 564, column: 39, scope: !928)
!938 = !DILocation(line: 563, column: 3, scope: !928)
!939 = !DILocation(line: 565, column: 1, scope: !928)
!940 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !64, file: !3, line: 333, type: !67)
!941 = !DILocation(line: 333, column: 32, scope: !64)
!942 = !DILocalVariable(name: "boottime", arg: 2, scope: !64, file: !3, line: 333, type: !9)
!943 = !DILocation(line: 333, column: 49, scope: !64)
!944 = !DILocalVariable(name: "stats", scope: !64, file: !3, line: 335, type: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !946, line: 46, size: 1152, elements: !947)
!946 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!947 = !{!948, !950, !952, !954, !956, !958, !960, !961, !962, !964, !966, !968, !975, !976, !977}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !945, file: !946, line: 48, baseType: !949, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !12, line: 145, baseType: !112)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !945, file: !946, line: 53, baseType: !951, size: 64, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !12, line: 148, baseType: !112)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !945, file: !946, line: 61, baseType: !953, size: 64, offset: 128)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !12, line: 151, baseType: !112)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !945, file: !946, line: 62, baseType: !955, size: 32, offset: 192)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !12, line: 150, baseType: !180)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !945, file: !946, line: 64, baseType: !957, size: 32, offset: 224)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !12, line: 146, baseType: !180)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !945, file: !946, line: 65, baseType: !959, size: 32, offset: 256)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !12, line: 147, baseType: !180)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !945, file: !946, line: 67, baseType: !53, size: 32, offset: 288)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !945, file: !946, line: 69, baseType: !949, size: 64, offset: 320)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !945, file: !946, line: 74, baseType: !963, size: 64, offset: 384)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !12, line: 152, baseType: !13)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !945, file: !946, line: 78, baseType: !965, size: 64, offset: 448)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !12, line: 174, baseType: !13)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !945, file: !946, line: 80, baseType: !967, size: 64, offset: 512)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !12, line: 179, baseType: !13)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !945, file: !946, line: 91, baseType: !969, size: 128, offset: 576)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !970, line: 10, size: 128, elements: !971)
!970 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!971 = !{!972, !973}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !969, file: !970, line: 12, baseType: !11, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !969, file: !970, line: 16, baseType: !974, size: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !12, line: 196, baseType: !13)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !945, file: !946, line: 92, baseType: !969, size: 128, offset: 704)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !945, file: !946, line: 93, baseType: !969, size: 128, offset: 832)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !945, file: !946, line: 106, baseType: !978, size: 192, offset: 960)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !974, size: 192, elements: !60)
!979 = !DILocation(line: 335, column: 15, scope: !64)
!980 = !DILocalVariable(name: "last_change", scope: !64, file: !3, line: 336, type: !9)
!981 = !DILocation(line: 336, column: 10, scope: !64)
!982 = !DILocalVariable(name: "mesg", scope: !64, file: !3, line: 337, type: !7)
!983 = !DILocation(line: 337, column: 8, scope: !64)
!984 = !DILocalVariable(name: "idlestr", scope: !64, file: !3, line: 338, type: !985)
!985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 56, elements: !478)
!986 = !DILocation(line: 338, column: 8, scope: !64)
!987 = !DILocalVariable(name: "line", scope: !64, file: !3, line: 347, type: !988)
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 304, elements: !989)
!989 = !{!990}
!990 = !DISubrange(count: 38)
!991 = !DILocation(line: 347, column: 8, scope: !64)
!992 = !DILocalVariable(name: "p", scope: !64, file: !3, line: 348, type: !6)
!993 = !DILocation(line: 348, column: 9, scope: !64)
!994 = !DILocation(line: 348, column: 13, scope: !64)
!995 = !DILocalVariable(name: "pidstr", scope: !64, file: !3, line: 349, type: !996)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !997)
!997 = !{!998}
!998 = !DISubrange(count: 12)
!999 = !DILocation(line: 349, column: 3, scope: !64)
!1000 = !DILocation(line: 354, column: 10, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !64, file: !3, line: 354, column: 8)
!1002 = !DILocation(line: 354, column: 8, scope: !64)
!1003 = !DILocation(line: 355, column: 17, scope: !1001)
!1004 = !DILocation(line: 355, column: 9, scope: !1001)
!1005 = !DILocation(line: 355, column: 7, scope: !1001)
!1006 = !DILocation(line: 355, column: 5, scope: !1001)
!1007 = !DILocation(line: 356, column: 12, scope: !64)
!1008 = !DILocation(line: 356, column: 15, scope: !64)
!1009 = !DILocation(line: 356, column: 25, scope: !64)
!1010 = !DILocation(line: 356, column: 3, scope: !64)
!1011 = !DILocation(line: 358, column: 13, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !64, file: !3, line: 358, column: 7)
!1013 = !DILocation(line: 358, column: 7, scope: !1012)
!1014 = !DILocation(line: 358, column: 27, scope: !1012)
!1015 = !DILocation(line: 358, column: 7, scope: !64)
!1016 = !DILocation(line: 360, column: 14, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1012, file: !3, line: 359, column: 5)
!1018 = !DILocation(line: 360, column: 12, scope: !1017)
!1019 = !DILocation(line: 361, column: 27, scope: !1017)
!1020 = !DILocation(line: 361, column: 19, scope: !1017)
!1021 = !DILocation(line: 362, column: 5, scope: !1017)
!1022 = !DILocation(line: 365, column: 12, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !1012, file: !3, line: 364, column: 5)
!1024 = !DILocation(line: 366, column: 19, scope: !1023)
!1025 = !DILocation(line: 369, column: 7, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !64, file: !3, line: 369, column: 7)
!1027 = !DILocation(line: 369, column: 7, scope: !64)
!1028 = !DILocation(line: 370, column: 14, scope: !1026)
!1029 = !DILocation(line: 370, column: 57, scope: !1026)
!1030 = !DILocation(line: 370, column: 70, scope: !1026)
!1031 = !DILocation(line: 370, column: 44, scope: !1026)
!1032 = !DILocation(line: 370, column: 5, scope: !1026)
!1033 = !DILocation(line: 372, column: 14, scope: !1026)
!1034 = !DILocation(line: 372, column: 5, scope: !1026)
!1035 = !DILocation(line: 375, column: 7, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !64, file: !3, line: 375, column: 7)
!1037 = !DILocation(line: 375, column: 17, scope: !1036)
!1038 = !DILocation(line: 375, column: 7, scope: !64)
!1039 = !DILocalVariable(name: "ut_host", scope: !1040, file: !3, line: 377, type: !1041)
!1040 = distinct !DILexicalBlock(scope: !1036, file: !3, line: 376, column: 5)
!1041 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 2056, elements: !1042)
!1042 = !{!1043}
!1043 = !DISubrange(count: 257)
!1044 = !DILocation(line: 377, column: 12, scope: !1040)
!1045 = !DILocalVariable(name: "host", scope: !1040, file: !3, line: 378, type: !6)
!1046 = !DILocation(line: 378, column: 13, scope: !1040)
!1047 = !DILocalVariable(name: "display", scope: !1040, file: !3, line: 379, type: !6)
!1048 = !DILocation(line: 379, column: 13, scope: !1040)
!1049 = !DILocation(line: 382, column: 16, scope: !1040)
!1050 = !DILocation(line: 382, column: 25, scope: !1040)
!1051 = !DILocation(line: 382, column: 35, scope: !1040)
!1052 = !DILocation(line: 382, column: 7, scope: !1040)
!1053 = !DILocation(line: 385, column: 25, scope: !1040)
!1054 = !DILocation(line: 385, column: 17, scope: !1040)
!1055 = !DILocation(line: 385, column: 15, scope: !1040)
!1056 = !DILocation(line: 386, column: 11, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 386, column: 11)
!1058 = !DILocation(line: 386, column: 11, scope: !1040)
!1059 = !DILocation(line: 387, column: 17, scope: !1057)
!1060 = !DILocation(line: 387, column: 20, scope: !1057)
!1061 = !DILocation(line: 387, column: 9, scope: !1057)
!1062 = !DILocation(line: 389, column: 11, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 389, column: 11)
!1064 = !DILocation(line: 389, column: 20, scope: !1063)
!1065 = !DILocation(line: 389, column: 23, scope: !1063)
!1066 = !DILocation(line: 389, column: 11, scope: !1040)
!1067 = !DILocation(line: 392, column: 30, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !1063, file: !3, line: 390, column: 9)
!1069 = !DILocation(line: 392, column: 18, scope: !1068)
!1070 = !DILocation(line: 392, column: 16, scope: !1068)
!1071 = !DILocation(line: 393, column: 9, scope: !1068)
!1072 = !DILocation(line: 395, column: 13, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 395, column: 11)
!1074 = !DILocation(line: 395, column: 11, scope: !1040)
!1075 = !DILocation(line: 396, column: 16, scope: !1073)
!1076 = !DILocation(line: 396, column: 14, scope: !1073)
!1077 = !DILocation(line: 396, column: 9, scope: !1073)
!1078 = !DILocation(line: 398, column: 11, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 398, column: 11)
!1080 = !DILocation(line: 398, column: 11, scope: !1040)
!1081 = !DILocation(line: 400, column: 15, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1083, file: !3, line: 400, column: 15)
!1083 = distinct !DILexicalBlock(scope: !1079, file: !3, line: 399, column: 9)
!1084 = !DILocation(line: 400, column: 33, scope: !1082)
!1085 = !DILocation(line: 400, column: 25, scope: !1082)
!1086 = !DILocation(line: 400, column: 49, scope: !1082)
!1087 = !DILocation(line: 400, column: 41, scope: !1082)
!1088 = !DILocation(line: 400, column: 39, scope: !1082)
!1089 = !DILocation(line: 400, column: 58, scope: !1082)
!1090 = !DILocation(line: 400, column: 23, scope: !1082)
!1091 = !DILocation(line: 400, column: 15, scope: !1083)
!1092 = !DILocation(line: 402, column: 33, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1082, file: !3, line: 401, column: 13)
!1094 = !DILocation(line: 402, column: 25, scope: !1093)
!1095 = !DILocation(line: 402, column: 49, scope: !1093)
!1096 = !DILocation(line: 402, column: 41, scope: !1093)
!1097 = !DILocation(line: 402, column: 39, scope: !1093)
!1098 = !DILocation(line: 402, column: 58, scope: !1093)
!1099 = !DILocation(line: 402, column: 23, scope: !1093)
!1100 = !DILocation(line: 403, column: 21, scope: !1093)
!1101 = !DILocation(line: 403, column: 15, scope: !1093)
!1102 = !DILocation(line: 404, column: 34, scope: !1093)
!1103 = !DILocation(line: 404, column: 25, scope: !1093)
!1104 = !DILocation(line: 404, column: 23, scope: !1093)
!1105 = !DILocation(line: 405, column: 13, scope: !1093)
!1106 = !DILocation(line: 406, column: 20, scope: !1083)
!1107 = !DILocation(line: 406, column: 40, scope: !1083)
!1108 = !DILocation(line: 406, column: 46, scope: !1083)
!1109 = !DILocation(line: 406, column: 11, scope: !1083)
!1110 = !DILocation(line: 407, column: 9, scope: !1083)
!1111 = !DILocation(line: 410, column: 15, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1113, file: !3, line: 410, column: 15)
!1113 = distinct !DILexicalBlock(scope: !1079, file: !3, line: 409, column: 9)
!1114 = !DILocation(line: 410, column: 33, scope: !1112)
!1115 = !DILocation(line: 410, column: 25, scope: !1112)
!1116 = !DILocation(line: 410, column: 39, scope: !1112)
!1117 = !DILocation(line: 410, column: 23, scope: !1112)
!1118 = !DILocation(line: 410, column: 15, scope: !1113)
!1119 = !DILocation(line: 412, column: 33, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1112, file: !3, line: 411, column: 13)
!1121 = !DILocation(line: 412, column: 25, scope: !1120)
!1122 = !DILocation(line: 412, column: 39, scope: !1120)
!1123 = !DILocation(line: 412, column: 23, scope: !1120)
!1124 = !DILocation(line: 413, column: 21, scope: !1120)
!1125 = !DILocation(line: 413, column: 15, scope: !1120)
!1126 = !DILocation(line: 414, column: 34, scope: !1120)
!1127 = !DILocation(line: 414, column: 25, scope: !1120)
!1128 = !DILocation(line: 414, column: 23, scope: !1120)
!1129 = !DILocation(line: 415, column: 13, scope: !1120)
!1130 = !DILocation(line: 416, column: 20, scope: !1113)
!1131 = !DILocation(line: 416, column: 37, scope: !1113)
!1132 = !DILocation(line: 416, column: 11, scope: !1113)
!1133 = !DILocation(line: 419, column: 11, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1040, file: !3, line: 419, column: 11)
!1135 = !DILocation(line: 419, column: 19, scope: !1134)
!1136 = !DILocation(line: 419, column: 16, scope: !1134)
!1137 = !DILocation(line: 419, column: 11, scope: !1040)
!1138 = !DILocation(line: 420, column: 15, scope: !1134)
!1139 = !DILocation(line: 420, column: 9, scope: !1134)
!1140 = !DILocation(line: 421, column: 5, scope: !1040)
!1141 = !DILocation(line: 424, column: 11, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !1143, file: !3, line: 424, column: 11)
!1143 = distinct !DILexicalBlock(scope: !1036, file: !3, line: 423, column: 5)
!1144 = !DILocation(line: 424, column: 19, scope: !1142)
!1145 = !DILocation(line: 424, column: 11, scope: !1143)
!1146 = !DILocation(line: 426, column: 19, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1142, file: !3, line: 425, column: 9)
!1148 = !DILocation(line: 427, column: 17, scope: !1147)
!1149 = !DILocation(line: 427, column: 11, scope: !1147)
!1150 = !DILocation(line: 428, column: 30, scope: !1147)
!1151 = !DILocation(line: 428, column: 21, scope: !1147)
!1152 = !DILocation(line: 428, column: 19, scope: !1147)
!1153 = !DILocation(line: 429, column: 9, scope: !1147)
!1154 = !DILocation(line: 430, column: 8, scope: !1143)
!1155 = !DILocation(line: 430, column: 16, scope: !1143)
!1156 = !DILocation(line: 434, column: 42, scope: !64)
!1157 = !DILocation(line: 434, column: 62, scope: !64)
!1158 = !DILocation(line: 435, column: 41, scope: !64)
!1159 = !DILocation(line: 435, column: 51, scope: !64)
!1160 = !DILocation(line: 436, column: 28, scope: !64)
!1161 = !DILocation(line: 436, column: 15, scope: !64)
!1162 = !DILocation(line: 436, column: 39, scope: !64)
!1163 = !DILocation(line: 436, column: 48, scope: !64)
!1164 = !DILocation(line: 437, column: 15, scope: !64)
!1165 = !DILocation(line: 437, column: 25, scope: !64)
!1166 = !DILocation(line: 434, column: 3, scope: !64)
!1167 = !DILocation(line: 438, column: 1, scope: !64)
!1168 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !1169, file: !3, line: 333, type: !1172)
!1169 = distinct !DISubprogram(name: "print_user", scope: !3, file: !3, line: 333, type: !1170, scopeLine: 334, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1196, retainedNodes: !4)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{null, !1172, !9}
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1174)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !70, line: 146, baseType: !1175)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !72, line: 55, size: 3072, elements: !1176)
!1176 = !{!1177, !1178, !1179, !1180, !1181, !1182, !1183, !1188, !1189, !1194, !1195}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !1175, file: !72, line: 57, baseType: !14, size: 16)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !1175, file: !72, line: 58, baseType: !76, size: 32, offset: 32)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !1175, file: !72, line: 59, baseType: !78, size: 256, offset: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !1175, file: !72, line: 61, baseType: !82, size: 32, offset: 320)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !1175, file: !72, line: 63, baseType: !78, size: 256, offset: 352)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !1175, file: !72, line: 65, baseType: !87, size: 2048, offset: 608)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !1175, file: !72, line: 67, baseType: !1184, size: 32, offset: 2656)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !72, line: 42, size: 32, elements: !1185)
!1185 = !{!1186, !1187}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !1184, file: !72, line: 45, baseType: !14, size: 16)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !1184, file: !72, line: 46, baseType: !14, size: 16, offset: 16)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !1175, file: !72, line: 74, baseType: !96, size: 32, offset: 2688)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !1175, file: !72, line: 79, baseType: !1190, size: 64, offset: 2720)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1175, file: !72, line: 75, size: 64, elements: !1191)
!1191 = !{!1192, !1193}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1190, file: !72, line: 77, baseType: !96, size: 32)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !1190, file: !72, line: 78, baseType: !96, size: 32, offset: 32)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !1175, file: !72, line: 84, baseType: !103, size: 128, offset: 2784)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1175, file: !72, line: 85, baseType: !105, size: 160, offset: 2912)
!1196 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !1197, nameTableKind: None)
!1197 = !{!1198, !1200, !1202, !1204, !1206, !1208, !1210, !1212, !1214, !1216, !1218, !1220, !1222, !1224, !1226, !1228, !1230, !1232, !1242, !1245, !1247, !1249, !1252, !1254, !1259, !1264, !1266}
!1198 = !DIGlobalVariableExpression(var: !1199, expr: !DIExpression())
!1199 = distinct !DIGlobalVariable(name: "do_lookup", scope: !1196, file: !3, line: 102, type: !18, isLocal: true, isDefinition: true)
!1200 = !DIGlobalVariableExpression(var: !1201, expr: !DIExpression())
!1201 = distinct !DIGlobalVariable(name: "short_list", scope: !1196, file: !3, line: 107, type: !18, isLocal: true, isDefinition: true)
!1202 = !DIGlobalVariableExpression(var: !1203, expr: !DIExpression())
!1203 = distinct !DIGlobalVariable(name: "short_output", scope: !1196, file: !3, line: 110, type: !18, isLocal: true, isDefinition: true)
!1204 = !DIGlobalVariableExpression(var: !1205, expr: !DIExpression())
!1205 = distinct !DIGlobalVariable(name: "include_idle", scope: !1196, file: !3, line: 115, type: !18, isLocal: true, isDefinition: true)
!1206 = !DIGlobalVariableExpression(var: !1207, expr: !DIExpression())
!1207 = distinct !DIGlobalVariable(name: "include_heading", scope: !1196, file: !3, line: 118, type: !18, isLocal: true, isDefinition: true)
!1208 = !DIGlobalVariableExpression(var: !1209, expr: !DIExpression())
