; ModuleID = '<stdin>'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.addrinfo = type { i32, i32, i32, i32, i32, %struct.sockaddr*, i8*, %struct.addrinfo* }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.utmpx = type { i16, i32, [32 x i8], [4 x i8], [32 x i8], [256 x i8], %struct.__exit_status, i32, %struct.anon, [4 x i32], [20 x i8] }
%struct.__exit_status = type { i16, i16 }
%struct.anon = type { i32, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }


!10 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !12, line: 160, baseType: !13)
!12 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!13 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!14 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!15 = !{!16, !19, !21, !23, !25, !27, !29, !31, !33, !35, !37, !39, !41, !43, !45, !47, !51, !0, !54, !62, !108, !113, !118, !123, !131, !136, !138}
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "do_lookup", scope: !2, file: !3, line: 102, type: !18, isLocal: true, isDefinition: true)
!18 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "short_list", scope: !2, file: !3, line: 107, type: !18, isLocal: true, isDefinition: true)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "short_output", scope: !2, file: !3, line: 110, type: !18, isLocal: true, isDefinition: true)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "include_idle", scope: !2, file: !3, line: 115, type: !18, isLocal: true, isDefinition: true)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "include_heading", scope: !2, file: !3, line: 118, type: !18, isLocal: true, isDefinition: true)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "include_mesg", scope: !2, file: !3, line: 122, type: !18, isLocal: true, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "include_exit", scope: !2, file: !3, line: 125, type: !18, isLocal: true, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "need_boottime", scope: !2, file: !3, line: 128, type: !18, isLocal: true, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "need_deadprocs", scope: !2, file: !3, line: 131, type: !18, isLocal: true, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "need_login", scope: !2, file: !3, line: 134, type: !18, isLocal: true, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "need_initspawn", scope: !2, file: !3, line: 137, type: !18, isLocal: true, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "need_clockchange", scope: !2, file: !3, line: 140, type: !18, isLocal: true, isDefinition: true)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "need_runlevel", scope: !2, file: !3, line: 143, type: !18, isLocal: true, isDefinition: true)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "need_users", scope: !2, file: !3, line: 146, type: !18, isLocal: true, isDefinition: true)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "my_line_only", scope: !2, file: !3, line: 149, type: !18, isLocal: true, isDefinition: true)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "time_format", scope: !2, file: !3, line: 153, type: !49, isLocal: true, isDefinition: true)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "time_format_width", scope: !2, file: !3, line: 154, type: !53, isLocal: true, isDefinition: true)
!53 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "mesg", scope: !56, file: !3, line: 249, type: !59, isLocal: true, isDefinition: true)
!56 = distinct !DISubprogram(name: "print_line", scope: !3, file: !3, line: 244, type: !57, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!57 = !DISubroutineType(types: !58)
!58 = !{null, !53, !49, !50, !53, !49, !49, !49, !49, !49, !49}
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 24, elements: !60)
!60 = !{!61}
!61 = !DISubrange(count: 3)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "hoststr", scope: !64, file: !3, line: 339, type: !6, isLocal: true, isDefinition: true)
!64 = distinct !DISubprogram(name: "print_user", scope: !3, file: !3, line: 333, type: !65, scopeLine: 334, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!65 = !DISubroutineType(types: !66)
!66 = !{null, !67, !9}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !70, line: 146, baseType: !71)
!70 = !DIFile(filename: "./lib/readutmp.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !72, line: 55, size: 3072, elements: !73)
!72 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/utmpx.h", directory: "")
!73 = !{!74, !75, !77, !81, !85, !86, !90, !95, !97, !102, !104}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !71, file: !72, line: 57, baseType: !14, size: 16)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !71, file: !72, line: 58, baseType: !76, size: 32, offset: 32)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !12, line: 154, baseType: !53)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !71, file: !72, line: 59, baseType: !78, size: 256, offset: 64)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !71, file: !72, line: 61, baseType: !82, size: 32, offset: 320)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 4)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !71, file: !72, line: 63, baseType: !78, size: 256, offset: 352)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !71, file: !72, line: 65, baseType: !87, size: 2048, offset: 608)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 2048, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 256)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !71, file: !72, line: 67, baseType: !91, size: 32, offset: 2656)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !72, line: 42, size: 32, elements: !92)
!92 = !{!93, !94}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !91, file: !72, line: 45, baseType: !14, size: 16)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !91, file: !72, line: 46, baseType: !14, size: 16, offset: 16)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !71, file: !72, line: 74, baseType: !96, size: 32, offset: 2688)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !12, line: 41, baseType: !53)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !71, file: !72, line: 79, baseType: !98, size: 64, offset: 2720)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !71, file: !72, line: 75, size: 64, elements: !99)
!99 = !{!100, !101}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !98, file: !72, line: 77, baseType: !96, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !98, file: !72, line: 78, baseType: !96, size: 32, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !71, file: !72, line: 84, baseType: !103, size: 128, offset: 2784)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 128, elements: !83)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !71, file: !72, line: 85, baseType: !105, size: 160, offset: 2912)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 160, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 20)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "hostlen", scope: !64, file: !3, line: 341, type: !110, isLocal: true, isDefinition: true)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !111, line: 46, baseType: !112)
!111 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.1/include/stddef.h", directory: "")
!112 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "now", scope: !115, file: !3, line: 190, type: !9, isLocal: true, isDefinition: true)
!115 = distinct !DISubprogram(name: "idle_string", scope: !3, file: !3, line: 188, type: !116, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!116 = !DISubroutineType(types: !117)
!117 = !{!49, !9, !9}
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "idle_hhmm", scope: !115, file: !3, line: 202, type: !120, isLocal: true, isDefinition: true)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 48, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 6)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "buf", scope: !125, file: !3, line: 220, type: !128, isLocal: true, isDefinition: true)
!125 = distinct !DISubprogram(name: "time_string", scope: !3, file: !3, line: 218, type: !126, scopeLine: 219, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!126 = !DISubroutineType(types: !127)
!127 = !{!49, !67}
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 264, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 33)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "runlevline", scope: !133, file: !3, line: 516, type: !6, isLocal: true, isDefinition: true)
!133 = distinct !DISubprogram(name: "print_runlevel", scope: !3, file: !3, line: 514, type: !134, scopeLine: 515, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!134 = !DISubroutineType(types: !135)
!135 = !{null, !67}
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "comment", scope: !133, file: !3, line: 516, type: !6, isLocal: true, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "exitstr", scope: !140, file: !3, line: 461, type: !6, isLocal: true, isDefinition: true)
!140 = distinct !DISubprogram(name: "print_deadprocs", scope: !3, file: !3, line: 459, type: !134, scopeLine: 460, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 4608, elements: !151)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !144, line: 50, size: 256, elements: !145)
!144 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "")
!145 = !{!146, !147, !148, !150}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !143, file: !144, line: 52, baseType: !49, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !143, file: !144, line: 55, baseType: !53, size: 32, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !143, file: !144, line: 56, baseType: !149, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !143, file: !144, line: 57, baseType: !53, size: 32, offset: 192)
!151 = !{!152}
!152 = !DISubrange(count: 18)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "Version", scope: !155, file: !156, line: 2, type: !49, isLocal: false, isDefinition: true)
!155 = distinct !DICompileUnit(language: DW_LANG_C99, file: !156, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !157, nameTableKind: None)
!156 = !DIFile(filename: "src/version.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!157 = !{!153}
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "last_cherror", scope: !160, file: !166, line: 28, type: !53, isLocal: true, isDefinition: true)
!160 = distinct !DICompileUnit(language: DW_LANG_C99, file: !161, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !162, nameTableKind: None)
!161 = !DIFile(filename: "./lib/canon-host.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!162 = !{!163, !158}
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "hints", scope: !165, file: !166, line: 64, type: !169, isLocal: true, isDefinition: true)
!165 = distinct !DISubprogram(name: "canon_host_r", scope: !166, file: !166, line: 61, type: !167, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !160, retainedNodes: !4)
!166 = !DIFile(filename: "lib/canon-host.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!167 = !DISubroutineType(types: !168)
!168 = !{!6, !49, !149}
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !170, line: 565, size: 384, elements: !171)
!170 = !DIFile(filename: "/usr/include/netdb.h", directory: "")
!171 = !{!172, !173, !174, !175, !176, !181, !193, !194}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !169, file: !170, line: 567, baseType: !53, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !169, file: !170, line: 568, baseType: !53, size: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !169, file: !170, line: 569, baseType: !53, size: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !169, file: !170, line: 570, baseType: !53, size: 32, offset: 96)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !169, file: !170, line: 571, baseType: !177, size: 32, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !178, line: 33, baseType: !179)
!178 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "")
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !12, line: 209, baseType: !180)
!180 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !169, file: !170, line: 572, baseType: !182, size: 64, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !178, line: 178, size: 128, elements: !184)
!184 = !{!185, !189}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !183, file: !178, line: 180, baseType: !186, size: 16)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !187, line: 28, baseType: !188)
!187 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "")
!188 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !183, file: !178, line: 181, baseType: !190, size: 112, offset: 16)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 112, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 14)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !169, file: !170, line: 573, baseType: !6, size: 64, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !169, file: !170, line: 574, baseType: !195, size: 64, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !198, file: !203, line: 56, type: !18, isLocal: true, isDefinition: true)
!198 = distinct !DICompileUnit(language: DW_LANG_C99, file: !199, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !200, nameTableKind: None)
!199 = !DIFile(filename: "./lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!200 = !{!201, !196}
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "file_name", scope: !198, file: !203, line: 46, type: !49, isLocal: true, isDefinition: true)
!203 = !DIFile(filename: "lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "exit_failure", scope: !206, file: !209, line: 24, type: !210, isLocal: false, isDefinition: true)
!206 = distinct !DICompileUnit(language: DW_LANG_C99, file: !207, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !208, nameTableKind: None)
!207 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!208 = !{!204}
!209 = !DIFile(filename: "lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!210 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !53)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "program_name", scope: !213, file: !217, line: 33, type: !49, isLocal: false, isDefinition: true)
!213 = distinct !DICompileUnit(language: DW_LANG_C99, file: !214, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !215, globals: !216, nameTableKind: None)
!214 = !DIFile(filename: "./lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!215 = !{!8, !6}
!216 = !{!211}
!217 = !DIFile(filename: "lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !220, file: !241, line: 116, type: !254, isLocal: true, isDefinition: true)
!220 = distinct !DICompileUnit(language: DW_LANG_C99, file: !221, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !222, retainedTypes: !237, globals: !238, nameTableKind: None)
!221 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!222 = !{!223}
!223 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !224, line: 32, baseType: !180, size: 32, elements: !225)
!224 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!225 = !{!226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236}
!226 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!227 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!228 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!229 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!230 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!231 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!232 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!233 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!234 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!235 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!236 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!237 = !{!53, !188, !110}
!238 = !{!239, !246, !252, !218, !264, !266, !273, !275}
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !220, file: !241, line: 85, type: !242, isLocal: false, isDefinition: true)
!241 = !DIFile(filename: "lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 704, elements: !244)
!243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!244 = !{!245}
!245 = !DISubrange(count: 11)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !220, file: !241, line: 101, type: !248, isLocal: false, isDefinition: true)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 320, elements: !250)
!249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !223)
!250 = !{!251}
!251 = !DISubrange(count: 10)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !220, file: !241, line: 1052, type: !254, isLocal: false, isDefinition: true)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !241, line: 65, size: 448, elements: !255)
!255 = !{!256, !257, !258, !262, !263}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !254, file: !241, line: 68, baseType: !223, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !254, file: !241, line: 71, baseType: !53, size: 32, offset: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !254, file: !241, line: 75, baseType: !259, size: 256, offset: 64)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 256, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 8)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !254, file: !241, line: 78, baseType: !49, size: 64, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !254, file: !241, line: 81, baseType: !49, size: 64, offset: 384)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "slot0", scope: !220, file: !241, line: 842, type: !87, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "slotvec", scope: !220, file: !241, line: 845, type: !268, isLocal: true, isDefinition: true)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !241, line: 834, size: 128, elements: !270)
!270 = !{!271, !272}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !269, file: !241, line: 836, baseType: !110, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !269, file: !241, line: 837, baseType: !6, size: 64, offset: 64)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "nslots", scope: !220, file: !241, line: 843, type: !53, isLocal: true, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "slotvec0", scope: !220, file: !241, line: 844, type: !269, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !279, file: !282, line: 26, type: !283, isLocal: false, isDefinition: true)
!279 = distinct !DICompileUnit(language: DW_LANG_C99, file: !280, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !281, nameTableKind: None)
!280 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!281 = !{!277}
!282 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 376, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 47)
!286 = distinct !DICompileUnit(language: DW_LANG_C99, file: !287, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!287 = !DIFile(filename: "./lib/c-ctype.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!288 = distinct !DICompileUnit(language: DW_LANG_C99, file: !289, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!289 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!290 = distinct !DICompileUnit(language: DW_LANG_C99, file: !291, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !292, nameTableKind: None)
!291 = !DIFile(filename: "./lib/imaxtostr.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!292 = !{!293}
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !294, line: 101, baseType: !295)
!294 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !12, line: 72, baseType: !13)
!296 = distinct !DICompileUnit(language: DW_LANG_C99, file: !297, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !298, nameTableKind: None)
!297 = !DIFile(filename: "./lib/setlocale_null.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!298 = !{!8}
!299 = distinct !DICompileUnit(language: DW_LANG_C99, file: !300, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !298, nameTableKind: None)
!300 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!301 = distinct !DICompileUnit(language: DW_LANG_C99, file: !302, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !303, nameTableKind: None)
!302 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!303 = !{!110, !6, !8}
!304 = distinct !DICompileUnit(language: DW_LANG_C99, file: !305, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!305 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!306 = distinct !DICompileUnit(language: DW_LANG_C99, file: !307, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !308, nameTableKind: None)
!307 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!308 = !{!110}
!309 = distinct !DICompileUnit(language: DW_LANG_C99, file: !310, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !311, nameTableKind: None)
!310 = !DIFile(filename: "./lib/readutmp.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!311 = !{!6, !8}
!312 = distinct !DICompileUnit(language: DW_LANG_C99, file: !313, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !314, nameTableKind: None)
!313 = !DIFile(filename: "./lib/c-strcasecmp.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!314 = !{!315}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !317)
!317 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!318 = distinct !DICompileUnit(language: DW_LANG_C99, file: !319, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!319 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!320 = distinct !DICompileUnit(language: DW_LANG_C99, file: !321, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !298, nameTableKind: None)
!321 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!322 = distinct !DICompileUnit(language: DW_LANG_C99, file: !323, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!323 = !DIFile(filename: "./lib/fclose.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!324 = distinct !DICompileUnit(language: DW_LANG_C99, file: !325, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !298, nameTableKind: None)
!325 = !DIFile(filename: "./lib/fflush.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!326 = distinct !DICompileUnit(language: DW_LANG_C99, file: !327, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !298, nameTableKind: None)
!327 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!328 = !{!"clang version 9.0.1-12 "}
!329 = !{i32 2, !"Dwarf Version", i32 4}
!330 = !{i32 2, !"Debug Info Version", i32 3}
!331 = !{i32 1, !"wchar_size", i32 4}
!332 = !{i32 1, !"ThinLTO", i32 0}
!333 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!334 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 638, type: !335, scopeLine: 639, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !53}
!337 = !DILocalVariable(name: "status", arg: 1, scope: !334, file: !3, line: 638, type: !53)
!338 = !DILocation(line: 638, column: 12, scope: !334)
!339 = !DILocation(line: 640, column: 7, scope: !340)
!340 = distinct !DILexicalBlock(scope: !334, file: !3, line: 640, column: 7)
!341 = !DILocation(line: 640, column: 14, scope: !340)
!342 = !DILocation(line: 641, column: 5, scope: !343)
!343 = distinct !DILexicalBlock(scope: !340, file: !3, line: 641, column: 5)
!344 = !DILocation(line: 644, column: 15, scope: !345)
!345 = distinct !DILexicalBlock(scope: !340, file: !3, line: 643, column: 5)
!346 = !DILocation(line: 644, column: 66, scope: !345)
!347 = !DILocation(line: 644, column: 7, scope: !345)
!348 = !DILocation(line: 645, column: 7, scope: !345)
!349 = !DILocation(line: 648, column: 7, scope: !345)
!350 = !DILocation(line: 655, column: 7, scope: !345)
!351 = !DILocation(line: 658, column: 7, scope: !345)
!352 = !DILocation(line: 663, column: 7, scope: !345)
!353 = !DILocation(line: 669, column: 7, scope: !345)
!354 = !DILocation(line: 675, column: 7, scope: !345)
!355 = !DILocation(line: 676, column: 7, scope: !345)
!356 = !DILocation(line: 677, column: 15, scope: !345)
!357 = !DILocation(line: 677, column: 7, scope: !345)
!358 = !DILocation(line: 682, column: 7, scope: !345)
!359 = !DILocation(line: 684, column: 9, scope: !334)
!360 = !DILocation(line: 684, column: 3, scope: !334)
!361 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !362, file: !362, line: 634, type: !363, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!362 = !DIFile(filename: "src/system.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!363 = !DISubroutineType(types: !364)
!364 = !{null, !49}
!365 = !DILocalVariable(name: "program", arg: 1, scope: !361, file: !362, line: 634, type: !49)
!366 = !DILocation(line: 634, column: 34, scope: !361)
!367 = !DILocalVariable(name: "infomap", scope: !361, file: !362, line: 636, type: !368)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 896, elements: !374)
!369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !361, file: !362, line: 636, size: 128, elements: !371)
!371 = !{!372, !373}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !370, file: !362, line: 636, baseType: !49, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !370, file: !362, line: 636, baseType: !49, size: 64, offset: 64)
!374 = !{!375}
!375 = !DISubrange(count: 7)
!376 = !DILocation(line: 636, column: 67, scope: !361)
!377 = !DILocalVariable(name: "node", scope: !361, file: !362, line: 646, type: !49)
!378 = !DILocation(line: 646, column: 15, scope: !361)
!379 = !DILocation(line: 646, column: 22, scope: !361)
!380 = !DILocalVariable(name: "map_prog", scope: !361, file: !362, line: 647, type: !381)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!382 = !DILocation(line: 647, column: 25, scope: !361)
!383 = !DILocation(line: 647, column: 36, scope: !361)
!384 = !DILocation(line: 649, column: 10, scope: !361)
!385 = !DILocation(line: 649, column: 20, scope: !361)
!386 = !DILocation(line: 649, column: 33, scope: !361)
!387 = !DILocation(line: 649, column: 31, scope: !361)
!388 = !DILocation(line: 650, column: 13, scope: !361)
!389 = !DILocation(line: 652, column: 7, scope: !390)
!390 = distinct !DILexicalBlock(scope: !361, file: !362, line: 652, column: 7)
!391 = !DILocation(line: 652, column: 17, scope: !390)
!392 = !DILocation(line: 653, column: 12, scope: !390)
!393 = !DILocation(line: 653, column: 22, scope: !390)
!394 = !DILocation(line: 653, column: 10, scope: !390)
!395 = !DILocation(line: 655, column: 11, scope: !361)
!396 = !DILocation(line: 655, column: 3, scope: !361)
!397 = !DILocalVariable(name: "lc_messages", scope: !361, file: !362, line: 659, type: !49)
!398 = !DILocation(line: 659, column: 15, scope: !361)
!399 = !DILocation(line: 659, column: 29, scope: !361)
!400 = !DILocation(line: 660, column: 7, scope: !401)
!401 = distinct !DILexicalBlock(scope: !361, file: !362, line: 660, column: 7)
!402 = !DILocation(line: 660, column: 22, scope: !401)
!403 = !DILocation(line: 666, column: 7, scope: !404)
!404 = distinct !DILexicalBlock(scope: !401, file: !362, line: 661, column: 5)
!405 = !DILocation(line: 669, column: 11, scope: !361)
!406 = !DILocation(line: 670, column: 24, scope: !361)
!407 = !DILocation(line: 669, column: 3, scope: !361)
!408 = !DILocation(line: 671, column: 11, scope: !361)
!409 = !DILocation(line: 672, column: 11, scope: !361)
!410 = !DILocation(line: 672, column: 17, scope: !361)
!411 = !DILocation(line: 672, column: 25, scope: !361)
!412 = !DILocation(line: 672, column: 22, scope: !361)
!413 = !DILocation(line: 671, column: 3, scope: !361)
!414 = !DILocation(line: 673, column: 1, scope: !361)
!415 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 688, type: !416, scopeLine: 689, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!416 = !DISubroutineType(types: !417)
!417 = !{!53, !53, !418}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!419 = !DILocalVariable(name: "argc", arg: 1, scope: !415, file: !3, line: 688, type: !53)
!420 = !DILocation(line: 688, column: 11, scope: !415)
!421 = !DILocalVariable(name: "argv", arg: 2, scope: !415, file: !3, line: 688, type: !418)
!422 = !DILocation(line: 688, column: 24, scope: !415)
!423 = !DILocalVariable(name: "optc", scope: !415, file: !3, line: 690, type: !53)
!424 = !DILocation(line: 690, column: 7, scope: !415)
!425 = !DILocalVariable(name: "assumptions", scope: !415, file: !3, line: 691, type: !18)
!426 = !DILocation(line: 691, column: 8, scope: !415)
!427 = !DILocation(line: 694, column: 21, scope: !415)
!428 = !DILocation(line: 694, column: 3, scope: !415)
!429 = !DILocation(line: 695, column: 3, scope: !415)
!430 = !DILocation(line: 696, column: 3, scope: !415)
!431 = !DILocation(line: 697, column: 3, scope: !415)
!432 = !DILocation(line: 699, column: 3, scope: !415)
!433 = !DILocation(line: 701, column: 31, scope: !415)
!434 = !DILocation(line: 701, column: 37, scope: !415)
!435 = !DILocation(line: 701, column: 18, scope: !415)
!436 = !DILocation(line: 701, column: 16, scope: !415)
!437 = !DILocation(line: 702, column: 10, scope: !415)
!438 = !DILocation(line: 704, column: 15, scope: !439)
!439 = distinct !DILexicalBlock(scope: !415, file: !3, line: 703, column: 5)
!440 = !DILocation(line: 704, column: 7, scope: !439)
!441 = !DILocation(line: 707, column: 25, scope: !442)
!442 = distinct !DILexicalBlock(scope: !439, file: !3, line: 705, column: 9)
!443 = !DILocation(line: 708, column: 26, scope: !442)
!444 = !DILocation(line: 709, column: 22, scope: !442)
!445 = !DILocation(line: 710, column: 26, scope: !442)
!446 = !DILocation(line: 711, column: 25, scope: !442)
!447 = !DILocation(line: 712, column: 28, scope: !442)
!448 = !DILocation(line: 713, column: 22, scope: !442)
!449 = !DILocation(line: 714, column: 24, scope: !442)
!450 = !DILocation(line: 715, column: 24, scope: !442)
!451 = !DILocation(line: 716, column: 24, scope: !442)
!452 = !DILocation(line: 717, column: 23, scope: !442)
!453 = !DILocation(line: 721, column: 25, scope: !442)
!454 = !DILocation(line: 722, column: 23, scope: !442)
!455 = !DILocation(line: 726, column: 26, scope: !442)
!456 = !DILocation(line: 727, column: 24, scope: !442)
!457 = !DILocation(line: 728, column: 24, scope: !442)
!458 = !DILocation(line: 729, column: 23, scope: !442)
!459 = !DILocation(line: 733, column: 27, scope: !442)
!460 = !DILocation(line: 737, column: 22, scope: !442)
!461 = !DILocation(line: 738, column: 24, scope: !442)
!462 = !DILocation(line: 739, column: 23, scope: !442)
!463 = !DILocation(line: 743, column: 24, scope: !442)
!464 = !DILocation(line: 747, column: 26, scope: !442)
!465 = !DILocation(line: 748, column: 23, scope: !442)
!466 = !DILocation(line: 752, column: 22, scope: !442)
!467 = !DILocation(line: 756, column: 25, scope: !442)
!468 = !DILocation(line: 757, column: 24, scope: !442)
!469 = !DILocation(line: 758, column: 23, scope: !442)
!470 = !DILocation(line: 762, column: 24, scope: !442)
!471 = !DILocation(line: 766, column: 28, scope: !442)
!472 = !DILocation(line: 767, column: 23, scope: !442)
!473 = !DILocation(line: 772, column: 24, scope: !442)
!474 = !DILocation(line: 776, column: 22, scope: !442)
!475 = !DILocation(line: 777, column: 24, scope: !442)
!476 = !DILocation(line: 778, column: 23, scope: !442)
!477 = !DILocation(line: 782, column: 21, scope: !442)
!478 = !DILocation(line: 785, column: 9, scope: !442)
!479 = !DILocation(line: 787, column: 9, scope: !442)
!480 = !DILocation(line: 790, column: 11, scope: !442)
!481 = !DILocation(line: 794, column: 7, scope: !482)
!482 = distinct !DILexicalBlock(scope: !415, file: !3, line: 794, column: 7)
!483 = !DILocation(line: 796, column: 18, scope: !484)
!484 = distinct !DILexicalBlock(scope: !482, file: !3, line: 795, column: 5)
!485 = !DILocation(line: 797, column: 20, scope: !484)
!486 = !DILocation(line: 800, column: 7, scope: !487)
!487 = distinct !DILexicalBlock(scope: !415, file: !3, line: 800, column: 7)
!488 = !DILocation(line: 802, column: 20, scope: !489)
!489 = distinct !DILexicalBlock(scope: !487, file: !3, line: 801, column: 5)
!490 = !DILocation(line: 805, column: 7, scope: !491)
!491 = distinct !DILexicalBlock(scope: !415, file: !3, line: 805, column: 7)
!492 = !DILocation(line: 807, column: 19, scope: !493)
!493 = distinct !DILexicalBlock(scope: !491, file: !3, line: 806, column: 5)
!494 = !DILocation(line: 808, column: 25, scope: !493)
!495 = !DILocation(line: 812, column: 19, scope: !496)
!496 = distinct !DILexicalBlock(scope: !491, file: !3, line: 811, column: 5)
!497 = !DILocation(line: 813, column: 25, scope: !496)
!498 = !DILocation(line: 816, column: 11, scope: !415)
!499 = !DILocation(line: 816, column: 18, scope: !415)
!500 = !DILocation(line: 816, column: 16, scope: !415)
!501 = !DILocation(line: 816, column: 3, scope: !415)
!502 = !DILocation(line: 819, column: 20, scope: !503)
!503 = distinct !DILexicalBlock(scope: !415, file: !3, line: 817, column: 5)
!504 = !DILocation(line: 823, column: 7, scope: !503)
!505 = !DILocation(line: 827, column: 12, scope: !503)
!506 = !DILocation(line: 827, column: 17, scope: !503)
!507 = !DILocation(line: 827, column: 7, scope: !503)
!508 = !DILocation(line: 831, column: 20, scope: !503)
!509 = !DILocation(line: 831, column: 50, scope: !503)
!510 = !DILocation(line: 831, column: 55, scope: !503)
!511 = !DILocation(line: 831, column: 62, scope: !503)
!512 = !DILocation(line: 831, column: 43, scope: !503)
!513 = !DILocation(line: 831, column: 7, scope: !503)
!514 = !DILocation(line: 832, column: 7, scope: !503)
!515 = !DILocation(line: 835, column: 3, scope: !415)
!516 = distinct !DISubprogram(name: "who", scope: !3, file: !3, line: 621, type: !517, scopeLine: 622, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!517 = !DISubroutineType(types: !518)
!518 = !{null, !49, !53}
!519 = !DILocalVariable(name: "filename", arg: 1, scope: !516, file: !3, line: 621, type: !49)
!520 = !DILocation(line: 621, column: 18, scope: !516)
!521 = !DILocalVariable(name: "options", arg: 2, scope: !516, file: !3, line: 621, type: !53)
!522 = !DILocation(line: 621, column: 32, scope: !516)
!523 = !DILocalVariable(name: "n_users", scope: !516, file: !3, line: 623, type: !110)
!524 = !DILocation(line: 623, column: 10, scope: !516)
!525 = !DILocalVariable(name: "utmp_buf", scope: !516, file: !3, line: 624, type: !526)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!527 = !DILocation(line: 624, column: 16, scope: !516)
!528 = !DILocation(line: 626, column: 18, scope: !529)
!529 = distinct !DILexicalBlock(scope: !516, file: !3, line: 626, column: 7)
!530 = !DILocation(line: 626, column: 49, scope: !529)
!531 = !DILocation(line: 626, column: 7, scope: !529)
!532 = !DILocation(line: 626, column: 58, scope: !529)
!533 = !DILocation(line: 627, column: 5, scope: !529)
!534 = !DILocation(line: 629, column: 7, scope: !535)
!535 = distinct !DILexicalBlock(scope: !516, file: !3, line: 629, column: 7)
!536 = !DILocation(line: 630, column: 23, scope: !535)
!537 = !DILocation(line: 630, column: 32, scope: !535)
!538 = !DILocation(line: 630, column: 5, scope: !535)
!539 = !DILocation(line: 632, column: 19, scope: !535)
!540 = !DILocation(line: 632, column: 28, scope: !535)
!541 = !DILocation(line: 632, column: 5, scope: !535)
!542 = !DILocation(line: 634, column: 9, scope: !516)
!543 = !DILocation(line: 634, column: 3, scope: !516)
!544 = !DILocation(line: 635, column: 1, scope: !516)
!545 = distinct !DISubprogram(name: "list_entries_who", scope: !3, file: !3, line: 537, type: !546, scopeLine: 538, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!546 = !DISubroutineType(types: !547)
!547 = !{null, !110, !67}
!548 = !DILocalVariable(name: "n", arg: 1, scope: !545, file: !3, line: 537, type: !110)
!549 = !DILocation(line: 537, column: 26, scope: !545)
!550 = !DILocalVariable(name: "utmp_buf", arg: 2, scope: !545, file: !3, line: 537, type: !67)
!551 = !DILocation(line: 537, column: 48, scope: !545)
!552 = !DILocalVariable(name: "entries", scope: !545, file: !3, line: 539, type: !112)
!553 = !DILocation(line: 539, column: 21, scope: !545)
!554 = !DILocalVariable(name: "separator", scope: !545, file: !3, line: 540, type: !49)
!555 = !DILocation(line: 540, column: 15, scope: !545)
!556 = !DILocation(line: 542, column: 11, scope: !545)
!557 = !DILocation(line: 542, column: 3, scope: !545)
!558 = !DILocation(line: 544, column: 11, scope: !559)
!559 = distinct !DILexicalBlock(scope: !560, file: !3, line: 544, column: 11)
!560 = distinct !DILexicalBlock(scope: !545, file: !3, line: 543, column: 5)
!561 = !DILocalVariable(name: "trimmed_name", scope: !562, file: !3, line: 546, type: !6)
!562 = distinct !DILexicalBlock(scope: !559, file: !3, line: 545, column: 9)
!563 = !DILocation(line: 546, column: 17, scope: !562)
!564 = !DILocation(line: 548, column: 48, scope: !562)
!565 = !DILocation(line: 548, column: 26, scope: !562)
!566 = !DILocation(line: 548, column: 24, scope: !562)
!567 = !DILocation(line: 550, column: 27, scope: !562)
!568 = !DILocation(line: 550, column: 38, scope: !562)
!569 = !DILocation(line: 550, column: 11, scope: !562)
!570 = !DILocation(line: 551, column: 17, scope: !562)
!571 = !DILocation(line: 551, column: 11, scope: !562)
!572 = !DILocation(line: 552, column: 21, scope: !562)
!573 = !DILocation(line: 553, column: 18, scope: !562)
!574 = !DILocation(line: 555, column: 15, scope: !560)
!575 = !DILocation(line: 557, column: 11, scope: !545)
!576 = !DILocation(line: 557, column: 33, scope: !545)
!577 = !DILocation(line: 557, column: 3, scope: !545)
!578 = !DILocation(line: 558, column: 1, scope: !545)
!579 = distinct !DISubprogram(name: "scan_entries", scope: !3, file: !3, line: 569, type: !546, scopeLine: 570, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!580 = !DILocalVariable(name: "n", arg: 1, scope: !579, file: !3, line: 569, type: !110)
!581 = !DILocation(line: 569, column: 22, scope: !579)
!582 = !DILocalVariable(name: "utmp_buf", arg: 2, scope: !579, file: !3, line: 569, type: !67)
!583 = !DILocation(line: 569, column: 44, scope: !579)
!584 = !DILocalVariable(name: "ttyname_b", scope: !579, file: !3, line: 571, type: !6)
!585 = !DILocation(line: 571, column: 9, scope: !579)
!586 = !DILocalVariable(name: "boottime", scope: !579, file: !3, line: 572, type: !9)
!587 = !DILocation(line: 572, column: 10, scope: !579)
!588 = !DILocation(line: 574, column: 7, scope: !589)
!589 = distinct !DILexicalBlock(scope: !579, file: !3, line: 574, column: 7)
!590 = !DILocation(line: 575, column: 5, scope: !589)
!591 = !DILocation(line: 577, column: 7, scope: !592)
!592 = distinct !DILexicalBlock(scope: !579, file: !3, line: 577, column: 7)
!593 = !DILocation(line: 579, column: 19, scope: !594)
!594 = distinct !DILexicalBlock(scope: !592, file: !3, line: 578, column: 5)
!595 = !DILocation(line: 579, column: 17, scope: !594)
!596 = !DILocation(line: 580, column: 12, scope: !597)
!597 = distinct !DILexicalBlock(scope: !594, file: !3, line: 580, column: 11)
!598 = !DILocation(line: 582, column: 11, scope: !599)
!599 = distinct !DILexicalBlock(scope: !594, file: !3, line: 582, column: 11)
!600 = !DILocation(line: 583, column: 19, scope: !599)
!601 = !DILocation(line: 586, column: 11, scope: !579)
!602 = !DILocation(line: 586, column: 3, scope: !579)
!603 = !DILocation(line: 588, column: 12, scope: !604)
!604 = distinct !DILexicalBlock(scope: !605, file: !3, line: 588, column: 11)
!605 = distinct !DILexicalBlock(scope: !579, file: !3, line: 587, column: 5)
!606 = !DILocation(line: 589, column: 14, scope: !604)
!607 = !DILocation(line: 592, column: 15, scope: !608)
!608 = distinct !DILexicalBlock(scope: !609, file: !3, line: 592, column: 15)
!609 = distinct !DILexicalBlock(scope: !604, file: !3, line: 591, column: 9)
!610 = !DILocation(line: 592, column: 29, scope: !608)
!611 = !DILocation(line: 593, column: 25, scope: !608)
!612 = !DILocation(line: 593, column: 35, scope: !608)
!613 = !DILocation(line: 593, column: 13, scope: !608)
!614 = !DILocation(line: 594, column: 20, scope: !615)
!615 = distinct !DILexicalBlock(scope: !608, file: !3, line: 594, column: 20)
!616 = !DILocation(line: 594, column: 37, scope: !615)
!617 = !DILocation(line: 595, column: 29, scope: !615)
!618 = !DILocation(line: 595, column: 13, scope: !615)
!619 = !DILocation(line: 596, column: 20, scope: !620)
!620 = distinct !DILexicalBlock(scope: !615, file: !3, line: 596, column: 20)
!621 = !DILocation(line: 596, column: 37, scope: !620)
!622 = !DILocation(line: 597, column: 29, scope: !620)
!623 = !DILocation(line: 597, column: 13, scope: !620)
!624 = !DILocation(line: 601, column: 20, scope: !625)
!625 = distinct !DILexicalBlock(scope: !620, file: !3, line: 601, column: 20)
!626 = !DILocation(line: 601, column: 40, scope: !625)
!627 = !DILocation(line: 602, column: 32, scope: !625)
!628 = !DILocation(line: 602, column: 13, scope: !625)
!629 = !DILocation(line: 603, column: 20, scope: !630)
!630 = distinct !DILexicalBlock(scope: !625, file: !3, line: 603, column: 20)
!631 = !DILocation(line: 603, column: 38, scope: !630)
!632 = !DILocation(line: 604, column: 30, scope: !630)
!633 = !DILocation(line: 604, column: 13, scope: !630)
!634 = !DILocation(line: 605, column: 20, scope: !635)
!635 = distinct !DILexicalBlock(scope: !630, file: !3, line: 605, column: 20)
!636 = !DILocation(line: 605, column: 34, scope: !635)
!637 = !DILocation(line: 606, column: 26, scope: !635)
!638 = !DILocation(line: 606, column: 13, scope: !635)
!639 = !DILocation(line: 607, column: 20, scope: !640)
!640 = distinct !DILexicalBlock(scope: !635, file: !3, line: 607, column: 20)
!641 = !DILocation(line: 607, column: 38, scope: !640)
!642 = !DILocation(line: 608, column: 30, scope: !640)
!643 = !DILocation(line: 608, column: 13, scope: !640)
!644 = !DILocation(line: 611, column: 11, scope: !645)
!645 = distinct !DILexicalBlock(scope: !605, file: !3, line: 611, column: 11)
!646 = !DILocation(line: 612, column: 20, scope: !645)
!647 = !DILocation(line: 612, column: 18, scope: !645)
!648 = !DILocation(line: 614, column: 15, scope: !605)
!649 = !DILocation(line: 616, column: 1, scope: !579)
!650 = distinct !DISubprogram(name: "print_heading", scope: !3, file: !3, line: 561, type: !651, scopeLine: 562, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!651 = !DISubroutineType(types: !652)
!652 = !{null}
!653 = !DILocation(line: 563, column: 19, scope: !650)
!654 = !DILocation(line: 563, column: 39, scope: !650)
!655 = !DILocation(line: 563, column: 50, scope: !650)
!656 = !DILocation(line: 563, column: 61, scope: !650)
!657 = !DILocation(line: 564, column: 15, scope: !650)
!658 = !DILocation(line: 564, column: 25, scope: !650)
!659 = !DILocation(line: 564, column: 39, scope: !650)
!660 = !DILocation(line: 563, column: 3, scope: !650)
!661 = !DILocation(line: 565, column: 1, scope: !650)
!662 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !64, file: !3, line: 333, type: !67)
!663 = !DILocation(line: 333, column: 32, scope: !64)
!664 = !DILocalVariable(name: "boottime", arg: 2, scope: !64, file: !3, line: 333, type: !9)
!665 = !DILocation(line: 333, column: 49, scope: !64)
!666 = !DILocalVariable(name: "stats", scope: !64, file: !3, line: 335, type: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !668, line: 46, size: 1152, elements: !669)
!668 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!669 = !{!670, !672, !674, !676, !678, !680, !682, !683, !684, !686, !688, !690, !697, !698, !699}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !667, file: !668, line: 48, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !12, line: 145, baseType: !112)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !667, file: !668, line: 53, baseType: !673, size: 64, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !12, line: 148, baseType: !112)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !667, file: !668, line: 61, baseType: !675, size: 64, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !12, line: 151, baseType: !112)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !667, file: !668, line: 62, baseType: !677, size: 32, offset: 192)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !12, line: 150, baseType: !180)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !667, file: !668, line: 64, baseType: !679, size: 32, offset: 224)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !12, line: 146, baseType: !180)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !667, file: !668, line: 65, baseType: !681, size: 32, offset: 256)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !12, line: 147, baseType: !180)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !667, file: !668, line: 67, baseType: !53, size: 32, offset: 288)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !667, file: !668, line: 69, baseType: !671, size: 64, offset: 320)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !667, file: !668, line: 74, baseType: !685, size: 64, offset: 384)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !12, line: 152, baseType: !13)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !667, file: !668, line: 78, baseType: !687, size: 64, offset: 448)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !12, line: 174, baseType: !13)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !667, file: !668, line: 80, baseType: !689, size: 64, offset: 512)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !12, line: 179, baseType: !13)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !667, file: !668, line: 91, baseType: !691, size: 128, offset: 576)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !692, line: 10, size: 128, elements: !693)
!692 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!693 = !{!694, !695}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !691, file: !692, line: 12, baseType: !11, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !691, file: !692, line: 16, baseType: !696, size: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !12, line: 196, baseType: !13)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !667, file: !668, line: 92, baseType: !691, size: 128, offset: 704)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !667, file: !668, line: 93, baseType: !691, size: 128, offset: 832)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !667, file: !668, line: 106, baseType: !700, size: 192, offset: 960)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 192, elements: !60)
!701 = !DILocation(line: 335, column: 15, scope: !64)
!702 = !DILocalVariable(name: "last_change", scope: !64, file: !3, line: 336, type: !9)
!703 = !DILocation(line: 336, column: 10, scope: !64)
!704 = !DILocalVariable(name: "mesg", scope: !64, file: !3, line: 337, type: !7)
!705 = !DILocation(line: 337, column: 8, scope: !64)
!706 = !DILocalVariable(name: "idlestr", scope: !64, file: !3, line: 338, type: !707)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 56, elements: !374)
!708 = !DILocation(line: 338, column: 8, scope: !64)
!709 = !DILocalVariable(name: "line", scope: !64, file: !3, line: 347, type: !710)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 304, elements: !711)
!711 = !{!712}
!712 = !DISubrange(count: 38)
!713 = !DILocation(line: 347, column: 8, scope: !64)
!714 = !DILocalVariable(name: "p", scope: !64, file: !3, line: 348, type: !6)
!715 = !DILocation(line: 348, column: 9, scope: !64)
!716 = !DILocation(line: 348, column: 13, scope: !64)
!717 = !DILocalVariable(name: "pidstr", scope: !64, file: !3, line: 349, type: !718)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !719)
!719 = !{!720}
!720 = !DISubrange(count: 12)
!721 = !DILocation(line: 349, column: 3, scope: !64)
!722 = !DILocation(line: 354, column: 10, scope: !723)
!723 = distinct !DILexicalBlock(scope: !64, file: !3, line: 354, column: 8)
!724 = !DILocation(line: 355, column: 17, scope: !723)
!725 = !DILocation(line: 355, column: 9, scope: !723)
!726 = !DILocation(line: 355, column: 7, scope: !723)
!727 = !DILocation(line: 356, column: 12, scope: !64)
!728 = !DILocation(line: 356, column: 15, scope: !64)
!729 = !DILocation(line: 356, column: 25, scope: !64)
!730 = !DILocation(line: 356, column: 3, scope: !64)
!731 = !DILocation(line: 358, column: 13, scope: !732)
!732 = distinct !DILexicalBlock(scope: !64, file: !3, line: 358, column: 7)
!733 = !DILocation(line: 358, column: 7, scope: !732)
!734 = !DILocation(line: 358, column: 27, scope: !732)
!735 = !DILocation(line: 360, column: 14, scope: !736)
!736 = distinct !DILexicalBlock(scope: !732, file: !3, line: 359, column: 5)
!737 = !DILocation(line: 360, column: 12, scope: !736)
!738 = !DILocation(line: 361, column: 27, scope: !736)
!739 = !DILocation(line: 361, column: 19, scope: !736)
!740 = !DILocation(line: 365, column: 12, scope: !741)
!741 = distinct !DILexicalBlock(scope: !732, file: !3, line: 364, column: 5)
!742 = !DILocation(line: 366, column: 19, scope: !741)
!743 = !DILocation(line: 369, column: 7, scope: !744)
!744 = distinct !DILexicalBlock(scope: !64, file: !3, line: 369, column: 7)
!745 = !DILocation(line: 370, column: 14, scope: !744)
!746 = !DILocation(line: 370, column: 57, scope: !744)
!747 = !DILocation(line: 370, column: 70, scope: !744)
!748 = !DILocation(line: 370, column: 44, scope: !744)
!749 = !DILocation(line: 370, column: 5, scope: !744)
!750 = !DILocation(line: 372, column: 14, scope: !744)
!751 = !DILocation(line: 372, column: 5, scope: !744)
!752 = !DILocation(line: 375, column: 7, scope: !753)
!753 = distinct !DILexicalBlock(scope: !64, file: !3, line: 375, column: 7)
!754 = !DILocation(line: 375, column: 17, scope: !753)
!755 = !DILocalVariable(name: "ut_host", scope: !756, file: !3, line: 377, type: !757)
!756 = distinct !DILexicalBlock(scope: !753, file: !3, line: 376, column: 5)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 2056, elements: !758)
!758 = !{!759}
!759 = !DISubrange(count: 257)
!760 = !DILocation(line: 377, column: 12, scope: !756)
!761 = !DILocalVariable(name: "host", scope: !756, file: !3, line: 378, type: !6)
!762 = !DILocation(line: 378, column: 13, scope: !756)
!763 = !DILocalVariable(name: "display", scope: !756, file: !3, line: 379, type: !6)
!764 = !DILocation(line: 379, column: 13, scope: !756)
!765 = !DILocation(line: 382, column: 16, scope: !756)
!766 = !DILocation(line: 382, column: 25, scope: !756)
!767 = !DILocation(line: 382, column: 35, scope: !756)
!768 = !DILocation(line: 382, column: 7, scope: !756)
!769 = !DILocation(line: 385, column: 25, scope: !756)
!770 = !DILocation(line: 385, column: 17, scope: !756)
!771 = !DILocation(line: 385, column: 15, scope: !756)
!772 = !DILocation(line: 386, column: 11, scope: !773)
!773 = distinct !DILexicalBlock(scope: !756, file: !3, line: 386, column: 11)
!774 = !DILocation(line: 387, column: 17, scope: !773)
!775 = !DILocation(line: 387, column: 20, scope: !773)
!776 = !DILocation(line: 389, column: 11, scope: !777)
!777 = distinct !DILexicalBlock(scope: !756, file: !3, line: 389, column: 11)
!778 = !DILocation(line: 389, column: 23, scope: !777)
!779 = !DILocation(line: 392, column: 30, scope: !780)
!780 = distinct !DILexicalBlock(scope: !777, file: !3, line: 390, column: 9)
!781 = !DILocation(line: 392, column: 18, scope: !780)
!782 = !DILocation(line: 392, column: 16, scope: !780)
!783 = !DILocation(line: 395, column: 13, scope: !784)
!784 = distinct !DILexicalBlock(scope: !756, file: !3, line: 395, column: 11)
!785 = !DILocation(line: 396, column: 16, scope: !784)
!786 = !DILocation(line: 396, column: 14, scope: !784)
!787 = !DILocation(line: 398, column: 11, scope: !788)
!788 = distinct !DILexicalBlock(scope: !756, file: !3, line: 398, column: 11)
!789 = !DILocation(line: 400, column: 15, scope: !790)
!790 = distinct !DILexicalBlock(scope: !791, file: !3, line: 400, column: 15)
!791 = distinct !DILexicalBlock(scope: !788, file: !3, line: 399, column: 9)
!792 = !DILocation(line: 400, column: 33, scope: !790)
!793 = !DILocation(line: 400, column: 25, scope: !790)
!794 = !DILocation(line: 400, column: 49, scope: !790)
!795 = !DILocation(line: 400, column: 41, scope: !790)
!796 = !DILocation(line: 400, column: 39, scope: !790)
!797 = !DILocation(line: 400, column: 58, scope: !790)
!798 = !DILocation(line: 400, column: 23, scope: !790)
!799 = !DILocation(line: 402, column: 33, scope: !800)
!800 = distinct !DILexicalBlock(scope: !790, file: !3, line: 401, column: 13)
!801 = !DILocation(line: 402, column: 25, scope: !800)
!802 = !DILocation(line: 402, column: 49, scope: !800)
!803 = !DILocation(line: 402, column: 41, scope: !800)
!804 = !DILocation(line: 402, column: 39, scope: !800)
!805 = !DILocation(line: 402, column: 58, scope: !800)
!806 = !DILocation(line: 402, column: 23, scope: !800)
!807 = !DILocation(line: 403, column: 21, scope: !800)
!808 = !DILocation(line: 403, column: 15, scope: !800)
!809 = !DILocation(line: 404, column: 34, scope: !800)
!810 = !DILocation(line: 404, column: 25, scope: !800)
!811 = !DILocation(line: 404, column: 23, scope: !800)
!812 = !DILocation(line: 406, column: 20, scope: !791)
!813 = !DILocation(line: 406, column: 40, scope: !791)
!814 = !DILocation(line: 406, column: 46, scope: !791)
!815 = !DILocation(line: 406, column: 11, scope: !791)
!816 = !DILocation(line: 410, column: 15, scope: !817)
!817 = distinct !DILexicalBlock(scope: !818, file: !3, line: 410, column: 15)
!818 = distinct !DILexicalBlock(scope: !788, file: !3, line: 409, column: 9)
!819 = !DILocation(line: 410, column: 33, scope: !817)
!820 = !DILocation(line: 410, column: 25, scope: !817)
!821 = !DILocation(line: 410, column: 39, scope: !817)
!822 = !DILocation(line: 410, column: 23, scope: !817)
!823 = !DILocation(line: 412, column: 33, scope: !824)
!824 = distinct !DILexicalBlock(scope: !817, file: !3, line: 411, column: 13)
!825 = !DILocation(line: 412, column: 25, scope: !824)
!826 = !DILocation(line: 412, column: 39, scope: !824)
!827 = !DILocation(line: 412, column: 23, scope: !824)
!828 = !DILocation(line: 413, column: 21, scope: !824)
!829 = !DILocation(line: 413, column: 15, scope: !824)
!830 = !DILocation(line: 414, column: 34, scope: !824)
!831 = !DILocation(line: 414, column: 25, scope: !824)
!832 = !DILocation(line: 414, column: 23, scope: !824)
!833 = !DILocation(line: 416, column: 20, scope: !818)
!834 = !DILocation(line: 416, column: 37, scope: !818)
!835 = !DILocation(line: 416, column: 11, scope: !818)
!836 = !DILocation(line: 419, column: 11, scope: !837)
!837 = distinct !DILexicalBlock(scope: !756, file: !3, line: 419, column: 11)
!838 = !DILocation(line: 419, column: 19, scope: !837)
!839 = !DILocation(line: 419, column: 16, scope: !837)
!840 = !DILocation(line: 420, column: 15, scope: !837)
!841 = !DILocation(line: 420, column: 9, scope: !837)
!842 = !DILocation(line: 424, column: 11, scope: !843)
!843 = distinct !DILexicalBlock(scope: !844, file: !3, line: 424, column: 11)
!844 = distinct !DILexicalBlock(scope: !753, file: !3, line: 423, column: 5)
!845 = !DILocation(line: 424, column: 19, scope: !843)
!846 = !DILocation(line: 426, column: 19, scope: !847)
!847 = distinct !DILexicalBlock(scope: !843, file: !3, line: 425, column: 9)
!848 = !DILocation(line: 427, column: 17, scope: !847)
!849 = !DILocation(line: 427, column: 11, scope: !847)
!850 = !DILocation(line: 428, column: 30, scope: !847)
!851 = !DILocation(line: 428, column: 21, scope: !847)
!852 = !DILocation(line: 428, column: 19, scope: !847)
!853 = !DILocation(line: 430, column: 8, scope: !844)
!854 = !DILocation(line: 430, column: 16, scope: !844)
!855 = !DILocation(line: 434, column: 42, scope: !64)
!856 = !DILocation(line: 434, column: 62, scope: !64)
!857 = !DILocation(line: 435, column: 41, scope: !64)
!858 = !DILocation(line: 435, column: 51, scope: !64)
!859 = !DILocation(line: 436, column: 28, scope: !64)
!860 = !DILocation(line: 436, column: 15, scope: !64)
!861 = !DILocation(line: 436, column: 39, scope: !64)
!862 = !DILocation(line: 436, column: 48, scope: !64)
!863 = !DILocation(line: 437, column: 15, scope: !64)
!864 = !DILocation(line: 437, column: 25, scope: !64)
!865 = !DILocation(line: 434, column: 3, scope: !64)
!866 = !DILocation(line: 438, column: 1, scope: !64)
!867 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !133, file: !3, line: 514, type: !67)
!868 = !DILocation(line: 514, column: 36, scope: !133)
!869 = !DILocalVariable(name: "last", scope: !133, file: !3, line: 517, type: !317)
!870 = !DILocation(line: 517, column: 17, scope: !133)
!871 = !DILocation(line: 517, column: 24, scope: !133)
!872 = !DILocation(line: 517, column: 42, scope: !133)
!873 = !DILocalVariable(name: "curr", scope: !133, file: !3, line: 518, type: !317)
!874 = !DILocation(line: 518, column: 17, scope: !133)
!875 = !DILocation(line: 518, column: 24, scope: !133)
!876 = !DILocation(line: 518, column: 42, scope: !133)
!877 = !DILocation(line: 520, column: 8, scope: !878)
!878 = distinct !DILexicalBlock(scope: !133, file: !3, line: 520, column: 7)
!879 = !DILocation(line: 521, column: 35, scope: !878)
!880 = !DILocation(line: 521, column: 27, scope: !878)
!881 = !DILocation(line: 521, column: 51, scope: !878)
!882 = !DILocation(line: 521, column: 18, scope: !878)
!883 = !DILocation(line: 521, column: 16, scope: !878)
!884 = !DILocation(line: 522, column: 12, scope: !133)
!885 = !DILocation(line: 522, column: 33, scope: !133)
!886 = !DILocation(line: 522, column: 49, scope: !133)
!887 = !DILocation(line: 522, column: 3, scope: !133)
!888 = !DILocation(line: 524, column: 8, scope: !889)
!889 = distinct !DILexicalBlock(scope: !133, file: !3, line: 524, column: 7)
!890 = !DILocation(line: 525, column: 32, scope: !889)
!891 = !DILocation(line: 525, column: 24, scope: !889)
!892 = !DILocation(line: 525, column: 44, scope: !889)
!893 = !DILocation(line: 525, column: 15, scope: !889)
!894 = !DILocation(line: 525, column: 13, scope: !889)
!895 = !DILocation(line: 526, column: 12, scope: !133)
!896 = !DILocation(line: 526, column: 29, scope: !133)
!897 = !DILocation(line: 526, column: 42, scope: !133)
!898 = !DILocation(line: 526, column: 47, scope: !133)
!899 = !DILocation(line: 526, column: 63, scope: !133)
!900 = !DILocation(line: 526, column: 3, scope: !133)
!901 = !DILocation(line: 528, column: 32, scope: !133)
!902 = !DILocation(line: 528, column: 57, scope: !133)
!903 = !DILocation(line: 528, column: 44, scope: !133)
!904 = !DILocation(line: 529, column: 34, scope: !133)
!905 = !DILocation(line: 529, column: 23, scope: !133)
!906 = !DILocation(line: 529, column: 42, scope: !133)
!907 = !DILocation(line: 528, column: 3, scope: !133)
!908 = !DILocation(line: 531, column: 3, scope: !133)
!909 = distinct !DISubprogram(name: "print_boottime", scope: !3, file: !3, line: 441, type: !134, scopeLine: 442, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!910 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !909, file: !3, line: 441, type: !67)
!911 = !DILocation(line: 441, column: 36, scope: !909)
!912 = !DILocation(line: 443, column: 32, scope: !909)
!913 = !DILocation(line: 444, column: 28, scope: !909)
!914 = !DILocation(line: 444, column: 15, scope: !909)
!915 = !DILocation(line: 443, column: 3, scope: !909)
!916 = !DILocation(line: 445, column: 1, scope: !909)
!917 = distinct !DISubprogram(name: "print_clockchange", scope: !3, file: !3, line: 506, type: !134, scopeLine: 507, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!918 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !917, file: !3, line: 506, type: !67)
!919 = !DILocation(line: 506, column: 39, scope: !917)
!920 = !DILocation(line: 509, column: 32, scope: !917)
!921 = !DILocation(line: 510, column: 28, scope: !917)
!922 = !DILocation(line: 510, column: 15, scope: !917)
!923 = !DILocation(line: 509, column: 3, scope: !917)
!924 = !DILocation(line: 511, column: 1, scope: !917)
!925 = distinct !DISubprogram(name: "print_initspawn", scope: !3, file: !3, line: 495, type: !134, scopeLine: 496, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!926 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !925, file: !3, line: 495, type: !67)
!927 = !DILocation(line: 495, column: 37, scope: !925)
!928 = !DILocalVariable(name: "comment", scope: !925, file: !3, line: 497, type: !6)
!929 = !DILocation(line: 497, column: 9, scope: !925)
!930 = !DILocation(line: 497, column: 43, scope: !925)
!931 = !DILocation(line: 497, column: 19, scope: !925)
!932 = !DILocalVariable(name: "pidstr", scope: !925, file: !3, line: 498, type: !718)
!933 = !DILocation(line: 498, column: 3, scope: !925)
!934 = !DILocation(line: 500, column: 54, scope: !925)
!935 = !DILocation(line: 500, column: 64, scope: !925)
!936 = !DILocation(line: 501, column: 28, scope: !925)
!937 = !DILocation(line: 501, column: 15, scope: !925)
!938 = !DILocation(line: 501, column: 43, scope: !925)
!939 = !DILocation(line: 501, column: 51, scope: !925)
!940 = !DILocation(line: 500, column: 3, scope: !925)
!941 = !DILocation(line: 502, column: 9, scope: !925)
!942 = !DILocation(line: 502, column: 3, scope: !925)
!943 = !DILocation(line: 503, column: 1, scope: !925)
!944 = distinct !DISubprogram(name: "print_login", scope: !3, file: !3, line: 482, type: !134, scopeLine: 483, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!945 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !944, file: !3, line: 482, type: !67)
!946 = !DILocation(line: 482, column: 33, scope: !944)
!947 = !DILocalVariable(name: "comment", scope: !944, file: !3, line: 484, type: !6)
!948 = !DILocation(line: 484, column: 9, scope: !944)
!949 = !DILocation(line: 484, column: 43, scope: !944)
!950 = !DILocation(line: 484, column: 19, scope: !944)
!951 = !DILocalVariable(name: "pidstr", scope: !944, file: !3, line: 485, type: !718)
!952 = !DILocation(line: 485, column: 3, scope: !944)
!953 = !DILocation(line: 489, column: 19, scope: !944)
!954 = !DILocation(line: 489, column: 62, scope: !944)
!955 = !DILocation(line: 489, column: 72, scope: !944)
!956 = !DILocation(line: 490, column: 28, scope: !944)
!957 = !DILocation(line: 490, column: 15, scope: !944)
!958 = !DILocation(line: 490, column: 43, scope: !944)
!959 = !DILocation(line: 490, column: 51, scope: !944)
!960 = !DILocation(line: 489, column: 3, scope: !944)
!961 = !DILocation(line: 491, column: 9, scope: !944)
!962 = !DILocation(line: 491, column: 3, scope: !944)
!963 = !DILocation(line: 492, column: 1, scope: !944)
!964 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !140, file: !3, line: 459, type: !67)
!965 = !DILocation(line: 459, column: 37, scope: !140)
!966 = !DILocalVariable(name: "comment", scope: !140, file: !3, line: 462, type: !6)
!967 = !DILocation(line: 462, column: 9, scope: !140)
!968 = !DILocation(line: 462, column: 43, scope: !140)
!969 = !DILocation(line: 462, column: 19, scope: !140)
!970 = !DILocalVariable(name: "pidstr", scope: !140, file: !3, line: 463, type: !718)
!971 = !DILocation(line: 463, column: 3, scope: !140)
!972 = !DILocation(line: 465, column: 8, scope: !973)
!973 = distinct !DILexicalBlock(scope: !140, file: !3, line: 465, column: 7)
!974 = !DILocation(line: 466, column: 32, scope: !973)
!975 = !DILocation(line: 466, column: 24, scope: !973)
!976 = !DILocation(line: 467, column: 24, scope: !973)
!977 = !DILocation(line: 467, column: 78, scope: !973)
!978 = !DILocation(line: 468, column: 34, scope: !973)
!979 = !DILocation(line: 468, column: 26, scope: !973)
!980 = !DILocation(line: 468, column: 24, scope: !973)
!981 = !DILocation(line: 469, column: 24, scope: !973)
!982 = !DILocation(line: 470, column: 24, scope: !973)
!983 = !DILocation(line: 466, column: 15, scope: !973)
!984 = !DILocation(line: 466, column: 13, scope: !973)
!985 = !DILocation(line: 471, column: 12, scope: !140)
!986 = !DILocation(line: 471, column: 34, scope: !140)
!987 = !DILocation(line: 471, column: 46, scope: !140)
!988 = !DILocation(line: 472, column: 12, scope: !140)
!989 = !DILocation(line: 472, column: 24, scope: !140)
!990 = !DILocation(line: 471, column: 3, scope: !140)
!991 = !DILocation(line: 476, column: 54, scope: !140)
!992 = !DILocation(line: 476, column: 64, scope: !140)
!993 = !DILocation(line: 477, column: 28, scope: !140)
!994 = !DILocation(line: 477, column: 15, scope: !140)
!995 = !DILocation(line: 477, column: 43, scope: !140)
!996 = !DILocation(line: 477, column: 51, scope: !140)
!997 = !DILocation(line: 477, column: 60, scope: !140)
!998 = !DILocation(line: 476, column: 3, scope: !140)
!999 = !DILocation(line: 478, column: 9, scope: !140)
!1000 = !DILocation(line: 478, column: 3, scope: !140)
!1001 = !DILocation(line: 479, column: 1, scope: !140)
!1002 = distinct !DISubprogram(name: "make_id_equals_comment", scope: !3, file: !3, line: 448, type: !1003, scopeLine: 449, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!6, !67}
!1005 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !1002, file: !3, line: 448, type: !67)
!1006 = !DILocation(line: 448, column: 44, scope: !1002)
!1007 = !DILocalVariable(name: "utmpsize", scope: !1002, file: !3, line: 450, type: !110)
!1008 = !DILocation(line: 450, column: 10, scope: !1002)
!1009 = !DILocalVariable(name: "comment", scope: !1002, file: !3, line: 451, type: !6)
!1010 = !DILocation(line: 451, column: 9, scope: !1002)
!1011 = !DILocation(line: 451, column: 36, scope: !1002)
!1012 = !DILocation(line: 451, column: 28, scope: !1002)
!1013 = !DILocation(line: 451, column: 48, scope: !1002)
!1014 = !DILocation(line: 451, column: 46, scope: !1002)
!1015 = !DILocation(line: 451, column: 57, scope: !1002)
!1016 = !DILocation(line: 451, column: 19, scope: !1002)
!1017 = !DILocation(line: 453, column: 11, scope: !1002)
!1018 = !DILocation(line: 453, column: 20, scope: !1002)
!1019 = !DILocation(line: 453, column: 3, scope: !1002)
!1020 = !DILocation(line: 454, column: 12, scope: !1002)
!1021 = !DILocation(line: 454, column: 21, scope: !1002)
!1022 = !DILocation(line: 454, column: 39, scope: !1002)
!1023 = !DILocation(line: 454, column: 3, scope: !1002)
!1024 = !DILocation(line: 455, column: 10, scope: !1002)
!1025 = !DILocation(line: 455, column: 3, scope: !1002)
!1026 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !125, file: !3, line: 218, type: !67)
!1027 = !DILocation(line: 218, column: 33, scope: !125)
!1028 = !DILocalVariable(name: "t", scope: !125, file: !3, line: 228, type: !9)
!1029 = !DILocation(line: 228, column: 10, scope: !125)
!1030 = !DILocation(line: 228, column: 14, scope: !125)
!1031 = !DILocalVariable(name: "tmp", scope: !125, file: !3, line: 229, type: !1032)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !1034, line: 7, size: 448, elements: !1035)
!1034 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h", directory: "")
!1035 = !{!1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !1033, file: !1034, line: 9, baseType: !53, size: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !1033, file: !1034, line: 10, baseType: !53, size: 32, offset: 32)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !1033, file: !1034, line: 11, baseType: !53, size: 32, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !1033, file: !1034, line: 12, baseType: !53, size: 32, offset: 96)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !1033, file: !1034, line: 13, baseType: !53, size: 32, offset: 128)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !1033, file: !1034, line: 14, baseType: !53, size: 32, offset: 160)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !1033, file: !1034, line: 15, baseType: !53, size: 32, offset: 192)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !1033, file: !1034, line: 16, baseType: !53, size: 32, offset: 224)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !1033, file: !1034, line: 17, baseType: !53, size: 32, offset: 256)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !1033, file: !1034, line: 20, baseType: !13, size: 64, offset: 320)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !1033, file: !1034, line: 21, baseType: !49, size: 64, offset: 384)
!1047 = !DILocation(line: 229, column: 14, scope: !125)
!1048 = !DILocation(line: 229, column: 20, scope: !125)
!1049 = !DILocation(line: 231, column: 7, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !125, file: !3, line: 231, column: 7)
!1051 = !DILocation(line: 233, column: 34, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !1050, file: !3, line: 232, column: 5)
!1053 = !DILocation(line: 233, column: 47, scope: !1052)
!1054 = !DILocation(line: 233, column: 7, scope: !1052)
!1055 = !DILocation(line: 234, column: 7, scope: !1052)
!1056 = !DILocation(line: 237, column: 23, scope: !1050)
!1057 = !DILocation(line: 237, column: 12, scope: !1050)
!1058 = !DILocation(line: 237, column: 5, scope: !1050)
!1059 = !DILocation(line: 238, column: 1, scope: !125)
!1060 = !DILocalVariable(name: "userlen", arg: 1, scope: !56, file: !3, line: 244, type: !53)
!1061 = !DILocation(line: 244, column: 17, scope: !56)
!1062 = !DILocalVariable(name: "user", arg: 2, scope: !56, file: !3, line: 244, type: !49)
!1063 = !DILocation(line: 244, column: 38, scope: !56)
!1064 = !DILocalVariable(name: "state", arg: 3, scope: !56, file: !3, line: 244, type: !50)
!1065 = !DILocation(line: 244, column: 55, scope: !56)
!1066 = !DILocalVariable(name: "linelen", arg: 4, scope: !56, file: !3, line: 245, type: !53)
!1067 = !DILocation(line: 245, column: 17, scope: !56)
!1068 = !DILocalVariable(name: "line", arg: 5, scope: !56, file: !3, line: 245, type: !49)
!1069 = !DILocation(line: 245, column: 38, scope: !56)
!1070 = !DILocalVariable(name: "time_str", arg: 6, scope: !56, file: !3, line: 246, type: !49)
!1071 = !DILocation(line: 246, column: 25, scope: !56)
!1072 = !DILocalVariable(name: "idle", arg: 7, scope: !56, file: !3, line: 246, type: !49)
!1073 = !DILocation(line: 246, column: 47, scope: !56)
!1074 = !DILocalVariable(name: "pid", arg: 8, scope: !56, file: !3, line: 246, type: !49)
!1075 = !DILocation(line: 246, column: 65, scope: !56)
!1076 = !DILocalVariable(name: "comment", arg: 9, scope: !56, file: !3, line: 247, type: !49)
!1077 = !DILocation(line: 247, column: 25, scope: !56)
!1078 = !DILocalVariable(name: "exitstr", arg: 10, scope: !56, file: !3, line: 247, type: !49)
!1079 = !DILocation(line: 247, column: 46, scope: !56)
!1080 = !DILocalVariable(name: "buf", scope: !56, file: !3, line: 250, type: !6)
!1081 = !DILocation(line: 250, column: 9, scope: !56)
!1082 = !DILocalVariable(name: "x_idle", scope: !56, file: !3, line: 251, type: !1083)
!1083 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !260)
!1084 = !DILocation(line: 251, column: 8, scope: !56)
!1085 = !DILocalVariable(name: "x_pid", scope: !56, file: !3, line: 252, type: !1086)
!1086 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 104, elements: !1087)
!1087 = !{!1088}
!1088 = !DISubrange(count: 13)
!1089 = !DILocation(line: 252, column: 8, scope: !56)
!1090 = !DILocalVariable(name: "x_exitstr", scope: !56, file: !3, line: 253, type: !6)
!1091 = !DILocation(line: 253, column: 9, scope: !56)
!1092 = !DILocalVariable(name: "err", scope: !56, file: !3, line: 254, type: !53)
!1093 = !DILocation(line: 254, column: 7, scope: !56)
!1094 = !DILocation(line: 256, column: 13, scope: !56)
!1095 = !DILocation(line: 256, column: 11, scope: !56)
!1096 = !DILocation(line: 258, column: 7, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !56, file: !3, line: 258, column: 7)
!1098 = !DILocation(line: 258, column: 24, scope: !1097)
!1099 = !DILocation(line: 258, column: 48, scope: !1097)
!1100 = !DILocation(line: 258, column: 40, scope: !1097)
!1101 = !DILocation(line: 258, column: 54, scope: !1097)
!1102 = !DILocation(line: 259, column: 14, scope: !1097)
!1103 = !DILocation(line: 259, column: 31, scope: !1097)
!1104 = !DILocation(line: 259, column: 5, scope: !1097)
!1105 = !DILocation(line: 261, column: 5, scope: !1097)
!1106 = !DILocation(line: 261, column: 13, scope: !1097)
!1107 = !DILocation(line: 263, column: 8, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !56, file: !3, line: 263, column: 7)
!1109 = !DILocation(line: 263, column: 32, scope: !1108)
!1110 = !DILocation(line: 263, column: 24, scope: !1108)
!1111 = !DILocation(line: 263, column: 37, scope: !1108)
!1112 = !DILocation(line: 264, column: 14, scope: !1108)
!1113 = !DILocation(line: 264, column: 30, scope: !1108)
!1114 = !DILocation(line: 264, column: 5, scope: !1108)
!1115 = !DILocation(line: 266, column: 5, scope: !1108)
!1116 = !DILocation(line: 266, column: 12, scope: !1108)
!1117 = !DILocation(line: 268, column: 24, scope: !56)
!1118 = !DILocation(line: 268, column: 43, scope: !56)
!1119 = !DILocation(line: 268, column: 41, scope: !56)
!1120 = !DILocation(line: 268, column: 70, scope: !56)
!1121 = !DILocation(line: 268, column: 15, scope: !56)
!1122 = !DILocation(line: 268, column: 13, scope: !56)
!1123 = !DILocation(line: 269, column: 7, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !56, file: !3, line: 269, column: 7)
!1125 = !DILocation(line: 270, column: 14, scope: !1124)
!1126 = !DILocation(line: 270, column: 35, scope: !1124)
!1127 = !DILocation(line: 270, column: 5, scope: !1124)
!1128 = !DILocation(line: 272, column: 6, scope: !1124)
!1129 = !DILocation(line: 272, column: 16, scope: !1124)
!1130 = !DILocation(line: 284, column: 19, scope: !56)
!1131 = !DILocation(line: 284, column: 28, scope: !56)
!1132 = !DILocation(line: 284, column: 35, scope: !56)
!1133 = !DILocation(line: 285, column: 19, scope: !56)
!1134 = !DILocation(line: 286, column: 19, scope: !56)
!1135 = !DILocation(line: 286, column: 28, scope: !56)
!1136 = !DILocation(line: 287, column: 19, scope: !56)
!1137 = !DILocation(line: 288, column: 19, scope: !56)
!1138 = !DILocation(line: 289, column: 19, scope: !56)
!1139 = !DILocation(line: 290, column: 19, scope: !56)
!1140 = !DILocation(line: 295, column: 19, scope: !56)
!1141 = !DILocation(line: 296, column: 19, scope: !56)
!1142 = !DILocation(line: 274, column: 9, scope: !56)
!1143 = !DILocation(line: 274, column: 7, scope: !56)
!1144 = !DILocation(line: 298, column: 7, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !56, file: !3, line: 298, column: 7)
!1146 = !DILocation(line: 299, column: 5, scope: !1145)
!1147 = !DILocalVariable(name: "p", scope: !1148, file: !3, line: 303, type: !6)
!1148 = distinct !DILexicalBlock(scope: !56, file: !3, line: 301, column: 3)
!1149 = !DILocation(line: 303, column: 11, scope: !1148)
!1150 = !DILocation(line: 303, column: 15, scope: !1148)
!1151 = !DILocation(line: 303, column: 29, scope: !1148)
!1152 = !DILocation(line: 303, column: 21, scope: !1148)
!1153 = !DILocation(line: 303, column: 19, scope: !1148)
!1154 = !DILocation(line: 304, column: 13, scope: !1148)
!1155 = !DILocation(line: 304, column: 12, scope: !1148)
!1156 = !DILocation(line: 304, column: 17, scope: !1148)
!1157 = !DILocation(line: 306, column: 7, scope: !1148)
!1158 = !DILocation(line: 306, column: 9, scope: !1148)
!1159 = !DILocation(line: 306, column: 14, scope: !1148)
!1160 = !DILocation(line: 309, column: 9, scope: !56)
!1161 = !DILocation(line: 309, column: 3, scope: !56)
!1162 = !DILocation(line: 310, column: 9, scope: !56)
!1163 = !DILocation(line: 310, column: 3, scope: !56)
!1164 = !DILocation(line: 311, column: 9, scope: !56)
!1165 = !DILocation(line: 311, column: 3, scope: !56)
!1166 = !DILocation(line: 312, column: 1, scope: !56)
!1167 = distinct !DISubprogram(name: "timetostr", scope: !362, file: !362, line: 690, type: !1168, scopeLine: 691, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{!6, !9, !6}
!1170 = !DILocalVariable(name: "t", arg: 1, scope: !1167, file: !362, line: 690, type: !9)
!1171 = !DILocation(line: 690, column: 19, scope: !1167)
!1172 = !DILocalVariable(name: "buf", arg: 2, scope: !1167, file: !362, line: 690, type: !6)
!1173 = !DILocation(line: 690, column: 28, scope: !1167)
!1174 = !DILocation(line: 693, column: 24, scope: !1167)
!1175 = !DILocation(line: 693, column: 27, scope: !1167)
!1176 = !DILocation(line: 693, column: 13, scope: !1167)
!1177 = !DILocation(line: 692, column: 3, scope: !1167)
!1178 = distinct !DISubprogram(name: "stzncpy", scope: !362, file: !362, line: 741, type: !1179, scopeLine: 742, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{!6, !1181, !1182, !110}
!1181 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !6)
!1182 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !49)
!1183 = !DILocalVariable(name: "dest", arg: 1, scope: !1178, file: !362, line: 741, type: !1181)
!1184 = !DILocation(line: 741, column: 25, scope: !1178)
!1185 = !DILocalVariable(name: "src", arg: 2, scope: !1178, file: !362, line: 741, type: !1182)
!1186 = !DILocation(line: 741, column: 52, scope: !1178)
!1187 = !DILocalVariable(name: "len", arg: 3, scope: !1178, file: !362, line: 741, type: !110)
!1188 = !DILocation(line: 741, column: 64, scope: !1178)
!1189 = !DILocalVariable(name: "src_end", scope: !1178, file: !362, line: 743, type: !49)
!1190 = !DILocation(line: 743, column: 15, scope: !1178)
!1191 = !DILocation(line: 743, column: 25, scope: !1178)
!1192 = !DILocation(line: 743, column: 31, scope: !1178)
!1193 = !DILocation(line: 743, column: 29, scope: !1178)
!1194 = !DILocation(line: 744, column: 10, scope: !1178)
!1195 = !DILocation(line: 744, column: 16, scope: !1178)
!1196 = !DILocation(line: 744, column: 14, scope: !1178)
!1197 = !DILocation(line: 744, column: 28, scope: !1178)
!1198 = !DILocation(line: 744, column: 27, scope: !1178)
!1199 = !DILocation(line: 744, column: 24, scope: !1178)
!1200 = !DILocation(line: 745, column: 19, scope: !1178)
!1201 = !DILocation(line: 745, column: 15, scope: !1178)
!1202 = !DILocation(line: 745, column: 10, scope: !1178)
!1203 = !DILocation(line: 745, column: 13, scope: !1178)
!1204 = !DILocation(line: 746, column: 4, scope: !1178)
!1205 = !DILocation(line: 746, column: 9, scope: !1178)
!1206 = !DILocation(line: 747, column: 10, scope: !1178)
!1207 = !DILocation(line: 747, column: 3, scope: !1178)
!1208 = distinct !DISubprogram(name: "is_tty_writable", scope: !3, file: !3, line: 317, type: !1209, scopeLine: 318, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{!18, !1211}
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!1213 = !DILocalVariable(name: "pstat", arg: 1, scope: !1208, file: !3, line: 317, type: !1211)
!1214 = !DILocation(line: 317, column: 37, scope: !1208)
!1215 = !DILocation(line: 327, column: 10, scope: !1208)
!1216 = !DILocation(line: 327, column: 17, scope: !1208)
!1217 = !DILocation(line: 327, column: 25, scope: !1208)
!1218 = !DILocation(line: 327, column: 3, scope: !1208)
!1219 = !DILocalVariable(name: "when", arg: 1, scope: !115, file: !3, line: 188, type: !9)
!1220 = !DILocation(line: 188, column: 21, scope: !115)
!1221 = !DILocalVariable(name: "boottime", arg: 2, scope: !115, file: !3, line: 188, type: !9)
!1222 = !DILocation(line: 188, column: 34, scope: !115)
!1223 = !DILocation(line: 192, column: 7, scope: !1224)
!1224 = distinct !DILexicalBlock(scope: !115, file: !3, line: 192, column: 7)
!1225 = !DILocation(line: 192, column: 11, scope: !1224)
!1226 = !DILocation(line: 193, column: 5, scope: !1224)
!1227 = !DILocation(line: 195, column: 7, scope: !1228)
!1228 = distinct !DILexicalBlock(scope: !115, file: !3, line: 195, column: 7)
!1229 = !DILocation(line: 195, column: 18, scope: !1228)
!1230 = !DILocation(line: 195, column: 16, scope: !1228)
!1231 = !DILocation(line: 195, column: 26, scope: !1228)
!1232 = !DILocation(line: 195, column: 30, scope: !1228)
!1233 = !DILocation(line: 195, column: 47, scope: !1228)
!1234 = !DILocation(line: 195, column: 45, scope: !1228)
!1235 = !DILocation(line: 195, column: 55, scope: !1228)
!1236 = !DILocation(line: 195, column: 63, scope: !1228)
!1237 = !DILocation(line: 195, column: 60, scope: !1228)
!1238 = !DILocalVariable(name: "seconds_idle", scope: !1239, file: !3, line: 197, type: !53)
!1239 = distinct !DILexicalBlock(scope: !1228, file: !3, line: 196, column: 5)
!1240 = !DILocation(line: 197, column: 11, scope: !1239)
!1241 = !DILocation(line: 197, column: 26, scope: !1239)
!1242 = !DILocation(line: 197, column: 32, scope: !1239)
!1243 = !DILocation(line: 197, column: 30, scope: !1239)
!1244 = !DILocation(line: 198, column: 11, scope: !1245)
!1245 = distinct !DILexicalBlock(scope: !1239, file: !3, line: 198, column: 11)
!1246 = !DILocation(line: 198, column: 24, scope: !1245)
!1247 = !DILocation(line: 199, column: 9, scope: !1245)
!1248 = !DILocation(line: 205, column: 11, scope: !1249)
!1249 = distinct !DILexicalBlock(scope: !1250, file: !3, line: 205, column: 11)
!1250 = distinct !DILexicalBlock(scope: !1251, file: !3, line: 205, column: 11)
!1251 = distinct !DILexicalBlock(scope: !1245, file: !3, line: 201, column: 9)
!1252 = !DILocation(line: 207, column: 20, scope: !1251)
!1253 = !DILocation(line: 207, column: 33, scope: !1251)
!1254 = !DILocation(line: 208, column: 21, scope: !1251)
!1255 = !DILocation(line: 208, column: 34, scope: !1251)
!1256 = !DILocation(line: 208, column: 47, scope: !1251)
!1257 = !DILocation(line: 206, column: 11, scope: !1251)
!1258 = !DILocation(line: 209, column: 11, scope: !1251)
!1259 = !DILocation(line: 213, column: 10, scope: !115)
!1260 = !DILocation(line: 213, column: 3, scope: !115)
!1261 = !DILocation(line: 214, column: 1, scope: !115)
!1262 = distinct !DISubprogram(name: "c_isprint", scope: !1263, file: !1263, line: 272, type: !1264, scopeLine: 273, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !286, retainedNodes: !4)
!1263 = !DIFile(filename: "./lib/c-ctype.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!1264 = !DISubroutineType(types: !1265)
!1265 = !{!18, !53}
!1266 = !DILocalVariable(name: "c", arg: 1, scope: !1262, file: !1263, line: 272, type: !53)
!1267 = !DILocation(line: 272, column: 16, scope: !1262)
!1268 = !DILocation(line: 274, column: 11, scope: !1262)
!1269 = !DILocation(line: 274, column: 3, scope: !1262)
!1270 = !DILocation(line: 281, column: 7, scope: !1271)
!1271 = distinct !DILexicalBlock(scope: !1262, file: !1263, line: 275, column: 5)
!1272 = !DILocation(line: 283, column: 7, scope: !1271)
!1273 = !DILocation(line: 285, column: 1, scope: !1262)
!1274 = distinct !DISubprogram(name: "c_tolower", scope: !1263, file: !1263, line: 337, type: !1275, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !286, retainedNodes: !4)
!1275 = !DISubroutineType(types: !1276)
!1276 = !{!53, !53}
!1277 = !DILocalVariable(name: "c", arg: 1, scope: !1274, file: !1263, line: 337, type: !53)
!1278 = !DILocation(line: 337, column: 16, scope: !1274)
!1279 = !DILocation(line: 339, column: 11, scope: !1274)
!1280 = !DILocation(line: 339, column: 3, scope: !1274)
!1281 = !DILocation(line: 342, column: 14, scope: !1282)
!1282 = distinct !DILexicalBlock(scope: !1274, file: !1263, line: 340, column: 5)
!1283 = !DILocation(line: 342, column: 16, scope: !1282)
!1284 = !DILocation(line: 342, column: 22, scope: !1282)
!1285 = !DILocation(line: 342, column: 7, scope: !1282)
!1286 = !DILocation(line: 344, column: 14, scope: !1282)
!1287 = !DILocation(line: 344, column: 7, scope: !1282)
!1288 = !DILocation(line: 346, column: 1, scope: !1274)
!1289 = distinct !DISubprogram(name: "canon_host", scope: !166, file: !166, line: 33, type: !1290, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !160, retainedNodes: !4)
!1290 = !DISubroutineType(types: !1291)
!1291 = !{!6, !49}
!1292 = !DILocalVariable(name: "host", arg: 1, scope: !1289, file: !166, line: 33, type: !49)
!1293 = !DILocation(line: 33, column: 25, scope: !1289)
!1294 = !DILocation(line: 35, column: 24, scope: !1289)
!1295 = !DILocation(line: 35, column: 10, scope: !1289)
!1296 = !DILocation(line: 35, column: 3, scope: !1289)
!1297 = !DILocalVariable(name: "host", arg: 1, scope: !165, file: !166, line: 61, type: !49)
!1298 = !DILocation(line: 61, column: 27, scope: !165)
!1299 = !DILocalVariable(name: "cherror", arg: 2, scope: !165, file: !166, line: 61, type: !149)
!1300 = !DILocation(line: 61, column: 38, scope: !165)
!1301 = !DILocalVariable(name: "retval", scope: !165, file: !166, line: 63, type: !6)
!1302 = !DILocation(line: 63, column: 9, scope: !165)
!1303 = !DILocalVariable(name: "res", scope: !165, file: !166, line: 65, type: !195)
!1304 = !DILocation(line: 65, column: 20, scope: !165)
!1305 = !DILocalVariable(name: "status", scope: !165, file: !166, line: 66, type: !53)
!1306 = !DILocation(line: 66, column: 7, scope: !165)
!1307 = !DILocation(line: 68, column: 18, scope: !165)
!1308 = !DILocation(line: 69, column: 25, scope: !165)
!1309 = !DILocation(line: 69, column: 12, scope: !165)
!1310 = !DILocation(line: 69, column: 10, scope: !165)
!1311 = !DILocation(line: 70, column: 8, scope: !1312)
!1312 = distinct !DILexicalBlock(scope: !165, file: !166, line: 70, column: 7)
!1313 = !DILocation(line: 75, column: 24, scope: !1314)
!1314 = distinct !DILexicalBlock(scope: !1312, file: !166, line: 71, column: 5)
!1315 = !DILocation(line: 75, column: 29, scope: !1314)
!1316 = !DILocation(line: 75, column: 44, scope: !1314)
!1317 = !DILocation(line: 75, column: 49, scope: !1314)
!1318 = !DILocation(line: 75, column: 64, scope: !1314)
!1319 = !DILocation(line: 75, column: 16, scope: !1314)
!1320 = !DILocation(line: 75, column: 14, scope: !1314)
!1321 = !DILocation(line: 76, column: 12, scope: !1322)
!1322 = distinct !DILexicalBlock(scope: !1314, file: !166, line: 76, column: 11)
!1323 = !DILocation(line: 76, column: 22, scope: !1322)
!1324 = !DILocation(line: 77, column: 10, scope: !1322)
!1325 = !DILocation(line: 77, column: 18, scope: !1322)
!1326 = !DILocation(line: 78, column: 21, scope: !1314)
!1327 = !DILocation(line: 78, column: 7, scope: !1314)
!1328 = !DILocation(line: 80, column: 12, scope: !1329)
!1329 = distinct !DILexicalBlock(scope: !1312, file: !166, line: 80, column: 12)
!1330 = !DILocation(line: 81, column: 16, scope: !1329)
!1331 = !DILocation(line: 81, column: 6, scope: !1329)
!1332 = !DILocation(line: 81, column: 14, scope: !1329)
!1333 = !DILocation(line: 83, column: 10, scope: !165)
!1334 = !DILocation(line: 83, column: 3, scope: !165)
!1335 = distinct !DISubprogram(name: "close_stdout", scope: !203, file: !203, line: 117, type: !651, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !198, retainedNodes: !4)
!1336 = !DILocation(line: 119, column: 21, scope: !1337)
!1337 = distinct !DILexicalBlock(scope: !1335, file: !203, line: 119, column: 7)
!1338 = !DILocation(line: 119, column: 7, scope: !1337)
!1339 = !DILocation(line: 119, column: 29, scope: !1337)
!1340 = !DILocation(line: 120, column: 12, scope: !1337)
!1341 = !DILocation(line: 120, column: 28, scope: !1337)
!1342 = !DILocation(line: 120, column: 34, scope: !1337)
!1343 = !DILocalVariable(name: "write_error", scope: !1344, file: !203, line: 122, type: !49)
!1344 = distinct !DILexicalBlock(scope: !1337, file: !203, line: 121, column: 5)
!1345 = !DILocation(line: 122, column: 19, scope: !1344)
!1346 = !DILocation(line: 122, column: 33, scope: !1344)
!1347 = !DILocation(line: 123, column: 11, scope: !1348)
!1348 = distinct !DILexicalBlock(scope: !1344, file: !203, line: 123, column: 11)
!1349 = !DILocation(line: 124, column: 19, scope: !1348)
!1350 = !DILocation(line: 124, column: 52, scope: !1348)
!1351 = !DILocation(line: 124, column: 36, scope: !1348)
!1352 = !DILocation(line: 125, column: 16, scope: !1348)
!1353 = !DILocation(line: 124, column: 9, scope: !1348)
!1354 = !DILocation(line: 127, column: 19, scope: !1348)
!1355 = !DILocation(line: 127, column: 32, scope: !1348)
!1356 = !DILocation(line: 127, column: 9, scope: !1348)
!1357 = !DILocation(line: 129, column: 14, scope: !1344)
!1358 = !DILocation(line: 129, column: 7, scope: !1344)
!1359 = !DILocation(line: 134, column: 42, scope: !1360)
