; ModuleID = '<stdin>'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.addrinfo = type { i32, i32, i32, i32, i32, %struct.sockaddr*, i8*, %struct.addrinfo* }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.utmpx = type { i16, i32, [32 x i8], [4 x i8], [32 x i8], [256 x i8], %struct.__exit_status, i32, %struct.anon, [4 x i32], [20 x i8] }
%struct.__exit_status = type { i16, i16 }
%struct.anon = type { i32, i32 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }


!10 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !12, line: 160, baseType: !13)
!12 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!13 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!14 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!15 = !{!16, !19, !21, !23, !25, !27, !29, !31, !33, !35, !37, !39, !41, !43, !45, !47, !51, !0, !54, !62, !108, !113, !118, !123, !131, !136, !138}
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "do_lookup", scope: !2, file: !3, line: 102, type: !18, isLocal: true, isDefinition: true)
!18 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "short_list", scope: !2, file: !3, line: 107, type: !18, isLocal: true, isDefinition: true)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "short_output", scope: !2, file: !3, line: 110, type: !18, isLocal: true, isDefinition: true)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "include_idle", scope: !2, file: !3, line: 115, type: !18, isLocal: true, isDefinition: true)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "include_heading", scope: !2, file: !3, line: 118, type: !18, isLocal: true, isDefinition: true)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "include_mesg", scope: !2, file: !3, line: 122, type: !18, isLocal: true, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "include_exit", scope: !2, file: !3, line: 125, type: !18, isLocal: true, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "need_boottime", scope: !2, file: !3, line: 128, type: !18, isLocal: true, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "need_deadprocs", scope: !2, file: !3, line: 131, type: !18, isLocal: true, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "need_login", scope: !2, file: !3, line: 134, type: !18, isLocal: true, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "need_initspawn", scope: !2, file: !3, line: 137, type: !18, isLocal: true, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "need_clockchange", scope: !2, file: !3, line: 140, type: !18, isLocal: true, isDefinition: true)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "need_runlevel", scope: !2, file: !3, line: 143, type: !18, isLocal: true, isDefinition: true)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "need_users", scope: !2, file: !3, line: 146, type: !18, isLocal: true, isDefinition: true)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "my_line_only", scope: !2, file: !3, line: 149, type: !18, isLocal: true, isDefinition: true)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "time_format", scope: !2, file: !3, line: 153, type: !49, isLocal: true, isDefinition: true)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "time_format_width", scope: !2, file: !3, line: 154, type: !53, isLocal: true, isDefinition: true)
!53 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "mesg", scope: !56, file: !3, line: 249, type: !59, isLocal: true, isDefinition: true)
!56 = distinct !DISubprogram(name: "print_line", scope: !3, file: !3, line: 244, type: !57, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!57 = !DISubroutineType(types: !58)
!58 = !{null, !53, !49, !50, !53, !49, !49, !49, !49, !49, !49}
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 24, elements: !60)
!60 = !{!61}
!61 = !DISubrange(count: 3)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "hoststr", scope: !64, file: !3, line: 339, type: !6, isLocal: true, isDefinition: true)
!64 = distinct !DISubprogram(name: "print_user", scope: !3, file: !3, line: 333, type: !65, scopeLine: 334, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!65 = !DISubroutineType(types: !66)
!66 = !{null, !67, !9}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !70, line: 146, baseType: !71)
!70 = !DIFile(filename: "./lib/readutmp.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !72, line: 55, size: 3072, elements: !73)
!72 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/utmpx.h", directory: "")
!73 = !{!74, !75, !77, !81, !85, !86, !90, !95, !97, !102, !104}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !71, file: !72, line: 57, baseType: !14, size: 16)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !71, file: !72, line: 58, baseType: !76, size: 32, offset: 32)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !12, line: 154, baseType: !53)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !71, file: !72, line: 59, baseType: !78, size: 256, offset: 64)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !71, file: !72, line: 61, baseType: !82, size: 32, offset: 320)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 4)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !71, file: !72, line: 63, baseType: !78, size: 256, offset: 352)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !71, file: !72, line: 65, baseType: !87, size: 2048, offset: 608)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 2048, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 256)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !71, file: !72, line: 67, baseType: !91, size: 32, offset: 2656)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !72, line: 42, size: 32, elements: !92)
!92 = !{!93, !94}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !91, file: !72, line: 45, baseType: !14, size: 16)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !91, file: !72, line: 46, baseType: !14, size: 16, offset: 16)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !71, file: !72, line: 74, baseType: !96, size: 32, offset: 2688)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !12, line: 41, baseType: !53)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !71, file: !72, line: 79, baseType: !98, size: 64, offset: 2720)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !71, file: !72, line: 75, size: 64, elements: !99)
!99 = !{!100, !101}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !98, file: !72, line: 77, baseType: !96, size: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !98, file: !72, line: 78, baseType: !96, size: 32, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !71, file: !72, line: 84, baseType: !103, size: 128, offset: 2784)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 128, elements: !83)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !71, file: !72, line: 85, baseType: !105, size: 160, offset: 2912)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 160, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 20)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "hostlen", scope: !64, file: !3, line: 341, type: !110, isLocal: true, isDefinition: true)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !111, line: 46, baseType: !112)
!111 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.1/include/stddef.h", directory: "")
!112 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "now", scope: !115, file: !3, line: 190, type: !9, isLocal: true, isDefinition: true)
!115 = distinct !DISubprogram(name: "idle_string", scope: !3, file: !3, line: 188, type: !116, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!116 = !DISubroutineType(types: !117)
!117 = !{!49, !9, !9}
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "idle_hhmm", scope: !115, file: !3, line: 202, type: !120, isLocal: true, isDefinition: true)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 48, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 6)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "buf", scope: !125, file: !3, line: 220, type: !128, isLocal: true, isDefinition: true)
!125 = distinct !DISubprogram(name: "time_string", scope: !3, file: !3, line: 218, type: !126, scopeLine: 219, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!126 = !DISubroutineType(types: !127)
!127 = !{!49, !67}
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 264, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 33)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "runlevline", scope: !133, file: !3, line: 516, type: !6, isLocal: true, isDefinition: true)
!133 = distinct !DISubprogram(name: "print_runlevel", scope: !3, file: !3, line: 514, type: !134, scopeLine: 515, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!134 = !DISubroutineType(types: !135)
!135 = !{null, !67}
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "comment", scope: !133, file: !3, line: 516, type: !6, isLocal: true, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "exitstr", scope: !140, file: !3, line: 461, type: !6, isLocal: true, isDefinition: true)
!140 = distinct !DISubprogram(name: "print_deadprocs", scope: !3, file: !3, line: 459, type: !134, scopeLine: 460, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 4608, elements: !151)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !144, line: 50, size: 256, elements: !145)
!144 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "")
!145 = !{!146, !147, !148, !150}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !143, file: !144, line: 52, baseType: !49, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !143, file: !144, line: 55, baseType: !53, size: 32, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !143, file: !144, line: 56, baseType: !149, size: 64, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !143, file: !144, line: 57, baseType: !53, size: 32, offset: 192)
!151 = !{!152}
!152 = !DISubrange(count: 18)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "Version", scope: !155, file: !156, line: 2, type: !49, isLocal: false, isDefinition: true)
!155 = distinct !DICompileUnit(language: DW_LANG_C99, file: !156, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !157, nameTableKind: None)
!156 = !DIFile(filename: "src/version.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!157 = !{!153}
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "last_cherror", scope: !160, file: !166, line: 28, type: !53, isLocal: true, isDefinition: true)
!160 = distinct !DICompileUnit(language: DW_LANG_C99, file: !161, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !162, nameTableKind: None)
!161 = !DIFile(filename: "./lib/canon-host.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!162 = !{!163, !158}
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "hints", scope: !165, file: !166, line: 64, type: !169, isLocal: true, isDefinition: true)
!165 = distinct !DISubprogram(name: "canon_host_r", scope: !166, file: !166, line: 61, type: !167, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !160, retainedNodes: !4)
!166 = !DIFile(filename: "lib/canon-host.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!167 = !DISubroutineType(types: !168)
!168 = !{!6, !49, !149}
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !170, line: 565, size: 384, elements: !171)
!170 = !DIFile(filename: "/usr/include/netdb.h", directory: "")
!171 = !{!172, !173, !174, !175, !176, !181, !193, !194}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !169, file: !170, line: 567, baseType: !53, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !169, file: !170, line: 568, baseType: !53, size: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !169, file: !170, line: 569, baseType: !53, size: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !169, file: !170, line: 570, baseType: !53, size: 32, offset: 96)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !169, file: !170, line: 571, baseType: !177, size: 32, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !178, line: 33, baseType: !179)
!178 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "")
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !12, line: 209, baseType: !180)
!180 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !169, file: !170, line: 572, baseType: !182, size: 64, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !178, line: 178, size: 128, elements: !184)
!184 = !{!185, !189}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !183, file: !178, line: 180, baseType: !186, size: 16)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !187, line: 28, baseType: !188)
!187 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "")
!188 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !183, file: !178, line: 181, baseType: !190, size: 112, offset: 16)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 112, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 14)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !169, file: !170, line: 573, baseType: !6, size: 64, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !169, file: !170, line: 574, baseType: !195, size: 64, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !198, file: !203, line: 56, type: !18, isLocal: true, isDefinition: true)
!198 = distinct !DICompileUnit(language: DW_LANG_C99, file: !199, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !200, nameTableKind: None)
!199 = !DIFile(filename: "./lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!200 = !{!201, !196}
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "file_name", scope: !198, file: !203, line: 46, type: !49, isLocal: true, isDefinition: true)
!203 = !DIFile(filename: "lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "exit_failure", scope: !206, file: !209, line: 24, type: !210, isLocal: false, isDefinition: true)
!206 = distinct !DICompileUnit(language: DW_LANG_C99, file: !207, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !208, nameTableKind: None)
!207 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!208 = !{!204}
!209 = !DIFile(filename: "lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!210 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !53)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "program_name", scope: !213, file: !217, line: 33, type: !49, isLocal: false, isDefinition: true)
!213 = distinct !DICompileUnit(language: DW_LANG_C99, file: !214, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !215, globals: !216, nameTableKind: None)
!214 = !DIFile(filename: "./lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!215 = !{!8, !6}
!216 = !{!211}
!217 = !DIFile(filename: "lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !220, file: !241, line: 116, type: !254, isLocal: true, isDefinition: true)
!220 = distinct !DICompileUnit(language: DW_LANG_C99, file: !221, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !222, retainedTypes: !237, globals: !238, nameTableKind: None)
!221 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!222 = !{!223}
!223 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !224, line: 32, baseType: !180, size: 32, elements: !225)
!224 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!225 = !{!226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236}
!226 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!227 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!228 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!229 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!230 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!231 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!232 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!233 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!234 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!235 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!236 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!237 = !{!53, !188, !110}
!238 = !{!239, !246, !252, !218, !264, !266, !273, !275}
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !220, file: !241, line: 85, type: !242, isLocal: false, isDefinition: true)
!241 = !DIFile(filename: "lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 704, elements: !244)
!243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!244 = !{!245}
!245 = !DISubrange(count: 11)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !220, file: !241, line: 101, type: !248, isLocal: false, isDefinition: true)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 320, elements: !250)
!249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !223)
!250 = !{!251}
!251 = !DISubrange(count: 10)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !220, file: !241, line: 1052, type: !254, isLocal: false, isDefinition: true)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !241, line: 65, size: 448, elements: !255)
!255 = !{!256, !257, !258, !262, !263}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !254, file: !241, line: 68, baseType: !223, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !254, file: !241, line: 71, baseType: !53, size: 32, offset: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !254, file: !241, line: 75, baseType: !259, size: 256, offset: 64)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 256, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 8)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !254, file: !241, line: 78, baseType: !49, size: 64, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !254, file: !241, line: 81, baseType: !49, size: 64, offset: 384)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "slot0", scope: !220, file: !241, line: 842, type: !87, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "slotvec", scope: !220, file: !241, line: 845, type: !268, isLocal: true, isDefinition: true)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !241, line: 834, size: 128, elements: !270)
!270 = !{!271, !272}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !269, file: !241, line: 836, baseType: !110, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !269, file: !241, line: 837, baseType: !6, size: 64, offset: 64)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "nslots", scope: !220, file: !241, line: 843, type: !53, isLocal: true, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "slotvec0", scope: !220, file: !241, line: 844, type: !269, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !279, file: !282, line: 26, type: !283, isLocal: false, isDefinition: true)
!279 = distinct !DICompileUnit(language: DW_LANG_C99, file: !280, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !281, nameTableKind: None)
!280 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!281 = !{!277}
!282 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 376, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 47)
!286 = distinct !DICompileUnit(language: DW_LANG_C99, file: !287, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!287 = !DIFile(filename: "./lib/c-ctype.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!288 = distinct !DICompileUnit(language: DW_LANG_C99, file: !289, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!289 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!290 = distinct !DICompileUnit(language: DW_LANG_C99, file: !291, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !292, nameTableKind: None)
!291 = !DIFile(filename: "./lib/imaxtostr.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!292 = !{!293}
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !294, line: 101, baseType: !295)
!294 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !12, line: 72, baseType: !13)
!296 = distinct !DICompileUnit(language: DW_LANG_C99, file: !297, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !298, nameTableKind: None)
!297 = !DIFile(filename: "./lib/setlocale_null.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!298 = !{!8}
!299 = distinct !DICompileUnit(language: DW_LANG_C99, file: !300, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !298, nameTableKind: None)
!300 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!301 = distinct !DICompileUnit(language: DW_LANG_C99, file: !302, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !303, nameTableKind: None)
!302 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!303 = !{!110, !6, !8}
!304 = distinct !DICompileUnit(language: DW_LANG_C99, file: !305, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!305 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!306 = distinct !DICompileUnit(language: DW_LANG_C99, file: !307, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !308, nameTableKind: None)
!307 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!308 = !{!110}
!309 = distinct !DICompileUnit(language: DW_LANG_C99, file: !310, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !311, nameTableKind: None)
!310 = !DIFile(filename: "./lib/readutmp.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!311 = !{!6, !8}
!312 = distinct !DICompileUnit(language: DW_LANG_C99, file: !313, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !314, nameTableKind: None)
!313 = !DIFile(filename: "./lib/c-strcasecmp.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!314 = !{!315}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !317)
!317 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!318 = distinct !DICompileUnit(language: DW_LANG_C99, file: !319, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!319 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!320 = distinct !DICompileUnit(language: DW_LANG_C99, file: !321, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !298, nameTableKind: None)
!321 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!322 = distinct !DICompileUnit(language: DW_LANG_C99, file: !323, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!323 = !DIFile(filename: "./lib/fclose.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!324 = distinct !DICompileUnit(language: DW_LANG_C99, file: !325, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !298, nameTableKind: None)
!325 = !DIFile(filename: "./lib/fflush.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!326 = distinct !DICompileUnit(language: DW_LANG_C99, file: !327, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !298, nameTableKind: None)
!327 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!328 = !{!"clang version 9.0.1-12 "}
!329 = !{i32 2, !"Dwarf Version", i32 4}
!330 = !{i32 2, !"Debug Info Version", i32 3}
!331 = !{i32 1, !"wchar_size", i32 4}
!332 = !{i32 1, !"ThinLTO", i32 0}
!333 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!334 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 638, type: !335, scopeLine: 639, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !53}
!337 = !DILocalVariable(name: "status", arg: 1, scope: !334, file: !3, line: 638, type: !53)
!338 = !DILocation(line: 638, column: 12, scope: !334)
!339 = !DILocation(line: 640, column: 7, scope: !340)
!340 = distinct !DILexicalBlock(scope: !334, file: !3, line: 640, column: 7)
!341 = !DILocation(line: 640, column: 14, scope: !340)
!342 = !DILocation(line: 640, column: 7, scope: !334)
!343 = !DILocation(line: 641, column: 5, scope: !340)
!344 = !DILocation(line: 641, column: 5, scope: !345)
!345 = distinct !DILexicalBlock(scope: !340, file: !3, line: 641, column: 5)
!346 = !DILocation(line: 644, column: 15, scope: !347)
!347 = distinct !DILexicalBlock(scope: !340, file: !3, line: 643, column: 5)
!348 = !DILocation(line: 644, column: 66, scope: !347)
!349 = !DILocation(line: 644, column: 7, scope: !347)
!350 = !DILocation(line: 645, column: 7, scope: !347)
!351 = !DILocation(line: 648, column: 7, scope: !347)
!352 = !DILocation(line: 655, column: 7, scope: !347)
!353 = !DILocation(line: 658, column: 7, scope: !347)
!354 = !DILocation(line: 663, column: 7, scope: !347)
!355 = !DILocation(line: 669, column: 7, scope: !347)
!356 = !DILocation(line: 675, column: 7, scope: !347)
!357 = !DILocation(line: 676, column: 7, scope: !347)
!358 = !DILocation(line: 677, column: 15, scope: !347)
!359 = !DILocation(line: 677, column: 7, scope: !347)
!360 = !DILocation(line: 682, column: 7, scope: !347)
!361 = !DILocation(line: 684, column: 9, scope: !334)
!362 = !DILocation(line: 684, column: 3, scope: !334)
!363 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !364, file: !364, line: 634, type: !365, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!364 = !DIFile(filename: "src/system.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!365 = !DISubroutineType(types: !366)
!366 = !{null, !49}
!367 = !DILocalVariable(name: "program", arg: 1, scope: !363, file: !364, line: 634, type: !49)
!368 = !DILocation(line: 634, column: 34, scope: !363)
!369 = !DILocalVariable(name: "infomap", scope: !363, file: !364, line: 636, type: !370)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !371, size: 896, elements: !376)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !363, file: !364, line: 636, size: 128, elements: !373)
!373 = !{!374, !375}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !372, file: !364, line: 636, baseType: !49, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !372, file: !364, line: 636, baseType: !49, size: 64, offset: 64)
!376 = !{!377}
!377 = !DISubrange(count: 7)
!378 = !DILocation(line: 636, column: 67, scope: !363)
!379 = !DILocalVariable(name: "node", scope: !363, file: !364, line: 646, type: !49)
!380 = !DILocation(line: 646, column: 15, scope: !363)
!381 = !DILocation(line: 646, column: 22, scope: !363)
!382 = !DILocalVariable(name: "map_prog", scope: !363, file: !364, line: 647, type: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!384 = !DILocation(line: 647, column: 25, scope: !363)
!385 = !DILocation(line: 647, column: 36, scope: !363)
!386 = !DILocation(line: 649, column: 3, scope: !363)
!387 = !DILocation(line: 649, column: 10, scope: !363)
!388 = !DILocation(line: 649, column: 20, scope: !363)
!389 = !DILocation(line: 649, column: 28, scope: !363)
!390 = !DILocation(line: 649, column: 33, scope: !363)
!391 = !DILocation(line: 649, column: 31, scope: !363)
!392 = !DILocation(line: 0, scope: !363)
!393 = !DILocation(line: 650, column: 13, scope: !363)
!394 = distinct !{!394, !386, !393}
!395 = !DILocation(line: 652, column: 7, scope: !396)
!396 = distinct !DILexicalBlock(scope: !363, file: !364, line: 652, column: 7)
!397 = !DILocation(line: 652, column: 17, scope: !396)
!398 = !DILocation(line: 652, column: 7, scope: !363)
!399 = !DILocation(line: 653, column: 12, scope: !396)
!400 = !DILocation(line: 653, column: 22, scope: !396)
!401 = !DILocation(line: 653, column: 10, scope: !396)
!402 = !DILocation(line: 653, column: 5, scope: !396)
!403 = !DILocation(line: 655, column: 11, scope: !363)
!404 = !DILocation(line: 655, column: 3, scope: !363)
!405 = !DILocalVariable(name: "lc_messages", scope: !363, file: !364, line: 659, type: !49)
!406 = !DILocation(line: 659, column: 15, scope: !363)
!407 = !DILocation(line: 659, column: 29, scope: !363)
!408 = !DILocation(line: 660, column: 7, scope: !409)
!409 = distinct !DILexicalBlock(scope: !363, file: !364, line: 660, column: 7)
!410 = !DILocation(line: 660, column: 19, scope: !409)
!411 = !DILocation(line: 660, column: 22, scope: !409)
!412 = !DILocation(line: 660, column: 7, scope: !363)
!413 = !DILocation(line: 666, column: 7, scope: !414)
!414 = distinct !DILexicalBlock(scope: !409, file: !364, line: 661, column: 5)
!415 = !DILocation(line: 668, column: 5, scope: !414)
!416 = !DILocation(line: 669, column: 11, scope: !363)
!417 = !DILocation(line: 670, column: 24, scope: !363)
!418 = !DILocation(line: 669, column: 3, scope: !363)
!419 = !DILocation(line: 671, column: 11, scope: !363)
!420 = !DILocation(line: 672, column: 11, scope: !363)
!421 = !DILocation(line: 672, column: 17, scope: !363)
!422 = !DILocation(line: 672, column: 25, scope: !363)
!423 = !DILocation(line: 672, column: 22, scope: !363)
!424 = !DILocation(line: 671, column: 3, scope: !363)
!425 = !DILocation(line: 673, column: 1, scope: !363)
!426 = !DILocalVariable(name: "lc_messages", scope: !427, file: !364, line: 659, type: !49)
!427 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !364, file: !364, line: 634, type: !365, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !428, retainedNodes: !4)
!428 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !429, nameTableKind: None)
!429 = !{!430, !432, !434, !436, !438, !440, !442, !444, !446, !448, !450, !452, !454, !456, !458, !460, !462, !464, !474, !477, !506, !508, !511, !513, !518, !523, !525}
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "do_lookup", scope: !428, file: !3, line: 102, type: !18, isLocal: true, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "short_list", scope: !428, file: !3, line: 107, type: !18, isLocal: true, isDefinition: true)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "short_output", scope: !428, file: !3, line: 110, type: !18, isLocal: true, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "include_idle", scope: !428, file: !3, line: 115, type: !18, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "include_heading", scope: !428, file: !3, line: 118, type: !18, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "include_mesg", scope: !428, file: !3, line: 122, type: !18, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "include_exit", scope: !428, file: !3, line: 125, type: !18, isLocal: true, isDefinition: true)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "need_boottime", scope: !428, file: !3, line: 128, type: !18, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "need_deadprocs", scope: !428, file: !3, line: 131, type: !18, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "need_login", scope: !428, file: !3, line: 134, type: !18, isLocal: true, isDefinition: true)
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "need_initspawn", scope: !428, file: !3, line: 137, type: !18, isLocal: true, isDefinition: true)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "need_clockchange", scope: !428, file: !3, line: 140, type: !18, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "need_runlevel", scope: !428, file: !3, line: 143, type: !18, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "need_users", scope: !428, file: !3, line: 146, type: !18, isLocal: true, isDefinition: true)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "my_line_only", scope: !428, file: !3, line: 149, type: !18, isLocal: true, isDefinition: true)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "time_format", scope: !428, file: !3, line: 153, type: !49, isLocal: true, isDefinition: true)
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "time_format_width", scope: !428, file: !3, line: 154, type: !53, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "longopts", scope: !428, file: !3, line: 162, type: !466, isLocal: true, isDefinition: true)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 4608, elements: !151)
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !144, line: 50, size: 256, elements: !469)
!469 = !{!470, !471, !472, !473}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !468, file: !144, line: 52, baseType: !49, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !468, file: !144, line: 55, baseType: !53, size: 32, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !468, file: !144, line: 56, baseType: !149, size: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !468, file: !144, line: 57, baseType: !53, size: 32, offset: 192)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "mesg", scope: !476, file: !3, line: 249, type: !59, isLocal: true, isDefinition: true)
!476 = distinct !DISubprogram(name: "print_line", scope: !3, file: !3, line: 244, type: !57, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !428, retainedNodes: !4)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "hoststr", scope: !479, file: !3, line: 339, type: !6, isLocal: true, isDefinition: true)
!479 = distinct !DISubprogram(name: "print_user", scope: !3, file: !3, line: 333, type: !480, scopeLine: 334, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !428, retainedNodes: !4)
!480 = !DISubroutineType(types: !481)
!481 = !{null, !482, !9}
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !70, line: 146, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !72, line: 55, size: 3072, elements: !486)
!486 = !{!487, !488, !489, !490, !491, !492, !493, !498, !499, !504, !505}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !485, file: !72, line: 57, baseType: !14, size: 16)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !485, file: !72, line: 58, baseType: !76, size: 32, offset: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !485, file: !72, line: 59, baseType: !78, size: 256, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !485, file: !72, line: 61, baseType: !82, size: 32, offset: 320)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !485, file: !72, line: 63, baseType: !78, size: 256, offset: 352)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !485, file: !72, line: 65, baseType: !87, size: 2048, offset: 608)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !485, file: !72, line: 67, baseType: !494, size: 32, offset: 2656)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !72, line: 42, size: 32, elements: !495)
!495 = !{!496, !497}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !494, file: !72, line: 45, baseType: !14, size: 16)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !494, file: !72, line: 46, baseType: !14, size: 16, offset: 16)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !485, file: !72, line: 74, baseType: !96, size: 32, offset: 2688)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !485, file: !72, line: 79, baseType: !500, size: 64, offset: 2720)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !485, file: !72, line: 75, size: 64, elements: !501)
!501 = !{!502, !503}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !500, file: !72, line: 77, baseType: !96, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !500, file: !72, line: 78, baseType: !96, size: 32, offset: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !485, file: !72, line: 84, baseType: !103, size: 128, offset: 2784)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !485, file: !72, line: 85, baseType: !105, size: 160, offset: 2912)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "hostlen", scope: !479, file: !3, line: 341, type: !110, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "now", scope: !510, file: !3, line: 190, type: !9, isLocal: true, isDefinition: true)
!510 = distinct !DISubprogram(name: "idle_string", scope: !3, file: !3, line: 188, type: !116, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !428, retainedNodes: !4)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "idle_hhmm", scope: !510, file: !3, line: 202, type: !120, isLocal: true, isDefinition: true)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "buf", scope: !515, file: !3, line: 220, type: !128, isLocal: true, isDefinition: true)
!515 = distinct !DISubprogram(name: "time_string", scope: !3, file: !3, line: 218, type: !516, scopeLine: 219, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !428, retainedNodes: !4)
!516 = !DISubroutineType(types: !517)
!517 = !{!49, !482}
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "runlevline", scope: !520, file: !3, line: 516, type: !6, isLocal: true, isDefinition: true)
!520 = distinct !DISubprogram(name: "print_runlevel", scope: !3, file: !3, line: 514, type: !521, scopeLine: 515, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !428, retainedNodes: !4)
!521 = !DISubroutineType(types: !522)
!522 = !{null, !482}
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "comment", scope: !520, file: !3, line: 516, type: !6, isLocal: true, isDefinition: true)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "exitstr", scope: !527, file: !3, line: 461, type: !6, isLocal: true, isDefinition: true)
!527 = distinct !DISubprogram(name: "print_deadprocs", scope: !3, file: !3, line: 459, type: !521, scopeLine: 460, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !428, retainedNodes: !4)
!528 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 688, type: !529, scopeLine: 689, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!529 = !DISubroutineType(types: !530)
!530 = !{!53, !53, !531}
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!532 = !DILocalVariable(name: "argc", arg: 1, scope: !528, file: !3, line: 688, type: !53)
!533 = !DILocation(line: 688, column: 11, scope: !528)
!534 = !DILocalVariable(name: "argv", arg: 2, scope: !528, file: !3, line: 688, type: !531)
!535 = !DILocation(line: 688, column: 24, scope: !528)
!536 = !DILocalVariable(name: "optc", scope: !528, file: !3, line: 690, type: !53)
!537 = !DILocation(line: 690, column: 7, scope: !528)
!538 = !DILocalVariable(name: "assumptions", scope: !528, file: !3, line: 691, type: !18)
!539 = !DILocation(line: 691, column: 8, scope: !528)
!540 = !DILocation(line: 694, column: 21, scope: !528)
!541 = !DILocation(line: 694, column: 3, scope: !528)
!542 = !DILocation(line: 695, column: 3, scope: !528)
!543 = !DILocation(line: 696, column: 3, scope: !528)
!544 = !DILocation(line: 697, column: 3, scope: !528)
!545 = !DILocation(line: 699, column: 3, scope: !528)
!546 = !DILocation(line: 701, column: 3, scope: !528)
!547 = !DILocation(line: 701, column: 31, scope: !528)
!548 = !DILocation(line: 701, column: 37, scope: !528)
!549 = !DILocation(line: 701, column: 18, scope: !528)
!550 = !DILocation(line: 701, column: 16, scope: !528)
!551 = !DILocation(line: 702, column: 10, scope: !528)
!552 = !DILocation(line: 704, column: 15, scope: !553)
!553 = distinct !DILexicalBlock(scope: !528, file: !3, line: 703, column: 5)
!554 = !DILocation(line: 704, column: 7, scope: !553)
!555 = !DILocation(line: 707, column: 25, scope: !556)
!556 = distinct !DILexicalBlock(scope: !553, file: !3, line: 705, column: 9)
!557 = !DILocation(line: 708, column: 26, scope: !556)
!558 = !DILocation(line: 709, column: 22, scope: !556)
!559 = !DILocation(line: 710, column: 26, scope: !556)
!560 = !DILocation(line: 711, column: 25, scope: !556)
!561 = !DILocation(line: 712, column: 28, scope: !556)
!562 = !DILocation(line: 713, column: 22, scope: !556)
!563 = !DILocation(line: 714, column: 24, scope: !556)
!564 = !DILocation(line: 715, column: 24, scope: !556)
!565 = !DILocation(line: 716, column: 24, scope: !556)
!566 = !DILocation(line: 717, column: 23, scope: !556)
!567 = !DILocation(line: 718, column: 11, scope: !556)
!568 = !DILocation(line: 721, column: 25, scope: !556)
!569 = !DILocation(line: 722, column: 23, scope: !556)
!570 = !DILocation(line: 723, column: 11, scope: !556)
!571 = !DILocation(line: 726, column: 26, scope: !556)
!572 = !DILocation(line: 727, column: 24, scope: !556)
!573 = !DILocation(line: 728, column: 24, scope: !556)
!574 = !DILocation(line: 729, column: 23, scope: !556)
!575 = !DILocation(line: 730, column: 11, scope: !556)
!576 = !DILocation(line: 733, column: 27, scope: !556)
!577 = !DILocation(line: 734, column: 11, scope: !556)
!578 = !DILocation(line: 737, column: 22, scope: !556)
!579 = !DILocation(line: 738, column: 24, scope: !556)
!580 = !DILocation(line: 739, column: 23, scope: !556)
!581 = !DILocation(line: 740, column: 11, scope: !556)
!582 = !DILocation(line: 743, column: 24, scope: !556)
!583 = !DILocation(line: 744, column: 11, scope: !556)
!584 = !DILocation(line: 747, column: 26, scope: !556)
!585 = !DILocation(line: 748, column: 23, scope: !556)
!586 = !DILocation(line: 749, column: 11, scope: !556)
!587 = !DILocation(line: 752, column: 22, scope: !556)
!588 = !DILocation(line: 753, column: 11, scope: !556)
!589 = !DILocation(line: 756, column: 25, scope: !556)
!590 = !DILocation(line: 757, column: 24, scope: !556)
!591 = !DILocation(line: 758, column: 23, scope: !556)
!592 = !DILocation(line: 759, column: 11, scope: !556)
!593 = !DILocation(line: 762, column: 24, scope: !556)
!594 = !DILocation(line: 763, column: 11, scope: !556)
!595 = !DILocation(line: 766, column: 28, scope: !556)
!596 = !DILocation(line: 767, column: 23, scope: !556)
!597 = !DILocation(line: 768, column: 11, scope: !556)
!598 = !DILocation(line: 772, column: 24, scope: !556)
!599 = !DILocation(line: 773, column: 11, scope: !556)
!600 = !DILocation(line: 776, column: 22, scope: !556)
!601 = !DILocation(line: 777, column: 24, scope: !556)
!602 = !DILocation(line: 778, column: 23, scope: !556)
!603 = !DILocation(line: 779, column: 11, scope: !556)
!604 = !DILocation(line: 782, column: 21, scope: !556)
!605 = !DILocation(line: 783, column: 11, scope: !556)
!606 = !DILocation(line: 785, column: 9, scope: !556)
!607 = !DILocation(line: 787, column: 9, scope: !556)
!608 = !DILocation(line: 790, column: 11, scope: !556)
!609 = distinct !{!609, !546, !610}
!610 = !DILocation(line: 792, column: 5, scope: !528)
!611 = !DILocation(line: 794, column: 7, scope: !612)
!612 = distinct !DILexicalBlock(scope: !528, file: !3, line: 794, column: 7)
!613 = !DILocation(line: 794, column: 7, scope: !528)
!614 = !DILocation(line: 796, column: 18, scope: !615)
!615 = distinct !DILexicalBlock(scope: !612, file: !3, line: 795, column: 5)
!616 = !DILocation(line: 797, column: 20, scope: !615)
!617 = !DILocation(line: 798, column: 5, scope: !615)
!618 = !DILocation(line: 800, column: 7, scope: !619)
!619 = distinct !DILexicalBlock(scope: !528, file: !3, line: 800, column: 7)
!620 = !DILocation(line: 800, column: 7, scope: !528)
!621 = !DILocation(line: 802, column: 20, scope: !622)
!622 = distinct !DILexicalBlock(scope: !619, file: !3, line: 801, column: 5)
!623 = !DILocation(line: 803, column: 5, scope: !622)
!624 = !DILocation(line: 805, column: 7, scope: !625)
!625 = distinct !DILexicalBlock(scope: !528, file: !3, line: 805, column: 7)
!626 = !DILocation(line: 805, column: 7, scope: !528)
!627 = !DILocation(line: 807, column: 19, scope: !628)
!628 = distinct !DILexicalBlock(scope: !625, file: !3, line: 806, column: 5)
!629 = !DILocation(line: 808, column: 25, scope: !628)
!630 = !DILocation(line: 809, column: 5, scope: !628)
!631 = !DILocation(line: 812, column: 19, scope: !632)
!632 = distinct !DILexicalBlock(scope: !625, file: !3, line: 811, column: 5)
!633 = !DILocation(line: 813, column: 25, scope: !632)
!634 = !DILocation(line: 816, column: 11, scope: !528)
!635 = !DILocation(line: 816, column: 18, scope: !528)
!636 = !DILocation(line: 816, column: 16, scope: !528)
!637 = !DILocation(line: 816, column: 3, scope: !528)
!638 = !DILocation(line: 819, column: 20, scope: !639)
!639 = distinct !DILexicalBlock(scope: !528, file: !3, line: 817, column: 5)
!640 = !DILocation(line: 820, column: 7, scope: !639)
!641 = !DILocation(line: 823, column: 7, scope: !639)
!642 = !DILocation(line: 824, column: 7, scope: !639)
!643 = !DILocation(line: 827, column: 12, scope: !639)
!644 = !DILocation(line: 827, column: 17, scope: !639)
!645 = !DILocation(line: 827, column: 7, scope: !639)
!646 = !DILocation(line: 828, column: 7, scope: !639)
!647 = !DILocation(line: 831, column: 20, scope: !639)
!648 = !DILocation(line: 831, column: 50, scope: !639)
!649 = !DILocation(line: 831, column: 55, scope: !639)
!650 = !DILocation(line: 831, column: 62, scope: !639)
!651 = !DILocation(line: 831, column: 43, scope: !639)
!652 = !DILocation(line: 831, column: 7, scope: !639)
!653 = !DILocation(line: 832, column: 7, scope: !639)
!654 = !DILocation(line: 835, column: 3, scope: !528)
!655 = distinct !DISubprogram(name: "who", scope: !3, file: !3, line: 621, type: !656, scopeLine: 622, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!656 = !DISubroutineType(types: !657)
!657 = !{null, !49, !53}
!658 = !DILocalVariable(name: "filename", arg: 1, scope: !655, file: !3, line: 621, type: !49)
!659 = !DILocation(line: 621, column: 18, scope: !655)
!660 = !DILocalVariable(name: "options", arg: 2, scope: !655, file: !3, line: 621, type: !53)
!661 = !DILocation(line: 621, column: 32, scope: !655)
!662 = !DILocalVariable(name: "n_users", scope: !655, file: !3, line: 623, type: !110)
!663 = !DILocation(line: 623, column: 10, scope: !655)
!664 = !DILocalVariable(name: "utmp_buf", scope: !655, file: !3, line: 624, type: !665)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!666 = !DILocation(line: 624, column: 16, scope: !655)
!667 = !DILocation(line: 626, column: 18, scope: !668)
!668 = distinct !DILexicalBlock(scope: !655, file: !3, line: 626, column: 7)
!669 = !DILocation(line: 626, column: 49, scope: !668)
!670 = !DILocation(line: 626, column: 7, scope: !668)
!671 = !DILocation(line: 626, column: 58, scope: !668)
!672 = !DILocation(line: 626, column: 7, scope: !655)
!673 = !DILocation(line: 627, column: 5, scope: !668)
!674 = !DILocation(line: 629, column: 7, scope: !675)
!675 = distinct !DILexicalBlock(scope: !655, file: !3, line: 629, column: 7)
!676 = !DILocation(line: 629, column: 7, scope: !655)
!677 = !DILocation(line: 630, column: 23, scope: !675)
!678 = !DILocation(line: 630, column: 32, scope: !675)
!679 = !DILocation(line: 630, column: 5, scope: !675)
!680 = !DILocation(line: 632, column: 19, scope: !675)
!681 = !DILocation(line: 632, column: 28, scope: !675)
!682 = !DILocation(line: 632, column: 5, scope: !675)
!683 = !DILocation(line: 634, column: 9, scope: !655)
!684 = !DILocation(line: 634, column: 3, scope: !655)
!685 = !DILocation(line: 635, column: 1, scope: !655)
!686 = distinct !DISubprogram(name: "list_entries_who", scope: !3, file: !3, line: 537, type: !687, scopeLine: 538, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!687 = !DISubroutineType(types: !688)
!688 = !{null, !110, !67}
!689 = !DILocalVariable(name: "n", arg: 1, scope: !686, file: !3, line: 537, type: !110)
!690 = !DILocation(line: 537, column: 26, scope: !686)
!691 = !DILocalVariable(name: "utmp_buf", arg: 2, scope: !686, file: !3, line: 537, type: !67)
!692 = !DILocation(line: 537, column: 48, scope: !686)
!693 = !DILocalVariable(name: "entries", scope: !686, file: !3, line: 539, type: !112)
!694 = !DILocation(line: 539, column: 21, scope: !686)
!695 = !DILocalVariable(name: "separator", scope: !686, file: !3, line: 540, type: !49)
!696 = !DILocation(line: 540, column: 15, scope: !686)
!697 = !DILocation(line: 542, column: 3, scope: !686)
!698 = !DILocation(line: 542, column: 11, scope: !686)
!699 = !DILocation(line: 544, column: 11, scope: !700)
!700 = distinct !DILexicalBlock(scope: !701, file: !3, line: 544, column: 11)
!701 = distinct !DILexicalBlock(scope: !686, file: !3, line: 543, column: 5)
!702 = !DILocation(line: 544, column: 11, scope: !701)
!703 = !DILocalVariable(name: "trimmed_name", scope: !704, file: !3, line: 546, type: !6)
!704 = distinct !DILexicalBlock(scope: !700, file: !3, line: 545, column: 9)
!705 = !DILocation(line: 546, column: 17, scope: !704)
!706 = !DILocation(line: 548, column: 48, scope: !704)
!707 = !DILocation(line: 548, column: 26, scope: !704)
!708 = !DILocation(line: 548, column: 24, scope: !704)
!709 = !DILocation(line: 550, column: 27, scope: !704)
!710 = !DILocation(line: 550, column: 38, scope: !704)
!711 = !DILocation(line: 550, column: 11, scope: !704)
!712 = !DILocation(line: 551, column: 17, scope: !704)
!713 = !DILocation(line: 551, column: 11, scope: !704)
!714 = !DILocation(line: 552, column: 21, scope: !704)
!715 = !DILocation(line: 553, column: 18, scope: !704)
!716 = !DILocation(line: 554, column: 9, scope: !704)
!717 = !DILocation(line: 555, column: 15, scope: !701)
!718 = distinct !{!718, !697, !719}
!719 = !DILocation(line: 556, column: 5, scope: !686)
!720 = !DILocation(line: 557, column: 11, scope: !686)
!721 = !DILocation(line: 557, column: 33, scope: !686)
!722 = !DILocation(line: 557, column: 3, scope: !686)
!723 = !DILocation(line: 558, column: 1, scope: !686)
!724 = !DILocalVariable(name: "n", arg: 1, scope: !725, file: !3, line: 537, type: !110)
!725 = distinct !DISubprogram(name: "list_entries_who", scope: !3, file: !3, line: 537, type: !726, scopeLine: 538, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !752, retainedNodes: !4)
!726 = !DISubroutineType(types: !727)
!727 = !{null, !110, !728}
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !730)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !70, line: 146, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !72, line: 55, size: 3072, elements: !732)
!732 = !{!733, !734, !735, !736, !737, !738, !739, !744, !745, !750, !751}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !731, file: !72, line: 57, baseType: !14, size: 16)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !731, file: !72, line: 58, baseType: !76, size: 32, offset: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !731, file: !72, line: 59, baseType: !78, size: 256, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !731, file: !72, line: 61, baseType: !82, size: 32, offset: 320)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !731, file: !72, line: 63, baseType: !78, size: 256, offset: 352)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !731, file: !72, line: 65, baseType: !87, size: 2048, offset: 608)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !731, file: !72, line: 67, baseType: !740, size: 32, offset: 2656)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !72, line: 42, size: 32, elements: !741)
!741 = !{!742, !743}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !740, file: !72, line: 45, baseType: !14, size: 16)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !740, file: !72, line: 46, baseType: !14, size: 16, offset: 16)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !731, file: !72, line: 74, baseType: !96, size: 32, offset: 2688)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !731, file: !72, line: 79, baseType: !746, size: 64, offset: 2720)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !731, file: !72, line: 75, size: 64, elements: !747)
!747 = !{!748, !749}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !746, file: !72, line: 77, baseType: !96, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !746, file: !72, line: 78, baseType: !96, size: 32, offset: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !731, file: !72, line: 84, baseType: !103, size: 128, offset: 2784)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !731, file: !72, line: 85, baseType: !105, size: 160, offset: 2912)
!752 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !753, nameTableKind: None)
!753 = !{!754, !756, !758, !760, !762, !764, !766, !768, !770, !772, !774, !776, !778, !780, !782, !784, !786, !788, !798, !801, !806, !808, !811, !813, !818, !823, !825}
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(name: "do_lookup", scope: !752, file: !3, line: 102, type: !18, isLocal: true, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(name: "short_list", scope: !752, file: !3, line: 107, type: !18, isLocal: true, isDefinition: true)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(name: "short_output", scope: !752, file: !3, line: 110, type: !18, isLocal: true, isDefinition: true)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(name: "include_idle", scope: !752, file: !3, line: 115, type: !18, isLocal: true, isDefinition: true)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(name: "include_heading", scope: !752, file: !3, line: 118, type: !18, isLocal: true, isDefinition: true)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "include_mesg", scope: !752, file: !3, line: 122, type: !18, isLocal: true, isDefinition: true)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "include_exit", scope: !752, file: !3, line: 125, type: !18, isLocal: true, isDefinition: true)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(name: "need_boottime", scope: !752, file: !3, line: 128, type: !18, isLocal: true, isDefinition: true)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(name: "need_deadprocs", scope: !752, file: !3, line: 131, type: !18, isLocal: true, isDefinition: true)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(name: "need_login", scope: !752, file: !3, line: 134, type: !18, isLocal: true, isDefinition: true)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(name: "need_initspawn", scope: !752, file: !3, line: 137, type: !18, isLocal: true, isDefinition: true)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(name: "need_clockchange", scope: !752, file: !3, line: 140, type: !18, isLocal: true, isDefinition: true)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(name: "need_runlevel", scope: !752, file: !3, line: 143, type: !18, isLocal: true, isDefinition: true)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(name: "need_users", scope: !752, file: !3, line: 146, type: !18, isLocal: true, isDefinition: true)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(name: "my_line_only", scope: !752, file: !3, line: 149, type: !18, isLocal: true, isDefinition: true)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(name: "time_format", scope: !752, file: !3, line: 153, type: !49, isLocal: true, isDefinition: true)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "time_format_width", scope: !752, file: !3, line: 154, type: !53, isLocal: true, isDefinition: true)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(name: "longopts", scope: !752, file: !3, line: 162, type: !790, isLocal: true, isDefinition: true)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !791, size: 4608, elements: !151)
!791 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !792)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !144, line: 50, size: 256, elements: !793)
!793 = !{!794, !795, !796, !797}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !792, file: !144, line: 52, baseType: !49, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !792, file: !144, line: 55, baseType: !53, size: 32, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !792, file: !144, line: 56, baseType: !149, size: 64, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !792, file: !144, line: 57, baseType: !53, size: 32, offset: 192)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(name: "mesg", scope: !800, file: !3, line: 249, type: !59, isLocal: true, isDefinition: true)
!800 = distinct !DISubprogram(name: "print_line", scope: !3, file: !3, line: 244, type: !57, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !752, retainedNodes: !4)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(name: "hoststr", scope: !803, file: !3, line: 339, type: !6, isLocal: true, isDefinition: true)
!803 = distinct !DISubprogram(name: "print_user", scope: !3, file: !3, line: 333, type: !804, scopeLine: 334, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !752, retainedNodes: !4)
!804 = !DISubroutineType(types: !805)
!805 = !{null, !728, !9}
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(name: "hostlen", scope: !803, file: !3, line: 341, type: !110, isLocal: true, isDefinition: true)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(name: "now", scope: !810, file: !3, line: 190, type: !9, isLocal: true, isDefinition: true)
!810 = distinct !DISubprogram(name: "idle_string", scope: !3, file: !3, line: 188, type: !116, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !752, retainedNodes: !4)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(name: "idle_hhmm", scope: !810, file: !3, line: 202, type: !120, isLocal: true, isDefinition: true)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(name: "buf", scope: !815, file: !3, line: 220, type: !128, isLocal: true, isDefinition: true)
!815 = distinct !DISubprogram(name: "time_string", scope: !3, file: !3, line: 218, type: !816, scopeLine: 219, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !752, retainedNodes: !4)
!816 = !DISubroutineType(types: !817)
!817 = !{!49, !728}
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(name: "runlevline", scope: !820, file: !3, line: 516, type: !6, isLocal: true, isDefinition: true)
!820 = distinct !DISubprogram(name: "print_runlevel", scope: !3, file: !3, line: 514, type: !821, scopeLine: 515, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !752, retainedNodes: !4)
!821 = !DISubroutineType(types: !822)
!822 = !{null, !728}
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(name: "comment", scope: !820, file: !3, line: 516, type: !6, isLocal: true, isDefinition: true)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "exitstr", scope: !827, file: !3, line: 461, type: !6, isLocal: true, isDefinition: true)
!827 = distinct !DISubprogram(name: "print_deadprocs", scope: !3, file: !3, line: 459, type: !821, scopeLine: 460, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !752, retainedNodes: !4)
!828 = !DILocalVariable(name: "utmp_buf", arg: 2, scope: !725, file: !3, line: 537, type: !728)
!829 = !DILocalVariable(name: "entries", scope: !725, file: !3, line: 539, type: !112)
!830 = !DILocalVariable(name: "separator", scope: !725, file: !3, line: 540, type: !49)
!831 = distinct !DISubprogram(name: "scan_entries", scope: !3, file: !3, line: 569, type: !687, scopeLine: 570, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!832 = !DILocalVariable(name: "n", arg: 1, scope: !831, file: !3, line: 569, type: !110)
!833 = !DILocation(line: 569, column: 22, scope: !831)
!834 = !DILocalVariable(name: "utmp_buf", arg: 2, scope: !831, file: !3, line: 569, type: !67)
!835 = !DILocation(line: 569, column: 44, scope: !831)
!836 = !DILocalVariable(name: "ttyname_b", scope: !831, file: !3, line: 571, type: !6)
!837 = !DILocation(line: 571, column: 9, scope: !831)
!838 = !DILocalVariable(name: "boottime", scope: !831, file: !3, line: 572, type: !9)
!839 = !DILocation(line: 572, column: 10, scope: !831)
!840 = !DILocation(line: 574, column: 7, scope: !841)
!841 = distinct !DILexicalBlock(scope: !831, file: !3, line: 574, column: 7)
!842 = !DILocation(line: 574, column: 7, scope: !831)
!843 = !DILocation(line: 575, column: 5, scope: !841)
!844 = !DILocation(line: 577, column: 7, scope: !845)
!845 = distinct !DILexicalBlock(scope: !831, file: !3, line: 577, column: 7)
!846 = !DILocation(line: 577, column: 7, scope: !831)
!847 = !DILocation(line: 579, column: 19, scope: !848)
!848 = distinct !DILexicalBlock(scope: !845, file: !3, line: 578, column: 5)
!849 = !DILocation(line: 579, column: 17, scope: !848)
!850 = !DILocation(line: 580, column: 12, scope: !851)
!851 = distinct !DILexicalBlock(scope: !848, file: !3, line: 580, column: 11)
!852 = !DILocation(line: 580, column: 11, scope: !848)
!853 = !DILocation(line: 581, column: 9, scope: !851)
!854 = !DILocation(line: 582, column: 11, scope: !855)
!855 = distinct !DILexicalBlock(scope: !848, file: !3, line: 582, column: 11)
!856 = !DILocation(line: 582, column: 64, scope: !855)
!857 = !DILocation(line: 583, column: 19, scope: !855)
!858 = !DILocation(line: 583, column: 9, scope: !855)
!859 = !DILocation(line: 584, column: 5, scope: !848)
!860 = !DILocation(line: 586, column: 3, scope: !831)
!861 = !DILocation(line: 586, column: 11, scope: !831)
!862 = !DILocation(line: 588, column: 12, scope: !863)
!863 = distinct !DILexicalBlock(scope: !864, file: !3, line: 588, column: 11)
!864 = distinct !DILexicalBlock(scope: !831, file: !3, line: 587, column: 5)
!865 = !DILocation(line: 589, column: 11, scope: !863)
!866 = !DILocation(line: 589, column: 14, scope: !863)
!867 = !DILocation(line: 588, column: 11, scope: !864)
!868 = !DILocation(line: 592, column: 15, scope: !869)
!869 = distinct !DILexicalBlock(scope: !870, file: !3, line: 592, column: 15)
!870 = distinct !DILexicalBlock(scope: !863, file: !3, line: 591, column: 9)
!871 = !DILocation(line: 592, column: 26, scope: !869)
!872 = !DILocation(line: 592, column: 29, scope: !869)
!873 = !DILocation(line: 592, column: 15, scope: !870)
!874 = !DILocation(line: 593, column: 25, scope: !869)
!875 = !DILocation(line: 593, column: 35, scope: !869)
!876 = !DILocation(line: 593, column: 13, scope: !869)
!877 = !DILocation(line: 594, column: 20, scope: !878)
!878 = distinct !DILexicalBlock(scope: !869, file: !3, line: 594, column: 20)
!879 = !DILocation(line: 594, column: 34, scope: !878)
!880 = !DILocation(line: 594, column: 37, scope: !878)
!881 = !DILocation(line: 594, column: 20, scope: !869)
!882 = !DILocation(line: 595, column: 29, scope: !878)
!883 = !DILocation(line: 595, column: 13, scope: !878)
!884 = !DILocation(line: 596, column: 20, scope: !885)
!885 = distinct !DILexicalBlock(scope: !878, file: !3, line: 596, column: 20)
!886 = !DILocation(line: 596, column: 34, scope: !885)
!887 = !DILocation(line: 596, column: 37, scope: !885)
!888 = !DILocation(line: 596, column: 20, scope: !878)
!889 = !DILocation(line: 597, column: 29, scope: !885)
!890 = !DILocation(line: 597, column: 13, scope: !885)
!891 = !DILocation(line: 601, column: 20, scope: !892)
!892 = distinct !DILexicalBlock(scope: !885, file: !3, line: 601, column: 20)
!893 = !DILocation(line: 601, column: 37, scope: !892)
!894 = !DILocation(line: 601, column: 40, scope: !892)
!895 = !DILocation(line: 601, column: 20, scope: !885)
!896 = !DILocation(line: 602, column: 32, scope: !892)
!897 = !DILocation(line: 602, column: 13, scope: !892)
!898 = !DILocation(line: 603, column: 20, scope: !899)
!899 = distinct !DILexicalBlock(scope: !892, file: !3, line: 603, column: 20)
!900 = !DILocation(line: 603, column: 35, scope: !899)
!901 = !DILocation(line: 603, column: 38, scope: !899)
!902 = !DILocation(line: 603, column: 20, scope: !892)
!903 = !DILocation(line: 604, column: 30, scope: !899)
!904 = !DILocation(line: 604, column: 13, scope: !899)
!905 = !DILocation(line: 605, column: 20, scope: !906)
!906 = distinct !DILexicalBlock(scope: !899, file: !3, line: 605, column: 20)
!907 = !DILocation(line: 605, column: 31, scope: !906)
!908 = !DILocation(line: 605, column: 34, scope: !906)
!909 = !DILocation(line: 605, column: 20, scope: !899)
!910 = !DILocation(line: 606, column: 26, scope: !906)
!911 = !DILocation(line: 606, column: 13, scope: !906)
!912 = !DILocation(line: 607, column: 20, scope: !913)
!913 = distinct !DILexicalBlock(scope: !906, file: !3, line: 607, column: 20)
!914 = !DILocation(line: 607, column: 35, scope: !913)
!915 = !DILocation(line: 607, column: 38, scope: !913)
!916 = !DILocation(line: 607, column: 20, scope: !906)
!917 = !DILocation(line: 608, column: 30, scope: !913)
!918 = !DILocation(line: 608, column: 13, scope: !913)
!919 = !DILocation(line: 609, column: 9, scope: !870)
!920 = !DILocation(line: 611, column: 11, scope: !921)
!921 = distinct !DILexicalBlock(scope: !864, file: !3, line: 611, column: 11)
!922 = !DILocation(line: 611, column: 11, scope: !864)
!923 = !DILocation(line: 612, column: 20, scope: !921)
!924 = !DILocation(line: 612, column: 18, scope: !921)
!925 = !DILocation(line: 612, column: 9, scope: !921)
!926 = !DILocation(line: 614, column: 15, scope: !864)
!927 = distinct !{!927, !860, !928}
!928 = !DILocation(line: 615, column: 5, scope: !831)
!929 = !DILocation(line: 616, column: 1, scope: !831)
!930 = distinct !DISubprogram(name: "print_heading", scope: !3, file: !3, line: 561, type: !931, scopeLine: 562, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!931 = !DISubroutineType(types: !932)
!932 = !{null}
!933 = !DILocation(line: 563, column: 19, scope: !930)
!934 = !DILocation(line: 563, column: 39, scope: !930)
!935 = !DILocation(line: 563, column: 50, scope: !930)
!936 = !DILocation(line: 563, column: 61, scope: !930)
!937 = !DILocation(line: 564, column: 15, scope: !930)
!938 = !DILocation(line: 564, column: 25, scope: !930)
!939 = !DILocation(line: 564, column: 39, scope: !930)
!940 = !DILocation(line: 563, column: 3, scope: !930)
!941 = !DILocation(line: 565, column: 1, scope: !930)
!942 = !DILocalVariable(name: "utmp_ent", arg: 1, scope: !64, file: !3, line: 333, type: !67)
!943 = !DILocation(line: 333, column: 32, scope: !64)
!944 = !DILocalVariable(name: "boottime", arg: 2, scope: !64, file: !3, line: 333, type: !9)
!945 = !DILocation(line: 333, column: 49, scope: !64)
!946 = !DILocalVariable(name: "stats", scope: !64, file: !3, line: 335, type: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !948, line: 46, size: 1152, elements: !949)
!948 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!949 = !{!950, !952, !954, !956, !958, !960, !962, !963, !964, !966, !968, !970, !977, !978, !979}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !947, file: !948, line: 48, baseType: !951, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !12, line: 145, baseType: !112)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !947, file: !948, line: 53, baseType: !953, size: 64, offset: 64)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !12, line: 148, baseType: !112)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !947, file: !948, line: 61, baseType: !955, size: 64, offset: 128)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !12, line: 151, baseType: !112)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !947, file: !948, line: 62, baseType: !957, size: 32, offset: 192)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !12, line: 150, baseType: !180)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !947, file: !948, line: 64, baseType: !959, size: 32, offset: 224)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !12, line: 146, baseType: !180)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !947, file: !948, line: 65, baseType: !961, size: 32, offset: 256)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !12, line: 147, baseType: !180)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !947, file: !948, line: 67, baseType: !53, size: 32, offset: 288)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !947, file: !948, line: 69, baseType: !951, size: 64, offset: 320)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !947, file: !948, line: 74, baseType: !965, size: 64, offset: 384)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !12, line: 152, baseType: !13)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !947, file: !948, line: 78, baseType: !967, size: 64, offset: 448)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !12, line: 174, baseType: !13)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !947, file: !948, line: 80, baseType: !969, size: 64, offset: 512)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !12, line: 179, baseType: !13)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !947, file: !948, line: 91, baseType: !971, size: 128, offset: 576)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !972, line: 10, size: 128, elements: !973)
!972 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!973 = !{!974, !975}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !971, file: !972, line: 12, baseType: !11, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !971, file: !972, line: 16, baseType: !976, size: 64, offset: 64)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !12, line: 196, baseType: !13)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !947, file: !948, line: 92, baseType: !971, size: 128, offset: 704)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !947, file: !948, line: 93, baseType: !971, size: 128, offset: 832)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !947, file: !948, line: 106, baseType: !980, size: 192, offset: 960)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !976, size: 192, elements: !60)
!981 = !DILocation(line: 335, column: 15, scope: !64)
!982 = !DILocalVariable(name: "last_change", scope: !64, file: !3, line: 336, type: !9)
!983 = !DILocation(line: 336, column: 10, scope: !64)
!984 = !DILocalVariable(name: "mesg", scope: !64, file: !3, line: 337, type: !7)
!985 = !DILocation(line: 337, column: 8, scope: !64)
!986 = !DILocalVariable(name: "idlestr", scope: !64, file: !3, line: 338, type: !987)
!987 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 56, elements: !376)
!988 = !DILocation(line: 338, column: 8, scope: !64)
!989 = !DILocalVariable(name: "line", scope: !64, file: !3, line: 347, type: !990)
!990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 304, elements: !991)
!991 = !{!992}
!992 = !DISubrange(count: 38)
!993 = !DILocation(line: 347, column: 8, scope: !64)
!994 = !DILocalVariable(name: "p", scope: !64, file: !3, line: 348, type: !6)
!995 = !DILocation(line: 348, column: 9, scope: !64)
!996 = !DILocation(line: 348, column: 13, scope: !64)
!997 = !DILocalVariable(name: "pidstr", scope: !64, file: !3, line: 349, type: !998)
!998 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !999)
!999 = !{!1000}
!1000 = !DISubrange(count: 12)
!1001 = !DILocation(line: 349, column: 3, scope: !64)
!1002 = !DILocation(line: 354, column: 10, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !64, file: !3, line: 354, column: 8)
!1004 = !DILocation(line: 354, column: 8, scope: !64)
!1005 = !DILocation(line: 355, column: 17, scope: !1003)
!1006 = !DILocation(line: 355, column: 9, scope: !1003)
!1007 = !DILocation(line: 355, column: 7, scope: !1003)
!1008 = !DILocation(line: 355, column: 5, scope: !1003)
!1009 = !DILocation(line: 356, column: 12, scope: !64)
!1010 = !DILocation(line: 356, column: 15, scope: !64)
!1011 = !DILocation(line: 356, column: 25, scope: !64)
!1012 = !DILocation(line: 356, column: 3, scope: !64)
!1013 = !DILocation(line: 358, column: 13, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !64, file: !3, line: 358, column: 7)
!1015 = !DILocation(line: 358, column: 7, scope: !1014)
!1016 = !DILocation(line: 358, column: 27, scope: !1014)
!1017 = !DILocation(line: 358, column: 7, scope: !64)
!1018 = !DILocation(line: 360, column: 14, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !1014, file: !3, line: 359, column: 5)
!1020 = !DILocation(line: 360, column: 12, scope: !1019)
!1021 = !DILocation(line: 361, column: 27, scope: !1019)
!1022 = !DILocation(line: 361, column: 19, scope: !1019)
!1023 = !DILocation(line: 362, column: 5, scope: !1019)
!1024 = !DILocation(line: 365, column: 12, scope: !1025)
!1025 = distinct !DILexicalBlock(scope: !1014, file: !3, line: 364, column: 5)
!1026 = !DILocation(line: 366, column: 19, scope: !1025)
!1027 = !DILocation(line: 369, column: 7, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !64, file: !3, line: 369, column: 7)
!1029 = !DILocation(line: 369, column: 7, scope: !64)
!1030 = !DILocation(line: 370, column: 14, scope: !1028)
!1031 = !DILocation(line: 370, column: 57, scope: !1028)
!1032 = !DILocation(line: 370, column: 70, scope: !1028)
!1033 = !DILocation(line: 370, column: 44, scope: !1028)
!1034 = !DILocation(line: 370, column: 5, scope: !1028)
!1035 = !DILocation(line: 372, column: 14, scope: !1028)
!1036 = !DILocation(line: 372, column: 5, scope: !1028)
!1037 = !DILocation(line: 375, column: 7, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !64, file: !3, line: 375, column: 7)
!1039 = !DILocation(line: 375, column: 17, scope: !1038)
!1040 = !DILocation(line: 375, column: 7, scope: !64)
!1041 = !DILocalVariable(name: "ut_host", scope: !1042, file: !3, line: 377, type: !1043)
!1042 = distinct !DILexicalBlock(scope: !1038, file: !3, line: 376, column: 5)
!1043 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 2056, elements: !1044)
!1044 = !{!1045}
!1045 = !DISubrange(count: 257)
!1046 = !DILocation(line: 377, column: 12, scope: !1042)
!1047 = !DILocalVariable(name: "host", scope: !1042, file: !3, line: 378, type: !6)
!1048 = !DILocation(line: 378, column: 13, scope: !1042)
!1049 = !DILocalVariable(name: "display", scope: !1042, file: !3, line: 379, type: !6)
!1050 = !DILocation(line: 379, column: 13, scope: !1042)
!1051 = !DILocation(line: 382, column: 16, scope: !1042)
!1052 = !DILocation(line: 382, column: 25, scope: !1042)
!1053 = !DILocation(line: 382, column: 35, scope: !1042)
!1054 = !DILocation(line: 382, column: 7, scope: !1042)
!1055 = !DILocation(line: 385, column: 25, scope: !1042)
!1056 = !DILocation(line: 385, column: 17, scope: !1042)
!1057 = !DILocation(line: 385, column: 15, scope: !1042)
!1058 = !DILocation(line: 386, column: 11, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1042, file: !3, line: 386, column: 11)
!1060 = !DILocation(line: 386, column: 11, scope: !1042)
!1061 = !DILocation(line: 387, column: 17, scope: !1059)
!1062 = !DILocation(line: 387, column: 20, scope: !1059)
!1063 = !DILocation(line: 387, column: 9, scope: !1059)
!1064 = !DILocation(line: 389, column: 11, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1042, file: !3, line: 389, column: 11)
!1066 = !DILocation(line: 389, column: 20, scope: !1065)
!1067 = !DILocation(line: 389, column: 23, scope: !1065)
!1068 = !DILocation(line: 389, column: 11, scope: !1042)
!1069 = !DILocation(line: 392, column: 30, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !1065, file: !3, line: 390, column: 9)
!1071 = !DILocation(line: 392, column: 18, scope: !1070)
!1072 = !DILocation(line: 392, column: 16, scope: !1070)
!1073 = !DILocation(line: 393, column: 9, scope: !1070)
!1074 = !DILocation(line: 395, column: 13, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1042, file: !3, line: 395, column: 11)
!1076 = !DILocation(line: 395, column: 11, scope: !1042)
!1077 = !DILocation(line: 396, column: 16, scope: !1075)
!1078 = !DILocation(line: 396, column: 14, scope: !1075)
!1079 = !DILocation(line: 396, column: 9, scope: !1075)
!1080 = !DILocation(line: 398, column: 11, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !1042, file: !3, line: 398, column: 11)
!1082 = !DILocation(line: 398, column: 11, scope: !1042)
!1083 = !DILocation(line: 400, column: 15, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1085, file: !3, line: 400, column: 15)
!1085 = distinct !DILexicalBlock(scope: !1081, file: !3, line: 399, column: 9)
!1086 = !DILocation(line: 400, column: 33, scope: !1084)
!1087 = !DILocation(line: 400, column: 25, scope: !1084)
!1088 = !DILocation(line: 400, column: 49, scope: !1084)
!1089 = !DILocation(line: 400, column: 41, scope: !1084)
!1090 = !DILocation(line: 400, column: 39, scope: !1084)
!1091 = !DILocation(line: 400, column: 58, scope: !1084)
!1092 = !DILocation(line: 400, column: 23, scope: !1084)
!1093 = !DILocation(line: 400, column: 15, scope: !1085)
!1094 = !DILocation(line: 402, column: 33, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !1084, file: !3, line: 401, column: 13)
!1096 = !DILocation(line: 402, column: 25, scope: !1095)
!1097 = !DILocation(line: 402, column: 49, scope: !1095)
!1098 = !DILocation(line: 402, column: 41, scope: !1095)
!1099 = !DILocation(line: 402, column: 39, scope: !1095)
!1100 = !DILocation(line: 402, column: 58, scope: !1095)
!1101 = !DILocation(line: 402, column: 23, scope: !1095)
!1102 = !DILocation(line: 403, column: 21, scope: !1095)
!1103 = !DILocation(line: 403, column: 15, scope: !1095)
!1104 = !DILocation(line: 404, column: 34, scope: !1095)
!1105 = !DILocation(line: 404, column: 25, scope: !1095)
!1106 = !DILocation(line: 404, column: 23, scope: !1095)
!1107 = !DILocation(line: 405, column: 13, scope: !1095)
!1108 = !DILocation(line: 406, column: 20, scope: !1085)
!1109 = !DILocation(line: 406, column: 40, scope: !1085)
!1110 = !DILocation(line: 406, column: 46, scope: !1085)
!1111 = !DILocation(line: 406, column: 11, scope: !1085)
!1112 = !DILocation(line: 407, column: 9, scope: !1085)
!1113 = !DILocation(line: 410, column: 15, scope: !1114)
!1114 = distinct !DILexicalBlock(scope: !1115, file: !3, line: 410, column: 15)
!1115 = distinct !DILexicalBlock(scope: !1081, file: !3, line: 409, column: 9)
!1116 = !DILocation(line: 410, column: 33, scope: !1114)
!1117 = !DILocation(line: 410, column: 25, scope: !1114)
!1118 = !DILocation(line: 410, column: 39, scope: !1114)
!1119 = !DILocation(line: 410, column: 23, scope: !1114)
!1120 = !DILocation(line: 410, column: 15, scope: !1115)
!1121 = !DILocation(line: 412, column: 33, scope: !1122)
!1122 = distinct !DILexicalBlock(scope: !1114, file: !3, line: 411, column: 13)
!1123 = !DILocation(line: 412, column: 25, scope: !1122)
!1124 = !DILocation(line: 412, column: 39, scope: !1122)
!1125 = !DILocation(line: 412, column: 23, scope: !1122)
!1126 = !DILocation(line: 413, column: 21, scope: !1122)
!1127 = !DILocation(line: 413, column: 15, scope: !1122)
!1128 = !DILocation(line: 414, column: 34, scope: !1122)
!1129 = !DILocation(line: 414, column: 25, scope: !1122)
!1130 = !DILocation(line: 414, column: 23, scope: !1122)
!1131 = !DILocation(line: 415, column: 13, scope: !1122)
!1132 = !DILocation(line: 416, column: 20, scope: !1115)
!1133 = !DILocation(line: 416, column: 37, scope: !1115)
!1134 = !DILocation(line: 416, column: 11, scope: !1115)
!1135 = !DILocation(line: 419, column: 11, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1042, file: !3, line: 419, column: 11)
!1137 = !DILocation(line: 419, column: 19, scope: !1136)
!1138 = !DILocation(line: 419, column: 16, scope: !1136)
!1139 = !DILocation(line: 419, column: 11, scope: !1042)
!1140 = !DILocation(line: 420, column: 15, scope: !1136)
!1141 = !DILocation(line: 420, column: 9, scope: !1136)
!1142 = !DILocation(line: 421, column: 5, scope: !1042)
!1143 = !DILocation(line: 424, column: 11, scope: !1144)
!1144 = distinct !DILexicalBlock(scope: !1145, file: !3, line: 424, column: 11)
!1145 = distinct !DILexicalBlock(scope: !1038, file: !3, line: 423, column: 5)
!1146 = !DILocation(line: 424, column: 19, scope: !1144)
!1147 = !DILocation(line: 424, column: 11, scope: !1145)
!1148 = !DILocation(line: 426, column: 19, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1144, file: !3, line: 425, column: 9)
!1150 = !DILocation(line: 427, column: 17, scope: !1149)
!1151 = !DILocation(line: 427, column: 11, scope: !1149)
!1152 = !DILocation(line: 428, column: 30, scope: !1149)
!1153 = !DILocation(line: 428, column: 21, scope: !1149)
!1154 = !DILocation(line: 428, column: 19, scope: !1149)
!1155 = !DILocation(line: 429, column: 9, scope: !1149)
!1156 = !DILocation(line: 430, column: 8, scope: !1145)
!1157 = !DILocation(line: 430, column: 16, scope: !1145)
!1158 = !DILocation(line: 434, column: 42, scope: !64)
!1159 = !DILocation(line: 434, column: 62, scope: !64)
!1160 = !DILocation(line: 435, column: 41, scope: !64)
!1161 = !DILocation(line: 435, column: 51, scope: !64)
!1162 = !DILocation(line: 436, column: 28, scope: !64)
!1163 = !DILocation(line: 436, column: 15, scope: !64)
!1164 = !DILocation(line: 436, column: 39, scope: !64)
!1165 = !DILocation(line: 436, column: 48, scope: !64)
!1166 = !DILocation(line: 437, column: 15, scope: !64)
!1167 = !DILocation(line: 437, column: 25, scope: !64)
!1168 = !DILocation(line: 434, column: 3, scope: !64)
!1169 = !DILocation(line: 438, column: 1, scope: !64)
!1170 = !DILocalVariable(name: "display", scope: !1171, file: !3, line: 379, type: !6)
!1171 = distinct !DILexicalBlock(scope: !1172, file: !3, line: 376, column: 5)
!1172 = distinct !DILexicalBlock(scope: !1173, file: !3, line: 375, column: 7)
!1173 = distinct !DISubprogram(name: "print_user", scope: !3, file: !3, line: 333, type: !1174, scopeLine: 334, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1200, retainedNodes: !4)
!1174 = !DISubroutineType(types: !1175)
!1175 = !{null, !1176, !9}
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1178)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "STRUCT_UTMP", file: !70, line: 146, baseType: !1179)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !72, line: 55, size: 3072, elements: !1180)
!1180 = !{!1181, !1182, !1183, !1184, !1185, !1186, !1187, !1192, !1193, !1198, !1199}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !1179, file: !72, line: 57, baseType: !14, size: 16)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !1179, file: !72, line: 58, baseType: !76, size: 32, offset: 32)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !1179, file: !72, line: 59, baseType: !78, size: 256, offset: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !1179, file: !72, line: 61, baseType: !82, size: 32, offset: 320)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !1179, file: !72, line: 63, baseType: !78, size: 256, offset: 352)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !1179, file: !72, line: 65, baseType: !87, size: 2048, offset: 608)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !1179, file: !72, line: 67, baseType: !1188, size: 32, offset: 2656)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exit_status", file: !72, line: 42, size: 32, elements: !1189)
!1189 = !{!1190, !1191}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !1188, file: !72, line: 45, baseType: !14, size: 16)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !1188, file: !72, line: 46, baseType: !14, size: 16, offset: 16)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !1179, file: !72, line: 74, baseType: !96, size: 32, offset: 2688)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !1179, file: !72, line: 79, baseType: !1194, size: 64, offset: 2720)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1179, file: !72, line: 75, size: 64, elements: !1195)
!1195 = !{!1196, !1197}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1194, file: !72, line: 77, baseType: !96, size: 32)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !1194, file: !72, line: 78, baseType: !96, size: 32, offset: 32)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !1179, file: !72, line: 84, baseType: !103, size: 128, offset: 2784)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1179, file: !72, line: 85, baseType: !105, size: 160, offset: 2912)
!1200 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !1201, nameTableKind: None)
!1201 = !{!1202, !1204, !1206, !1208, !1210, !1212, !1214, !1216, !1218, !1220, !1222, !1224, !1226, !1228, !1230, !1232, !1234, !1236, !1246, !1249, !1251, !1253, !1256, !1258, !1263, !1268, !1270}
!1202 = !DIGlobalVariableExpression(var: !1203, expr: !DIExpression())
!1203 = distinct !DIGlobalVariable(name: "do_lookup", scope: !1200, file: !3, line: 102, type: !18, isLocal: true, isDefinition: true)
!1204 = !DIGlobalVariableExpression(var: !1205, expr: !DIExpression())
!1205 = distinct !DIGlobalVariable(name: "short_list", scope: !1200, file: !3, line: 107, type: !18, isLocal: true, isDefinition: true)
!1206 = !DIGlobalVariableExpression(var: !1207, expr: !DIExpression())
!1207 = distinct !DIGlobalVariable(name: "short_output", scope: !1200, file: !3, line: 110, type: !18, isLocal: true, isDefinition: true)
!1208 = !DIGlobalVariableExpression(var: !1209, expr: !DIExpression())
!1209 = distinct !DIGlobalVariable(name: "include_idle", scope: !1200, file: !3, line: 115, type: !18, isLocal: true, isDefinition: true)
!1210 = !DIGlobalVariableExpression(var: !1211, expr: !DIExpression())
