; ModuleID = 'echodir/echo-O1-inserted.ll'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@.str.11 = private unnamed_addr constant [5 x i8] c"echo\00", align 1
@.str.19 = private unnamed_addr constant [14 x i8] c"GNU coreutils\00", align 1
@.str.12 = private unnamed_addr constant [16 x i8] c"POSIXLY_CORRECT\00", align 1
@.str.13 = private unnamed_addr constant [3 x i8] c"-n\00", align 1
@.str.17 = private unnamed_addr constant [7 x i8] c"--help\00", align 1
@.str.18 = private unnamed_addr constant [10 x i8] c"--version\00", align 1
@.str.20 = private unnamed_addr constant [10 x i8] c"Brian Fox\00", align 1
@.str.21 = private unnamed_addr constant [11 x i8] c"Chet Ramey\00", align 1
@.str.37 = private unnamed_addr constant [5 x i8] c"8.32\00", align 1
@stderr = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8

!20 = !{!21}
!21 = !DISubrange(count: 47)
!22 = distinct !DICompileUnit(language: DW_LANG_C99, file: !23, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !24, nameTableKind: None)
!23 = !DIFile(filename: "src/echo.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!24 = !{!7, !6, !25, !26}
!25 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!26 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !29, nameTableKind: None)
!28 = !DIFile(filename: "src/version.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!29 = !{!30}
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "Version", scope: !27, file: !28, line: 2, type: !11, isLocal: false, isDefinition: true)
!32 = distinct !DICompileUnit(language: DW_LANG_C99, file: !33, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !34, nameTableKind: None)
!33 = !DIFile(filename: "./lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!34 = !{!35, !38}
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "file_name", scope: !32, file: !37, line: 46, type: !11, isLocal: true, isDefinition: true)
!37 = !DIFile(filename: "lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !32, file: !37, line: 56, type: !40, isLocal: true, isDefinition: true)
!40 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!41 = distinct !DICompileUnit(language: DW_LANG_C99, file: !42, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !43, nameTableKind: None)
!42 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!43 = !{!44}
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "exit_failure", scope: !41, file: !46, line: 24, type: !47, isLocal: false, isDefinition: true)
!46 = !DIFile(filename: "lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!47 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !25)
!48 = distinct !DICompileUnit(language: DW_LANG_C99, file: !49, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !50, retainedTypes: !66, globals: !70, nameTableKind: None)
!49 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!50 = !{!51}
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !52, line: 32, baseType: !53, size: 32, elements: !54)
!52 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!53 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!54 = !{!55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65}
!55 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!56 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!59 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!60 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!61 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!62 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!63 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!64 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!65 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!66 = !{!25, !26, !67}
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !68, line: 46, baseType: !69)
!68 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.1/include/stddef.h", directory: "")
!69 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!70 = !{!71, !78, !84, !96, !98, !103, !110, !112}
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !48, file: !73, line: 85, type: !74, isLocal: false, isDefinition: true)
!73 = !DIFile(filename: "lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 704, elements: !76)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!76 = !{!77}
!77 = !DISubrange(count: 11)
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !48, file: !73, line: 101, type: !80, isLocal: false, isDefinition: true)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 320, elements: !82)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!82 = !{!83}
!83 = !DISubrange(count: 10)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !48, file: !73, line: 1052, type: !86, isLocal: false, isDefinition: true)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !73, line: 65, size: 448, elements: !87)
!87 = !{!88, !89, !90, !94, !95}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !86, file: !73, line: 68, baseType: !51, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !86, file: !73, line: 71, baseType: !25, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !86, file: !73, line: 75, baseType: !91, size: 256, offset: 64)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 256, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 8)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !86, file: !73, line: 78, baseType: !11, size: 64, offset: 320)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !86, file: !73, line: 81, baseType: !11, size: 64, offset: 384)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !48, file: !73, line: 116, type: !86, isLocal: true, isDefinition: true)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "slot0", scope: !48, file: !73, line: 842, type: !100, isLocal: true, isDefinition: true)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 256)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "slotvec", scope: !48, file: !73, line: 845, type: !105, isLocal: true, isDefinition: true)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !73, line: 834, size: 128, elements: !107)
!107 = !{!108, !109}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !106, file: !73, line: 836, baseType: !67, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !106, file: !73, line: 837, baseType: !7, size: 64, offset: 64)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "nslots", scope: !48, file: !73, line: 843, type: !25, isLocal: true, isDefinition: true)
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "slotvec0", scope: !48, file: !73, line: 844, type: !106, isLocal: true, isDefinition: true)
!114 = distinct !DICompileUnit(language: DW_LANG_C99, file: !115, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !116, nameTableKind: None)
!115 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!116 = !{!6}
!117 = distinct !DICompileUnit(language: DW_LANG_C99, file: !118, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !119, nameTableKind: None)
!118 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!119 = !{!67, !7, !6}
!120 = distinct !DICompileUnit(language: DW_LANG_C99, file: !121, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!121 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!122 = distinct !DICompileUnit(language: DW_LANG_C99, file: !123, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !124, nameTableKind: None)
!123 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!124 = !{!67}
!125 = distinct !DICompileUnit(language: DW_LANG_C99, file: !126, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !127, nameTableKind: None)
!126 = !DIFile(filename: "./lib/c-strcasecmp.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!127 = !{!128}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!130 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!131 = distinct !DICompileUnit(language: DW_LANG_C99, file: !132, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!132 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!133 = distinct !DICompileUnit(language: DW_LANG_C99, file: !134, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!134 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!135 = distinct !DICompileUnit(language: DW_LANG_C99, file: !136, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !116, nameTableKind: None)
!136 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!137 = distinct !DICompileUnit(language: DW_LANG_C99, file: !138, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !116, nameTableKind: None)
!138 = !DIFile(filename: "./lib/setlocale_null.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!139 = distinct !DICompileUnit(language: DW_LANG_C99, file: !140, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!140 = !DIFile(filename: "./lib/fclose.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!141 = distinct !DICompileUnit(language: DW_LANG_C99, file: !142, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !116, nameTableKind: None)
!142 = !DIFile(filename: "./lib/fflush.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!143 = distinct !DICompileUnit(language: DW_LANG_C99, file: !144, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !116, nameTableKind: None)
!144 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!145 = distinct !DICompileUnit(language: DW_LANG_C99, file: !146, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!146 = !DIFile(filename: "./lib/c-ctype.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!147 = !{!"clang version 9.0.1-12 "}
!148 = !{i32 2, !"Dwarf Version", i32 4}
!149 = !{i32 2, !"Debug Info Version", i32 3}
!150 = !{i32 1, !"wchar_size", i32 4}
!151 = !{i32 1, !"ThinLTO", i32 0}
!152 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!153 = !DILocalVariable(name: "argc", arg: 1, scope: !154, file: !23, line: 108, type: !25)
!154 = distinct !DISubprogram(name: "main", scope: !23, file: !23, line: 108, type: !155, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !22, retainedNodes: !4)
!155 = !DISubroutineType(types: !156)
!156 = !{!25, !25, !157}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!158 = !DILocation(line: 0, scope: !154)
!159 = !DILocalVariable(name: "argv", arg: 2, scope: !154, file: !23, line: 108, type: !157)
!160 = !DILocalVariable(name: "display_return", scope: !154, file: !23, line: 110, type: !40)
!161 = !DILocation(line: 111, column: 26, scope: !154)
!162 = !DILocalVariable(name: "posixly_correct", scope: !154, file: !23, line: 111, type: !40)
!163 = !DILocation(line: 114, column: 6, scope: !154)
!164 = !DILocalVariable(name: "allow_options", scope: !154, file: !23, line: 112, type: !40)
!165 = !DILocalVariable(name: "do_v9", scope: !154, file: !23, line: 119, type: !40)
!166 = !DILocation(line: 122, column: 21, scope: !154)
!167 = !DILocation(line: 122, column: 3, scope: !154)
!168 = !DILocation(line: 131, column: 21, scope: !169)
!169 = distinct !DILexicalBlock(scope: !154, file: !23, line: 131, column: 7)
!170 = !DILocation(line: 114, column: 37, scope: !154)
!171 = !DILocation(line: 114, column: 44, scope: !154)
!172 = !DILocation(line: 114, column: 47, scope: !154)
!173 = !DILocation(line: 144, column: 3, scope: !154)
!174 = !DILocation(line: 145, column: 3, scope: !154)
!175 = !DILabel(scope: !154, name: "just_echo", file: !23, line: 191)
!176 = !DILocation(line: 191, column: 1, scope: !154)
!177 = !DILocation(line: 195, column: 7, scope: !178)
!178 = distinct !DILexicalBlock(scope: !179, file: !23, line: 194, column: 5)
!179 = distinct !DILexicalBlock(scope: !154, file: !23, line: 193, column: 7)
!180 = !DILocation(line: 133, column: 11, scope: !181)
!181 = distinct !DILexicalBlock(scope: !182, file: !23, line: 133, column: 11)
!182 = distinct !DILexicalBlock(scope: !169, file: !23, line: 132, column: 5)
!183 = !DILocation(line: 136, column: 11, scope: !184)
!184 = distinct !DILexicalBlock(scope: !182, file: !23, line: 136, column: 11)
!185 = !DILocation(line: 138, column: 24, scope: !186)
!186 = distinct !DILexicalBlock(scope: !184, file: !23, line: 137, column: 9)
!187 = !DILocation(line: 138, column: 11, scope: !186)
!188 = !DILocation(line: 140, column: 11, scope: !186)
!189 = !DILocation(line: 148, column: 17, scope: !190)
!190 = distinct !DILexicalBlock(scope: !154, file: !23, line: 147, column: 7)
!191 = !DILocation(line: 148, column: 21, scope: !190)
!192 = !DILocation(line: 110, column: 8, scope: !154)
!193 = !DILocation(line: 119, column: 8, scope: !154)
!194 = !DILocation(line: 148, column: 25, scope: !190)
!195 = !DILocation(line: 148, column: 24, scope: !190)
!196 = !DILocation(line: 148, column: 33, scope: !190)
!197 = !DILocation(line: 148, column: 5, scope: !190)
!198 = !DILocation(line: 150, column: 36, scope: !199)
!199 = distinct !DILexicalBlock(scope: !190, file: !23, line: 149, column: 7)
!200 = !DILocalVariable(name: "temp", scope: !199, file: !23, line: 150, type: !11)
!201 = !DILocation(line: 0, scope: !199)
!202 = !DILocalVariable(name: "i", scope: !199, file: !23, line: 151, type: !67)
!203 = !DILocation(line: 157, column: 21, scope: !204)
!204 = distinct !DILexicalBlock(scope: !205, file: !23, line: 157, column: 9)
!205 = distinct !DILexicalBlock(scope: !199, file: !23, line: 157, column: 9)
!206 = !DILocation(line: 157, column: 9, scope: !205)
!207 = !DILocation(line: 158, column: 19, scope: !204)
!208 = !DILocation(line: 158, column: 11, scope: !204)
!209 = !DILocation(line: 157, column: 31, scope: !204)
!210 = distinct !{!210, !206, !211}
!211 = !DILocation(line: 164, column: 13, scope: !205)
!212 = !DILocation(line: 0, scope: !205)
!213 = !DILocation(line: 171, column: 16, scope: !199)
!214 = !DILocation(line: 171, column: 9, scope: !199)
!215 = distinct !{!215, !197, !216}
!216 = !DILocation(line: 189, column: 7, scope: !190)
!217 = !DILocation(line: 172, column: 24, scope: !199)
!218 = !DILocation(line: 172, column: 19, scope: !199)
!219 = !DILocation(line: 172, column: 11, scope: !199)
!220 = !DILocation(line: 176, column: 15, scope: !221)
!221 = distinct !DILexicalBlock(scope: !199, file: !23, line: 173, column: 13)
!222 = !DILocation(line: 180, column: 15, scope: !221)
!223 = !DILocation(line: 184, column: 15, scope: !221)
!224 = distinct !{!224, !214, !225}
!225 = !DILocation(line: 185, column: 13, scope: !199)
!226 = !DILocation(line: 193, column: 7, scope: !179)
!227 = !DILocation(line: 193, column: 13, scope: !179)
!228 = !DILocation(line: 0, scope: !179)
!229 = !DILocation(line: 260, column: 7, scope: !230)
!230 = distinct !DILexicalBlock(scope: !179, file: !23, line: 259, column: 5)
!231 = !DILocation(line: 262, column: 11, scope: !232)
!232 = distinct !DILexicalBlock(scope: !230, file: !23, line: 261, column: 9)
!233 = !DILocation(line: 263, column: 15, scope: !232)
!234 = !DILocation(line: 265, column: 20, scope: !235)
!235 = distinct !DILexicalBlock(scope: !232, file: !23, line: 265, column: 15)
!236 = !DILocation(line: 265, column: 15, scope: !232)
!237 = !DILocation(line: 197, column: 27, scope: !238)
!238 = distinct !DILexicalBlock(scope: !178, file: !23, line: 196, column: 9)
!239 = !DILocalVariable(name: "s", scope: !238, file: !23, line: 197, type: !11)
!240 = !DILocation(line: 0, scope: !238)
!241 = !DILocation(line: 200, column: 11, scope: !238)
!242 = !DILocation(line: 200, column: 25, scope: !238)
!243 = !DILocation(line: 200, column: 23, scope: !238)
!244 = !DILocalVariable(name: "c", scope: !238, file: !23, line: 198, type: !130)
!245 = !DILocation(line: 202, column: 32, scope: !246)
!246 = distinct !DILexicalBlock(scope: !247, file: !23, line: 202, column: 19)
!247 = distinct !DILexicalBlock(scope: !238, file: !23, line: 201, column: 13)
!248 = !DILocation(line: 202, column: 19, scope: !247)
!249 = !DILocation(line: 204, column: 33, scope: !250)
!250 = distinct !DILexicalBlock(scope: !246, file: !23, line: 203, column: 17)
!251 = !DILocation(line: 204, column: 19, scope: !250)
!252 = !DILocation(line: 206, column: 41, scope: !253)
!253 = distinct !DILexicalBlock(scope: !250, file: !23, line: 205, column: 21)
!254 = !DILocation(line: 207, column: 41, scope: !253)
!255 = !DILocation(line: 209, column: 43, scope: !253)
!256 = !DILocation(line: 210, column: 41, scope: !253)
!257 = !DILocation(line: 211, column: 41, scope: !253)
!258 = !DILocation(line: 212, column: 41, scope: !253)
!259 = !DILocation(line: 213, column: 41, scope: !253)
!260 = !DILocation(line: 214, column: 41, scope: !253)
!261 = !DILocation(line: 217, column: 44, scope: !262)
!262 = distinct !DILexicalBlock(scope: !253, file: !23, line: 216, column: 23)
!263 = !DILocalVariable(name: "ch", scope: !262, file: !23, line: 217, type: !130)
!264 = !DILocation(line: 0, scope: !262)
!265 = !DILocation(line: 218, column: 31, scope: !266)
!266 = distinct !DILexicalBlock(scope: !262, file: !23, line: 218, column: 29)
!267 = !DILocation(line: 218, column: 29, scope: !262)
!268 = !DILocation(line: 220, column: 26, scope: !262)
!269 = !DILocation(line: 221, column: 29, scope: !262)
!270 = !DILocation(line: 222, column: 30, scope: !262)
!271 = !DILocation(line: 223, column: 29, scope: !272)
!272 = distinct !DILexicalBlock(scope: !262, file: !23, line: 223, column: 29)
!273 = !DILocation(line: 223, column: 29, scope: !262)
!274 = !DILocation(line: 225, column: 30, scope: !275)
!275 = distinct !DILexicalBlock(scope: !272, file: !23, line: 224, column: 27)
!276 = !DILocation(line: 226, column: 35, scope: !275)
!277 = !DILocation(line: 226, column: 42, scope: !275)
!278 = !DILocation(line: 226, column: 40, scope: !275)
!279 = !DILocation(line: 226, column: 33, scope: !275)
!280 = !DILocation(line: 227, column: 27, scope: !275)
!281 = !DILocation(line: 232, column: 37, scope: !282)
!282 = distinct !DILexicalBlock(scope: !253, file: !23, line: 232, column: 27)
!283 = !DILocation(line: 232, column: 40, scope: !282)
!284 = !DILocation(line: 234, column: 29, scope: !253)
!285 = !DILocation(line: 235, column: 23, scope: !253)
!286 = !DILocation(line: 0, scope: !250)
!287 = !DILocation(line: 238, column: 25, scope: !253)
!288 = !DILocation(line: 239, column: 34, scope: !289)
!289 = distinct !DILexicalBlock(scope: !253, file: !23, line: 239, column: 27)
!290 = !DILocation(line: 239, column: 37, scope: !289)
!291 = !DILocation(line: 240, column: 31, scope: !289)
!292 = !DILocation(line: 240, column: 40, scope: !289)
!293 = !DILocation(line: 240, column: 43, scope: !289)
!294 = !DILocation(line: 240, column: 35, scope: !289)
!295 = !DILocation(line: 240, column: 25, scope: !289)
!296 = !DILocation(line: 0, scope: !253)
!297 = !DILocation(line: 241, column: 34, scope: !298)
!298 = distinct !DILexicalBlock(scope: !253, file: !23, line: 241, column: 27)
!299 = !DILocation(line: 241, column: 37, scope: !298)
!300 = !DILocation(line: 242, column: 31, scope: !298)
!301 = !DILocation(line: 242, column: 40, scope: !298)
!302 = !DILocation(line: 242, column: 43, scope: !298)
!303 = !DILocation(line: 242, column: 35, scope: !298)
!304 = !DILocation(line: 242, column: 25, scope: !298)
!305 = !DILocation(line: 247, column: 31, scope: !253)
!306 = !DILocation(line: 247, column: 47, scope: !253)
!307 = !DILocation(line: 250, column: 15, scope: !247)
!308 = distinct !{!308, !241, !309}
!309 = !DILocation(line: 251, column: 13, scope: !238)
!310 = !DILocation(line: 252, column: 15, scope: !238)
!311 = !DILocation(line: 254, column: 20, scope: !312)
!312 = distinct !DILexicalBlock(scope: !238, file: !23, line: 254, column: 15)
!313 = !DILocation(line: 254, column: 15, scope: !238)
!314 = !DILocation(line: 253, column: 15, scope: !238)
!315 = !DILocation(line: 255, column: 13, scope: !312)
!316 = !DILocation(line: 264, column: 15, scope: !232)
!317 = !DILocation(line: 266, column: 13, scope: !235)
!318 = !DILocation(line: 270, column: 7, scope: !319)
!319 = distinct !DILexicalBlock(scope: !154, file: !23, line: 270, column: 7)
!320 = !DILocation(line: 270, column: 7, scope: !154)
!321 = !DILocation(line: 271, column: 5, scope: !319)
!322 = !DILocation(line: 273, column: 1, scope: !154)
!323 = !DILocalVariable(name: "c", arg: 1, scope: !324, file: !23, line: 89, type: !130)
!324 = distinct !DISubprogram(name: "hextobin", scope: !23, file: !23, line: 89, type: !325, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !22, retainedNodes: !4)
!325 = !DISubroutineType(types: !326)
!326 = !{!25, !130}
!327 = !DILocation(line: 0, scope: !324)
!328 = !DILocation(line: 91, column: 3, scope: !324)
!329 = !DILocation(line: 91, column: 11, scope: !324)
!330 = !DILocation(line: 93, column: 23, scope: !331)
!331 = distinct !DILexicalBlock(scope: !324, file: !23, line: 92, column: 5)
!332 = !DILocation(line: 93, column: 14, scope: !331)
!333 = !DILocation(line: 95, column: 25, scope: !331)
!334 = !DILocation(line: 96, column: 25, scope: !331)
!335 = !DILocation(line: 97, column: 25, scope: !331)
!336 = !DILocation(line: 98, column: 25, scope: !331)
!337 = !DILocation(line: 99, column: 25, scope: !331)
!338 = !DILocation(line: 0, scope: !331)
!339 = !DILocation(line: 101, column: 1, scope: !324)
!340 = !DILocalVariable(name: "argv0", arg: 1, scope: !341, file: !10, line: 39, type: !11)
!341 = distinct !DISubprogram(name: "set_program_name", scope: !10, file: !10, line: 39, type: !342, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!342 = !DISubroutineType(types: !343)
!343 = !{null, !11}
!344 = !DILocation(line: 0, scope: !341)
!345 = !DILocation(line: 51, column: 13, scope: !346)
!346 = distinct !DILexicalBlock(scope: !341, file: !10, line: 51, column: 7)
!347 = !DILocation(line: 51, column: 7, scope: !341)
!348 = !DILocation(line: 55, column: 14, scope: !349)
!349 = distinct !DILexicalBlock(scope: !346, file: !10, line: 52, column: 5)
!350 = !DILocation(line: 54, column: 7, scope: !349)
!351 = !DILocation(line: 56, column: 7, scope: !349)
!352 = !DILocation(line: 59, column: 11, scope: !341)
!353 = !DILocalVariable(name: "slash", scope: !341, file: !10, line: 46, type: !11)
!354 = !DILocation(line: 60, column: 17, scope: !341)
!355 = !DILocation(line: 60, column: 11, scope: !341)
!356 = !DILocalVariable(name: "base", scope: !341, file: !10, line: 47, type: !11)
!357 = !DILocation(line: 61, column: 12, scope: !358)
!358 = distinct !DILexicalBlock(scope: !341, file: !10, line: 61, column: 7)
!359 = !DILocation(line: 61, column: 20, scope: !358)
!360 = !DILocation(line: 61, column: 25, scope: !358)
!361 = !DILocation(line: 61, column: 42, scope: !358)
!362 = !DILocation(line: 61, column: 28, scope: !358)
!363 = !DILocation(line: 61, column: 61, scope: !358)
!364 = !DILocation(line: 61, column: 7, scope: !341)
!365 = !DILocation(line: 64, column: 11, scope: !366)
!366 = distinct !DILexicalBlock(scope: !367, file: !10, line: 64, column: 11)
!367 = distinct !DILexicalBlock(scope: !358, file: !10, line: 62, column: 5)
!368 = !DILocation(line: 64, column: 36, scope: !366)
!369 = !DILocation(line: 64, column: 11, scope: !367)
!370 = !DILocation(line: 66, column: 24, scope: !371)
!371 = distinct !DILexicalBlock(scope: !366, file: !10, line: 65, column: 9)
!372 = !DILocation(line: 70, column: 41, scope: !371)
!373 = !DILocation(line: 72, column: 9, scope: !371)
!374 = !DILocation(line: 84, column: 16, scope: !341)
!375 = !DILocation(line: 90, column: 27, scope: !341)
!376 = !DILocation(line: 92, column: 1, scope: !341)
!377 = !DILocalVariable(name: "stream", arg: 1, scope: !378, file: !379, line: 61, type: !382)
!378 = distinct !DISubprogram(name: "version_etc_arn", scope: !379, file: !379, line: 61, type: !380, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !114, retainedNodes: !4)
!379 = !DIFile(filename: "lib/version-etc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!380 = !DISubroutineType(types: !381)
!381 = !{null, !382, !11, !11, !11, !437, !67}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !384, line: 7, baseType: !385)
!384 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !386, line: 49, size: 1728, elements: !387)
!386 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!387 = !{!388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !403, !405, !406, !407, !411, !412, !414, !418, !421, !423, !426, !429, !430, !431, !432, !433}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !385, file: !386, line: 51, baseType: !25, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !385, file: !386, line: 54, baseType: !7, size: 64, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !385, file: !386, line: 55, baseType: !7, size: 64, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !385, file: !386, line: 56, baseType: !7, size: 64, offset: 192)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !385, file: !386, line: 57, baseType: !7, size: 64, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !385, file: !386, line: 58, baseType: !7, size: 64, offset: 320)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !385, file: !386, line: 59, baseType: !7, size: 64, offset: 384)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !385, file: !386, line: 60, baseType: !7, size: 64, offset: 448)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !385, file: !386, line: 61, baseType: !7, size: 64, offset: 512)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !385, file: !386, line: 64, baseType: !7, size: 64, offset: 576)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !385, file: !386, line: 65, baseType: !7, size: 64, offset: 640)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !385, file: !386, line: 66, baseType: !7, size: 64, offset: 704)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !385, file: !386, line: 68, baseType: !401, size: 64, offset: 768)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !386, line: 36, flags: DIFlagFwdDecl)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !385, file: !386, line: 70, baseType: !404, size: 64, offset: 832)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !385, file: !386, line: 72, baseType: !25, size: 32, offset: 896)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !385, file: !386, line: 73, baseType: !25, size: 32, offset: 928)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !385, file: !386, line: 74, baseType: !408, size: 64, offset: 960)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !409, line: 152, baseType: !410)
!409 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!410 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !385, file: !386, line: 77, baseType: !26, size: 16, offset: 1024)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !385, file: !386, line: 78, baseType: !413, size: 8, offset: 1040)
!413 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !385, file: !386, line: 79, baseType: !415, size: 8, offset: 1048)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 1)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !385, file: !386, line: 81, baseType: !419, size: 64, offset: 1088)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !386, line: 43, baseType: null)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !385, file: !386, line: 89, baseType: !422, size: 64, offset: 1152)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !409, line: 153, baseType: !410)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !385, file: !386, line: 91, baseType: !424, size: 64, offset: 1216)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !386, line: 37, flags: DIFlagFwdDecl)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !385, file: !386, line: 92, baseType: !427, size: 64, offset: 1280)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !386, line: 38, flags: DIFlagFwdDecl)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !385, file: !386, line: 93, baseType: !404, size: 64, offset: 1344)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !385, file: !386, line: 94, baseType: !6, size: 64, offset: 1408)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !385, file: !386, line: 95, baseType: !67, size: 64, offset: 1472)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !385, file: !386, line: 96, baseType: !25, size: 32, offset: 1536)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !385, file: !386, line: 98, baseType: !434, size: 160, offset: 1568)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !435)
!435 = !{!436}
!436 = !DISubrange(count: 20)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!438 = !DILocation(line: 0, scope: !378)
!439 = !DILocalVariable(name: "command_name", arg: 2, scope: !378, file: !379, line: 62, type: !11)
!440 = !DILocalVariable(name: "package", arg: 3, scope: !378, file: !379, line: 62, type: !11)
!441 = !DILocalVariable(name: "authors", arg: 5, scope: !378, file: !379, line: 64, type: !437)
!442 = !DILocalVariable(name: "n_authors", arg: 6, scope: !378, file: !379, line: 64, type: !67)
!443 = !DILocation(line: 67, column: 5, scope: !444)
!444 = distinct !DILexicalBlock(scope: !378, file: !379, line: 66, column: 7)
!445 = !DILocation(line: 83, column: 43, scope: !378)
!446 = !DILocation(line: 83, column: 3, scope: !378)
!447 = !DILocation(line: 85, column: 3, scope: !378)
!448 = !DILocation(line: 88, column: 20, scope: !378)
!449 = !DILocation(line: 88, column: 3, scope: !378)
!450 = !DILocation(line: 95, column: 3, scope: !378)
!451 = !DILocation(line: 97, column: 3, scope: !378)
!452 = !DILocation(line: 105, column: 24, scope: !453)
!453 = distinct !DILexicalBlock(scope: !378, file: !379, line: 98, column: 5)
!454 = !DILocation(line: 105, column: 47, scope: !453)
!455 = !DILocation(line: 105, column: 7, scope: !453)
!456 = !DILocation(line: 106, column: 7, scope: !453)
!457 = !DILocation(line: 109, column: 24, scope: !453)
!458 = !DILocation(line: 109, column: 54, scope: !453)
!459 = !DILocation(line: 109, column: 66, scope: !453)
!460 = !DILocation(line: 109, column: 7, scope: !453)
!461 = !DILocation(line: 110, column: 7, scope: !453)
!462 = !DILocation(line: 113, column: 24, scope: !453)
!463 = !DILocation(line: 114, column: 16, scope: !453)
!464 = !DILocation(line: 114, column: 28, scope: !453)
!465 = !DILocation(line: 114, column: 40, scope: !453)
!466 = !DILocation(line: 113, column: 7, scope: !453)
!467 = !DILocation(line: 115, column: 7, scope: !453)
!468 = !DILocation(line: 120, column: 24, scope: !453)
!469 = !DILocation(line: 121, column: 16, scope: !453)
!470 = !DILocation(line: 121, column: 28, scope: !453)
!471 = !DILocation(line: 121, column: 40, scope: !453)
!472 = !DILocation(line: 121, column: 52, scope: !453)
!473 = !DILocation(line: 120, column: 7, scope: !453)
!474 = !DILocation(line: 122, column: 7, scope: !453)
!475 = !DILocation(line: 127, column: 24, scope: !453)
!476 = !DILocation(line: 128, column: 16, scope: !453)
!477 = !DILocation(line: 128, column: 28, scope: !453)
!478 = !DILocation(line: 128, column: 40, scope: !453)
!479 = !DILocation(line: 128, column: 52, scope: !453)
!480 = !DILocation(line: 128, column: 64, scope: !453)
!481 = !DILocation(line: 127, column: 7, scope: !453)
!482 = !DILocation(line: 129, column: 7, scope: !453)
!483 = !DILocation(line: 134, column: 24, scope: !453)
!484 = !DILocation(line: 135, column: 16, scope: !453)
!485 = !DILocation(line: 135, column: 28, scope: !453)
!486 = !DILocation(line: 135, column: 40, scope: !453)
!487 = !DILocation(line: 135, column: 52, scope: !453)
!488 = !DILocation(line: 135, column: 64, scope: !453)
!489 = !DILocation(line: 136, column: 16, scope: !453)
!490 = !DILocation(line: 134, column: 7, scope: !453)
!491 = !DILocation(line: 137, column: 7, scope: !453)
!492 = !DILocation(line: 142, column: 24, scope: !453)
!493 = !DILocation(line: 143, column: 16, scope: !453)
!494 = !DILocation(line: 143, column: 28, scope: !453)
!495 = !DILocation(line: 143, column: 40, scope: !453)
!496 = !DILocation(line: 143, column: 52, scope: !453)
!497 = !DILocation(line: 143, column: 64, scope: !453)
!498 = !DILocation(line: 144, column: 16, scope: !453)
!499 = !DILocation(line: 144, column: 28, scope: !453)
!500 = !DILocation(line: 142, column: 7, scope: !453)
!501 = !DILocation(line: 145, column: 7, scope: !453)
!502 = !DILocation(line: 150, column: 24, scope: !453)
!503 = !DILocation(line: 152, column: 17, scope: !453)
!504 = !DILocation(line: 152, column: 29, scope: !453)
!505 = !DILocation(line: 152, column: 41, scope: !453)
!506 = !DILocation(line: 152, column: 53, scope: !453)
!507 = !DILocation(line: 152, column: 65, scope: !453)
!508 = !DILocation(line: 153, column: 17, scope: !453)
!509 = !DILocation(line: 153, column: 29, scope: !453)
!510 = !DILocation(line: 153, column: 41, scope: !453)
!511 = !DILocation(line: 150, column: 7, scope: !453)
!512 = !DILocation(line: 154, column: 7, scope: !453)
!513 = !DILocation(line: 159, column: 24, scope: !453)
!514 = !DILocation(line: 161, column: 16, scope: !453)
!515 = !DILocation(line: 161, column: 28, scope: !453)
!516 = !DILocation(line: 161, column: 40, scope: !453)
!517 = !DILocation(line: 161, column: 52, scope: !453)
!518 = !DILocation(line: 161, column: 64, scope: !453)
!519 = !DILocation(line: 162, column: 16, scope: !453)
!520 = !DILocation(line: 162, column: 28, scope: !453)
!521 = !DILocation(line: 162, column: 40, scope: !453)
!522 = !DILocation(line: 162, column: 52, scope: !453)
!523 = !DILocation(line: 159, column: 7, scope: !453)
!524 = !DILocation(line: 163, column: 7, scope: !453)
!525 = !DILocation(line: 170, column: 24, scope: !453)
!526 = !DILocation(line: 172, column: 17, scope: !453)
!527 = !DILocation(line: 172, column: 29, scope: !453)
!528 = !DILocation(line: 172, column: 41, scope: !453)
!529 = !DILocation(line: 172, column: 53, scope: !453)
!530 = !DILocation(line: 172, column: 65, scope: !453)
!531 = !DILocation(line: 173, column: 17, scope: !453)
!532 = !DILocation(line: 173, column: 29, scope: !453)
!533 = !DILocation(line: 173, column: 41, scope: !453)
!534 = !DILocation(line: 173, column: 53, scope: !453)
!535 = !DILocation(line: 170, column: 7, scope: !453)
!536 = !DILocation(line: 174, column: 7, scope: !453)
!537 = !DILocation(line: 176, column: 1, scope: !378)
!538 = !DILocalVariable(name: "stream", arg: 1, scope: !539, file: !379, line: 199, type: !382)
!539 = distinct !DISubprogram(name: "version_etc_va", scope: !379, file: !379, line: 199, type: !540, scopeLine: 202, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !114, retainedNodes: !4)
!540 = !DISubroutineType(types: !541)
!541 = !{null, !382, !11, !11, !11, !542}
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !115, line: 192, size: 192, elements: !544)
!544 = !{!545, !546, !547, !548}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !543, file: !115, line: 192, baseType: !53, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !543, file: !115, line: 192, baseType: !53, size: 32, offset: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !543, file: !115, line: 192, baseType: !6, size: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !543, file: !115, line: 192, baseType: !6, size: 64, offset: 128)
!549 = !DILocation(line: 0, scope: !539)
!550 = !DILocalVariable(name: "command_name", arg: 2, scope: !539, file: !379, line: 200, type: !11)
!551 = !DILocalVariable(name: "package", arg: 3, scope: !539, file: !379, line: 200, type: !11)
!552 = !DILocalVariable(name: "authors", arg: 5, scope: !539, file: !379, line: 201, type: !542)
!553 = !DILocalVariable(name: "authtab", scope: !539, file: !379, line: 204, type: !554)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 640, elements: !82)
!555 = !DILocation(line: 204, column: 15, scope: !539)
!556 = !DILocalVariable(name: "n_authors", scope: !539, file: !379, line: 203, type: !67)
!557 = !DILocation(line: 0, scope: !558)
!558 = distinct !DILexicalBlock(scope: !559, file: !379, line: 206, column: 3)
!559 = distinct !DILexicalBlock(scope: !539, file: !379, line: 206, column: 3)
!560 = !DILocation(line: 208, column: 10, scope: !558)
!561 = !DILocation(line: 208, column: 35, scope: !558)
!562 = !DILocation(line: 208, column: 14, scope: !558)
!563 = !DILocation(line: 208, column: 33, scope: !558)
!564 = !DILocation(line: 208, column: 67, scope: !558)
!565 = !DILocation(line: 206, column: 3, scope: !559)
!566 = !DILocation(line: 209, column: 17, scope: !558)
!567 = !DILocation(line: 207, column: 18, scope: !558)
!568 = distinct !{!568, !565, !569}
!569 = !DILocation(line: 210, column: 5, scope: !559)
!570 = !DILocation(line: 0, scope: !559)
!571 = !DILocation(line: 212, column: 20, scope: !539)
!572 = !DILocation(line: 211, column: 3, scope: !539)
!573 = !DILocation(line: 213, column: 1, scope: !539)
!574 = !DILocalVariable(name: "stream", arg: 1, scope: !575, file: !379, line: 230, type: !382)
!575 = distinct !DISubprogram(name: "version_etc", scope: !379, file: !379, line: 230, type: !576, scopeLine: 233, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !114, retainedNodes: !4)
!576 = !DISubroutineType(types: !577)
!577 = !{null, !382, !11, !11, !11, null}
!578 = !DILocation(line: 0, scope: !575)
!579 = !DILocalVariable(name: "command_name", arg: 2, scope: !575, file: !379, line: 231, type: !11)
!580 = !DILocalVariable(name: "package", arg: 3, scope: !575, file: !379, line: 231, type: !11)
!581 = !DILocalVariable(name: "authors", scope: !575, file: !379, line: 234, type: !582)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !583, line: 52, baseType: !584)
!583 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !585, line: 32, baseType: !586)
!585 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.1/include/stdarg.h", directory: "")
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !115, line: 234, baseType: !587)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 192, elements: !416)
!588 = !DILocation(line: 234, column: 11, scope: !575)
!589 = !DILocation(line: 236, column: 3, scope: !575)
!590 = !DILocation(line: 237, column: 3, scope: !575)
!591 = !DILocation(line: 238, column: 3, scope: !575)
!592 = !DILocation(line: 239, column: 1, scope: !575)
