; ModuleID = '<stdin>'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.utsname = type { [65 x i8], [65 x i8], [65 x i8], [65 x i8], [65 x i8], [65 x i8] }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external dso_local global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [23 x i8] c"Usage: %s [OPTION]...\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "unknown", scope: !2, file: !3, line: 262, type: !42, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 260, type: !4, scopeLine: 261, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !11)
!3 = !DIFile(filename: "src/uname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !6, !7}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!10 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !12, globals: !14, nameTableKind: None)
!11 = !{}
!12 = !{!8, !13}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!14 = !{!0, !15, !31, !36}
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "arch_long_options", scope: !10, file: !3, line: 107, type: !17, isLocal: true, isDefinition: true)
!17 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 768, elements: !29)
!18 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !20, line: 50, size: 256, elements: !21)
!20 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "")
!21 = !{!22, !25, !26, !28}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !19, file: !20, line: 52, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !19, file: !20, line: 55, baseType: !6, size: 32, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !19, file: !20, line: 56, baseType: !27, size: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !19, file: !20, line: 57, baseType: !6, size: 32, offset: 192)
!29 = !{!30}
!30 = !DISubrange(count: 3)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "uname_long_options", scope: !10, file: !3, line: 89, type: !33, isLocal: true, isDefinition: true)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 3584, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 14)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "printed", scope: !38, file: !3, line: 163, type: !41, isLocal: true, isDefinition: true)
!38 = distinct !DISubprogram(name: "print_element", scope: !3, file: !3, line: 161, type: !39, scopeLine: 162, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10, retainedNodes: !11)
!39 = !DISubroutineType(types: !40)
!40 = !{null, !23}
!41 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 64, elements: !43)
!43 = !{!44}
!44 = !DISubrange(count: 8)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "uname_mode", scope: !47, file: !48, line: 2, type: !6, isLocal: false, isDefinition: true)
!47 = distinct !DICompileUnit(language: DW_LANG_C99, file: !48, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, globals: !49, nameTableKind: None)
!48 = !DIFile(filename: "src/uname-uname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!49 = !{!45}
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "Version", scope: !52, file: !53, line: 2, type: !23, isLocal: false, isDefinition: true)
!52 = distinct !DICompileUnit(language: DW_LANG_C99, file: !53, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, globals: !54, nameTableKind: None)
!53 = !DIFile(filename: "src/version.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!54 = !{!50}
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !57, file: !62, line: 56, type: !41, isLocal: true, isDefinition: true)
!57 = distinct !DICompileUnit(language: DW_LANG_C99, file: !58, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, globals: !59, nameTableKind: None)
!58 = !DIFile(filename: "./lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!59 = !{!60, !55}
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "file_name", scope: !57, file: !62, line: 46, type: !23, isLocal: true, isDefinition: true)
!62 = !DIFile(filename: "lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "exit_failure", scope: !65, file: !68, line: 24, type: !69, isLocal: false, isDefinition: true)
!65 = distinct !DICompileUnit(language: DW_LANG_C99, file: !66, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, globals: !67, nameTableKind: None)
!66 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!67 = !{!63}
!68 = !DIFile(filename: "lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!69 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !6)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "program_name", scope: !72, file: !76, line: 33, type: !23, isLocal: false, isDefinition: true)
!72 = distinct !DICompileUnit(language: DW_LANG_C99, file: !73, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !74, globals: !75, nameTableKind: None)
!73 = !DIFile(filename: "./lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!74 = !{!13, !8}
!75 = !{!70}
!76 = !DIFile(filename: "lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !79, file: !105, line: 116, type: !118, isLocal: true, isDefinition: true)
!79 = distinct !DICompileUnit(language: DW_LANG_C99, file: !80, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !81, retainedTypes: !97, globals: !102, nameTableKind: None)
!80 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!81 = !{!82}
!82 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !83, line: 32, baseType: !84, size: 32, elements: !85)
!83 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!84 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96}
!86 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!87 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!88 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!89 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!90 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!91 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!92 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!93 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!94 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!95 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!96 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!97 = !{!6, !98, !99}
!98 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !100, line: 46, baseType: !101)
!100 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.1/include/stddef.h", directory: "")
!101 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!102 = !{!103, !110, !116, !77, !126, !131, !138, !140}
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !79, file: !105, line: 85, type: !106, isLocal: false, isDefinition: true)
!105 = !DIFile(filename: "lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 704, elements: !108)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!108 = !{!109}
!109 = !DISubrange(count: 11)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !79, file: !105, line: 101, type: !112, isLocal: false, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 320, elements: !114)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!114 = !{!115}
!115 = !DISubrange(count: 10)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !79, file: !105, line: 1052, type: !118, isLocal: false, isDefinition: true)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !105, line: 65, size: 448, elements: !119)
!119 = !{!120, !121, !122, !124, !125}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !118, file: !105, line: 68, baseType: !82, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !118, file: !105, line: 71, baseType: !6, size: 32, offset: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !118, file: !105, line: 75, baseType: !123, size: 256, offset: 64)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 256, elements: !43)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !118, file: !105, line: 78, baseType: !23, size: 64, offset: 320)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !118, file: !105, line: 81, baseType: !23, size: 64, offset: 384)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "slot0", scope: !79, file: !105, line: 842, type: !128, isLocal: true, isDefinition: true)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2048, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 256)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "slotvec", scope: !79, file: !105, line: 845, type: !133, isLocal: true, isDefinition: true)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !105, line: 834, size: 128, elements: !135)
!135 = !{!136, !137}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !134, file: !105, line: 836, baseType: !99, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !134, file: !105, line: 837, baseType: !8, size: 64, offset: 64)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "nslots", scope: !79, file: !105, line: 843, type: !6, isLocal: true, isDefinition: true)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "slotvec0", scope: !79, file: !105, line: 844, type: !134, isLocal: true, isDefinition: true)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !144, file: !147, line: 26, type: !148, isLocal: false, isDefinition: true)
!144 = distinct !DICompileUnit(language: DW_LANG_C99, file: !145, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, globals: !146, nameTableKind: None)
!145 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!146 = !{!142}
!147 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 376, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 47)
!151 = distinct !DICompileUnit(language: DW_LANG_C99, file: !152, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !153, nameTableKind: None)
!152 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!153 = !{!13}
!154 = distinct !DICompileUnit(language: DW_LANG_C99, file: !155, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !156, nameTableKind: None)
!155 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!156 = !{!99, !8, !13}
!157 = distinct !DICompileUnit(language: DW_LANG_C99, file: !158, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, nameTableKind: None)
!158 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!159 = distinct !DICompileUnit(language: DW_LANG_C99, file: !160, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !161, nameTableKind: None)
!160 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!161 = !{!99}
!162 = distinct !DICompileUnit(language: DW_LANG_C99, file: !163, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !164, nameTableKind: None)
!163 = !DIFile(filename: "./lib/c-strcasecmp.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!164 = !{!165}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!167 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!168 = distinct !DICompileUnit(language: DW_LANG_C99, file: !169, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, nameTableKind: None)
!169 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!170 = distinct !DICompileUnit(language: DW_LANG_C99, file: !171, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, nameTableKind: None)
!171 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!172 = distinct !DICompileUnit(language: DW_LANG_C99, file: !173, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !153, nameTableKind: None)
!173 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!174 = distinct !DICompileUnit(language: DW_LANG_C99, file: !175, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !153, nameTableKind: None)
!175 = !DIFile(filename: "./lib/setlocale_null.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!176 = distinct !DICompileUnit(language: DW_LANG_C99, file: !177, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, nameTableKind: None)
!177 = !DIFile(filename: "./lib/fclose.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!178 = distinct !DICompileUnit(language: DW_LANG_C99, file: !179, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !153, nameTableKind: None)
!179 = !DIFile(filename: "./lib/fflush.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!180 = distinct !DICompileUnit(language: DW_LANG_C99, file: !181, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !153, nameTableKind: None)
!181 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!182 = distinct !DICompileUnit(language: DW_LANG_C99, file: !183, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, nameTableKind: None)
!183 = !DIFile(filename: "./lib/c-ctype.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!184 = !{!"clang version 9.0.1-12 "}
!185 = !{i32 2, !"Dwarf Version", i32 4}
!186 = !{i32 2, !"Debug Info Version", i32 3}
!187 = !{i32 1, !"wchar_size", i32 4}
!188 = !{i32 1, !"ThinLTO", i32 0}
!189 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!190 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 115, type: !191, scopeLine: 116, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !11)
!191 = !DISubroutineType(types: !192)
!192 = !{null, !6}
!193 = !DILocalVariable(name: "status", arg: 1, scope: !190, file: !3, line: 115, type: !6)
!194 = !DILocation(line: 115, column: 12, scope: !190)
!195 = !DILocation(line: 117, column: 7, scope: !196)
!196 = distinct !DILexicalBlock(scope: !190, file: !3, line: 117, column: 7)
!197 = !DILocation(line: 117, column: 14, scope: !196)
!198 = !DILocation(line: 117, column: 7, scope: !190)
!199 = !DILocation(line: 118, column: 5, scope: !196)
!200 = !DILocation(line: 118, column: 5, scope: !201)
!201 = distinct !DILexicalBlock(scope: !196, file: !3, line: 118, column: 5)
!202 = !DILocation(line: 121, column: 15, scope: !203)
!203 = distinct !DILexicalBlock(scope: !196, file: !3, line: 120, column: 5)
!204 = !DILocation(line: 121, column: 45, scope: !203)
!205 = !DILocation(line: 121, column: 7, scope: !203)
!206 = !DILocation(line: 123, column: 11, scope: !207)
!207 = distinct !DILexicalBlock(scope: !203, file: !3, line: 123, column: 11)
!208 = !DILocation(line: 123, column: 22, scope: !207)
!209 = !DILocation(line: 123, column: 11, scope: !203)
!210 = !DILocation(line: 125, column: 11, scope: !211)
!211 = distinct !DILexicalBlock(scope: !207, file: !3, line: 124, column: 9)
!212 = !DILocation(line: 134, column: 11, scope: !211)
!213 = !DILocation(line: 141, column: 9, scope: !211)
!214 = !DILocation(line: 144, column: 11, scope: !215)
!215 = distinct !DILexicalBlock(scope: !207, file: !3, line: 143, column: 9)
!216 = !DILocation(line: 150, column: 7, scope: !203)
!217 = !DILocation(line: 151, column: 7, scope: !203)
!218 = !DILocation(line: 152, column: 28, scope: !203)
!219 = !DILocation(line: 152, column: 7, scope: !203)
!220 = !DILocation(line: 154, column: 9, scope: !190)
!221 = !DILocation(line: 154, column: 3, scope: !190)
!222 = !DILocalVariable(name: "status", arg: 1, scope: !223, file: !3, line: 115, type: !6)
!223 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 115, type: !191, scopeLine: 116, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !224, retainedNodes: !11)
!224 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !12, globals: !225, nameTableKind: None)
!225 = !{!226, !229, !239, !242}
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "unknown", scope: !228, file: !3, line: 262, type: !42, isLocal: true, isDefinition: true)
!228 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 260, type: !4, scopeLine: 261, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !224, retainedNodes: !11)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "arch_long_options", scope: !224, file: !3, line: 107, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 768, elements: !29)
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !20, line: 50, size: 256, elements: !234)
!234 = !{!235, !236, !237, !238}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !233, file: !20, line: 52, baseType: !23, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !233, file: !20, line: 55, baseType: !6, size: 32, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !233, file: !20, line: 56, baseType: !27, size: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !233, file: !20, line: 57, baseType: !6, size: 32, offset: 192)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "uname_long_options", scope: !224, file: !3, line: 89, type: !241, isLocal: true, isDefinition: true)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 3584, elements: !34)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "printed", scope: !244, file: !3, line: 163, type: !41, isLocal: true, isDefinition: true)
!244 = distinct !DISubprogram(name: "print_element", scope: !3, file: !3, line: 161, type: !39, scopeLine: 162, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !224, retainedNodes: !11)
!245 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !246, file: !246, line: 634, type: !39, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10, retainedNodes: !11)
!246 = !DIFile(filename: "src/system.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!247 = !DILocalVariable(name: "program", arg: 1, scope: !245, file: !246, line: 634, type: !23)
!248 = !DILocation(line: 634, column: 34, scope: !245)
!249 = !DILocalVariable(name: "infomap", scope: !245, file: !246, line: 636, type: !250)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 896, elements: !256)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !245, file: !246, line: 636, size: 128, elements: !253)
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !252, file: !246, line: 636, baseType: !23, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !252, file: !246, line: 636, baseType: !23, size: 64, offset: 64)
!256 = !{!257}
!257 = !DISubrange(count: 7)
!258 = !DILocation(line: 636, column: 67, scope: !245)
!259 = !DILocalVariable(name: "node", scope: !245, file: !246, line: 646, type: !23)
!260 = !DILocation(line: 646, column: 15, scope: !245)
!261 = !DILocation(line: 646, column: 22, scope: !245)
!262 = !DILocalVariable(name: "map_prog", scope: !245, file: !246, line: 647, type: !263)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!264 = !DILocation(line: 647, column: 25, scope: !245)
!265 = !DILocation(line: 647, column: 36, scope: !245)
!266 = !DILocation(line: 649, column: 3, scope: !245)
!267 = !DILocation(line: 649, column: 10, scope: !245)
!268 = !DILocation(line: 649, column: 20, scope: !245)
!269 = !DILocation(line: 649, column: 28, scope: !245)
!270 = !DILocation(line: 649, column: 33, scope: !245)
!271 = !DILocation(line: 649, column: 31, scope: !245)
!272 = !DILocation(line: 0, scope: !245)
!273 = !DILocation(line: 650, column: 13, scope: !245)
!274 = distinct !{!274, !266, !273}
!275 = !DILocation(line: 652, column: 7, scope: !276)
!276 = distinct !DILexicalBlock(scope: !245, file: !246, line: 652, column: 7)
!277 = !DILocation(line: 652, column: 17, scope: !276)
!278 = !DILocation(line: 652, column: 7, scope: !245)
!279 = !DILocation(line: 653, column: 12, scope: !276)
!280 = !DILocation(line: 653, column: 22, scope: !276)
!281 = !DILocation(line: 653, column: 10, scope: !276)
!282 = !DILocation(line: 653, column: 5, scope: !276)
!283 = !DILocation(line: 655, column: 11, scope: !245)
!284 = !DILocation(line: 655, column: 3, scope: !245)
!285 = !DILocalVariable(name: "lc_messages", scope: !245, file: !246, line: 659, type: !23)
!286 = !DILocation(line: 659, column: 15, scope: !245)
!287 = !DILocation(line: 659, column: 29, scope: !245)
!288 = !DILocation(line: 660, column: 7, scope: !289)
!289 = distinct !DILexicalBlock(scope: !245, file: !246, line: 660, column: 7)
!290 = !DILocation(line: 660, column: 19, scope: !289)
!291 = !DILocation(line: 660, column: 22, scope: !289)
!292 = !DILocation(line: 660, column: 7, scope: !245)
!293 = !DILocation(line: 666, column: 7, scope: !294)
!294 = distinct !DILexicalBlock(scope: !289, file: !246, line: 661, column: 5)
!295 = !DILocation(line: 668, column: 5, scope: !294)
!296 = !DILocation(line: 669, column: 11, scope: !245)
!297 = !DILocation(line: 670, column: 24, scope: !245)
!298 = !DILocation(line: 669, column: 3, scope: !245)
!299 = !DILocation(line: 671, column: 11, scope: !245)
!300 = !DILocation(line: 672, column: 11, scope: !245)
!301 = !DILocation(line: 672, column: 17, scope: !245)
!302 = !DILocation(line: 672, column: 25, scope: !245)
!303 = !DILocation(line: 672, column: 22, scope: !245)
!304 = !DILocation(line: 671, column: 3, scope: !245)
!305 = !DILocation(line: 673, column: 1, scope: !245)
!306 = !DILocalVariable(name: "lc_messages", scope: !307, file: !246, line: 659, type: !23)
!307 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !246, file: !246, line: 634, type: !39, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !308, retainedNodes: !11)
!308 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !12, globals: !309, nameTableKind: None)
!309 = !{!310, !313, !323, !326}
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "unknown", scope: !312, file: !3, line: 262, type: !42, isLocal: true, isDefinition: true)
!312 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 260, type: !4, scopeLine: 261, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !308, retainedNodes: !11)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "arch_long_options", scope: !308, file: !3, line: 107, type: !315, isLocal: true, isDefinition: true)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 768, elements: !29)
!316 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !20, line: 50, size: 256, elements: !318)
!318 = !{!319, !320, !321, !322}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !317, file: !20, line: 52, baseType: !23, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !317, file: !20, line: 55, baseType: !6, size: 32, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !317, file: !20, line: 56, baseType: !27, size: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !317, file: !20, line: 57, baseType: !6, size: 32, offset: 192)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "uname_long_options", scope: !308, file: !3, line: 89, type: !325, isLocal: true, isDefinition: true)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 3584, elements: !34)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "printed", scope: !328, file: !3, line: 163, type: !41, isLocal: true, isDefinition: true)
!328 = distinct !DISubprogram(name: "print_element", scope: !3, file: !3, line: 161, type: !39, scopeLine: 162, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !308, retainedNodes: !11)
!329 = !DILocalVariable(name: "argc", arg: 1, scope: !2, file: !3, line: 260, type: !6)
!330 = !DILocation(line: 260, column: 11, scope: !2)
!331 = !DILocalVariable(name: "argv", arg: 2, scope: !2, file: !3, line: 260, type: !7)
!332 = !DILocation(line: 260, column: 24, scope: !2)
!333 = !DILocalVariable(name: "toprint", scope: !2, file: !3, line: 265, type: !84)
!334 = !DILocation(line: 265, column: 16, scope: !2)
!335 = !DILocation(line: 268, column: 21, scope: !2)
!336 = !DILocation(line: 268, column: 3, scope: !2)
!337 = !DILocation(line: 269, column: 3, scope: !2)
!338 = !DILocation(line: 270, column: 3, scope: !2)
!339 = !DILocation(line: 271, column: 3, scope: !2)
!340 = !DILocation(line: 273, column: 3, scope: !2)
!341 = !DILocation(line: 275, column: 30, scope: !2)
!342 = !DILocation(line: 275, column: 36, scope: !2)
!343 = !DILocation(line: 275, column: 13, scope: !2)
!344 = !DILocation(line: 275, column: 11, scope: !2)
!345 = !DILocation(line: 277, column: 7, scope: !346)
!346 = distinct !DILexicalBlock(scope: !2, file: !3, line: 277, column: 7)
!347 = !DILocation(line: 277, column: 15, scope: !346)
!348 = !DILocation(line: 278, column: 13, scope: !346)
!349 = !DILocation(line: 278, column: 5, scope: !346)
!350 = !DILocation(line: 280, column: 7, scope: !351)
!351 = distinct !DILexicalBlock(scope: !2, file: !3, line: 280, column: 7)
!352 = !DILocation(line: 281, column: 8, scope: !351)
!353 = !DILocation(line: 280, column: 7, scope: !2)
!354 = !DILocalVariable(name: "name", scope: !355, file: !3, line: 284, type: !356)
!355 = distinct !DILexicalBlock(scope: !351, file: !3, line: 283, column: 5)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utsname", file: !357, line: 48, size: 3120, elements: !358)
!357 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/utsname.h", directory: "")
!358 = !{!359, !363, !364, !365, !366, !367}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "sysname", scope: !356, file: !357, line: 51, baseType: !360, size: 520)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 520, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 65)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "nodename", scope: !356, file: !357, line: 54, baseType: !360, size: 520, offset: 520)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !356, file: !357, line: 57, baseType: !360, size: 520, offset: 1040)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !356, file: !357, line: 59, baseType: !360, size: 520, offset: 1560)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !356, file: !357, line: 62, baseType: !360, size: 520, offset: 2080)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "domainname", scope: !356, file: !357, line: 67, baseType: !360, size: 520, offset: 2600)
!368 = !DILocation(line: 284, column: 22, scope: !355)
!369 = !DILocation(line: 286, column: 11, scope: !370)
!370 = distinct !DILexicalBlock(scope: !355, file: !3, line: 286, column: 11)
!371 = !DILocation(line: 286, column: 25, scope: !370)
!372 = !DILocation(line: 287, column: 9, scope: !370)
!373 = !DILocation(line: 289, column: 11, scope: !374)
!374 = distinct !DILexicalBlock(scope: !355, file: !3, line: 289, column: 11)
!375 = !DILocation(line: 289, column: 19, scope: !374)
!376 = !DILocation(line: 289, column: 11, scope: !355)
!377 = !DILocation(line: 290, column: 29, scope: !374)
!378 = !DILocation(line: 290, column: 24, scope: !374)
!379 = !DILocation(line: 290, column: 9, scope: !374)
!380 = !DILocation(line: 291, column: 11, scope: !381)
!381 = distinct !DILexicalBlock(scope: !355, file: !3, line: 291, column: 11)
!382 = !DILocation(line: 291, column: 19, scope: !381)
!383 = !DILocation(line: 291, column: 11, scope: !355)
!384 = !DILocation(line: 292, column: 29, scope: !381)
!385 = !DILocation(line: 292, column: 24, scope: !381)
!386 = !DILocation(line: 292, column: 9, scope: !381)
!387 = !DILocation(line: 293, column: 11, scope: !388)
!388 = distinct !DILexicalBlock(scope: !355, file: !3, line: 293, column: 11)
!389 = !DILocation(line: 293, column: 19, scope: !388)
!390 = !DILocation(line: 293, column: 11, scope: !355)
!391 = !DILocation(line: 294, column: 29, scope: !388)
!392 = !DILocation(line: 294, column: 24, scope: !388)
!393 = !DILocation(line: 294, column: 9, scope: !388)
!394 = !DILocation(line: 295, column: 11, scope: !395)
!395 = distinct !DILexicalBlock(scope: !355, file: !3, line: 295, column: 11)
!396 = !DILocation(line: 295, column: 19, scope: !395)
!397 = !DILocation(line: 295, column: 11, scope: !355)
!398 = !DILocation(line: 296, column: 29, scope: !395)
!399 = !DILocation(line: 296, column: 24, scope: !395)
!400 = !DILocation(line: 296, column: 9, scope: !395)
!401 = !DILocation(line: 297, column: 11, scope: !402)
!402 = distinct !DILexicalBlock(scope: !355, file: !3, line: 297, column: 11)
!403 = !DILocation(line: 297, column: 19, scope: !402)
!404 = !DILocation(line: 297, column: 11, scope: !355)
!405 = !DILocation(line: 298, column: 29, scope: !402)
!406 = !DILocation(line: 298, column: 24, scope: !402)
!407 = !DILocation(line: 298, column: 9, scope: !402)
!408 = !DILocation(line: 299, column: 5, scope: !355)
!409 = !DILocation(line: 301, column: 7, scope: !410)
!410 = distinct !DILexicalBlock(scope: !2, file: !3, line: 301, column: 7)
!411 = !DILocation(line: 301, column: 15, scope: !410)
!412 = !DILocation(line: 301, column: 7, scope: !2)
!413 = !DILocalVariable(name: "element", scope: !414, file: !3, line: 303, type: !23)
!414 = distinct !DILexicalBlock(scope: !410, file: !3, line: 302, column: 5)
!415 = !DILocation(line: 303, column: 19, scope: !414)
!416 = !DILocation(line: 341, column: 14, scope: !417)
!417 = distinct !DILexicalBlock(scope: !414, file: !3, line: 341, column: 11)
!418 = !DILocation(line: 341, column: 22, scope: !417)
!419 = !DILocation(line: 341, column: 37, scope: !417)
!420 = !DILocation(line: 341, column: 45, scope: !417)
!421 = !DILocation(line: 341, column: 11, scope: !414)
!422 = !DILocation(line: 342, column: 24, scope: !417)
!423 = !DILocation(line: 342, column: 9, scope: !417)
!424 = !DILocation(line: 343, column: 5, scope: !414)
!425 = !DILocation(line: 345, column: 7, scope: !426)
!426 = distinct !DILexicalBlock(scope: !2, file: !3, line: 345, column: 7)
!427 = !DILocation(line: 345, column: 15, scope: !426)
!428 = !DILocation(line: 345, column: 7, scope: !2)
!429 = !DILocalVariable(name: "element", scope: !430, file: !3, line: 347, type: !23)
!430 = distinct !DILexicalBlock(scope: !426, file: !3, line: 346, column: 5)
!431 = !DILocation(line: 347, column: 19, scope: !430)
!432 = !DILocation(line: 366, column: 14, scope: !433)
!433 = distinct !DILexicalBlock(scope: !430, file: !3, line: 366, column: 11)
!434 = !DILocation(line: 366, column: 22, scope: !433)
!435 = !DILocation(line: 366, column: 37, scope: !433)
!436 = !DILocation(line: 366, column: 45, scope: !433)
!437 = !DILocation(line: 366, column: 11, scope: !430)
!438 = !DILocation(line: 367, column: 24, scope: !433)
!439 = !DILocation(line: 367, column: 9, scope: !433)
!440 = !DILocation(line: 368, column: 5, scope: !430)
!441 = !DILocation(line: 370, column: 7, scope: !442)
!442 = distinct !DILexicalBlock(scope: !2, file: !3, line: 370, column: 7)
!443 = !DILocation(line: 370, column: 15, scope: !442)
!444 = !DILocation(line: 370, column: 7, scope: !2)
!445 = !DILocation(line: 371, column: 5, scope: !442)
!446 = !DILocation(line: 373, column: 3, scope: !2)
!447 = !DILocation(line: 375, column: 3, scope: !2)
!448 = !DILocalVariable(name: "argc", arg: 1, scope: !449, file: !3, line: 260, type: !6)
!449 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 260, type: !4, scopeLine: 261, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !450, retainedNodes: !11)
!450 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !12, globals: !451, nameTableKind: None)
!451 = !{!452, !454, !464, !467}
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "unknown", scope: !449, file: !3, line: 262, type: !42, isLocal: true, isDefinition: true)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "arch_long_options", scope: !450, file: !3, line: 107, type: !456, isLocal: true, isDefinition: true)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 768, elements: !29)
!457 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !20, line: 50, size: 256, elements: !459)
!459 = !{!460, !461, !462, !463}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !458, file: !20, line: 52, baseType: !23, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !458, file: !20, line: 55, baseType: !6, size: 32, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !458, file: !20, line: 56, baseType: !27, size: 64, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !458, file: !20, line: 57, baseType: !6, size: 32, offset: 192)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "uname_long_options", scope: !450, file: !3, line: 89, type: !466, isLocal: true, isDefinition: true)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 3584, elements: !34)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "printed", scope: !469, file: !3, line: 163, type: !41, isLocal: true, isDefinition: true)
!469 = distinct !DISubprogram(name: "print_element", scope: !3, file: !3, line: 161, type: !39, scopeLine: 162, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !450, retainedNodes: !11)
!470 = !DILocalVariable(name: "argv", arg: 2, scope: !449, file: !3, line: 260, type: !7)
!471 = !DILocalVariable(name: "toprint", scope: !449, file: !3, line: 265, type: !84)
!472 = distinct !DISubprogram(name: "decode_switches", scope: !3, file: !3, line: 175, type: !4, scopeLine: 176, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10, retainedNodes: !11)
!473 = !DILocalVariable(name: "argc", arg: 1, scope: !472, file: !3, line: 175, type: !6)
!474 = !DILocation(line: 175, column: 22, scope: !472)
!475 = !DILocalVariable(name: "argv", arg: 2, scope: !472, file: !3, line: 175, type: !7)
!476 = !DILocation(line: 175, column: 35, scope: !472)
!477 = !DILocalVariable(name: "c", scope: !472, file: !3, line: 177, type: !6)
!478 = !DILocation(line: 177, column: 7, scope: !472)
!479 = !DILocalVariable(name: "toprint", scope: !472, file: !3, line: 178, type: !84)
!480 = !DILocation(line: 178, column: 16, scope: !472)
!481 = !DILocation(line: 180, column: 7, scope: !482)
!482 = distinct !DILexicalBlock(scope: !472, file: !3, line: 180, column: 7)
!483 = !DILocation(line: 180, column: 18, scope: !482)
!484 = !DILocation(line: 180, column: 7, scope: !472)
!485 = !DILocation(line: 182, column: 7, scope: !486)
!486 = distinct !DILexicalBlock(scope: !482, file: !3, line: 181, column: 5)
!487 = !DILocation(line: 182, column: 32, scope: !486)
!488 = !DILocation(line: 182, column: 38, scope: !486)
!489 = !DILocation(line: 182, column: 19, scope: !486)
!490 = !DILocation(line: 182, column: 17, scope: !486)
!491 = !DILocation(line: 183, column: 58, scope: !486)
!492 = !DILocation(line: 185, column: 19, scope: !493)
!493 = distinct !DILexicalBlock(scope: !486, file: !3, line: 184, column: 9)
!494 = !DILocation(line: 185, column: 11, scope: !493)
!495 = !DILocation(line: 187, column: 13, scope: !496)
!496 = distinct !DILexicalBlock(scope: !493, file: !3, line: 186, column: 13)
!497 = !DILocation(line: 189, column: 13, scope: !496)
!498 = !DILocation(line: 192, column: 15, scope: !496)
!499 = !DILocation(line: 195, column: 15, scope: !486)
!500 = !DILocation(line: 196, column: 5, scope: !486)
!501 = !DILocation(line: 199, column: 7, scope: !502)
!502 = distinct !DILexicalBlock(scope: !482, file: !3, line: 198, column: 5)
!503 = !DILocation(line: 199, column: 32, scope: !502)
!504 = !DILocation(line: 199, column: 38, scope: !502)
!505 = !DILocation(line: 199, column: 19, scope: !502)
!506 = !DILocation(line: 199, column: 17, scope: !502)
!507 = !DILocation(line: 200, column: 59, scope: !502)
!508 = !DILocation(line: 202, column: 19, scope: !509)
!509 = distinct !DILexicalBlock(scope: !502, file: !3, line: 201, column: 9)
!510 = !DILocation(line: 202, column: 11, scope: !509)
!511 = !DILocation(line: 205, column: 23, scope: !512)
!512 = distinct !DILexicalBlock(scope: !509, file: !3, line: 203, column: 13)
!513 = !DILocation(line: 206, column: 15, scope: !512)
!514 = !DILocation(line: 209, column: 23, scope: !512)
!515 = !DILocation(line: 210, column: 15, scope: !512)
!516 = !DILocation(line: 213, column: 23, scope: !512)
!517 = !DILocation(line: 214, column: 15, scope: !512)
!518 = !DILocation(line: 217, column: 23, scope: !512)
!519 = !DILocation(line: 218, column: 15, scope: !512)
!520 = !DILocation(line: 221, column: 23, scope: !512)
!521 = !DILocation(line: 222, column: 15, scope: !512)
!522 = !DILocation(line: 225, column: 23, scope: !512)
!523 = !DILocation(line: 226, column: 15, scope: !512)
!524 = !DILocation(line: 229, column: 23, scope: !512)
!525 = !DILocation(line: 230, column: 15, scope: !512)
!526 = !DILocation(line: 233, column: 23, scope: !512)
!527 = !DILocation(line: 234, column: 15, scope: !512)
!528 = !DILocation(line: 237, column: 23, scope: !512)
!529 = !DILocation(line: 238, column: 15, scope: !512)
!530 = !DILocation(line: 240, column: 13, scope: !512)
!531 = !DILocation(line: 242, column: 13, scope: !512)
!532 = !DILocation(line: 245, column: 15, scope: !512)
!533 = distinct !{!533, !501, !534}
!534 = !DILocation(line: 247, column: 9, scope: !502)
!535 = !DILocation(line: 250, column: 7, scope: !536)
!536 = distinct !DILexicalBlock(scope: !472, file: !3, line: 250, column: 7)
!537 = !DILocation(line: 250, column: 15, scope: !536)
!538 = !DILocation(line: 250, column: 12, scope: !536)
!539 = !DILocation(line: 250, column: 7, scope: !472)
!540 = !DILocation(line: 252, column: 20, scope: !541)
!541 = distinct !DILexicalBlock(scope: !536, file: !3, line: 251, column: 5)
!542 = !DILocation(line: 252, column: 50, scope: !541)
!543 = !DILocation(line: 252, column: 55, scope: !541)
!544 = !DILocation(line: 252, column: 43, scope: !541)
!545 = !DILocation(line: 252, column: 7, scope: !541)
!546 = !DILocation(line: 253, column: 7, scope: !541)
!547 = !DILocation(line: 256, column: 10, scope: !472)
!548 = !DILocation(line: 256, column: 3, scope: !472)
!549 = !DILocalVariable(name: "argc", arg: 1, scope: !550, file: !3, line: 175, type: !6)
!550 = distinct !DISubprogram(name: "decode_switches", scope: !3, file: !3, line: 175, type: !4, scopeLine: 176, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !551, retainedNodes: !11)
!551 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !12, globals: !552, nameTableKind: None)
!552 = !{!553, !556, !566, !569}
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "unknown", scope: !555, file: !3, line: 262, type: !42, isLocal: true, isDefinition: true)
!555 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 260, type: !4, scopeLine: 261, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !551, retainedNodes: !11)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(name: "arch_long_options", scope: !551, file: !3, line: 107, type: !558, isLocal: true, isDefinition: true)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 768, elements: !29)
!559 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !20, line: 50, size: 256, elements: !561)
!561 = !{!562, !563, !564, !565}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !560, file: !20, line: 52, baseType: !23, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !560, file: !20, line: 55, baseType: !6, size: 32, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !560, file: !20, line: 56, baseType: !27, size: 64, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !560, file: !20, line: 57, baseType: !6, size: 32, offset: 192)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "uname_long_options", scope: !551, file: !3, line: 89, type: !568, isLocal: true, isDefinition: true)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 3584, elements: !34)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "printed", scope: !571, file: !3, line: 163, type: !41, isLocal: true, isDefinition: true)
!571 = distinct !DISubprogram(name: "print_element", scope: !3, file: !3, line: 161, type: !39, scopeLine: 162, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !551, retainedNodes: !11)
!572 = !DILocalVariable(name: "argv", arg: 2, scope: !550, file: !3, line: 175, type: !7)
!573 = !DILocalVariable(name: "c", scope: !550, file: !3, line: 177, type: !6)
!574 = !DILocalVariable(name: "toprint", scope: !550, file: !3, line: 178, type: !84)
!575 = !DILocalVariable(name: "element", arg: 1, scope: !38, file: !3, line: 161, type: !23)
!576 = !DILocation(line: 161, column: 28, scope: !38)
!577 = !DILocation(line: 164, column: 7, scope: !578)
!578 = distinct !DILexicalBlock(scope: !38, file: !3, line: 164, column: 7)
!579 = !DILocation(line: 164, column: 7, scope: !38)
!580 = !DILocation(line: 165, column: 5, scope: !578)
!581 = !DILocation(line: 166, column: 11, scope: !38)
!582 = !DILocation(line: 167, column: 3, scope: !38)
!583 = !DILocation(line: 168, column: 1, scope: !38)
!584 = !DILocalVariable(name: "element", arg: 1, scope: !585, file: !3, line: 161, type: !23)
!585 = distinct !DISubprogram(name: "print_element", scope: !3, file: !3, line: 161, type: !39, scopeLine: 162, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !586, retainedNodes: !11)
!586 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !12, globals: !587, nameTableKind: None)
!587 = !{!588, !591, !601, !604}
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "unknown", scope: !590, file: !3, line: 262, type: !42, isLocal: true, isDefinition: true)
!590 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 260, type: !4, scopeLine: 261, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !586, retainedNodes: !11)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "arch_long_options", scope: !586, file: !3, line: 107, type: !593, isLocal: true, isDefinition: true)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !594, size: 768, elements: !29)
!594 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !595)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !20, line: 50, size: 256, elements: !596)
!596 = !{!597, !598, !599, !600}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !595, file: !20, line: 52, baseType: !23, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !595, file: !20, line: 55, baseType: !6, size: 32, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !595, file: !20, line: 56, baseType: !27, size: 64, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !595, file: !20, line: 57, baseType: !6, size: 32, offset: 192)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(name: "uname_long_options", scope: !586, file: !3, line: 89, type: !603, isLocal: true, isDefinition: true)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !594, size: 3584, elements: !34)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "printed", scope: !585, file: !3, line: 163, type: !41, isLocal: true, isDefinition: true)
!606 = distinct !DISubprogram(name: "close_stdout", scope: !62, file: !62, line: 117, type: !607, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !11)
!607 = !DISubroutineType(types: !608)
!608 = !{null}
!609 = !DILocation(line: 119, column: 21, scope: !610)
!610 = distinct !DILexicalBlock(scope: !606, file: !62, line: 119, column: 7)
!611 = !DILocation(line: 119, column: 7, scope: !610)
!612 = !DILocation(line: 119, column: 29, scope: !610)
!613 = !DILocation(line: 120, column: 7, scope: !610)
!614 = !DILocation(line: 120, column: 12, scope: !610)
!615 = !DILocation(line: 120, column: 25, scope: !610)
!616 = !DILocation(line: 120, column: 28, scope: !610)
!617 = !DILocation(line: 120, column: 34, scope: !610)
!618 = !DILocation(line: 119, column: 7, scope: !606)
!619 = !DILocalVariable(name: "write_error", scope: !620, file: !62, line: 122, type: !23)
!620 = distinct !DILexicalBlock(scope: !610, file: !62, line: 121, column: 5)
!621 = !DILocation(line: 122, column: 19, scope: !620)
!622 = !DILocation(line: 122, column: 33, scope: !620)
!623 = !DILocation(line: 123, column: 11, scope: !624)
!624 = distinct !DILexicalBlock(scope: !620, file: !62, line: 123, column: 11)
!625 = !DILocation(line: 123, column: 11, scope: !620)
!626 = !DILocation(line: 124, column: 19, scope: !624)
!627 = !DILocation(line: 124, column: 52, scope: !624)
!628 = !DILocation(line: 124, column: 36, scope: !624)
!629 = !DILocation(line: 125, column: 16, scope: !624)
!630 = !DILocation(line: 124, column: 9, scope: !624)
!631 = !DILocation(line: 127, column: 19, scope: !624)
!632 = !DILocation(line: 127, column: 32, scope: !624)
!633 = !DILocation(line: 127, column: 9, scope: !624)
!634 = !DILocation(line: 129, column: 14, scope: !620)
!635 = !DILocation(line: 129, column: 7, scope: !620)
!636 = !DILocation(line: 134, column: 42, scope: !637)
!637 = distinct !DILexicalBlock(scope: !606, file: !62, line: 134, column: 7)
!638 = !DILocation(line: 134, column: 28, scope: !637)
!639 = !DILocation(line: 134, column: 50, scope: !637)
!640 = !DILocation(line: 134, column: 7, scope: !606)
!641 = !DILocation(line: 135, column: 12, scope: !637)
!642 = !DILocation(line: 135, column: 5, scope: !637)
!643 = !DILocation(line: 136, column: 1, scope: !606)
!644 = distinct !DISubprogram(name: "set_program_name", scope: !76, file: !76, line: 39, type: !39, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !72, retainedNodes: !11)
!645 = !DILocalVariable(name: "argv0", arg: 1, scope: !644, file: !76, line: 39, type: !23)
!646 = !DILocation(line: 39, column: 31, scope: !644)
!647 = !DILocalVariable(name: "slash", scope: !644, file: !76, line: 46, type: !23)
!648 = !DILocation(line: 46, column: 15, scope: !644)
!649 = !DILocalVariable(name: "base", scope: !644, file: !76, line: 47, type: !23)
!650 = !DILocation(line: 47, column: 15, scope: !644)
!651 = !DILocation(line: 51, column: 7, scope: !652)
!652 = distinct !DILexicalBlock(scope: !644, file: !76, line: 51, column: 7)
!653 = !DILocation(line: 51, column: 13, scope: !652)
!654 = !DILocation(line: 51, column: 7, scope: !644)
!655 = !DILocation(line: 55, column: 14, scope: !656)
!656 = distinct !DILexicalBlock(scope: !652, file: !76, line: 52, column: 5)
!657 = !DILocation(line: 54, column: 7, scope: !656)
!658 = !DILocation(line: 56, column: 7, scope: !656)
!659 = !DILocation(line: 59, column: 20, scope: !644)
!660 = !DILocation(line: 59, column: 11, scope: !644)
!661 = !DILocation(line: 59, column: 9, scope: !644)
!662 = !DILocation(line: 60, column: 11, scope: !644)
!663 = !DILocation(line: 60, column: 17, scope: !644)
!664 = !DILocation(line: 60, column: 27, scope: !644)
!665 = !DILocation(line: 60, column: 33, scope: !644)
!666 = !DILocation(line: 60, column: 39, scope: !644)
!667 = !DILocation(line: 60, column: 8, scope: !644)
!668 = !DILocation(line: 61, column: 7, scope: !669)
!669 = distinct !DILexicalBlock(scope: !644, file: !76, line: 61, column: 7)
!670 = !DILocation(line: 61, column: 14, scope: !669)
!671 = !DILocation(line: 61, column: 12, scope: !669)
!672 = !DILocation(line: 61, column: 20, scope: !669)
!673 = !DILocation(line: 61, column: 25, scope: !669)
!674 = !DILocation(line: 61, column: 37, scope: !669)
!675 = !DILocation(line: 61, column: 42, scope: !669)
!676 = !DILocation(line: 61, column: 28, scope: !669)
!677 = !DILocation(line: 61, column: 61, scope: !669)
!678 = !DILocation(line: 61, column: 7, scope: !644)
!679 = !DILocation(line: 63, column: 15, scope: !680)
!680 = distinct !DILexicalBlock(scope: !669, file: !76, line: 62, column: 5)
!681 = !DILocation(line: 63, column: 13, scope: !680)
!682 = !DILocation(line: 64, column: 20, scope: !683)
!683 = distinct !DILexicalBlock(scope: !680, file: !76, line: 64, column: 11)
!684 = !DILocation(line: 64, column: 11, scope: !683)
!685 = !DILocation(line: 64, column: 36, scope: !683)
!686 = !DILocation(line: 64, column: 11, scope: !680)
!687 = !DILocation(line: 66, column: 19, scope: !688)
!688 = distinct !DILexicalBlock(scope: !683, file: !76, line: 65, column: 9)
!689 = !DILocation(line: 66, column: 24, scope: !688)
!690 = !DILocation(line: 66, column: 17, scope: !688)
!691 = !DILocation(line: 70, column: 52, scope: !688)
!692 = !DILocation(line: 70, column: 41, scope: !688)
!693 = !DILocation(line: 72, column: 9, scope: !688)
!694 = !DILocation(line: 73, column: 5, scope: !680)
!695 = !DILocation(line: 84, column: 18, scope: !644)
!696 = !DILocation(line: 84, column: 16, scope: !644)
!697 = !DILocation(line: 90, column: 38, scope: !644)
!698 = !DILocation(line: 90, column: 27, scope: !644)
!699 = !DILocation(line: 92, column: 1, scope: !644)
!700 = distinct !DISubprogram(name: "set_char_quoting", scope: !105, file: !105, line: 152, type: !701, scopeLine: 153, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !79, retainedNodes: !11)
!701 = !DISubroutineType(types: !702)
!702 = !{!6, !703, !9, !6}
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!704 = !DILocalVariable(name: "o", arg: 1, scope: !700, file: !105, line: 152, type: !703)
!705 = !DILocation(line: 152, column: 43, scope: !700)
!706 = !DILocalVariable(name: "c", arg: 2, scope: !700, file: !105, line: 152, type: !9)
!707 = !DILocation(line: 152, column: 51, scope: !700)
!708 = !DILocalVariable(name: "i", arg: 3, scope: !700, file: !105, line: 152, type: !6)
!709 = !DILocation(line: 152, column: 58, scope: !700)
!710 = !DILocalVariable(name: "uc", scope: !700, file: !105, line: 154, type: !167)
!711 = !DILocation(line: 154, column: 17, scope: !700)
!712 = !DILocation(line: 154, column: 22, scope: !700)
!713 = !DILocalVariable(name: "p", scope: !700, file: !105, line: 155, type: !714)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!715 = !DILocation(line: 155, column: 17, scope: !700)
!716 = !DILocation(line: 156, column: 6, scope: !700)
!717 = !DILocation(line: 156, column: 10, scope: !700)
!718 = !DILocation(line: 156, column: 41, scope: !700)
!719 = !DILocation(line: 156, column: 5, scope: !700)
!720 = !DILocation(line: 156, column: 59, scope: !700)
!721 = !DILocation(line: 156, column: 62, scope: !700)
!722 = !DILocation(line: 156, column: 57, scope: !700)
!723 = !DILocalVariable(name: "shift", scope: !700, file: !105, line: 157, type: !6)
!724 = !DILocation(line: 157, column: 7, scope: !700)
!725 = !DILocation(line: 157, column: 15, scope: !700)
!726 = !DILocation(line: 157, column: 18, scope: !700)
!727 = !DILocalVariable(name: "r", scope: !700, file: !105, line: 158, type: !6)
!728 = !DILocation(line: 158, column: 7, scope: !700)
!729 = !DILocation(line: 158, column: 13, scope: !700)
!730 = !DILocation(line: 158, column: 12, scope: !700)
!731 = !DILocation(line: 158, column: 18, scope: !700)
!732 = !DILocation(line: 158, column: 15, scope: !700)
!733 = !DILocation(line: 158, column: 25, scope: !700)
!734 = !DILocation(line: 159, column: 11, scope: !700)
!735 = !DILocation(line: 159, column: 13, scope: !700)
!736 = !DILocation(line: 159, column: 20, scope: !700)
!737 = !DILocation(line: 159, column: 18, scope: !700)
!738 = !DILocation(line: 159, column: 26, scope: !700)
!739 = !DILocation(line: 159, column: 23, scope: !700)
!740 = !DILocation(line: 159, column: 4, scope: !700)
!741 = !DILocation(line: 159, column: 6, scope: !700)
!742 = !DILocation(line: 160, column: 10, scope: !700)
!743 = !DILocation(line: 160, column: 3, scope: !700)
!744 = !DILocalVariable(name: "o", arg: 1, scope: !745, file: !105, line: 152, type: !748)
!745 = distinct !DISubprogram(name: "set_char_quoting", scope: !105, file: !105, line: 152, type: !746, scopeLine: 153, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !756, retainedNodes: !11)
!746 = !DISubroutineType(types: !747)
!747 = !{!6, !748, !9, !6}
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !105, line: 65, size: 448, elements: !750)
!750 = !{!751, !752, !753, !754, !755}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !749, file: !105, line: 68, baseType: !82, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !749, file: !105, line: 71, baseType: !6, size: 32, offset: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !749, file: !105, line: 75, baseType: !123, size: 256, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !749, file: !105, line: 78, baseType: !23, size: 64, offset: 320)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !749, file: !105, line: 81, baseType: !23, size: 64, offset: 384)
!756 = distinct !DICompileUnit(language: DW_LANG_C99, file: !80, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !81, retainedTypes: !97, globals: !757, nameTableKind: None)
!757 = !{!758, !760, !762, !764, !766, !768, !775, !777}
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !756, file: !105, line: 85, type: !106, isLocal: false, isDefinition: true)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !756, file: !105, line: 101, type: !112, isLocal: false, isDefinition: true)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !756, file: !105, line: 1052, type: !749, isLocal: false, isDefinition: true)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !756, file: !105, line: 116, type: !749, isLocal: true, isDefinition: true)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "slot0", scope: !756, file: !105, line: 842, type: !128, isLocal: true, isDefinition: true)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(name: "slotvec", scope: !756, file: !105, line: 845, type: !770, isLocal: true, isDefinition: true)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !105, line: 834, size: 128, elements: !772)
!772 = !{!773, !774}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !771, file: !105, line: 836, baseType: !99, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !771, file: !105, line: 837, baseType: !8, size: 64, offset: 64)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(name: "nslots", scope: !756, file: !105, line: 843, type: !6, isLocal: true, isDefinition: true)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(name: "slotvec0", scope: !756, file: !105, line: 844, type: !771, isLocal: true, isDefinition: true)
!779 = !DILocalVariable(name: "c", arg: 2, scope: !745, file: !105, line: 152, type: !9)
!780 = !DILocalVariable(name: "i", arg: 3, scope: !745, file: !105, line: 152, type: !6)
!781 = !DILocalVariable(name: "uc", scope: !745, file: !105, line: 154, type: !167)
!782 = !DILocalVariable(name: "p", scope: !745, file: !105, line: 155, type: !714)
!783 = distinct !DISubprogram(name: "quotearg_char_mem", scope: !105, file: !105, line: 982, type: !784, scopeLine: 983, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !79, retainedNodes: !11)
!784 = !DISubroutineType(types: !785)
!785 = !{!8, !23, !99, !9}
!786 = !DILocalVariable(name: "arg", arg: 1, scope: !783, file: !105, line: 982, type: !23)
!787 = !DILocation(line: 982, column: 32, scope: !783)
!788 = !DILocalVariable(name: "argsize", arg: 2, scope: !783, file: !105, line: 982, type: !99)
!789 = !DILocation(line: 982, column: 44, scope: !783)
!790 = !DILocalVariable(name: "ch", arg: 3, scope: !783, file: !105, line: 982, type: !9)
!791 = !DILocation(line: 982, column: 58, scope: !783)
!792 = !DILocalVariable(name: "options", scope: !783, file: !105, line: 984, type: !118)
!793 = !DILocation(line: 984, column: 26, scope: !783)
!794 = !DILocation(line: 985, column: 13, scope: !783)
!795 = !DILocation(line: 986, column: 31, scope: !783)
!796 = !DILocation(line: 986, column: 3, scope: !783)
!797 = !DILocation(line: 987, column: 33, scope: !783)
!798 = !DILocation(line: 987, column: 38, scope: !783)
!799 = !DILocation(line: 987, column: 10, scope: !783)
!800 = !DILocation(line: 987, column: 3, scope: !783)
!801 = !DILocalVariable(name: "arg", arg: 1, scope: !802, file: !105, line: 982, type: !23)
!802 = distinct !DISubprogram(name: "quotearg_char_mem", scope: !105, file: !105, line: 982, type: !784, scopeLine: 983, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !803, retainedNodes: !11)
!803 = distinct !DICompileUnit(language: DW_LANG_C99, file: !80, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !81, retainedTypes: !97, globals: !804, nameTableKind: None)
!804 = !{!805, !807, !809, !818, !820, !822, !829, !831}
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !803, file: !105, line: 85, type: !106, isLocal: false, isDefinition: true)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !803, file: !105, line: 101, type: !112, isLocal: false, isDefinition: true)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !803, file: !105, line: 1052, type: !811, isLocal: false, isDefinition: true)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !105, line: 65, size: 448, elements: !812)
!812 = !{!813, !814, !815, !816, !817}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !811, file: !105, line: 68, baseType: !82, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !811, file: !105, line: 71, baseType: !6, size: 32, offset: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !811, file: !105, line: 75, baseType: !123, size: 256, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !811, file: !105, line: 78, baseType: !23, size: 64, offset: 320)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !811, file: !105, line: 81, baseType: !23, size: 64, offset: 384)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !803, file: !105, line: 116, type: !811, isLocal: true, isDefinition: true)
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(name: "slot0", scope: !803, file: !105, line: 842, type: !128, isLocal: true, isDefinition: true)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(name: "slotvec", scope: !803, file: !105, line: 845, type: !824, isLocal: true, isDefinition: true)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !105, line: 834, size: 128, elements: !826)
!826 = !{!827, !828}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !825, file: !105, line: 836, baseType: !99, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !825, file: !105, line: 837, baseType: !8, size: 64, offset: 64)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "nslots", scope: !803, file: !105, line: 843, type: !6, isLocal: true, isDefinition: true)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "slotvec0", scope: !803, file: !105, line: 844, type: !825, isLocal: true, isDefinition: true)
!833 = !DILocalVariable(name: "argsize", arg: 2, scope: !802, file: !105, line: 982, type: !99)
!834 = !DILocalVariable(name: "ch", arg: 3, scope: !802, file: !105, line: 982, type: !9)
!835 = !DILocalVariable(name: "options", scope: !802, file: !105, line: 984, type: !811)
!836 = distinct !DISubprogram(name: "quotearg_n_options", scope: !105, file: !105, line: 877, type: !837, scopeLine: 879, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !79, retainedNodes: !11)
!837 = !DISubroutineType(types: !838)
!838 = !{!8, !6, !23, !99, !839}
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!841 = !DILocalVariable(name: "n", arg: 1, scope: !836, file: !105, line: 877, type: !6)
!842 = !DILocation(line: 877, column: 25, scope: !836)
!843 = !DILocalVariable(name: "arg", arg: 2, scope: !836, file: !105, line: 877, type: !23)
!844 = !DILocation(line: 877, column: 40, scope: !836)
!845 = !DILocalVariable(name: "argsize", arg: 3, scope: !836, file: !105, line: 877, type: !99)
!846 = !DILocation(line: 877, column: 52, scope: !836)
!847 = !DILocalVariable(name: "options", arg: 4, scope: !836, file: !105, line: 878, type: !839)
!848 = !DILocation(line: 878, column: 51, scope: !836)
!849 = !DILocalVariable(name: "e", scope: !836, file: !105, line: 880, type: !6)
!850 = !DILocation(line: 880, column: 7, scope: !836)
!851 = !DILocation(line: 880, column: 11, scope: !836)
!852 = !DILocalVariable(name: "sv", scope: !836, file: !105, line: 882, type: !133)
!853 = !DILocation(line: 882, column: 19, scope: !836)
!854 = !DILocation(line: 882, column: 24, scope: !836)
!855 = !DILocation(line: 884, column: 7, scope: !856)
!856 = distinct !DILexicalBlock(scope: !836, file: !105, line: 884, column: 7)
!857 = !DILocation(line: 884, column: 9, scope: !856)
!858 = !DILocation(line: 884, column: 7, scope: !836)
!859 = !DILocation(line: 885, column: 5, scope: !856)
!860 = !DILocation(line: 887, column: 7, scope: !861)
!861 = distinct !DILexicalBlock(scope: !836, file: !105, line: 887, column: 7)
!862 = !DILocation(line: 887, column: 17, scope: !861)
!863 = !DILocation(line: 887, column: 14, scope: !861)
!864 = !DILocation(line: 887, column: 7, scope: !836)
!865 = !DILocalVariable(name: "preallocated", scope: !866, file: !105, line: 889, type: !41)
!866 = distinct !DILexicalBlock(scope: !861, file: !105, line: 888, column: 5)
!867 = !DILocation(line: 889, column: 12, scope: !866)
!868 = !DILocation(line: 889, column: 28, scope: !866)
!869 = !DILocation(line: 889, column: 31, scope: !866)
!870 = !DILocalVariable(name: "nmax", scope: !866, file: !105, line: 890, type: !6)
!871 = !DILocation(line: 890, column: 11, scope: !866)
!872 = !DILocation(line: 892, column: 11, scope: !873)
!873 = distinct !DILexicalBlock(scope: !866, file: !105, line: 892, column: 11)
!874 = !DILocation(line: 892, column: 18, scope: !873)
!875 = !DILocation(line: 892, column: 16, scope: !873)
!876 = !DILocation(line: 892, column: 11, scope: !866)
!877 = !DILocation(line: 893, column: 9, scope: !873)
!878 = !DILocation(line: 895, column: 32, scope: !866)
!879 = !DILocation(line: 895, column: 54, scope: !866)
!880 = !DILocation(line: 895, column: 59, scope: !866)
!881 = !DILocation(line: 895, column: 61, scope: !866)
!882 = !DILocation(line: 895, column: 58, scope: !866)
!883 = !DILocation(line: 895, column: 66, scope: !866)
!884 = !DILocation(line: 895, column: 22, scope: !866)
!885 = !DILocation(line: 895, column: 20, scope: !866)
!886 = !DILocation(line: 895, column: 15, scope: !866)
!887 = !DILocation(line: 896, column: 11, scope: !888)
!888 = distinct !DILexicalBlock(scope: !866, file: !105, line: 896, column: 11)
!889 = !DILocation(line: 896, column: 11, scope: !866)
!890 = !DILocation(line: 897, column: 10, scope: !888)
!891 = !DILocation(line: 897, column: 15, scope: !888)
!892 = !DILocation(line: 897, column: 9, scope: !888)
!893 = !DILocation(line: 898, column: 15, scope: !866)
!894 = !DILocation(line: 898, column: 20, scope: !866)
!895 = !DILocation(line: 898, column: 18, scope: !866)
!896 = !DILocation(line: 898, column: 7, scope: !866)
!897 = !DILocation(line: 898, column: 32, scope: !866)
!898 = !DILocation(line: 898, column: 34, scope: !866)
!899 = !DILocation(line: 898, column: 40, scope: !866)
!900 = !DILocation(line: 898, column: 38, scope: !866)
!901 = !DILocation(line: 898, column: 31, scope: !866)
!902 = !DILocation(line: 898, column: 48, scope: !866)
!903 = !DILocation(line: 899, column: 16, scope: !866)
!904 = !DILocation(line: 899, column: 18, scope: !866)
!905 = !DILocation(line: 899, column: 14, scope: !866)
!906 = !DILocation(line: 900, column: 5, scope: !866)
!907 = !DILocalVariable(name: "size", scope: !908, file: !105, line: 903, type: !99)
!908 = distinct !DILexicalBlock(scope: !836, file: !105, line: 902, column: 3)
!909 = !DILocation(line: 903, column: 12, scope: !908)
!910 = !DILocation(line: 903, column: 19, scope: !908)
!911 = !DILocation(line: 903, column: 22, scope: !908)
!912 = !DILocation(line: 903, column: 25, scope: !908)
!913 = !DILocalVariable(name: "val", scope: !908, file: !105, line: 904, type: !8)
!914 = !DILocation(line: 904, column: 11, scope: !908)
!915 = !DILocation(line: 904, column: 17, scope: !908)
!916 = !DILocation(line: 904, column: 20, scope: !908)
!917 = !DILocation(line: 904, column: 23, scope: !908)
!918 = !DILocalVariable(name: "flags", scope: !908, file: !105, line: 906, type: !6)
!919 = !DILocation(line: 906, column: 9, scope: !908)
!920 = !DILocation(line: 906, column: 17, scope: !908)
!921 = !DILocation(line: 906, column: 26, scope: !908)
!922 = !DILocation(line: 906, column: 32, scope: !908)
!923 = !DILocalVariable(name: "qsize", scope: !908, file: !105, line: 907, type: !99)
!924 = !DILocation(line: 907, column: 12, scope: !908)
!925 = !DILocation(line: 907, column: 46, scope: !908)
!926 = !DILocation(line: 907, column: 51, scope: !908)
!927 = !DILocation(line: 907, column: 57, scope: !908)
!928 = !DILocation(line: 907, column: 62, scope: !908)
!929 = !DILocation(line: 908, column: 46, scope: !908)
!930 = !DILocation(line: 908, column: 55, scope: !908)
!931 = !DILocation(line: 908, column: 62, scope: !908)
!932 = !DILocation(line: 909, column: 46, scope: !908)
!933 = !DILocation(line: 909, column: 55, scope: !908)
!934 = !DILocation(line: 910, column: 46, scope: !908)
!935 = !DILocation(line: 910, column: 55, scope: !908)
!936 = !DILocation(line: 911, column: 46, scope: !908)
!937 = !DILocation(line: 911, column: 55, scope: !908)
!938 = !DILocation(line: 907, column: 20, scope: !908)
!939 = !DILocation(line: 913, column: 9, scope: !940)
!940 = distinct !DILexicalBlock(scope: !908, file: !105, line: 913, column: 9)
!941 = !DILocation(line: 913, column: 17, scope: !940)
!942 = !DILocation(line: 913, column: 14, scope: !940)
!943 = !DILocation(line: 913, column: 9, scope: !908)
!944 = !DILocation(line: 915, column: 29, scope: !945)
!945 = distinct !DILexicalBlock(scope: !940, file: !105, line: 914, column: 7)
!946 = !DILocation(line: 915, column: 35, scope: !945)
!947 = !DILocation(line: 915, column: 27, scope: !945)
!948 = !DILocation(line: 915, column: 9, scope: !945)
!949 = !DILocation(line: 915, column: 12, scope: !945)
!950 = !DILocation(line: 915, column: 15, scope: !945)
!951 = !DILocation(line: 915, column: 20, scope: !945)
!952 = !DILocation(line: 916, column: 13, scope: !953)
!953 = distinct !DILexicalBlock(scope: !945, file: !105, line: 916, column: 13)
!954 = !DILocation(line: 916, column: 17, scope: !953)
!955 = !DILocation(line: 916, column: 13, scope: !945)
!956 = !DILocation(line: 917, column: 17, scope: !953)
!957 = !DILocation(line: 917, column: 11, scope: !953)
!958 = !DILocation(line: 918, column: 39, scope: !945)
!959 = !DILocation(line: 918, column: 27, scope: !945)
!960 = !DILocation(line: 918, column: 25, scope: !945)
!961 = !DILocation(line: 918, column: 9, scope: !945)
!962 = !DILocation(line: 918, column: 12, scope: !945)
!963 = !DILocation(line: 918, column: 15, scope: !945)
!964 = !DILocation(line: 918, column: 19, scope: !945)
!965 = !DILocation(line: 919, column: 35, scope: !945)
!966 = !DILocation(line: 919, column: 40, scope: !945)
!967 = !DILocation(line: 919, column: 46, scope: !945)
!968 = !DILocation(line: 919, column: 51, scope: !945)
!969 = !DILocation(line: 919, column: 60, scope: !945)
!970 = !DILocation(line: 919, column: 69, scope: !945)
!971 = !DILocation(line: 920, column: 35, scope: !945)
!972 = !DILocation(line: 920, column: 42, scope: !945)
!973 = !DILocation(line: 920, column: 51, scope: !945)
!974 = !DILocation(line: 921, column: 35, scope: !945)
!975 = !DILocation(line: 921, column: 44, scope: !945)
!976 = !DILocation(line: 922, column: 35, scope: !945)
!977 = !DILocation(line: 922, column: 44, scope: !945)
!978 = !DILocation(line: 919, column: 9, scope: !945)
!979 = !DILocation(line: 923, column: 7, scope: !945)
!980 = !DILocation(line: 925, column: 13, scope: !908)
!981 = !DILocation(line: 925, column: 5, scope: !908)
!982 = !DILocation(line: 925, column: 11, scope: !908)
!983 = !DILocation(line: 926, column: 12, scope: !908)
!984 = !DILocation(line: 926, column: 5, scope: !908)
!985 = !DILocalVariable(name: "n", arg: 1, scope: !986, file: !105, line: 877, type: !6)
!986 = distinct !DISubprogram(name: "quotearg_n_options", scope: !105, file: !105, line: 877, type: !987, scopeLine: 879, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !998, retainedNodes: !11)
!987 = !DISubroutineType(types: !988)
!988 = !{!8, !6, !23, !99, !989}
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !991)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !105, line: 65, size: 448, elements: !992)
!992 = !{!993, !994, !995, !996, !997}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !991, file: !105, line: 68, baseType: !82, size: 32)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !991, file: !105, line: 71, baseType: !6, size: 32, offset: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !991, file: !105, line: 75, baseType: !123, size: 256, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !991, file: !105, line: 78, baseType: !23, size: 64, offset: 320)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !991, file: !105, line: 81, baseType: !23, size: 64, offset: 384)
!998 = distinct !DICompileUnit(language: DW_LANG_C99, file: !80, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !81, retainedTypes: !97, globals: !999, nameTableKind: None)
!999 = !{!1000, !1002, !1004, !1006, !1008, !1010, !1017, !1019}
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !998, file: !105, line: 85, type: !106, isLocal: false, isDefinition: true)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !998, file: !105, line: 101, type: !112, isLocal: false, isDefinition: true)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !998, file: !105, line: 1052, type: !991, isLocal: false, isDefinition: true)
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !998, file: !105, line: 116, type: !991, isLocal: true, isDefinition: true)
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(name: "slot0", scope: !998, file: !105, line: 842, type: !128, isLocal: true, isDefinition: true)
!1010 = !DIGlobalVariableExpression(var: !1011, expr: !DIExpression())
!1011 = distinct !DIGlobalVariable(name: "slotvec", scope: !998, file: !105, line: 845, type: !1012, isLocal: true, isDefinition: true)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !105, line: 834, size: 128, elements: !1014)
!1014 = !{!1015, !1016}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1013, file: !105, line: 836, baseType: !99, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1013, file: !105, line: 837, baseType: !8, size: 64, offset: 64)
!1017 = !DIGlobalVariableExpression(var: !1018, expr: !DIExpression())
!1018 = distinct !DIGlobalVariable(name: "nslots", scope: !998, file: !105, line: 843, type: !6, isLocal: true, isDefinition: true)
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(name: "slotvec0", scope: !998, file: !105, line: 844, type: !1013, isLocal: true, isDefinition: true)
!1021 = !DILocalVariable(name: "arg", arg: 2, scope: !986, file: !105, line: 877, type: !23)
!1022 = !DILocalVariable(name: "argsize", arg: 3, scope: !986, file: !105, line: 877, type: !99)
!1023 = !DILocalVariable(name: "options", arg: 4, scope: !986, file: !105, line: 878, type: !989)
!1024 = !DILocalVariable(name: "e", scope: !986, file: !105, line: 880, type: !6)
!1025 = !DILocalVariable(name: "sv", scope: !986, file: !105, line: 882, type: !1012)
!1026 = !DILocalVariable(name: "nmax", scope: !1027, file: !105, line: 890, type: !6)
!1027 = distinct !DILexicalBlock(scope: !1028, file: !105, line: 888, column: 5)
!1028 = distinct !DILexicalBlock(scope: !1029, file: !105, line: 887, column: 7)
!1029 = distinct !DISubprogram(name: "quotearg_n_options", scope: !105, file: !105, line: 877, type: !1030, scopeLine: 879, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1041, retainedNodes: !11)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!8, !6, !23, !99, !1032}
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1034)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !105, line: 65, size: 448, elements: !1035)
!1035 = !{!1036, !1037, !1038, !1039, !1040}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1034, file: !105, line: 68, baseType: !82, size: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1034, file: !105, line: 71, baseType: !6, size: 32, offset: 32)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1034, file: !105, line: 75, baseType: !123, size: 256, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1034, file: !105, line: 78, baseType: !23, size: 64, offset: 320)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1034, file: !105, line: 81, baseType: !23, size: 64, offset: 384)
!1041 = distinct !DICompileUnit(language: DW_LANG_C99, file: !80, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !81, retainedTypes: !97, globals: !1042, nameTableKind: None)
!1042 = !{!1043, !1045, !1047, !1049, !1051, !1053, !1060, !1062}
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1041, file: !105, line: 85, type: !106, isLocal: false, isDefinition: true)
!1045 = !DIGlobalVariableExpression(var: !1046, expr: !DIExpression())
!1046 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1041, file: !105, line: 101, type: !112, isLocal: false, isDefinition: true)
!1047 = !DIGlobalVariableExpression(var: !1048, expr: !DIExpression())
!1048 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1041, file: !105, line: 1052, type: !1034, isLocal: false, isDefinition: true)
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
!1050 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1041, file: !105, line: 116, type: !1034, isLocal: true, isDefinition: true)
!1051 = !DIGlobalVariableExpression(var: !1052, expr: !DIExpression())
!1052 = distinct !DIGlobalVariable(name: "slot0", scope: !1041, file: !105, line: 842, type: !128, isLocal: true, isDefinition: true)
!1053 = !DIGlobalVariableExpression(var: !1054, expr: !DIExpression())
!1054 = distinct !DIGlobalVariable(name: "slotvec", scope: !1041, file: !105, line: 845, type: !1055, isLocal: true, isDefinition: true)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !105, line: 834, size: 128, elements: !1057)
!1057 = !{!1058, !1059}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1056, file: !105, line: 836, baseType: !99, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1056, file: !105, line: 837, baseType: !8, size: 64, offset: 64)
!1060 = !DIGlobalVariableExpression(var: !1061, expr: !DIExpression())
!1061 = distinct !DIGlobalVariable(name: "nslots", scope: !1041, file: !105, line: 843, type: !6, isLocal: true, isDefinition: true)
!1062 = !DIGlobalVariableExpression(var: !1063, expr: !DIExpression())
!1063 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1041, file: !105, line: 844, type: !1056, isLocal: true, isDefinition: true)
!1064 = !DILocalVariable(name: "val", scope: !1065, file: !105, line: 904, type: !8)
!1065 = distinct !DILexicalBlock(scope: !1066, file: !105, line: 902, column: 3)
!1066 = distinct !DISubprogram(name: "quotearg_n_options", scope: !105, file: !105, line: 877, type: !1067, scopeLine: 879, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1078, retainedNodes: !11)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!8, !6, !23, !99, !1069}
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1071)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !105, line: 65, size: 448, elements: !1072)
!1072 = !{!1073, !1074, !1075, !1076, !1077}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1071, file: !105, line: 68, baseType: !82, size: 32)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1071, file: !105, line: 71, baseType: !6, size: 32, offset: 32)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1071, file: !105, line: 75, baseType: !123, size: 256, offset: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1071, file: !105, line: 78, baseType: !23, size: 64, offset: 320)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1071, file: !105, line: 81, baseType: !23, size: 64, offset: 384)
!1078 = distinct !DICompileUnit(language: DW_LANG_C99, file: !80, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !81, retainedTypes: !97, globals: !1079, nameTableKind: None)
!1079 = !{!1080, !1082, !1084, !1086, !1088, !1090, !1097, !1099}
!1080 = !DIGlobalVariableExpression(var: !1081, expr: !DIExpression())
!1081 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1078, file: !105, line: 85, type: !106, isLocal: false, isDefinition: true)
!1082 = !DIGlobalVariableExpression(var: !1083, expr: !DIExpression())
!1083 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1078, file: !105, line: 101, type: !112, isLocal: false, isDefinition: true)
!1084 = !DIGlobalVariableExpression(var: !1085, expr: !DIExpression())
!1085 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1078, file: !105, line: 1052, type: !1071, isLocal: false, isDefinition: true)
!1086 = !DIGlobalVariableExpression(var: !1087, expr: !DIExpression())
!1087 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1078, file: !105, line: 116, type: !1071, isLocal: true, isDefinition: true)
!1088 = !DIGlobalVariableExpression(var: !1089, expr: !DIExpression())
!1089 = distinct !DIGlobalVariable(name: "slot0", scope: !1078, file: !105, line: 842, type: !128, isLocal: true, isDefinition: true)
!1090 = !DIGlobalVariableExpression(var: !1091, expr: !DIExpression())
!1091 = distinct !DIGlobalVariable(name: "slotvec", scope: !1078, file: !105, line: 845, type: !1092, isLocal: true, isDefinition: true)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !105, line: 834, size: 128, elements: !1094)
!1094 = !{!1095, !1096}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1093, file: !105, line: 836, baseType: !99, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1093, file: !105, line: 837, baseType: !8, size: 64, offset: 64)
!1097 = !DIGlobalVariableExpression(var: !1098, expr: !DIExpression())
!1098 = distinct !DIGlobalVariable(name: "nslots", scope: !1078, file: !105, line: 843, type: !6, isLocal: true, isDefinition: true)
!1099 = !DIGlobalVariableExpression(var: !1100, expr: !DIExpression())
!1100 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1078, file: !105, line: 844, type: !1093, isLocal: true, isDefinition: true)
!1101 = !DILocalVariable(name: "flags", scope: !1065, file: !105, line: 906, type: !6)
!1102 = !DILocalVariable(name: "qsize", scope: !1065, file: !105, line: 907, type: !99)
!1103 = distinct !DISubprogram(name: "quotearg_buffer_restyled", scope: !105, file: !105, line: 256, type: !1104, scopeLine: 262, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !79, retainedNodes: !11)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!99, !8, !99, !23, !99, !82, !6, !1106, !23, !23}
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!1108 = !DILocalVariable(name: "buffer", arg: 1, scope: !1103, file: !105, line: 256, type: !8)
!1109 = !DILocation(line: 256, column: 33, scope: !1103)
!1110 = !DILocalVariable(name: "buffersize", arg: 2, scope: !1103, file: !105, line: 256, type: !99)
!1111 = !DILocation(line: 256, column: 48, scope: !1103)
!1112 = !DILocalVariable(name: "arg", arg: 3, scope: !1103, file: !105, line: 257, type: !23)
!1113 = !DILocation(line: 257, column: 39, scope: !1103)
!1114 = !DILocalVariable(name: "argsize", arg: 4, scope: !1103, file: !105, line: 257, type: !99)
!1115 = !DILocation(line: 257, column: 51, scope: !1103)
!1116 = !DILocalVariable(name: "quoting_style", arg: 5, scope: !1103, file: !105, line: 258, type: !82)
!1117 = !DILocation(line: 258, column: 46, scope: !1103)
!1118 = !DILocalVariable(name: "flags", arg: 6, scope: !1103, file: !105, line: 258, type: !6)
!1119 = !DILocation(line: 258, column: 65, scope: !1103)
!1120 = !DILocalVariable(name: "quote_these_too", arg: 7, scope: !1103, file: !105, line: 259, type: !1106)
!1121 = !DILocation(line: 259, column: 47, scope: !1103)
!1122 = !DILocalVariable(name: "left_quote", arg: 8, scope: !1103, file: !105, line: 260, type: !23)
!1123 = !DILocation(line: 260, column: 39, scope: !1103)
!1124 = !DILocalVariable(name: "right_quote", arg: 9, scope: !1103, file: !105, line: 261, type: !23)
!1125 = !DILocation(line: 261, column: 39, scope: !1103)
!1126 = !DILocalVariable(name: "i", scope: !1103, file: !105, line: 263, type: !99)
!1127 = !DILocation(line: 263, column: 10, scope: !1103)
!1128 = !DILocalVariable(name: "len", scope: !1103, file: !105, line: 264, type: !99)
!1129 = !DILocation(line: 264, column: 10, scope: !1103)
!1130 = !DILocalVariable(name: "orig_buffersize", scope: !1103, file: !105, line: 265, type: !99)
!1131 = !DILocation(line: 265, column: 10, scope: !1103)
!1132 = !DILocalVariable(name: "quote_string", scope: !1103, file: !105, line: 266, type: !23)
!1133 = !DILocation(line: 266, column: 15, scope: !1103)
!1134 = !DILocalVariable(name: "quote_string_len", scope: !1103, file: !105, line: 267, type: !99)
!1135 = !DILocation(line: 267, column: 10, scope: !1103)
!1136 = !DILocalVariable(name: "backslash_escapes", scope: !1103, file: !105, line: 268, type: !41)
!1137 = !DILocation(line: 268, column: 8, scope: !1103)
!1138 = !DILocalVariable(name: "unibyte_locale", scope: !1103, file: !105, line: 269, type: !41)
!1139 = !DILocation(line: 269, column: 8, scope: !1103)
!1140 = !DILocation(line: 269, column: 25, scope: !1103)
!1141 = !DILocation(line: 269, column: 36, scope: !1103)
!1142 = !DILocalVariable(name: "elide_outer_quotes", scope: !1103, file: !105, line: 270, type: !41)
!1143 = !DILocation(line: 270, column: 8, scope: !1103)
!1144 = !DILocation(line: 270, column: 30, scope: !1103)
!1145 = !DILocation(line: 270, column: 36, scope: !1103)
!1146 = !DILocation(line: 270, column: 61, scope: !1103)
!1147 = !DILocalVariable(name: "pending_shell_escape_end", scope: !1103, file: !105, line: 271, type: !41)
!1148 = !DILocation(line: 271, column: 8, scope: !1103)
!1149 = !DILocalVariable(name: "encountered_single_quote", scope: !1103, file: !105, line: 272, type: !41)
!1150 = !DILocation(line: 272, column: 8, scope: !1103)
!1151 = !DILocalVariable(name: "all_c_and_shell_quote_compat", scope: !1103, file: !105, line: 273, type: !41)
!1152 = !DILocation(line: 273, column: 8, scope: !1103)
!1153 = !DILocation(line: 273, column: 3, scope: !1103)
!1154 = !DILabel(scope: !1103, name: "process_input", file: !105, line: 314)
!1155 = !DILocation(line: 314, column: 2, scope: !1103)
!1156 = !DILocation(line: 316, column: 11, scope: !1103)
!1157 = !DILocation(line: 316, column: 3, scope: !1103)
!1158 = !DILocation(line: 319, column: 21, scope: !1159)
!1159 = distinct !DILexicalBlock(scope: !1103, file: !105, line: 317, column: 5)
!1160 = !DILocation(line: 320, column: 26, scope: !1159)
!1161 = !DILocation(line: 321, column: 7, scope: !1159)
!1162 = !DILocation(line: 323, column: 12, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1159, file: !105, line: 323, column: 11)
!1164 = !DILocation(line: 323, column: 11, scope: !1159)
!1165 = !DILocation(line: 324, column: 9, scope: !1163)
!1166 = !DILocation(line: 324, column: 9, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1168, file: !105, line: 324, column: 9)
!1168 = distinct !DILexicalBlock(scope: !1163, file: !105, line: 324, column: 9)
!1169 = !DILocation(line: 324, column: 9, scope: !1168)
!1170 = !DILocation(line: 325, column: 25, scope: !1159)
!1171 = !DILocation(line: 326, column: 20, scope: !1159)
!1172 = !DILocation(line: 327, column: 24, scope: !1159)
!1173 = !DILocation(line: 328, column: 7, scope: !1159)
!1174 = !DILocation(line: 331, column: 25, scope: !1159)
!1175 = !DILocation(line: 332, column: 26, scope: !1159)
!1176 = !DILocation(line: 333, column: 7, scope: !1159)
!1177 = !DILocation(line: 339, column: 13, scope: !1178)
!1178 = distinct !DILexicalBlock(scope: !1179, file: !105, line: 339, column: 13)
!1179 = distinct !DILexicalBlock(scope: !1159, file: !105, line: 338, column: 7)
!1180 = !DILocation(line: 339, column: 27, scope: !1178)
!1181 = !DILocation(line: 339, column: 13, scope: !1179)
!1182 = !DILocation(line: 362, column: 50, scope: !1183)
!1183 = distinct !DILexicalBlock(scope: !1178, file: !105, line: 340, column: 11)
!1184 = !DILocation(line: 362, column: 26, scope: !1183)
!1185 = !DILocation(line: 362, column: 24, scope: !1183)
!1186 = !DILocation(line: 363, column: 51, scope: !1183)
!1187 = !DILocation(line: 363, column: 27, scope: !1183)
!1188 = !DILocation(line: 363, column: 25, scope: !1183)
!1189 = !DILocation(line: 364, column: 11, scope: !1183)
!1190 = !DILocation(line: 365, column: 14, scope: !1191)
!1191 = distinct !DILexicalBlock(scope: !1179, file: !105, line: 365, column: 13)
!1192 = !DILocation(line: 365, column: 13, scope: !1179)
!1193 = !DILocation(line: 366, column: 31, scope: !1194)
!1194 = distinct !DILexicalBlock(scope: !1191, file: !105, line: 366, column: 11)
!1195 = !DILocation(line: 366, column: 29, scope: !1194)
!1196 = !DILocation(line: 366, column: 16, scope: !1194)
!1197 = !DILocation(line: 366, column: 44, scope: !1198)
!1198 = distinct !DILexicalBlock(scope: !1194, file: !105, line: 366, column: 11)
!1199 = !DILocation(line: 366, column: 43, scope: !1198)
!1200 = !DILocation(line: 366, column: 11, scope: !1194)
!1201 = !DILocation(line: 367, column: 13, scope: !1198)
!1202 = !DILocation(line: 367, column: 13, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1204, file: !105, line: 367, column: 13)
!1204 = distinct !DILexicalBlock(scope: !1198, file: !105, line: 367, column: 13)
!1205 = !DILocation(line: 367, column: 13, scope: !1204)
!1206 = !DILocation(line: 366, column: 70, scope: !1198)
!1207 = !DILocation(line: 366, column: 11, scope: !1198)
!1208 = distinct !{!1208, !1200, !1209}
!1209 = !DILocation(line: 367, column: 13, scope: !1194)
!1210 = !DILocation(line: 368, column: 27, scope: !1179)
!1211 = !DILocation(line: 369, column: 24, scope: !1179)
!1212 = !DILocation(line: 369, column: 22, scope: !1179)
!1213 = !DILocation(line: 370, column: 36, scope: !1179)
!1214 = !DILocation(line: 370, column: 28, scope: !1179)
!1215 = !DILocation(line: 370, column: 26, scope: !1179)
!1216 = !DILocation(line: 372, column: 7, scope: !1159)
!1217 = !DILocation(line: 375, column: 25, scope: !1159)
!1218 = !DILocation(line: 376, column: 7, scope: !1159)
!1219 = !DILocation(line: 378, column: 26, scope: !1159)
!1220 = !DILocation(line: 379, column: 7, scope: !1159)
!1221 = !DILocation(line: 381, column: 12, scope: !1222)
!1222 = distinct !DILexicalBlock(scope: !1159, file: !105, line: 381, column: 11)
!1223 = !DILocation(line: 381, column: 11, scope: !1159)
!1224 = !DILocation(line: 382, column: 27, scope: !1222)
!1225 = !DILocation(line: 382, column: 9, scope: !1222)
!1226 = !DILocation(line: 383, column: 7, scope: !1159)
!1227 = !DILocation(line: 385, column: 21, scope: !1159)
!1228 = !DILocation(line: 386, column: 12, scope: !1229)
!1229 = distinct !DILexicalBlock(scope: !1159, file: !105, line: 386, column: 11)
!1230 = !DILocation(line: 386, column: 11, scope: !1159)
!1231 = !DILocation(line: 387, column: 9, scope: !1229)
!1232 = !DILocation(line: 387, column: 9, scope: !1233)
!1233 = distinct !DILexicalBlock(scope: !1234, file: !105, line: 387, column: 9)
!1234 = distinct !DILexicalBlock(scope: !1229, file: !105, line: 387, column: 9)
!1235 = !DILocation(line: 387, column: 9, scope: !1234)
!1236 = !DILocation(line: 388, column: 20, scope: !1159)
!1237 = !DILocation(line: 389, column: 24, scope: !1159)
!1238 = !DILocation(line: 390, column: 7, scope: !1159)
!1239 = !DILocation(line: 393, column: 26, scope: !1159)
!1240 = !DILocation(line: 394, column: 7, scope: !1159)
!1241 = !DILocation(line: 397, column: 7, scope: !1159)
!1242 = !DILocation(line: 400, column: 10, scope: !1243)
!1243 = distinct !DILexicalBlock(scope: !1103, file: !105, line: 400, column: 3)
!1244 = !DILocation(line: 400, column: 8, scope: !1243)
!1245 = !DILocation(line: 400, column: 19, scope: !1246)
