; ModuleID = '<stdin>'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.utsname = type { [65 x i8], [65 x i8], [65 x i8], [65 x i8], [65 x i8], [65 x i8] }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external dso_local global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [23 x i8] c"Usage: %s [OPTION]...\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "unknown", scope: !2, file: !3, line: 262, type: !42, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 260, type: !4, scopeLine: 261, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !11)
!3 = !DIFile(filename: "src/uname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !6, !7}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!10 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !12, globals: !14, nameTableKind: None)
!11 = !{}
!12 = !{!8, !13}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!14 = !{!0, !15, !31, !36}
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "arch_long_options", scope: !10, file: !3, line: 107, type: !17, isLocal: true, isDefinition: true)
!17 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 768, elements: !29)
!18 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !20, line: 50, size: 256, elements: !21)
!20 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "")
!21 = !{!22, !25, !26, !28}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !19, file: !20, line: 52, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !19, file: !20, line: 55, baseType: !6, size: 32, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !19, file: !20, line: 56, baseType: !27, size: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !19, file: !20, line: 57, baseType: !6, size: 32, offset: 192)
!29 = !{!30}
!30 = !DISubrange(count: 3)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "uname_long_options", scope: !10, file: !3, line: 89, type: !33, isLocal: true, isDefinition: true)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 3584, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 14)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "printed", scope: !38, file: !3, line: 163, type: !41, isLocal: true, isDefinition: true)
!38 = distinct !DISubprogram(name: "print_element", scope: !3, file: !3, line: 161, type: !39, scopeLine: 162, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10, retainedNodes: !11)
!39 = !DISubroutineType(types: !40)
!40 = !{null, !23}
!41 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 64, elements: !43)
!43 = !{!44}
!44 = !DISubrange(count: 8)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "uname_mode", scope: !47, file: !48, line: 2, type: !6, isLocal: false, isDefinition: true)
!47 = distinct !DICompileUnit(language: DW_LANG_C99, file: !48, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, globals: !49, nameTableKind: None)
!48 = !DIFile(filename: "src/uname-uname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!49 = !{!45}
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "Version", scope: !52, file: !53, line: 2, type: !23, isLocal: false, isDefinition: true)
!52 = distinct !DICompileUnit(language: DW_LANG_C99, file: !53, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, globals: !54, nameTableKind: None)
!53 = !DIFile(filename: "src/version.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!54 = !{!50}
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !57, file: !62, line: 56, type: !41, isLocal: true, isDefinition: true)
!57 = distinct !DICompileUnit(language: DW_LANG_C99, file: !58, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, globals: !59, nameTableKind: None)
!58 = !DIFile(filename: "./lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!59 = !{!60, !55}
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "file_name", scope: !57, file: !62, line: 46, type: !23, isLocal: true, isDefinition: true)
!62 = !DIFile(filename: "lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "exit_failure", scope: !65, file: !68, line: 24, type: !69, isLocal: false, isDefinition: true)
!65 = distinct !DICompileUnit(language: DW_LANG_C99, file: !66, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, globals: !67, nameTableKind: None)
!66 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!67 = !{!63}
!68 = !DIFile(filename: "lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!69 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !6)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "program_name", scope: !72, file: !76, line: 33, type: !23, isLocal: false, isDefinition: true)
!72 = distinct !DICompileUnit(language: DW_LANG_C99, file: !73, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !74, globals: !75, nameTableKind: None)
!73 = !DIFile(filename: "./lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!74 = !{!13, !8}
!75 = !{!70}
!76 = !DIFile(filename: "lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !79, file: !105, line: 116, type: !118, isLocal: true, isDefinition: true)
!79 = distinct !DICompileUnit(language: DW_LANG_C99, file: !80, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !81, retainedTypes: !97, globals: !102, nameTableKind: None)
!80 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!81 = !{!82}
!82 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !83, line: 32, baseType: !84, size: 32, elements: !85)
!83 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!84 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96}
!86 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!87 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!88 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!89 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!90 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!91 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!92 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!93 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!94 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!95 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!96 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!97 = !{!6, !98, !99}
!98 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !100, line: 46, baseType: !101)
!100 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.1/include/stddef.h", directory: "")
!101 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!102 = !{!103, !110, !116, !77, !126, !131, !138, !140}
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !79, file: !105, line: 85, type: !106, isLocal: false, isDefinition: true)
!105 = !DIFile(filename: "lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 704, elements: !108)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!108 = !{!109}
!109 = !DISubrange(count: 11)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !79, file: !105, line: 101, type: !112, isLocal: false, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 320, elements: !114)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!114 = !{!115}
!115 = !DISubrange(count: 10)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !79, file: !105, line: 1052, type: !118, isLocal: false, isDefinition: true)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !105, line: 65, size: 448, elements: !119)
!119 = !{!120, !121, !122, !124, !125}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !118, file: !105, line: 68, baseType: !82, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !118, file: !105, line: 71, baseType: !6, size: 32, offset: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !118, file: !105, line: 75, baseType: !123, size: 256, offset: 64)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 256, elements: !43)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !118, file: !105, line: 78, baseType: !23, size: 64, offset: 320)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !118, file: !105, line: 81, baseType: !23, size: 64, offset: 384)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "slot0", scope: !79, file: !105, line: 842, type: !128, isLocal: true, isDefinition: true)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2048, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 256)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "slotvec", scope: !79, file: !105, line: 845, type: !133, isLocal: true, isDefinition: true)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !105, line: 834, size: 128, elements: !135)
!135 = !{!136, !137}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !134, file: !105, line: 836, baseType: !99, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !134, file: !105, line: 837, baseType: !8, size: 64, offset: 64)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "nslots", scope: !79, file: !105, line: 843, type: !6, isLocal: true, isDefinition: true)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "slotvec0", scope: !79, file: !105, line: 844, type: !134, isLocal: true, isDefinition: true)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !144, file: !147, line: 26, type: !148, isLocal: false, isDefinition: true)
!144 = distinct !DICompileUnit(language: DW_LANG_C99, file: !145, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, globals: !146, nameTableKind: None)
!145 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!146 = !{!142}
!147 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 376, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 47)
!151 = distinct !DICompileUnit(language: DW_LANG_C99, file: !152, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !153, nameTableKind: None)
!152 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!153 = !{!13}
!154 = distinct !DICompileUnit(language: DW_LANG_C99, file: !155, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !156, nameTableKind: None)
!155 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!156 = !{!99, !8, !13}
!157 = distinct !DICompileUnit(language: DW_LANG_C99, file: !158, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, nameTableKind: None)
!158 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!159 = distinct !DICompileUnit(language: DW_LANG_C99, file: !160, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !161, nameTableKind: None)
!160 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!161 = !{!99}
!162 = distinct !DICompileUnit(language: DW_LANG_C99, file: !163, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !164, nameTableKind: None)
!163 = !DIFile(filename: "./lib/c-strcasecmp.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!164 = !{!165}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!167 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!168 = distinct !DICompileUnit(language: DW_LANG_C99, file: !169, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, nameTableKind: None)
!169 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!170 = distinct !DICompileUnit(language: DW_LANG_C99, file: !171, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, nameTableKind: None)
!171 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!172 = distinct !DICompileUnit(language: DW_LANG_C99, file: !173, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !153, nameTableKind: None)
!173 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!174 = distinct !DICompileUnit(language: DW_LANG_C99, file: !175, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !153, nameTableKind: None)
!175 = !DIFile(filename: "./lib/setlocale_null.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!176 = distinct !DICompileUnit(language: DW_LANG_C99, file: !177, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, nameTableKind: None)
!177 = !DIFile(filename: "./lib/fclose.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!178 = distinct !DICompileUnit(language: DW_LANG_C99, file: !179, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !153, nameTableKind: None)
!179 = !DIFile(filename: "./lib/fflush.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!180 = distinct !DICompileUnit(language: DW_LANG_C99, file: !181, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !153, nameTableKind: None)
!181 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!182 = distinct !DICompileUnit(language: DW_LANG_C99, file: !183, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, nameTableKind: None)
!183 = !DIFile(filename: "./lib/c-ctype.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!184 = !{!"clang version 9.0.1-12 "}
!185 = !{i32 2, !"Dwarf Version", i32 4}
!186 = !{i32 2, !"Debug Info Version", i32 3}
!187 = !{i32 1, !"wchar_size", i32 4}
!188 = !{i32 1, !"ThinLTO", i32 0}
!189 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!190 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 115, type: !191, scopeLine: 116, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !11)
!191 = !DISubroutineType(types: !192)
!192 = !{null, !6}
!193 = !DILocalVariable(name: "status", arg: 1, scope: !190, file: !3, line: 115, type: !6)
!194 = !DILocation(line: 115, column: 12, scope: !190)
!195 = !DILocation(line: 117, column: 7, scope: !196)
!196 = distinct !DILexicalBlock(scope: !190, file: !3, line: 117, column: 7)
!197 = !DILocation(line: 117, column: 14, scope: !196)
!198 = !DILocation(line: 117, column: 7, scope: !190)
!199 = !DILocation(line: 118, column: 5, scope: !196)
!200 = !DILocation(line: 118, column: 5, scope: !201)
!201 = distinct !DILexicalBlock(scope: !196, file: !3, line: 118, column: 5)
!202 = !DILocation(line: 121, column: 15, scope: !203)
!203 = distinct !DILexicalBlock(scope: !196, file: !3, line: 120, column: 5)
!204 = !DILocation(line: 121, column: 45, scope: !203)
!205 = !DILocation(line: 121, column: 7, scope: !203)
!206 = !DILocation(line: 123, column: 11, scope: !207)
!207 = distinct !DILexicalBlock(scope: !203, file: !3, line: 123, column: 11)
!208 = !DILocation(line: 123, column: 22, scope: !207)
!209 = !DILocation(line: 123, column: 11, scope: !203)
!210 = !DILocation(line: 125, column: 11, scope: !211)
!211 = distinct !DILexicalBlock(scope: !207, file: !3, line: 124, column: 9)
!212 = !DILocation(line: 134, column: 11, scope: !211)
!213 = !DILocation(line: 141, column: 9, scope: !211)
!214 = !DILocation(line: 144, column: 11, scope: !215)
!215 = distinct !DILexicalBlock(scope: !207, file: !3, line: 143, column: 9)
!216 = !DILocation(line: 150, column: 7, scope: !203)
!217 = !DILocation(line: 151, column: 7, scope: !203)
!218 = !DILocation(line: 152, column: 28, scope: !203)
!219 = !DILocation(line: 152, column: 7, scope: !203)
!220 = !DILocation(line: 154, column: 9, scope: !190)
!221 = !DILocation(line: 154, column: 3, scope: !190)
!222 = !DILocalVariable(name: "status", arg: 1, scope: !223, file: !3, line: 115, type: !6)
!223 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 115, type: !191, scopeLine: 116, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !224, retainedNodes: !11)
!224 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !12, globals: !225, nameTableKind: None)
!225 = !{!226, !229, !239, !242}
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "unknown", scope: !228, file: !3, line: 262, type: !42, isLocal: true, isDefinition: true)
!228 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 260, type: !4, scopeLine: 261, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !224, retainedNodes: !11)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "arch_long_options", scope: !224, file: !3, line: 107, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 768, elements: !29)
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !20, line: 50, size: 256, elements: !234)
!234 = !{!235, !236, !237, !238}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !233, file: !20, line: 52, baseType: !23, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !233, file: !20, line: 55, baseType: !6, size: 32, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !233, file: !20, line: 56, baseType: !27, size: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !233, file: !20, line: 57, baseType: !6, size: 32, offset: 192)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "uname_long_options", scope: !224, file: !3, line: 89, type: !241, isLocal: true, isDefinition: true)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 3584, elements: !34)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "printed", scope: !244, file: !3, line: 163, type: !41, isLocal: true, isDefinition: true)
!244 = distinct !DISubprogram(name: "print_element", scope: !3, file: !3, line: 161, type: !39, scopeLine: 162, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !224, retainedNodes: !11)
!245 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !246, file: !246, line: 634, type: !39, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10, retainedNodes: !11)
!246 = !DIFile(filename: "src/system.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!247 = !DILocalVariable(name: "program", arg: 1, scope: !245, file: !246, line: 634, type: !23)
!248 = !DILocation(line: 634, column: 34, scope: !245)
!249 = !DILocalVariable(name: "infomap", scope: !245, file: !246, line: 636, type: !250)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 896, elements: !256)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !245, file: !246, line: 636, size: 128, elements: !253)
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !252, file: !246, line: 636, baseType: !23, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !252, file: !246, line: 636, baseType: !23, size: 64, offset: 64)
!256 = !{!257}
!257 = !DISubrange(count: 7)
!258 = !DILocation(line: 636, column: 67, scope: !245)
!259 = !DILocalVariable(name: "node", scope: !245, file: !246, line: 646, type: !23)
!260 = !DILocation(line: 646, column: 15, scope: !245)
!261 = !DILocation(line: 646, column: 22, scope: !245)
!262 = !DILocalVariable(name: "map_prog", scope: !245, file: !246, line: 647, type: !263)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!264 = !DILocation(line: 647, column: 25, scope: !245)
!265 = !DILocation(line: 647, column: 36, scope: !245)
!266 = !DILocation(line: 649, column: 3, scope: !245)
!267 = !DILocation(line: 649, column: 10, scope: !245)
!268 = !DILocation(line: 649, column: 20, scope: !245)
!269 = !DILocation(line: 649, column: 28, scope: !245)
!270 = !DILocation(line: 649, column: 33, scope: !245)
!271 = !DILocation(line: 649, column: 31, scope: !245)
!272 = !DILocation(line: 0, scope: !245)
!273 = !DILocation(line: 650, column: 13, scope: !245)
!274 = distinct !{!274, !266, !273}
!275 = !DILocation(line: 652, column: 7, scope: !276)
!276 = distinct !DILexicalBlock(scope: !245, file: !246, line: 652, column: 7)
!277 = !DILocation(line: 652, column: 17, scope: !276)
!278 = !DILocation(line: 652, column: 7, scope: !245)
!279 = !DILocation(line: 653, column: 12, scope: !276)
!280 = !DILocation(line: 653, column: 22, scope: !276)
!281 = !DILocation(line: 653, column: 10, scope: !276)
!282 = !DILocation(line: 653, column: 5, scope: !276)
!283 = !DILocation(line: 655, column: 11, scope: !245)
!284 = !DILocation(line: 655, column: 3, scope: !245)
!285 = !DILocalVariable(name: "lc_messages", scope: !245, file: !246, line: 659, type: !23)
!286 = !DILocation(line: 659, column: 15, scope: !245)
!287 = !DILocation(line: 659, column: 29, scope: !245)
!288 = !DILocation(line: 660, column: 7, scope: !289)
!289 = distinct !DILexicalBlock(scope: !245, file: !246, line: 660, column: 7)
!290 = !DILocation(line: 660, column: 19, scope: !289)
!291 = !DILocation(line: 660, column: 22, scope: !289)
!292 = !DILocation(line: 660, column: 7, scope: !245)
!293 = !DILocation(line: 666, column: 7, scope: !294)
!294 = distinct !DILexicalBlock(scope: !289, file: !246, line: 661, column: 5)
!295 = !DILocation(line: 668, column: 5, scope: !294)
!296 = !DILocation(line: 669, column: 11, scope: !245)
!297 = !DILocation(line: 670, column: 24, scope: !245)
!298 = !DILocation(line: 669, column: 3, scope: !245)
!299 = !DILocation(line: 671, column: 11, scope: !245)
!300 = !DILocation(line: 672, column: 11, scope: !245)
!301 = !DILocation(line: 672, column: 17, scope: !245)
!302 = !DILocation(line: 672, column: 25, scope: !245)
!303 = !DILocation(line: 672, column: 22, scope: !245)
!304 = !DILocation(line: 671, column: 3, scope: !245)
!305 = !DILocation(line: 673, column: 1, scope: !245)
!306 = !DILocalVariable(name: "program", arg: 1, scope: !307, file: !246, line: 634, type: !23)
!307 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !246, file: !246, line: 634, type: !39, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !308, retainedNodes: !11)
!308 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !12, globals: !309, nameTableKind: None)
!309 = !{!310, !313, !323, !326}
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "unknown", scope: !312, file: !3, line: 262, type: !42, isLocal: true, isDefinition: true)
!312 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 260, type: !4, scopeLine: 261, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !308, retainedNodes: !11)
!313 = !DIGlobalVariableExpression(var: !314, expr: !DIExpression())
!314 = distinct !DIGlobalVariable(name: "arch_long_options", scope: !308, file: !3, line: 107, type: !315, isLocal: true, isDefinition: true)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 768, elements: !29)
!316 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !20, line: 50, size: 256, elements: !318)
!318 = !{!319, !320, !321, !322}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !317, file: !20, line: 52, baseType: !23, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !317, file: !20, line: 55, baseType: !6, size: 32, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !317, file: !20, line: 56, baseType: !27, size: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !317, file: !20, line: 57, baseType: !6, size: 32, offset: 192)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "uname_long_options", scope: !308, file: !3, line: 89, type: !325, isLocal: true, isDefinition: true)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 3584, elements: !34)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "printed", scope: !328, file: !3, line: 163, type: !41, isLocal: true, isDefinition: true)
!328 = distinct !DISubprogram(name: "print_element", scope: !3, file: !3, line: 161, type: !39, scopeLine: 162, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !308, retainedNodes: !11)
!329 = !DILocalVariable(name: "infomap", scope: !307, file: !246, line: 636, type: !330)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 896, elements: !256)
!331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !307, file: !246, line: 636, size: 128, elements: !333)
!333 = !{!334, !335}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !332, file: !246, line: 636, baseType: !23, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !332, file: !246, line: 636, baseType: !23, size: 64, offset: 64)
!336 = !DILocalVariable(name: "node", scope: !307, file: !246, line: 646, type: !23)
!337 = !DILocalVariable(name: "map_prog", scope: !307, file: !246, line: 647, type: !338)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!339 = !DILocalVariable(name: "lc_messages", scope: !340, file: !246, line: 659, type: !23)
!340 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !246, file: !246, line: 634, type: !39, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !341, retainedNodes: !11)
!341 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !12, globals: !342, nameTableKind: None)
!342 = !{!343, !346, !356, !359}
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "unknown", scope: !345, file: !3, line: 262, type: !42, isLocal: true, isDefinition: true)
!345 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 260, type: !4, scopeLine: 261, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !341, retainedNodes: !11)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "arch_long_options", scope: !341, file: !3, line: 107, type: !348, isLocal: true, isDefinition: true)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 768, elements: !29)
!349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !20, line: 50, size: 256, elements: !351)
!351 = !{!352, !353, !354, !355}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !350, file: !20, line: 52, baseType: !23, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !350, file: !20, line: 55, baseType: !6, size: 32, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !350, file: !20, line: 56, baseType: !27, size: 64, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !350, file: !20, line: 57, baseType: !6, size: 32, offset: 192)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "uname_long_options", scope: !341, file: !3, line: 89, type: !358, isLocal: true, isDefinition: true)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 3584, elements: !34)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "printed", scope: !361, file: !3, line: 163, type: !41, isLocal: true, isDefinition: true)
!361 = distinct !DISubprogram(name: "print_element", scope: !3, file: !3, line: 161, type: !39, scopeLine: 162, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !341, retainedNodes: !11)
!362 = !DILocalVariable(name: "argc", arg: 1, scope: !2, file: !3, line: 260, type: !6)
!363 = !DILocation(line: 260, column: 11, scope: !2)
!364 = !DILocalVariable(name: "argv", arg: 2, scope: !2, file: !3, line: 260, type: !7)
!365 = !DILocation(line: 260, column: 24, scope: !2)
!366 = !DILocalVariable(name: "toprint", scope: !2, file: !3, line: 265, type: !84)
!367 = !DILocation(line: 265, column: 16, scope: !2)
!368 = !DILocation(line: 268, column: 21, scope: !2)
!369 = !DILocation(line: 268, column: 3, scope: !2)
!370 = !DILocation(line: 269, column: 3, scope: !2)
!371 = !DILocation(line: 270, column: 3, scope: !2)
!372 = !DILocation(line: 271, column: 3, scope: !2)
!373 = !DILocation(line: 273, column: 3, scope: !2)
!374 = !DILocation(line: 275, column: 30, scope: !2)
!375 = !DILocation(line: 275, column: 36, scope: !2)
!376 = !DILocation(line: 275, column: 13, scope: !2)
!377 = !DILocation(line: 275, column: 11, scope: !2)
!378 = !DILocation(line: 277, column: 7, scope: !379)
!379 = distinct !DILexicalBlock(scope: !2, file: !3, line: 277, column: 7)
!380 = !DILocation(line: 277, column: 15, scope: !379)
!381 = !DILocation(line: 278, column: 13, scope: !379)
!382 = !DILocation(line: 278, column: 5, scope: !379)
!383 = !DILocation(line: 280, column: 7, scope: !384)
!384 = distinct !DILexicalBlock(scope: !2, file: !3, line: 280, column: 7)
!385 = !DILocation(line: 281, column: 8, scope: !384)
!386 = !DILocation(line: 280, column: 7, scope: !2)
!387 = !DILocalVariable(name: "name", scope: !388, file: !3, line: 284, type: !389)
!388 = distinct !DILexicalBlock(scope: !384, file: !3, line: 283, column: 5)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utsname", file: !390, line: 48, size: 3120, elements: !391)
!390 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/utsname.h", directory: "")
!391 = !{!392, !396, !397, !398, !399, !400}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "sysname", scope: !389, file: !390, line: 51, baseType: !393, size: 520)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 520, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 65)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "nodename", scope: !389, file: !390, line: 54, baseType: !393, size: 520, offset: 520)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !389, file: !390, line: 57, baseType: !393, size: 520, offset: 1040)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !389, file: !390, line: 59, baseType: !393, size: 520, offset: 1560)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !389, file: !390, line: 62, baseType: !393, size: 520, offset: 2080)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "domainname", scope: !389, file: !390, line: 67, baseType: !393, size: 520, offset: 2600)
!401 = !DILocation(line: 284, column: 22, scope: !388)
!402 = !DILocation(line: 286, column: 11, scope: !403)
!403 = distinct !DILexicalBlock(scope: !388, file: !3, line: 286, column: 11)
!404 = !DILocation(line: 286, column: 25, scope: !403)
!405 = !DILocation(line: 287, column: 9, scope: !403)
!406 = !DILocation(line: 289, column: 11, scope: !407)
!407 = distinct !DILexicalBlock(scope: !388, file: !3, line: 289, column: 11)
!408 = !DILocation(line: 289, column: 19, scope: !407)
!409 = !DILocation(line: 289, column: 11, scope: !388)
!410 = !DILocation(line: 290, column: 29, scope: !407)
!411 = !DILocation(line: 290, column: 24, scope: !407)
!412 = !DILocation(line: 290, column: 9, scope: !407)
!413 = !DILocation(line: 291, column: 11, scope: !414)
!414 = distinct !DILexicalBlock(scope: !388, file: !3, line: 291, column: 11)
!415 = !DILocation(line: 291, column: 19, scope: !414)
!416 = !DILocation(line: 291, column: 11, scope: !388)
!417 = !DILocation(line: 292, column: 29, scope: !414)
!418 = !DILocation(line: 292, column: 24, scope: !414)
!419 = !DILocation(line: 292, column: 9, scope: !414)
!420 = !DILocation(line: 293, column: 11, scope: !421)
!421 = distinct !DILexicalBlock(scope: !388, file: !3, line: 293, column: 11)
!422 = !DILocation(line: 293, column: 19, scope: !421)
!423 = !DILocation(line: 293, column: 11, scope: !388)
!424 = !DILocation(line: 294, column: 29, scope: !421)
!425 = !DILocation(line: 294, column: 24, scope: !421)
!426 = !DILocation(line: 294, column: 9, scope: !421)
!427 = !DILocation(line: 295, column: 11, scope: !428)
!428 = distinct !DILexicalBlock(scope: !388, file: !3, line: 295, column: 11)
!429 = !DILocation(line: 295, column: 19, scope: !428)
!430 = !DILocation(line: 295, column: 11, scope: !388)
!431 = !DILocation(line: 296, column: 29, scope: !428)
!432 = !DILocation(line: 296, column: 24, scope: !428)
!433 = !DILocation(line: 296, column: 9, scope: !428)
!434 = !DILocation(line: 297, column: 11, scope: !435)
!435 = distinct !DILexicalBlock(scope: !388, file: !3, line: 297, column: 11)
!436 = !DILocation(line: 297, column: 19, scope: !435)
!437 = !DILocation(line: 297, column: 11, scope: !388)
!438 = !DILocation(line: 298, column: 29, scope: !435)
!439 = !DILocation(line: 298, column: 24, scope: !435)
!440 = !DILocation(line: 298, column: 9, scope: !435)
!441 = !DILocation(line: 299, column: 5, scope: !388)
!442 = !DILocation(line: 301, column: 7, scope: !443)
!443 = distinct !DILexicalBlock(scope: !2, file: !3, line: 301, column: 7)
!444 = !DILocation(line: 301, column: 15, scope: !443)
!445 = !DILocation(line: 301, column: 7, scope: !2)
!446 = !DILocalVariable(name: "element", scope: !447, file: !3, line: 303, type: !23)
!447 = distinct !DILexicalBlock(scope: !443, file: !3, line: 302, column: 5)
!448 = !DILocation(line: 303, column: 19, scope: !447)
!449 = !DILocation(line: 341, column: 14, scope: !450)
!450 = distinct !DILexicalBlock(scope: !447, file: !3, line: 341, column: 11)
!451 = !DILocation(line: 341, column: 22, scope: !450)
!452 = !DILocation(line: 341, column: 37, scope: !450)
!453 = !DILocation(line: 341, column: 45, scope: !450)
!454 = !DILocation(line: 341, column: 11, scope: !447)
!455 = !DILocation(line: 342, column: 24, scope: !450)
!456 = !DILocation(line: 342, column: 9, scope: !450)
!457 = !DILocation(line: 343, column: 5, scope: !447)
!458 = !DILocation(line: 345, column: 7, scope: !459)
!459 = distinct !DILexicalBlock(scope: !2, file: !3, line: 345, column: 7)
!460 = !DILocation(line: 345, column: 15, scope: !459)
!461 = !DILocation(line: 345, column: 7, scope: !2)
!462 = !DILocalVariable(name: "element", scope: !463, file: !3, line: 347, type: !23)
!463 = distinct !DILexicalBlock(scope: !459, file: !3, line: 346, column: 5)
!464 = !DILocation(line: 347, column: 19, scope: !463)
!465 = !DILocation(line: 366, column: 14, scope: !466)
!466 = distinct !DILexicalBlock(scope: !463, file: !3, line: 366, column: 11)
!467 = !DILocation(line: 366, column: 22, scope: !466)
!468 = !DILocation(line: 366, column: 37, scope: !466)
!469 = !DILocation(line: 366, column: 45, scope: !466)
!470 = !DILocation(line: 366, column: 11, scope: !463)
!471 = !DILocation(line: 367, column: 24, scope: !466)
!472 = !DILocation(line: 367, column: 9, scope: !466)
!473 = !DILocation(line: 368, column: 5, scope: !463)
!474 = !DILocation(line: 370, column: 7, scope: !475)
!475 = distinct !DILexicalBlock(scope: !2, file: !3, line: 370, column: 7)
!476 = !DILocation(line: 370, column: 15, scope: !475)
!477 = !DILocation(line: 370, column: 7, scope: !2)
!478 = !DILocation(line: 371, column: 5, scope: !475)
!479 = !DILocation(line: 373, column: 3, scope: !2)
!480 = !DILocation(line: 375, column: 3, scope: !2)
!481 = !DILocalVariable(name: "argc", arg: 1, scope: !482, file: !3, line: 260, type: !6)
!482 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 260, type: !4, scopeLine: 261, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !483, retainedNodes: !11)
!483 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !12, globals: !484, nameTableKind: None)
!484 = !{!485, !487, !497, !500}
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "unknown", scope: !482, file: !3, line: 262, type: !42, isLocal: true, isDefinition: true)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "arch_long_options", scope: !483, file: !3, line: 107, type: !489, isLocal: true, isDefinition: true)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 768, elements: !29)
!490 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !20, line: 50, size: 256, elements: !492)
!492 = !{!493, !494, !495, !496}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !491, file: !20, line: 52, baseType: !23, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !491, file: !20, line: 55, baseType: !6, size: 32, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !491, file: !20, line: 56, baseType: !27, size: 64, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !491, file: !20, line: 57, baseType: !6, size: 32, offset: 192)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "uname_long_options", scope: !483, file: !3, line: 89, type: !499, isLocal: true, isDefinition: true)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 3584, elements: !34)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "printed", scope: !502, file: !3, line: 163, type: !41, isLocal: true, isDefinition: true)
!502 = distinct !DISubprogram(name: "print_element", scope: !3, file: !3, line: 161, type: !39, scopeLine: 162, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !483, retainedNodes: !11)
!503 = !DILocalVariable(name: "argv", arg: 2, scope: !482, file: !3, line: 260, type: !7)
!504 = !DILocalVariable(name: "toprint", scope: !482, file: !3, line: 265, type: !84)
!505 = distinct !DISubprogram(name: "decode_switches", scope: !3, file: !3, line: 175, type: !4, scopeLine: 176, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10, retainedNodes: !11)
!506 = !DILocalVariable(name: "argc", arg: 1, scope: !505, file: !3, line: 175, type: !6)
!507 = !DILocation(line: 175, column: 22, scope: !505)
!508 = !DILocalVariable(name: "argv", arg: 2, scope: !505, file: !3, line: 175, type: !7)
!509 = !DILocation(line: 175, column: 35, scope: !505)
!510 = !DILocalVariable(name: "c", scope: !505, file: !3, line: 177, type: !6)
!511 = !DILocation(line: 177, column: 7, scope: !505)
!512 = !DILocalVariable(name: "toprint", scope: !505, file: !3, line: 178, type: !84)
!513 = !DILocation(line: 178, column: 16, scope: !505)
!514 = !DILocation(line: 180, column: 7, scope: !515)
!515 = distinct !DILexicalBlock(scope: !505, file: !3, line: 180, column: 7)
!516 = !DILocation(line: 180, column: 18, scope: !515)
!517 = !DILocation(line: 180, column: 7, scope: !505)
!518 = !DILocation(line: 182, column: 7, scope: !519)
!519 = distinct !DILexicalBlock(scope: !515, file: !3, line: 181, column: 5)
!520 = !DILocation(line: 182, column: 32, scope: !519)
!521 = !DILocation(line: 182, column: 38, scope: !519)
!522 = !DILocation(line: 182, column: 19, scope: !519)
!523 = !DILocation(line: 182, column: 17, scope: !519)
!524 = !DILocation(line: 183, column: 58, scope: !519)
!525 = !DILocation(line: 185, column: 19, scope: !526)
!526 = distinct !DILexicalBlock(scope: !519, file: !3, line: 184, column: 9)
!527 = !DILocation(line: 185, column: 11, scope: !526)
!528 = !DILocation(line: 187, column: 13, scope: !529)
!529 = distinct !DILexicalBlock(scope: !526, file: !3, line: 186, column: 13)
!530 = !DILocation(line: 189, column: 13, scope: !529)
!531 = !DILocation(line: 192, column: 15, scope: !529)
!532 = !DILocation(line: 195, column: 15, scope: !519)
!533 = !DILocation(line: 196, column: 5, scope: !519)
!534 = !DILocation(line: 199, column: 7, scope: !535)
!535 = distinct !DILexicalBlock(scope: !515, file: !3, line: 198, column: 5)
!536 = !DILocation(line: 199, column: 32, scope: !535)
!537 = !DILocation(line: 199, column: 38, scope: !535)
!538 = !DILocation(line: 199, column: 19, scope: !535)
!539 = !DILocation(line: 199, column: 17, scope: !535)
!540 = !DILocation(line: 200, column: 59, scope: !535)
!541 = !DILocation(line: 202, column: 19, scope: !542)
!542 = distinct !DILexicalBlock(scope: !535, file: !3, line: 201, column: 9)
!543 = !DILocation(line: 202, column: 11, scope: !542)
!544 = !DILocation(line: 205, column: 23, scope: !545)
!545 = distinct !DILexicalBlock(scope: !542, file: !3, line: 203, column: 13)
!546 = !DILocation(line: 206, column: 15, scope: !545)
!547 = !DILocation(line: 209, column: 23, scope: !545)
!548 = !DILocation(line: 210, column: 15, scope: !545)
!549 = !DILocation(line: 213, column: 23, scope: !545)
!550 = !DILocation(line: 214, column: 15, scope: !545)
!551 = !DILocation(line: 217, column: 23, scope: !545)
!552 = !DILocation(line: 218, column: 15, scope: !545)
!553 = !DILocation(line: 221, column: 23, scope: !545)
!554 = !DILocation(line: 222, column: 15, scope: !545)
!555 = !DILocation(line: 225, column: 23, scope: !545)
!556 = !DILocation(line: 226, column: 15, scope: !545)
!557 = !DILocation(line: 229, column: 23, scope: !545)
!558 = !DILocation(line: 230, column: 15, scope: !545)
!559 = !DILocation(line: 233, column: 23, scope: !545)
!560 = !DILocation(line: 234, column: 15, scope: !545)
!561 = !DILocation(line: 237, column: 23, scope: !545)
!562 = !DILocation(line: 238, column: 15, scope: !545)
!563 = !DILocation(line: 240, column: 13, scope: !545)
!564 = !DILocation(line: 242, column: 13, scope: !545)
!565 = !DILocation(line: 245, column: 15, scope: !545)
!566 = distinct !{!566, !534, !567}
!567 = !DILocation(line: 247, column: 9, scope: !535)
!568 = !DILocation(line: 250, column: 7, scope: !569)
!569 = distinct !DILexicalBlock(scope: !505, file: !3, line: 250, column: 7)
!570 = !DILocation(line: 250, column: 15, scope: !569)
!571 = !DILocation(line: 250, column: 12, scope: !569)
!572 = !DILocation(line: 250, column: 7, scope: !505)
!573 = !DILocation(line: 252, column: 20, scope: !574)
!574 = distinct !DILexicalBlock(scope: !569, file: !3, line: 251, column: 5)
!575 = !DILocation(line: 252, column: 50, scope: !574)
!576 = !DILocation(line: 252, column: 55, scope: !574)
!577 = !DILocation(line: 252, column: 43, scope: !574)
!578 = !DILocation(line: 252, column: 7, scope: !574)
!579 = !DILocation(line: 253, column: 7, scope: !574)
!580 = !DILocation(line: 256, column: 10, scope: !505)
!581 = !DILocation(line: 256, column: 3, scope: !505)
!582 = !DILocalVariable(name: "argc", arg: 1, scope: !583, file: !3, line: 175, type: !6)
!583 = distinct !DISubprogram(name: "decode_switches", scope: !3, file: !3, line: 175, type: !4, scopeLine: 176, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !584, retainedNodes: !11)
!584 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !12, globals: !585, nameTableKind: None)
!585 = !{!586, !589, !599, !602}
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "unknown", scope: !588, file: !3, line: 262, type: !42, isLocal: true, isDefinition: true)
!588 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 260, type: !4, scopeLine: 261, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !584, retainedNodes: !11)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "arch_long_options", scope: !584, file: !3, line: 107, type: !591, isLocal: true, isDefinition: true)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !592, size: 768, elements: !29)
!592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !20, line: 50, size: 256, elements: !594)
!594 = !{!595, !596, !597, !598}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !593, file: !20, line: 52, baseType: !23, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !593, file: !20, line: 55, baseType: !6, size: 32, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !593, file: !20, line: 56, baseType: !27, size: 64, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !593, file: !20, line: 57, baseType: !6, size: 32, offset: 192)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "uname_long_options", scope: !584, file: !3, line: 89, type: !601, isLocal: true, isDefinition: true)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !592, size: 3584, elements: !34)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "printed", scope: !604, file: !3, line: 163, type: !41, isLocal: true, isDefinition: true)
!604 = distinct !DISubprogram(name: "print_element", scope: !3, file: !3, line: 161, type: !39, scopeLine: 162, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !584, retainedNodes: !11)
!605 = !DILocalVariable(name: "argv", arg: 2, scope: !583, file: !3, line: 175, type: !7)
!606 = !DILocalVariable(name: "c", scope: !583, file: !3, line: 177, type: !6)
!607 = !DILocalVariable(name: "toprint", scope: !583, file: !3, line: 178, type: !84)
!608 = !DILocalVariable(name: "element", arg: 1, scope: !38, file: !3, line: 161, type: !23)
!609 = !DILocation(line: 161, column: 28, scope: !38)
!610 = !DILocation(line: 164, column: 7, scope: !611)
!611 = distinct !DILexicalBlock(scope: !38, file: !3, line: 164, column: 7)
!612 = !DILocation(line: 164, column: 7, scope: !38)
!613 = !DILocation(line: 165, column: 5, scope: !611)
!614 = !DILocation(line: 166, column: 11, scope: !38)
!615 = !DILocation(line: 167, column: 3, scope: !38)
!616 = !DILocation(line: 168, column: 1, scope: !38)
!617 = !DILocalVariable(name: "element", arg: 1, scope: !618, file: !3, line: 161, type: !23)
!618 = distinct !DISubprogram(name: "print_element", scope: !3, file: !3, line: 161, type: !39, scopeLine: 162, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !619, retainedNodes: !11)
!619 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !12, globals: !620, nameTableKind: None)
!620 = !{!621, !624, !634, !637}
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "unknown", scope: !623, file: !3, line: 262, type: !42, isLocal: true, isDefinition: true)
!623 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 260, type: !4, scopeLine: 261, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !619, retainedNodes: !11)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(name: "arch_long_options", scope: !619, file: !3, line: 107, type: !626, isLocal: true, isDefinition: true)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !627, size: 768, elements: !29)
!627 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !628)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !20, line: 50, size: 256, elements: !629)
!629 = !{!630, !631, !632, !633}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !628, file: !20, line: 52, baseType: !23, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !628, file: !20, line: 55, baseType: !6, size: 32, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !628, file: !20, line: 56, baseType: !27, size: 64, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !628, file: !20, line: 57, baseType: !6, size: 32, offset: 192)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(name: "uname_long_options", scope: !619, file: !3, line: 89, type: !636, isLocal: true, isDefinition: true)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !627, size: 3584, elements: !34)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(name: "printed", scope: !618, file: !3, line: 163, type: !41, isLocal: true, isDefinition: true)
!639 = distinct !DISubprogram(name: "close_stdout", scope: !62, file: !62, line: 117, type: !640, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !11)
!640 = !DISubroutineType(types: !641)
!641 = !{null}
!642 = !DILocation(line: 119, column: 21, scope: !643)
!643 = distinct !DILexicalBlock(scope: !639, file: !62, line: 119, column: 7)
!644 = !DILocation(line: 119, column: 7, scope: !643)
!645 = !DILocation(line: 119, column: 29, scope: !643)
!646 = !DILocation(line: 120, column: 7, scope: !643)
!647 = !DILocation(line: 120, column: 12, scope: !643)
!648 = !DILocation(line: 120, column: 25, scope: !643)
!649 = !DILocation(line: 120, column: 28, scope: !643)
!650 = !DILocation(line: 120, column: 34, scope: !643)
!651 = !DILocation(line: 119, column: 7, scope: !639)
!652 = !DILocalVariable(name: "write_error", scope: !653, file: !62, line: 122, type: !23)
!653 = distinct !DILexicalBlock(scope: !643, file: !62, line: 121, column: 5)
!654 = !DILocation(line: 122, column: 19, scope: !653)
!655 = !DILocation(line: 122, column: 33, scope: !653)
!656 = !DILocation(line: 123, column: 11, scope: !657)
!657 = distinct !DILexicalBlock(scope: !653, file: !62, line: 123, column: 11)
!658 = !DILocation(line: 123, column: 11, scope: !653)
!659 = !DILocation(line: 124, column: 19, scope: !657)
!660 = !DILocation(line: 124, column: 52, scope: !657)
!661 = !DILocation(line: 124, column: 36, scope: !657)
!662 = !DILocation(line: 125, column: 16, scope: !657)
!663 = !DILocation(line: 124, column: 9, scope: !657)
!664 = !DILocation(line: 127, column: 19, scope: !657)
!665 = !DILocation(line: 127, column: 32, scope: !657)
!666 = !DILocation(line: 127, column: 9, scope: !657)
!667 = !DILocation(line: 129, column: 14, scope: !653)
!668 = !DILocation(line: 129, column: 7, scope: !653)
!669 = !DILocation(line: 134, column: 42, scope: !670)
!670 = distinct !DILexicalBlock(scope: !639, file: !62, line: 134, column: 7)
!671 = !DILocation(line: 134, column: 28, scope: !670)
!672 = !DILocation(line: 134, column: 50, scope: !670)
!673 = !DILocation(line: 134, column: 7, scope: !639)
!674 = !DILocation(line: 135, column: 12, scope: !670)
!675 = !DILocation(line: 135, column: 5, scope: !670)
!676 = !DILocation(line: 136, column: 1, scope: !639)
!677 = distinct !DISubprogram(name: "set_program_name", scope: !76, file: !76, line: 39, type: !39, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !72, retainedNodes: !11)
!678 = !DILocalVariable(name: "argv0", arg: 1, scope: !677, file: !76, line: 39, type: !23)
!679 = !DILocation(line: 39, column: 31, scope: !677)
!680 = !DILocalVariable(name: "slash", scope: !677, file: !76, line: 46, type: !23)
!681 = !DILocation(line: 46, column: 15, scope: !677)
!682 = !DILocalVariable(name: "base", scope: !677, file: !76, line: 47, type: !23)
!683 = !DILocation(line: 47, column: 15, scope: !677)
!684 = !DILocation(line: 51, column: 7, scope: !685)
!685 = distinct !DILexicalBlock(scope: !677, file: !76, line: 51, column: 7)
!686 = !DILocation(line: 51, column: 13, scope: !685)
!687 = !DILocation(line: 51, column: 7, scope: !677)
!688 = !DILocation(line: 55, column: 14, scope: !689)
!689 = distinct !DILexicalBlock(scope: !685, file: !76, line: 52, column: 5)
!690 = !DILocation(line: 54, column: 7, scope: !689)
!691 = !DILocation(line: 56, column: 7, scope: !689)
!692 = !DILocation(line: 59, column: 20, scope: !677)
!693 = !DILocation(line: 59, column: 11, scope: !677)
!694 = !DILocation(line: 59, column: 9, scope: !677)
!695 = !DILocation(line: 60, column: 11, scope: !677)
!696 = !DILocation(line: 60, column: 17, scope: !677)
!697 = !DILocation(line: 60, column: 27, scope: !677)
!698 = !DILocation(line: 60, column: 33, scope: !677)
!699 = !DILocation(line: 60, column: 39, scope: !677)
!700 = !DILocation(line: 60, column: 8, scope: !677)
!701 = !DILocation(line: 61, column: 7, scope: !702)
!702 = distinct !DILexicalBlock(scope: !677, file: !76, line: 61, column: 7)
!703 = !DILocation(line: 61, column: 14, scope: !702)
!704 = !DILocation(line: 61, column: 12, scope: !702)
!705 = !DILocation(line: 61, column: 20, scope: !702)
!706 = !DILocation(line: 61, column: 25, scope: !702)
!707 = !DILocation(line: 61, column: 37, scope: !702)
!708 = !DILocation(line: 61, column: 42, scope: !702)
!709 = !DILocation(line: 61, column: 28, scope: !702)
!710 = !DILocation(line: 61, column: 61, scope: !702)
!711 = !DILocation(line: 61, column: 7, scope: !677)
!712 = !DILocation(line: 63, column: 15, scope: !713)
!713 = distinct !DILexicalBlock(scope: !702, file: !76, line: 62, column: 5)
!714 = !DILocation(line: 63, column: 13, scope: !713)
!715 = !DILocation(line: 64, column: 20, scope: !716)
!716 = distinct !DILexicalBlock(scope: !713, file: !76, line: 64, column: 11)
!717 = !DILocation(line: 64, column: 11, scope: !716)
!718 = !DILocation(line: 64, column: 36, scope: !716)
!719 = !DILocation(line: 64, column: 11, scope: !713)
!720 = !DILocation(line: 66, column: 19, scope: !721)
!721 = distinct !DILexicalBlock(scope: !716, file: !76, line: 65, column: 9)
!722 = !DILocation(line: 66, column: 24, scope: !721)
!723 = !DILocation(line: 66, column: 17, scope: !721)
!724 = !DILocation(line: 70, column: 52, scope: !721)
!725 = !DILocation(line: 70, column: 41, scope: !721)
!726 = !DILocation(line: 72, column: 9, scope: !721)
!727 = !DILocation(line: 73, column: 5, scope: !713)
!728 = !DILocation(line: 84, column: 18, scope: !677)
!729 = !DILocation(line: 84, column: 16, scope: !677)
!730 = !DILocation(line: 90, column: 38, scope: !677)
!731 = !DILocation(line: 90, column: 27, scope: !677)
!732 = !DILocation(line: 92, column: 1, scope: !677)
!733 = !DILocalVariable(name: "argv0", arg: 1, scope: !734, file: !76, line: 39, type: !23)
!734 = distinct !DISubprogram(name: "set_program_name", scope: !76, file: !76, line: 39, type: !39, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !735, retainedNodes: !11)
!735 = distinct !DICompileUnit(language: DW_LANG_C99, file: !73, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !74, globals: !736, nameTableKind: None)
!736 = !{!737}
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "program_name", scope: !735, file: !76, line: 33, type: !23, isLocal: false, isDefinition: true)
!739 = !DILocalVariable(name: "slash", scope: !734, file: !76, line: 46, type: !23)
!740 = !DILocalVariable(name: "base", scope: !734, file: !76, line: 47, type: !23)
!741 = distinct !DISubprogram(name: "set_char_quoting", scope: !105, file: !105, line: 152, type: !742, scopeLine: 153, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !79, retainedNodes: !11)
!742 = !DISubroutineType(types: !743)
!743 = !{!6, !744, !9, !6}
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!745 = !DILocalVariable(name: "o", arg: 1, scope: !741, file: !105, line: 152, type: !744)
!746 = !DILocation(line: 152, column: 43, scope: !741)
!747 = !DILocalVariable(name: "c", arg: 2, scope: !741, file: !105, line: 152, type: !9)
!748 = !DILocation(line: 152, column: 51, scope: !741)
!749 = !DILocalVariable(name: "i", arg: 3, scope: !741, file: !105, line: 152, type: !6)
!750 = !DILocation(line: 152, column: 58, scope: !741)
!751 = !DILocalVariable(name: "uc", scope: !741, file: !105, line: 154, type: !167)
!752 = !DILocation(line: 154, column: 17, scope: !741)
!753 = !DILocation(line: 154, column: 22, scope: !741)
!754 = !DILocalVariable(name: "p", scope: !741, file: !105, line: 155, type: !755)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!756 = !DILocation(line: 155, column: 17, scope: !741)
!757 = !DILocation(line: 156, column: 6, scope: !741)
!758 = !DILocation(line: 156, column: 10, scope: !741)
!759 = !DILocation(line: 156, column: 41, scope: !741)
!760 = !DILocation(line: 156, column: 5, scope: !741)
!761 = !DILocation(line: 156, column: 59, scope: !741)
!762 = !DILocation(line: 156, column: 62, scope: !741)
!763 = !DILocation(line: 156, column: 57, scope: !741)
!764 = !DILocalVariable(name: "shift", scope: !741, file: !105, line: 157, type: !6)
!765 = !DILocation(line: 157, column: 7, scope: !741)
!766 = !DILocation(line: 157, column: 15, scope: !741)
!767 = !DILocation(line: 157, column: 18, scope: !741)
!768 = !DILocalVariable(name: "r", scope: !741, file: !105, line: 158, type: !6)
!769 = !DILocation(line: 158, column: 7, scope: !741)
!770 = !DILocation(line: 158, column: 13, scope: !741)
!771 = !DILocation(line: 158, column: 12, scope: !741)
!772 = !DILocation(line: 158, column: 18, scope: !741)
!773 = !DILocation(line: 158, column: 15, scope: !741)
!774 = !DILocation(line: 158, column: 25, scope: !741)
!775 = !DILocation(line: 159, column: 11, scope: !741)
!776 = !DILocation(line: 159, column: 13, scope: !741)
!777 = !DILocation(line: 159, column: 20, scope: !741)
!778 = !DILocation(line: 159, column: 18, scope: !741)
!779 = !DILocation(line: 159, column: 26, scope: !741)
!780 = !DILocation(line: 159, column: 23, scope: !741)
!781 = !DILocation(line: 159, column: 4, scope: !741)
!782 = !DILocation(line: 159, column: 6, scope: !741)
!783 = !DILocation(line: 160, column: 10, scope: !741)
!784 = !DILocation(line: 160, column: 3, scope: !741)
!785 = !DILocalVariable(name: "o", arg: 1, scope: !786, file: !105, line: 152, type: !789)
!786 = distinct !DISubprogram(name: "set_char_quoting", scope: !105, file: !105, line: 152, type: !787, scopeLine: 153, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !797, retainedNodes: !11)
!787 = !DISubroutineType(types: !788)
!788 = !{!6, !789, !9, !6}
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !105, line: 65, size: 448, elements: !791)
!791 = !{!792, !793, !794, !795, !796}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !790, file: !105, line: 68, baseType: !82, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !790, file: !105, line: 71, baseType: !6, size: 32, offset: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !790, file: !105, line: 75, baseType: !123, size: 256, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !790, file: !105, line: 78, baseType: !23, size: 64, offset: 320)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !790, file: !105, line: 81, baseType: !23, size: 64, offset: 384)
!797 = distinct !DICompileUnit(language: DW_LANG_C99, file: !80, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !81, retainedTypes: !97, globals: !798, nameTableKind: None)
!798 = !{!799, !801, !803, !805, !807, !809, !816, !818}
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !797, file: !105, line: 85, type: !106, isLocal: false, isDefinition: true)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !797, file: !105, line: 101, type: !112, isLocal: false, isDefinition: true)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !797, file: !105, line: 1052, type: !790, isLocal: false, isDefinition: true)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !797, file: !105, line: 116, type: !790, isLocal: true, isDefinition: true)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(name: "slot0", scope: !797, file: !105, line: 842, type: !128, isLocal: true, isDefinition: true)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "slotvec", scope: !797, file: !105, line: 845, type: !811, isLocal: true, isDefinition: true)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !105, line: 834, size: 128, elements: !813)
!813 = !{!814, !815}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !812, file: !105, line: 836, baseType: !99, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !812, file: !105, line: 837, baseType: !8, size: 64, offset: 64)
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(name: "nslots", scope: !797, file: !105, line: 843, type: !6, isLocal: true, isDefinition: true)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(name: "slotvec0", scope: !797, file: !105, line: 844, type: !812, isLocal: true, isDefinition: true)
!820 = !DILocalVariable(name: "c", arg: 2, scope: !786, file: !105, line: 152, type: !9)
!821 = !DILocalVariable(name: "i", arg: 3, scope: !786, file: !105, line: 152, type: !6)
!822 = !DILocalVariable(name: "uc", scope: !786, file: !105, line: 154, type: !167)
!823 = !DILocalVariable(name: "p", scope: !786, file: !105, line: 155, type: !755)
!824 = !DILocalVariable(name: "shift", scope: !825, file: !105, line: 157, type: !6)
!825 = distinct !DISubprogram(name: "set_char_quoting", scope: !105, file: !105, line: 152, type: !826, scopeLine: 153, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !836, retainedNodes: !11)
!826 = !DISubroutineType(types: !827)
!827 = !{!6, !828, !9, !6}
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !105, line: 65, size: 448, elements: !830)
!830 = !{!831, !832, !833, !834, !835}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !829, file: !105, line: 68, baseType: !82, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !829, file: !105, line: 71, baseType: !6, size: 32, offset: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !829, file: !105, line: 75, baseType: !123, size: 256, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !829, file: !105, line: 78, baseType: !23, size: 64, offset: 320)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !829, file: !105, line: 81, baseType: !23, size: 64, offset: 384)
!836 = distinct !DICompileUnit(language: DW_LANG_C99, file: !80, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !81, retainedTypes: !97, globals: !837, nameTableKind: None)
!837 = !{!838, !840, !842, !844, !846, !848, !855, !857}
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !836, file: !105, line: 85, type: !106, isLocal: false, isDefinition: true)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !836, file: !105, line: 101, type: !112, isLocal: false, isDefinition: true)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !836, file: !105, line: 1052, type: !829, isLocal: false, isDefinition: true)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !836, file: !105, line: 116, type: !829, isLocal: true, isDefinition: true)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(name: "slot0", scope: !836, file: !105, line: 842, type: !128, isLocal: true, isDefinition: true)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(name: "slotvec", scope: !836, file: !105, line: 845, type: !850, isLocal: true, isDefinition: true)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !105, line: 834, size: 128, elements: !852)
!852 = !{!853, !854}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !851, file: !105, line: 836, baseType: !99, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !851, file: !105, line: 837, baseType: !8, size: 64, offset: 64)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(name: "nslots", scope: !836, file: !105, line: 843, type: !6, isLocal: true, isDefinition: true)
!857 = !DIGlobalVariableExpression(var: !858, expr: !DIExpression())
!858 = distinct !DIGlobalVariable(name: "slotvec0", scope: !836, file: !105, line: 844, type: !851, isLocal: true, isDefinition: true)
!859 = !DILocalVariable(name: "r", scope: !825, file: !105, line: 158, type: !6)
!860 = distinct !DISubprogram(name: "quotearg_char_mem", scope: !105, file: !105, line: 982, type: !861, scopeLine: 983, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !79, retainedNodes: !11)
!861 = !DISubroutineType(types: !862)
!862 = !{!8, !23, !99, !9}
!863 = !DILocalVariable(name: "arg", arg: 1, scope: !860, file: !105, line: 982, type: !23)
!864 = !DILocation(line: 982, column: 32, scope: !860)
!865 = !DILocalVariable(name: "argsize", arg: 2, scope: !860, file: !105, line: 982, type: !99)
!866 = !DILocation(line: 982, column: 44, scope: !860)
!867 = !DILocalVariable(name: "ch", arg: 3, scope: !860, file: !105, line: 982, type: !9)
!868 = !DILocation(line: 982, column: 58, scope: !860)
!869 = !DILocalVariable(name: "options", scope: !860, file: !105, line: 984, type: !118)
!870 = !DILocation(line: 984, column: 26, scope: !860)
!871 = !DILocation(line: 985, column: 13, scope: !860)
!872 = !DILocation(line: 986, column: 31, scope: !860)
!873 = !DILocation(line: 986, column: 3, scope: !860)
!874 = !DILocation(line: 987, column: 33, scope: !860)
!875 = !DILocation(line: 987, column: 38, scope: !860)
!876 = !DILocation(line: 987, column: 10, scope: !860)
!877 = !DILocation(line: 987, column: 3, scope: !860)
!878 = !DILocalVariable(name: "arg", arg: 1, scope: !879, file: !105, line: 982, type: !23)
!879 = distinct !DISubprogram(name: "quotearg_char_mem", scope: !105, file: !105, line: 982, type: !861, scopeLine: 983, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !880, retainedNodes: !11)
!880 = distinct !DICompileUnit(language: DW_LANG_C99, file: !80, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !81, retainedTypes: !97, globals: !881, nameTableKind: None)
!881 = !{!882, !884, !886, !895, !897, !899, !906, !908}
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !880, file: !105, line: 85, type: !106, isLocal: false, isDefinition: true)
!884 = !DIGlobalVariableExpression(var: !885, expr: !DIExpression())
!885 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !880, file: !105, line: 101, type: !112, isLocal: false, isDefinition: true)
!886 = !DIGlobalVariableExpression(var: !887, expr: !DIExpression())
!887 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !880, file: !105, line: 1052, type: !888, isLocal: false, isDefinition: true)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !105, line: 65, size: 448, elements: !889)
!889 = !{!890, !891, !892, !893, !894}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !888, file: !105, line: 68, baseType: !82, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !888, file: !105, line: 71, baseType: !6, size: 32, offset: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !888, file: !105, line: 75, baseType: !123, size: 256, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !888, file: !105, line: 78, baseType: !23, size: 64, offset: 320)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !888, file: !105, line: 81, baseType: !23, size: 64, offset: 384)
!895 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression())
!896 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !880, file: !105, line: 116, type: !888, isLocal: true, isDefinition: true)
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(name: "slot0", scope: !880, file: !105, line: 842, type: !128, isLocal: true, isDefinition: true)
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(name: "slotvec", scope: !880, file: !105, line: 845, type: !901, isLocal: true, isDefinition: true)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !105, line: 834, size: 128, elements: !903)
!903 = !{!904, !905}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !902, file: !105, line: 836, baseType: !99, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !902, file: !105, line: 837, baseType: !8, size: 64, offset: 64)
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(name: "nslots", scope: !880, file: !105, line: 843, type: !6, isLocal: true, isDefinition: true)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(name: "slotvec0", scope: !880, file: !105, line: 844, type: !902, isLocal: true, isDefinition: true)
!910 = !DILocalVariable(name: "argsize", arg: 2, scope: !879, file: !105, line: 982, type: !99)
!911 = !DILocalVariable(name: "ch", arg: 3, scope: !879, file: !105, line: 982, type: !9)
!912 = !DILocalVariable(name: "options", scope: !879, file: !105, line: 984, type: !888)
!913 = distinct !DISubprogram(name: "quotearg_n_options", scope: !105, file: !105, line: 877, type: !914, scopeLine: 879, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !79, retainedNodes: !11)
!914 = !DISubroutineType(types: !915)
!915 = !{!8, !6, !23, !99, !916}
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!918 = !DILocalVariable(name: "n", arg: 1, scope: !913, file: !105, line: 877, type: !6)
!919 = !DILocation(line: 877, column: 25, scope: !913)
!920 = !DILocalVariable(name: "arg", arg: 2, scope: !913, file: !105, line: 877, type: !23)
!921 = !DILocation(line: 877, column: 40, scope: !913)
!922 = !DILocalVariable(name: "argsize", arg: 3, scope: !913, file: !105, line: 877, type: !99)
!923 = !DILocation(line: 877, column: 52, scope: !913)
!924 = !DILocalVariable(name: "options", arg: 4, scope: !913, file: !105, line: 878, type: !916)
!925 = !DILocation(line: 878, column: 51, scope: !913)
!926 = !DILocalVariable(name: "e", scope: !913, file: !105, line: 880, type: !6)
!927 = !DILocation(line: 880, column: 7, scope: !913)
!928 = !DILocation(line: 880, column: 11, scope: !913)
!929 = !DILocalVariable(name: "sv", scope: !913, file: !105, line: 882, type: !133)
!930 = !DILocation(line: 882, column: 19, scope: !913)
!931 = !DILocation(line: 882, column: 24, scope: !913)
!932 = !DILocation(line: 884, column: 7, scope: !933)
!933 = distinct !DILexicalBlock(scope: !913, file: !105, line: 884, column: 7)
!934 = !DILocation(line: 884, column: 9, scope: !933)
!935 = !DILocation(line: 884, column: 7, scope: !913)
!936 = !DILocation(line: 885, column: 5, scope: !933)
!937 = !DILocation(line: 887, column: 7, scope: !938)
!938 = distinct !DILexicalBlock(scope: !913, file: !105, line: 887, column: 7)
!939 = !DILocation(line: 887, column: 17, scope: !938)
!940 = !DILocation(line: 887, column: 14, scope: !938)
!941 = !DILocation(line: 887, column: 7, scope: !913)
!942 = !DILocalVariable(name: "preallocated", scope: !943, file: !105, line: 889, type: !41)
!943 = distinct !DILexicalBlock(scope: !938, file: !105, line: 888, column: 5)
!944 = !DILocation(line: 889, column: 12, scope: !943)
!945 = !DILocation(line: 889, column: 28, scope: !943)
!946 = !DILocation(line: 889, column: 31, scope: !943)
!947 = !DILocalVariable(name: "nmax", scope: !943, file: !105, line: 890, type: !6)
!948 = !DILocation(line: 890, column: 11, scope: !943)
!949 = !DILocation(line: 892, column: 11, scope: !950)
!950 = distinct !DILexicalBlock(scope: !943, file: !105, line: 892, column: 11)
!951 = !DILocation(line: 892, column: 18, scope: !950)
!952 = !DILocation(line: 892, column: 16, scope: !950)
!953 = !DILocation(line: 892, column: 11, scope: !943)
!954 = !DILocation(line: 893, column: 9, scope: !950)
!955 = !DILocation(line: 895, column: 32, scope: !943)
!956 = !DILocation(line: 895, column: 54, scope: !943)
!957 = !DILocation(line: 895, column: 59, scope: !943)
!958 = !DILocation(line: 895, column: 61, scope: !943)
!959 = !DILocation(line: 895, column: 58, scope: !943)
!960 = !DILocation(line: 895, column: 66, scope: !943)
!961 = !DILocation(line: 895, column: 22, scope: !943)
!962 = !DILocation(line: 895, column: 20, scope: !943)
!963 = !DILocation(line: 895, column: 15, scope: !943)
!964 = !DILocation(line: 896, column: 11, scope: !965)
!965 = distinct !DILexicalBlock(scope: !943, file: !105, line: 896, column: 11)
!966 = !DILocation(line: 896, column: 11, scope: !943)
!967 = !DILocation(line: 897, column: 10, scope: !965)
!968 = !DILocation(line: 897, column: 15, scope: !965)
!969 = !DILocation(line: 897, column: 9, scope: !965)
!970 = !DILocation(line: 898, column: 15, scope: !943)
!971 = !DILocation(line: 898, column: 20, scope: !943)
!972 = !DILocation(line: 898, column: 18, scope: !943)
!973 = !DILocation(line: 898, column: 7, scope: !943)
!974 = !DILocation(line: 898, column: 32, scope: !943)
!975 = !DILocation(line: 898, column: 34, scope: !943)
!976 = !DILocation(line: 898, column: 40, scope: !943)
!977 = !DILocation(line: 898, column: 38, scope: !943)
!978 = !DILocation(line: 898, column: 31, scope: !943)
!979 = !DILocation(line: 898, column: 48, scope: !943)
!980 = !DILocation(line: 899, column: 16, scope: !943)
!981 = !DILocation(line: 899, column: 18, scope: !943)
!982 = !DILocation(line: 899, column: 14, scope: !943)
!983 = !DILocation(line: 900, column: 5, scope: !943)
!984 = !DILocalVariable(name: "size", scope: !985, file: !105, line: 903, type: !99)
!985 = distinct !DILexicalBlock(scope: !913, file: !105, line: 902, column: 3)
!986 = !DILocation(line: 903, column: 12, scope: !985)
!987 = !DILocation(line: 903, column: 19, scope: !985)
!988 = !DILocation(line: 903, column: 22, scope: !985)
!989 = !DILocation(line: 903, column: 25, scope: !985)
!990 = !DILocalVariable(name: "val", scope: !985, file: !105, line: 904, type: !8)
!991 = !DILocation(line: 904, column: 11, scope: !985)
!992 = !DILocation(line: 904, column: 17, scope: !985)
!993 = !DILocation(line: 904, column: 20, scope: !985)
!994 = !DILocation(line: 904, column: 23, scope: !985)
!995 = !DILocalVariable(name: "flags", scope: !985, file: !105, line: 906, type: !6)
!996 = !DILocation(line: 906, column: 9, scope: !985)
!997 = !DILocation(line: 906, column: 17, scope: !985)
!998 = !DILocation(line: 906, column: 26, scope: !985)
!999 = !DILocation(line: 906, column: 32, scope: !985)
!1000 = !DILocalVariable(name: "qsize", scope: !985, file: !105, line: 907, type: !99)
!1001 = !DILocation(line: 907, column: 12, scope: !985)
!1002 = !DILocation(line: 907, column: 46, scope: !985)
!1003 = !DILocation(line: 907, column: 51, scope: !985)
!1004 = !DILocation(line: 907, column: 57, scope: !985)
!1005 = !DILocation(line: 907, column: 62, scope: !985)
!1006 = !DILocation(line: 908, column: 46, scope: !985)
!1007 = !DILocation(line: 908, column: 55, scope: !985)
!1008 = !DILocation(line: 908, column: 62, scope: !985)
!1009 = !DILocation(line: 909, column: 46, scope: !985)
!1010 = !DILocation(line: 909, column: 55, scope: !985)
!1011 = !DILocation(line: 910, column: 46, scope: !985)
!1012 = !DILocation(line: 910, column: 55, scope: !985)
!1013 = !DILocation(line: 911, column: 46, scope: !985)
!1014 = !DILocation(line: 911, column: 55, scope: !985)
!1015 = !DILocation(line: 907, column: 20, scope: !985)
!1016 = !DILocation(line: 913, column: 9, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !985, file: !105, line: 913, column: 9)
!1018 = !DILocation(line: 913, column: 17, scope: !1017)
!1019 = !DILocation(line: 913, column: 14, scope: !1017)
!1020 = !DILocation(line: 913, column: 9, scope: !985)
!1021 = !DILocation(line: 915, column: 29, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1017, file: !105, line: 914, column: 7)
!1023 = !DILocation(line: 915, column: 35, scope: !1022)
!1024 = !DILocation(line: 915, column: 27, scope: !1022)
!1025 = !DILocation(line: 915, column: 9, scope: !1022)
!1026 = !DILocation(line: 915, column: 12, scope: !1022)
!1027 = !DILocation(line: 915, column: 15, scope: !1022)
!1028 = !DILocation(line: 915, column: 20, scope: !1022)
!1029 = !DILocation(line: 916, column: 13, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !1022, file: !105, line: 916, column: 13)
!1031 = !DILocation(line: 916, column: 17, scope: !1030)
!1032 = !DILocation(line: 916, column: 13, scope: !1022)
!1033 = !DILocation(line: 917, column: 17, scope: !1030)
!1034 = !DILocation(line: 917, column: 11, scope: !1030)
!1035 = !DILocation(line: 918, column: 39, scope: !1022)
!1036 = !DILocation(line: 918, column: 27, scope: !1022)
!1037 = !DILocation(line: 918, column: 25, scope: !1022)
!1038 = !DILocation(line: 918, column: 9, scope: !1022)
!1039 = !DILocation(line: 918, column: 12, scope: !1022)
!1040 = !DILocation(line: 918, column: 15, scope: !1022)
!1041 = !DILocation(line: 918, column: 19, scope: !1022)
!1042 = !DILocation(line: 919, column: 35, scope: !1022)
!1043 = !DILocation(line: 919, column: 40, scope: !1022)
!1044 = !DILocation(line: 919, column: 46, scope: !1022)
!1045 = !DILocation(line: 919, column: 51, scope: !1022)
!1046 = !DILocation(line: 919, column: 60, scope: !1022)
!1047 = !DILocation(line: 919, column: 69, scope: !1022)
!1048 = !DILocation(line: 920, column: 35, scope: !1022)
!1049 = !DILocation(line: 920, column: 42, scope: !1022)
!1050 = !DILocation(line: 920, column: 51, scope: !1022)
!1051 = !DILocation(line: 921, column: 35, scope: !1022)
!1052 = !DILocation(line: 921, column: 44, scope: !1022)
!1053 = !DILocation(line: 922, column: 35, scope: !1022)
!1054 = !DILocation(line: 922, column: 44, scope: !1022)
!1055 = !DILocation(line: 919, column: 9, scope: !1022)
!1056 = !DILocation(line: 923, column: 7, scope: !1022)
!1057 = !DILocation(line: 925, column: 13, scope: !985)
!1058 = !DILocation(line: 925, column: 5, scope: !985)
!1059 = !DILocation(line: 925, column: 11, scope: !985)
!1060 = !DILocation(line: 926, column: 12, scope: !985)
!1061 = !DILocation(line: 926, column: 5, scope: !985)
!1062 = !DILocalVariable(name: "n", arg: 1, scope: !1063, file: !105, line: 877, type: !6)
!1063 = distinct !DISubprogram(name: "quotearg_n_options", scope: !105, file: !105, line: 877, type: !1064, scopeLine: 879, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1075, retainedNodes: !11)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!8, !6, !23, !99, !1066}
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1068)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !105, line: 65, size: 448, elements: !1069)
!1069 = !{!1070, !1071, !1072, !1073, !1074}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1068, file: !105, line: 68, baseType: !82, size: 32)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1068, file: !105, line: 71, baseType: !6, size: 32, offset: 32)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1068, file: !105, line: 75, baseType: !123, size: 256, offset: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1068, file: !105, line: 78, baseType: !23, size: 64, offset: 320)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1068, file: !105, line: 81, baseType: !23, size: 64, offset: 384)
!1075 = distinct !DICompileUnit(language: DW_LANG_C99, file: !80, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !81, retainedTypes: !97, globals: !1076, nameTableKind: None)
!1076 = !{!1077, !1079, !1081, !1083, !1085, !1087, !1094, !1096}
!1077 = !DIGlobalVariableExpression(var: !1078, expr: !DIExpression())
!1078 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1075, file: !105, line: 85, type: !106, isLocal: false, isDefinition: true)
!1079 = !DIGlobalVariableExpression(var: !1080, expr: !DIExpression())
!1080 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1075, file: !105, line: 101, type: !112, isLocal: false, isDefinition: true)
!1081 = !DIGlobalVariableExpression(var: !1082, expr: !DIExpression())
!1082 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1075, file: !105, line: 1052, type: !1068, isLocal: false, isDefinition: true)
!1083 = !DIGlobalVariableExpression(var: !1084, expr: !DIExpression())
!1084 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1075, file: !105, line: 116, type: !1068, isLocal: true, isDefinition: true)
!1085 = !DIGlobalVariableExpression(var: !1086, expr: !DIExpression())
!1086 = distinct !DIGlobalVariable(name: "slot0", scope: !1075, file: !105, line: 842, type: !128, isLocal: true, isDefinition: true)
!1087 = !DIGlobalVariableExpression(var: !1088, expr: !DIExpression())
!1088 = distinct !DIGlobalVariable(name: "slotvec", scope: !1075, file: !105, line: 845, type: !1089, isLocal: true, isDefinition: true)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !105, line: 834, size: 128, elements: !1091)
!1091 = !{!1092, !1093}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1090, file: !105, line: 836, baseType: !99, size: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1090, file: !105, line: 837, baseType: !8, size: 64, offset: 64)
!1094 = !DIGlobalVariableExpression(var: !1095, expr: !DIExpression())
!1095 = distinct !DIGlobalVariable(name: "nslots", scope: !1075, file: !105, line: 843, type: !6, isLocal: true, isDefinition: true)
!1096 = !DIGlobalVariableExpression(var: !1097, expr: !DIExpression())
!1097 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1075, file: !105, line: 844, type: !1090, isLocal: true, isDefinition: true)
!1098 = !DILocalVariable(name: "arg", arg: 2, scope: !1063, file: !105, line: 877, type: !23)
!1099 = !DILocalVariable(name: "argsize", arg: 3, scope: !1063, file: !105, line: 877, type: !99)
!1100 = !DILocalVariable(name: "options", arg: 4, scope: !1063, file: !105, line: 878, type: !1066)
!1101 = !DILocalVariable(name: "e", scope: !1063, file: !105, line: 880, type: !6)
!1102 = !DILocalVariable(name: "sv", scope: !1063, file: !105, line: 882, type: !1089)
!1103 = !DILocalVariable(name: "nmax", scope: !1104, file: !105, line: 890, type: !6)
!1104 = distinct !DILexicalBlock(scope: !1105, file: !105, line: 888, column: 5)
!1105 = distinct !DILexicalBlock(scope: !1106, file: !105, line: 887, column: 7)
!1106 = distinct !DISubprogram(name: "quotearg_n_options", scope: !105, file: !105, line: 877, type: !1107, scopeLine: 879, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1118, retainedNodes: !11)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!8, !6, !23, !99, !1109}
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1111)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !105, line: 65, size: 448, elements: !1112)
!1112 = !{!1113, !1114, !1115, !1116, !1117}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1111, file: !105, line: 68, baseType: !82, size: 32)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1111, file: !105, line: 71, baseType: !6, size: 32, offset: 32)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1111, file: !105, line: 75, baseType: !123, size: 256, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1111, file: !105, line: 78, baseType: !23, size: 64, offset: 320)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1111, file: !105, line: 81, baseType: !23, size: 64, offset: 384)
!1118 = distinct !DICompileUnit(language: DW_LANG_C99, file: !80, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !81, retainedTypes: !97, globals: !1119, nameTableKind: None)
!1119 = !{!1120, !1122, !1124, !1126, !1128, !1130, !1137, !1139}
!1120 = !DIGlobalVariableExpression(var: !1121, expr: !DIExpression())
!1121 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1118, file: !105, line: 85, type: !106, isLocal: false, isDefinition: true)
!1122 = !DIGlobalVariableExpression(var: !1123, expr: !DIExpression())
!1123 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1118, file: !105, line: 101, type: !112, isLocal: false, isDefinition: true)
!1124 = !DIGlobalVariableExpression(var: !1125, expr: !DIExpression())
!1125 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1118, file: !105, line: 1052, type: !1111, isLocal: false, isDefinition: true)
!1126 = !DIGlobalVariableExpression(var: !1127, expr: !DIExpression())
!1127 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1118, file: !105, line: 116, type: !1111, isLocal: true, isDefinition: true)
!1128 = !DIGlobalVariableExpression(var: !1129, expr: !DIExpression())
!1129 = distinct !DIGlobalVariable(name: "slot0", scope: !1118, file: !105, line: 842, type: !128, isLocal: true, isDefinition: true)
!1130 = !DIGlobalVariableExpression(var: !1131, expr: !DIExpression())
!1131 = distinct !DIGlobalVariable(name: "slotvec", scope: !1118, file: !105, line: 845, type: !1132, isLocal: true, isDefinition: true)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !105, line: 834, size: 128, elements: !1134)
!1134 = !{!1135, !1136}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1133, file: !105, line: 836, baseType: !99, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1133, file: !105, line: 837, baseType: !8, size: 64, offset: 64)
!1137 = !DIGlobalVariableExpression(var: !1138, expr: !DIExpression())
!1138 = distinct !DIGlobalVariable(name: "nslots", scope: !1118, file: !105, line: 843, type: !6, isLocal: true, isDefinition: true)
!1139 = !DIGlobalVariableExpression(var: !1140, expr: !DIExpression())
!1140 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1118, file: !105, line: 844, type: !1133, isLocal: true, isDefinition: true)
!1141 = !DILocalVariable(name: "val", scope: !1142, file: !105, line: 904, type: !8)
!1142 = distinct !DILexicalBlock(scope: !1143, file: !105, line: 902, column: 3)
!1143 = distinct !DISubprogram(name: "quotearg_n_options", scope: !105, file: !105, line: 877, type: !1144, scopeLine: 879, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1155, retainedNodes: !11)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!8, !6, !23, !99, !1146}
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1148)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !105, line: 65, size: 448, elements: !1149)
!1149 = !{!1150, !1151, !1152, !1153, !1154}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1148, file: !105, line: 68, baseType: !82, size: 32)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1148, file: !105, line: 71, baseType: !6, size: 32, offset: 32)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1148, file: !105, line: 75, baseType: !123, size: 256, offset: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1148, file: !105, line: 78, baseType: !23, size: 64, offset: 320)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1148, file: !105, line: 81, baseType: !23, size: 64, offset: 384)
!1155 = distinct !DICompileUnit(language: DW_LANG_C99, file: !80, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !81, retainedTypes: !97, globals: !1156, nameTableKind: None)
!1156 = !{!1157, !1159, !1161, !1163, !1165, !1167, !1174, !1176}
!1157 = !DIGlobalVariableExpression(var: !1158, expr: !DIExpression())
!1158 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1155, file: !105, line: 85, type: !106, isLocal: false, isDefinition: true)
!1159 = !DIGlobalVariableExpression(var: !1160, expr: !DIExpression())
!1160 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1155, file: !105, line: 101, type: !112, isLocal: false, isDefinition: true)
!1161 = !DIGlobalVariableExpression(var: !1162, expr: !DIExpression())
!1162 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1155, file: !105, line: 1052, type: !1148, isLocal: false, isDefinition: true)
!1163 = !DIGlobalVariableExpression(var: !1164, expr: !DIExpression())
!1164 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1155, file: !105, line: 116, type: !1148, isLocal: true, isDefinition: true)
!1165 = !DIGlobalVariableExpression(var: !1166, expr: !DIExpression())
!1166 = distinct !DIGlobalVariable(name: "slot0", scope: !1155, file: !105, line: 842, type: !128, isLocal: true, isDefinition: true)
!1167 = !DIGlobalVariableExpression(var: !1168, expr: !DIExpression())
!1168 = distinct !DIGlobalVariable(name: "slotvec", scope: !1155, file: !105, line: 845, type: !1169, isLocal: true, isDefinition: true)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !105, line: 834, size: 128, elements: !1171)
!1171 = !{!1172, !1173}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1170, file: !105, line: 836, baseType: !99, size: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1170, file: !105, line: 837, baseType: !8, size: 64, offset: 64)
!1174 = !DIGlobalVariableExpression(var: !1175, expr: !DIExpression())
!1175 = distinct !DIGlobalVariable(name: "nslots", scope: !1155, file: !105, line: 843, type: !6, isLocal: true, isDefinition: true)
!1176 = !DIGlobalVariableExpression(var: !1177, expr: !DIExpression())
!1177 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1155, file: !105, line: 844, type: !1170, isLocal: true, isDefinition: true)
!1178 = !DILocalVariable(name: "flags", scope: !1142, file: !105, line: 906, type: !6)
!1179 = !DILocalVariable(name: "qsize", scope: !1142, file: !105, line: 907, type: !99)
!1180 = distinct !DISubprogram(name: "quotearg_buffer_restyled", scope: !105, file: !105, line: 256, type: !1181, scopeLine: 262, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !79, retainedNodes: !11)
!1181 = !DISubroutineType(types: !1182)
!1182 = !{!99, !8, !99, !23, !99, !82, !6, !1183, !23, !23}
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!1185 = !DILocalVariable(name: "buffer", arg: 1, scope: !1180, file: !105, line: 256, type: !8)
!1186 = !DILocation(line: 256, column: 33, scope: !1180)
!1187 = !DILocalVariable(name: "buffersize", arg: 2, scope: !1180, file: !105, line: 256, type: !99)
!1188 = !DILocation(line: 256, column: 48, scope: !1180)
!1189 = !DILocalVariable(name: "arg", arg: 3, scope: !1180, file: !105, line: 257, type: !23)
!1190 = !DILocation(line: 257, column: 39, scope: !1180)
!1191 = !DILocalVariable(name: "argsize", arg: 4, scope: !1180, file: !105, line: 257, type: !99)
!1192 = !DILocation(line: 257, column: 51, scope: !1180)
