; ModuleID = '<stdin>'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.utsname = type { [65 x i8], [65 x i8], [65 x i8], [65 x i8], [65 x i8], [65 x i8] }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external dso_local global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [23 x i8] c"Usage: %s [OPTION]...\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "unknown", scope: !2, file: !3, line: 262, type: !42, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 260, type: !4, scopeLine: 261, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !11)
!3 = !DIFile(filename: "src/uname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !6, !7}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!10 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !12, globals: !14, nameTableKind: None)
!11 = !{}
!12 = !{!8, !13}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!14 = !{!0, !15, !31, !36}
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "arch_long_options", scope: !10, file: !3, line: 107, type: !17, isLocal: true, isDefinition: true)
!17 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 768, elements: !29)
!18 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !20, line: 50, size: 256, elements: !21)
!20 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "")
!21 = !{!22, !25, !26, !28}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !19, file: !20, line: 52, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !19, file: !20, line: 55, baseType: !6, size: 32, offset: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !19, file: !20, line: 56, baseType: !27, size: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !19, file: !20, line: 57, baseType: !6, size: 32, offset: 192)
!29 = !{!30}
!30 = !DISubrange(count: 3)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "uname_long_options", scope: !10, file: !3, line: 89, type: !33, isLocal: true, isDefinition: true)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 3584, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 14)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "printed", scope: !38, file: !3, line: 163, type: !41, isLocal: true, isDefinition: true)
!38 = distinct !DISubprogram(name: "print_element", scope: !3, file: !3, line: 161, type: !39, scopeLine: 162, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10, retainedNodes: !11)
!39 = !DISubroutineType(types: !40)
!40 = !{null, !23}
!41 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 64, elements: !43)
!43 = !{!44}
!44 = !DISubrange(count: 8)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "uname_mode", scope: !47, file: !48, line: 2, type: !6, isLocal: false, isDefinition: true)
!47 = distinct !DICompileUnit(language: DW_LANG_C99, file: !48, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, globals: !49, nameTableKind: None)
!48 = !DIFile(filename: "src/uname-uname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!49 = !{!45}
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "Version", scope: !52, file: !53, line: 2, type: !23, isLocal: false, isDefinition: true)
!52 = distinct !DICompileUnit(language: DW_LANG_C99, file: !53, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, globals: !54, nameTableKind: None)
!53 = !DIFile(filename: "src/version.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!54 = !{!50}
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !57, file: !62, line: 56, type: !41, isLocal: true, isDefinition: true)
!57 = distinct !DICompileUnit(language: DW_LANG_C99, file: !58, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, globals: !59, nameTableKind: None)
!58 = !DIFile(filename: "./lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!59 = !{!60, !55}
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "file_name", scope: !57, file: !62, line: 46, type: !23, isLocal: true, isDefinition: true)
!62 = !DIFile(filename: "lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "exit_failure", scope: !65, file: !68, line: 24, type: !69, isLocal: false, isDefinition: true)
!65 = distinct !DICompileUnit(language: DW_LANG_C99, file: !66, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, globals: !67, nameTableKind: None)
!66 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!67 = !{!63}
!68 = !DIFile(filename: "lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!69 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !6)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "program_name", scope: !72, file: !76, line: 33, type: !23, isLocal: false, isDefinition: true)
!72 = distinct !DICompileUnit(language: DW_LANG_C99, file: !73, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !74, globals: !75, nameTableKind: None)
!73 = !DIFile(filename: "./lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!74 = !{!13, !8}
!75 = !{!70}
!76 = !DIFile(filename: "lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !79, file: !105, line: 116, type: !118, isLocal: true, isDefinition: true)
!79 = distinct !DICompileUnit(language: DW_LANG_C99, file: !80, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !81, retainedTypes: !97, globals: !102, nameTableKind: None)
!80 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!81 = !{!82}
!82 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !83, line: 32, baseType: !84, size: 32, elements: !85)
!83 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!84 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96}
!86 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!87 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!88 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!89 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!90 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!91 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!92 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!93 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!94 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!95 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!96 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!97 = !{!6, !98, !99}
!98 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !100, line: 46, baseType: !101)
!100 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.1/include/stddef.h", directory: "")
!101 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!102 = !{!103, !110, !116, !77, !126, !131, !138, !140}
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !79, file: !105, line: 85, type: !106, isLocal: false, isDefinition: true)
!105 = !DIFile(filename: "lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 704, elements: !108)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!108 = !{!109}
!109 = !DISubrange(count: 11)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !79, file: !105, line: 101, type: !112, isLocal: false, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 320, elements: !114)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!114 = !{!115}
!115 = !DISubrange(count: 10)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !79, file: !105, line: 1052, type: !118, isLocal: false, isDefinition: true)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !105, line: 65, size: 448, elements: !119)
!119 = !{!120, !121, !122, !124, !125}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !118, file: !105, line: 68, baseType: !82, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !118, file: !105, line: 71, baseType: !6, size: 32, offset: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !118, file: !105, line: 75, baseType: !123, size: 256, offset: 64)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 256, elements: !43)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !118, file: !105, line: 78, baseType: !23, size: 64, offset: 320)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !118, file: !105, line: 81, baseType: !23, size: 64, offset: 384)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "slot0", scope: !79, file: !105, line: 842, type: !128, isLocal: true, isDefinition: true)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2048, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 256)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "slotvec", scope: !79, file: !105, line: 845, type: !133, isLocal: true, isDefinition: true)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !105, line: 834, size: 128, elements: !135)
!135 = !{!136, !137}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !134, file: !105, line: 836, baseType: !99, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !134, file: !105, line: 837, baseType: !8, size: 64, offset: 64)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "nslots", scope: !79, file: !105, line: 843, type: !6, isLocal: true, isDefinition: true)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "slotvec0", scope: !79, file: !105, line: 844, type: !134, isLocal: true, isDefinition: true)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !144, file: !147, line: 26, type: !148, isLocal: false, isDefinition: true)
!144 = distinct !DICompileUnit(language: DW_LANG_C99, file: !145, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, globals: !146, nameTableKind: None)
!145 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!146 = !{!142}
!147 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 376, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 47)
!151 = distinct !DICompileUnit(language: DW_LANG_C99, file: !152, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !153, nameTableKind: None)
!152 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!153 = !{!13}
!154 = distinct !DICompileUnit(language: DW_LANG_C99, file: !155, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !156, nameTableKind: None)
!155 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!156 = !{!99, !8, !13}
!157 = distinct !DICompileUnit(language: DW_LANG_C99, file: !158, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, nameTableKind: None)
!158 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!159 = distinct !DICompileUnit(language: DW_LANG_C99, file: !160, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !161, nameTableKind: None)
!160 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!161 = !{!99}
!162 = distinct !DICompileUnit(language: DW_LANG_C99, file: !163, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !164, nameTableKind: None)
!163 = !DIFile(filename: "./lib/c-strcasecmp.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!164 = !{!165}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!167 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!168 = distinct !DICompileUnit(language: DW_LANG_C99, file: !169, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, nameTableKind: None)
!169 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!170 = distinct !DICompileUnit(language: DW_LANG_C99, file: !171, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, nameTableKind: None)
!171 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!172 = distinct !DICompileUnit(language: DW_LANG_C99, file: !173, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !153, nameTableKind: None)
!173 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!174 = distinct !DICompileUnit(language: DW_LANG_C99, file: !175, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !153, nameTableKind: None)
!175 = !DIFile(filename: "./lib/setlocale_null.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!176 = distinct !DICompileUnit(language: DW_LANG_C99, file: !177, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, nameTableKind: None)
!177 = !DIFile(filename: "./lib/fclose.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!178 = distinct !DICompileUnit(language: DW_LANG_C99, file: !179, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !153, nameTableKind: None)
!179 = !DIFile(filename: "./lib/fflush.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!180 = distinct !DICompileUnit(language: DW_LANG_C99, file: !181, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !153, nameTableKind: None)
!181 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!182 = distinct !DICompileUnit(language: DW_LANG_C99, file: !183, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, nameTableKind: None)
!183 = !DIFile(filename: "./lib/c-ctype.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!184 = !{!"clang version 9.0.1-12 "}
!185 = !{i32 2, !"Dwarf Version", i32 4}
!186 = !{i32 2, !"Debug Info Version", i32 3}
!187 = !{i32 1, !"wchar_size", i32 4}
!188 = !{i32 1, !"ThinLTO", i32 0}
!189 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!190 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 115, type: !191, scopeLine: 116, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !10, retainedNodes: !11)
!191 = !DISubroutineType(types: !192)
!192 = !{null, !6}
!193 = !DILocalVariable(name: "status", arg: 1, scope: !190, file: !3, line: 115, type: !6)
!194 = !DILocation(line: 115, column: 12, scope: !190)
!195 = !DILocation(line: 117, column: 7, scope: !196)
!196 = distinct !DILexicalBlock(scope: !190, file: !3, line: 117, column: 7)
!197 = !DILocation(line: 117, column: 14, scope: !196)
!198 = !DILocation(line: 117, column: 7, scope: !190)
!199 = !DILocation(line: 118, column: 5, scope: !196)
!200 = !DILocation(line: 118, column: 5, scope: !201)
!201 = distinct !DILexicalBlock(scope: !196, file: !3, line: 118, column: 5)
!202 = !DILocation(line: 121, column: 15, scope: !203)
!203 = distinct !DILexicalBlock(scope: !196, file: !3, line: 120, column: 5)
!204 = !DILocation(line: 121, column: 45, scope: !203)
!205 = !DILocation(line: 121, column: 7, scope: !203)
!206 = !DILocation(line: 123, column: 11, scope: !207)
!207 = distinct !DILexicalBlock(scope: !203, file: !3, line: 123, column: 11)
!208 = !DILocation(line: 123, column: 22, scope: !207)
!209 = !DILocation(line: 123, column: 11, scope: !203)
!210 = !DILocation(line: 125, column: 11, scope: !211)
!211 = distinct !DILexicalBlock(scope: !207, file: !3, line: 124, column: 9)
!212 = !DILocation(line: 134, column: 11, scope: !211)
!213 = !DILocation(line: 141, column: 9, scope: !211)
!214 = !DILocation(line: 144, column: 11, scope: !215)
!215 = distinct !DILexicalBlock(scope: !207, file: !3, line: 143, column: 9)
!216 = !DILocation(line: 150, column: 7, scope: !203)
!217 = !DILocation(line: 151, column: 7, scope: !203)
!218 = !DILocation(line: 152, column: 28, scope: !203)
!219 = !DILocation(line: 152, column: 7, scope: !203)
!220 = !DILocation(line: 154, column: 9, scope: !190)
!221 = !DILocation(line: 154, column: 3, scope: !190)
!222 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !223, file: !223, line: 634, type: !39, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10, retainedNodes: !11)
!223 = !DIFile(filename: "src/system.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!224 = !DILocalVariable(name: "program", arg: 1, scope: !222, file: !223, line: 634, type: !23)
!225 = !DILocation(line: 634, column: 34, scope: !222)
!226 = !DILocalVariable(name: "infomap", scope: !222, file: !223, line: 636, type: !227)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 896, elements: !233)
!228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !222, file: !223, line: 636, size: 128, elements: !230)
!230 = !{!231, !232}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !229, file: !223, line: 636, baseType: !23, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !229, file: !223, line: 636, baseType: !23, size: 64, offset: 64)
!233 = !{!234}
!234 = !DISubrange(count: 7)
!235 = !DILocation(line: 636, column: 67, scope: !222)
!236 = !DILocalVariable(name: "node", scope: !222, file: !223, line: 646, type: !23)
!237 = !DILocation(line: 646, column: 15, scope: !222)
!238 = !DILocation(line: 646, column: 22, scope: !222)
!239 = !DILocalVariable(name: "map_prog", scope: !222, file: !223, line: 647, type: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!241 = !DILocation(line: 647, column: 25, scope: !222)
!242 = !DILocation(line: 647, column: 36, scope: !222)
!243 = !DILocation(line: 649, column: 3, scope: !222)
!244 = !DILocation(line: 649, column: 10, scope: !222)
!245 = !DILocation(line: 649, column: 20, scope: !222)
!246 = !DILocation(line: 649, column: 28, scope: !222)
!247 = !DILocation(line: 649, column: 33, scope: !222)
!248 = !DILocation(line: 649, column: 31, scope: !222)
!249 = !DILocation(line: 0, scope: !222)
!250 = !DILocation(line: 650, column: 13, scope: !222)
!251 = distinct !{!251, !243, !250}
!252 = !DILocation(line: 652, column: 7, scope: !253)
!253 = distinct !DILexicalBlock(scope: !222, file: !223, line: 652, column: 7)
!254 = !DILocation(line: 652, column: 17, scope: !253)
!255 = !DILocation(line: 652, column: 7, scope: !222)
!256 = !DILocation(line: 653, column: 12, scope: !253)
!257 = !DILocation(line: 653, column: 22, scope: !253)
!258 = !DILocation(line: 653, column: 10, scope: !253)
!259 = !DILocation(line: 653, column: 5, scope: !253)
!260 = !DILocation(line: 655, column: 11, scope: !222)
!261 = !DILocation(line: 655, column: 3, scope: !222)
!262 = !DILocalVariable(name: "lc_messages", scope: !222, file: !223, line: 659, type: !23)
!263 = !DILocation(line: 659, column: 15, scope: !222)
!264 = !DILocation(line: 659, column: 29, scope: !222)
!265 = !DILocation(line: 660, column: 7, scope: !266)
!266 = distinct !DILexicalBlock(scope: !222, file: !223, line: 660, column: 7)
!267 = !DILocation(line: 660, column: 19, scope: !266)
!268 = !DILocation(line: 660, column: 22, scope: !266)
!269 = !DILocation(line: 660, column: 7, scope: !222)
!270 = !DILocation(line: 666, column: 7, scope: !271)
!271 = distinct !DILexicalBlock(scope: !266, file: !223, line: 661, column: 5)
!272 = !DILocation(line: 668, column: 5, scope: !271)
!273 = !DILocation(line: 669, column: 11, scope: !222)
!274 = !DILocation(line: 670, column: 24, scope: !222)
!275 = !DILocation(line: 669, column: 3, scope: !222)
!276 = !DILocation(line: 671, column: 11, scope: !222)
!277 = !DILocation(line: 672, column: 11, scope: !222)
!278 = !DILocation(line: 672, column: 17, scope: !222)
!279 = !DILocation(line: 672, column: 25, scope: !222)
!280 = !DILocation(line: 672, column: 22, scope: !222)
!281 = !DILocation(line: 671, column: 3, scope: !222)
!282 = !DILocation(line: 673, column: 1, scope: !222)
!283 = !DILocalVariable(name: "program", arg: 1, scope: !284, file: !223, line: 634, type: !23)
!284 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !223, file: !223, line: 634, type: !39, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !285, retainedNodes: !11)
!285 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !12, globals: !286, nameTableKind: None)
!286 = !{!287, !290, !300, !303}
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(name: "unknown", scope: !289, file: !3, line: 262, type: !42, isLocal: true, isDefinition: true)
!289 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 260, type: !4, scopeLine: 261, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !285, retainedNodes: !11)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "arch_long_options", scope: !285, file: !3, line: 107, type: !292, isLocal: true, isDefinition: true)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 768, elements: !29)
!293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !20, line: 50, size: 256, elements: !295)
!295 = !{!296, !297, !298, !299}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !294, file: !20, line: 52, baseType: !23, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !294, file: !20, line: 55, baseType: !6, size: 32, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !294, file: !20, line: 56, baseType: !27, size: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !294, file: !20, line: 57, baseType: !6, size: 32, offset: 192)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "uname_long_options", scope: !285, file: !3, line: 89, type: !302, isLocal: true, isDefinition: true)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 3584, elements: !34)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "printed", scope: !305, file: !3, line: 163, type: !41, isLocal: true, isDefinition: true)
!305 = distinct !DISubprogram(name: "print_element", scope: !3, file: !3, line: 161, type: !39, scopeLine: 162, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !285, retainedNodes: !11)
!306 = !DILocalVariable(name: "infomap", scope: !284, file: !223, line: 636, type: !307)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 896, elements: !233)
!308 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !284, file: !223, line: 636, size: 128, elements: !310)
!310 = !{!311, !312}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !309, file: !223, line: 636, baseType: !23, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !309, file: !223, line: 636, baseType: !23, size: 64, offset: 64)
!313 = !DILocalVariable(name: "node", scope: !284, file: !223, line: 646, type: !23)
!314 = !DILocalVariable(name: "map_prog", scope: !284, file: !223, line: 647, type: !315)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!316 = !DILocalVariable(name: "lc_messages", scope: !317, file: !223, line: 659, type: !23)
!317 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !223, file: !223, line: 634, type: !39, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !318, retainedNodes: !11)
!318 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !12, globals: !319, nameTableKind: None)
!319 = !{!320, !323, !333, !336}
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "unknown", scope: !322, file: !3, line: 262, type: !42, isLocal: true, isDefinition: true)
!322 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 260, type: !4, scopeLine: 261, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !318, retainedNodes: !11)
!323 = !DIGlobalVariableExpression(var: !324, expr: !DIExpression())
!324 = distinct !DIGlobalVariable(name: "arch_long_options", scope: !318, file: !3, line: 107, type: !325, isLocal: true, isDefinition: true)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 768, elements: !29)
!326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !20, line: 50, size: 256, elements: !328)
!328 = !{!329, !330, !331, !332}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !327, file: !20, line: 52, baseType: !23, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !327, file: !20, line: 55, baseType: !6, size: 32, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !327, file: !20, line: 56, baseType: !27, size: 64, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !327, file: !20, line: 57, baseType: !6, size: 32, offset: 192)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "uname_long_options", scope: !318, file: !3, line: 89, type: !335, isLocal: true, isDefinition: true)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 3584, elements: !34)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "printed", scope: !338, file: !3, line: 163, type: !41, isLocal: true, isDefinition: true)
!338 = distinct !DISubprogram(name: "print_element", scope: !3, file: !3, line: 161, type: !39, scopeLine: 162, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !318, retainedNodes: !11)
!339 = !DILocalVariable(name: "argc", arg: 1, scope: !2, file: !3, line: 260, type: !6)
!340 = !DILocation(line: 260, column: 11, scope: !2)
!341 = !DILocalVariable(name: "argv", arg: 2, scope: !2, file: !3, line: 260, type: !7)
!342 = !DILocation(line: 260, column: 24, scope: !2)
!343 = !DILocalVariable(name: "toprint", scope: !2, file: !3, line: 265, type: !84)
!344 = !DILocation(line: 265, column: 16, scope: !2)
!345 = !DILocation(line: 268, column: 21, scope: !2)
!346 = !DILocation(line: 268, column: 3, scope: !2)
!347 = !DILocation(line: 269, column: 3, scope: !2)
!348 = !DILocation(line: 270, column: 3, scope: !2)
!349 = !DILocation(line: 271, column: 3, scope: !2)
!350 = !DILocation(line: 273, column: 3, scope: !2)
!351 = !DILocation(line: 275, column: 30, scope: !2)
!352 = !DILocation(line: 275, column: 36, scope: !2)
!353 = !DILocation(line: 275, column: 13, scope: !2)
!354 = !DILocation(line: 275, column: 11, scope: !2)
!355 = !DILocation(line: 277, column: 7, scope: !356)
!356 = distinct !DILexicalBlock(scope: !2, file: !3, line: 277, column: 7)
!357 = !DILocation(line: 277, column: 15, scope: !356)
!358 = !DILocation(line: 278, column: 13, scope: !356)
!359 = !DILocation(line: 278, column: 5, scope: !356)
!360 = !DILocation(line: 280, column: 7, scope: !361)
!361 = distinct !DILexicalBlock(scope: !2, file: !3, line: 280, column: 7)
!362 = !DILocation(line: 281, column: 8, scope: !361)
!363 = !DILocation(line: 280, column: 7, scope: !2)
!364 = !DILocalVariable(name: "name", scope: !365, file: !3, line: 284, type: !366)
!365 = distinct !DILexicalBlock(scope: !361, file: !3, line: 283, column: 5)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utsname", file: !367, line: 48, size: 3120, elements: !368)
!367 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/utsname.h", directory: "")
!368 = !{!369, !373, !374, !375, !376, !377}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "sysname", scope: !366, file: !367, line: 51, baseType: !370, size: 520)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 520, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 65)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "nodename", scope: !366, file: !367, line: 54, baseType: !370, size: 520, offset: 520)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !366, file: !367, line: 57, baseType: !370, size: 520, offset: 1040)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !366, file: !367, line: 59, baseType: !370, size: 520, offset: 1560)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !366, file: !367, line: 62, baseType: !370, size: 520, offset: 2080)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "domainname", scope: !366, file: !367, line: 67, baseType: !370, size: 520, offset: 2600)
!378 = !DILocation(line: 284, column: 22, scope: !365)
!379 = !DILocation(line: 286, column: 11, scope: !380)
!380 = distinct !DILexicalBlock(scope: !365, file: !3, line: 286, column: 11)
!381 = !DILocation(line: 286, column: 25, scope: !380)
!382 = !DILocation(line: 287, column: 9, scope: !380)
!383 = !DILocation(line: 289, column: 11, scope: !384)
!384 = distinct !DILexicalBlock(scope: !365, file: !3, line: 289, column: 11)
!385 = !DILocation(line: 289, column: 19, scope: !384)
!386 = !DILocation(line: 289, column: 11, scope: !365)
!387 = !DILocation(line: 290, column: 29, scope: !384)
!388 = !DILocation(line: 290, column: 24, scope: !384)
!389 = !DILocation(line: 290, column: 9, scope: !384)
!390 = !DILocation(line: 291, column: 11, scope: !391)
!391 = distinct !DILexicalBlock(scope: !365, file: !3, line: 291, column: 11)
!392 = !DILocation(line: 291, column: 19, scope: !391)
!393 = !DILocation(line: 291, column: 11, scope: !365)
!394 = !DILocation(line: 292, column: 29, scope: !391)
!395 = !DILocation(line: 292, column: 24, scope: !391)
!396 = !DILocation(line: 292, column: 9, scope: !391)
!397 = !DILocation(line: 293, column: 11, scope: !398)
!398 = distinct !DILexicalBlock(scope: !365, file: !3, line: 293, column: 11)
!399 = !DILocation(line: 293, column: 19, scope: !398)
!400 = !DILocation(line: 293, column: 11, scope: !365)
!401 = !DILocation(line: 294, column: 29, scope: !398)
!402 = !DILocation(line: 294, column: 24, scope: !398)
!403 = !DILocation(line: 294, column: 9, scope: !398)
!404 = !DILocation(line: 295, column: 11, scope: !405)
!405 = distinct !DILexicalBlock(scope: !365, file: !3, line: 295, column: 11)
!406 = !DILocation(line: 295, column: 19, scope: !405)
!407 = !DILocation(line: 295, column: 11, scope: !365)
!408 = !DILocation(line: 296, column: 29, scope: !405)
!409 = !DILocation(line: 296, column: 24, scope: !405)
!410 = !DILocation(line: 296, column: 9, scope: !405)
!411 = !DILocation(line: 297, column: 11, scope: !412)
!412 = distinct !DILexicalBlock(scope: !365, file: !3, line: 297, column: 11)
!413 = !DILocation(line: 297, column: 19, scope: !412)
!414 = !DILocation(line: 297, column: 11, scope: !365)
!415 = !DILocation(line: 298, column: 29, scope: !412)
!416 = !DILocation(line: 298, column: 24, scope: !412)
!417 = !DILocation(line: 298, column: 9, scope: !412)
!418 = !DILocation(line: 299, column: 5, scope: !365)
!419 = !DILocation(line: 301, column: 7, scope: !420)
!420 = distinct !DILexicalBlock(scope: !2, file: !3, line: 301, column: 7)
!421 = !DILocation(line: 301, column: 15, scope: !420)
!422 = !DILocation(line: 301, column: 7, scope: !2)
!423 = !DILocalVariable(name: "element", scope: !424, file: !3, line: 303, type: !23)
!424 = distinct !DILexicalBlock(scope: !420, file: !3, line: 302, column: 5)
!425 = !DILocation(line: 303, column: 19, scope: !424)
!426 = !DILocation(line: 341, column: 14, scope: !427)
!427 = distinct !DILexicalBlock(scope: !424, file: !3, line: 341, column: 11)
!428 = !DILocation(line: 341, column: 22, scope: !427)
!429 = !DILocation(line: 341, column: 37, scope: !427)
!430 = !DILocation(line: 341, column: 45, scope: !427)
!431 = !DILocation(line: 341, column: 11, scope: !424)
!432 = !DILocation(line: 342, column: 24, scope: !427)
!433 = !DILocation(line: 342, column: 9, scope: !427)
!434 = !DILocation(line: 343, column: 5, scope: !424)
!435 = !DILocation(line: 345, column: 7, scope: !436)
!436 = distinct !DILexicalBlock(scope: !2, file: !3, line: 345, column: 7)
!437 = !DILocation(line: 345, column: 15, scope: !436)
!438 = !DILocation(line: 345, column: 7, scope: !2)
!439 = !DILocalVariable(name: "element", scope: !440, file: !3, line: 347, type: !23)
!440 = distinct !DILexicalBlock(scope: !436, file: !3, line: 346, column: 5)
!441 = !DILocation(line: 347, column: 19, scope: !440)
!442 = !DILocation(line: 366, column: 14, scope: !443)
!443 = distinct !DILexicalBlock(scope: !440, file: !3, line: 366, column: 11)
!444 = !DILocation(line: 366, column: 22, scope: !443)
!445 = !DILocation(line: 366, column: 37, scope: !443)
!446 = !DILocation(line: 366, column: 45, scope: !443)
!447 = !DILocation(line: 366, column: 11, scope: !440)
!448 = !DILocation(line: 367, column: 24, scope: !443)
!449 = !DILocation(line: 367, column: 9, scope: !443)
!450 = !DILocation(line: 368, column: 5, scope: !440)
!451 = !DILocation(line: 370, column: 7, scope: !452)
!452 = distinct !DILexicalBlock(scope: !2, file: !3, line: 370, column: 7)
!453 = !DILocation(line: 370, column: 15, scope: !452)
!454 = !DILocation(line: 370, column: 7, scope: !2)
!455 = !DILocation(line: 371, column: 5, scope: !452)
!456 = !DILocation(line: 373, column: 3, scope: !2)
!457 = !DILocation(line: 375, column: 3, scope: !2)
!458 = !DILocalVariable(name: "argc", arg: 1, scope: !459, file: !3, line: 260, type: !6)
!459 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 260, type: !4, scopeLine: 261, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !460, retainedNodes: !11)
!460 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !12, globals: !461, nameTableKind: None)
!461 = !{!462, !464, !474, !477}
!462 = !DIGlobalVariableExpression(var: !463, expr: !DIExpression())
!463 = distinct !DIGlobalVariable(name: "unknown", scope: !459, file: !3, line: 262, type: !42, isLocal: true, isDefinition: true)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "arch_long_options", scope: !460, file: !3, line: 107, type: !466, isLocal: true, isDefinition: true)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 768, elements: !29)
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !20, line: 50, size: 256, elements: !469)
!469 = !{!470, !471, !472, !473}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !468, file: !20, line: 52, baseType: !23, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !468, file: !20, line: 55, baseType: !6, size: 32, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !468, file: !20, line: 56, baseType: !27, size: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !468, file: !20, line: 57, baseType: !6, size: 32, offset: 192)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "uname_long_options", scope: !460, file: !3, line: 89, type: !476, isLocal: true, isDefinition: true)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 3584, elements: !34)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "printed", scope: !479, file: !3, line: 163, type: !41, isLocal: true, isDefinition: true)
!479 = distinct !DISubprogram(name: "print_element", scope: !3, file: !3, line: 161, type: !39, scopeLine: 162, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !460, retainedNodes: !11)
!480 = !DILocalVariable(name: "argv", arg: 2, scope: !459, file: !3, line: 260, type: !7)
!481 = !DILocalVariable(name: "toprint", scope: !459, file: !3, line: 265, type: !84)
!482 = distinct !DISubprogram(name: "decode_switches", scope: !3, file: !3, line: 175, type: !4, scopeLine: 176, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !10, retainedNodes: !11)
!483 = !DILocalVariable(name: "argc", arg: 1, scope: !482, file: !3, line: 175, type: !6)
!484 = !DILocation(line: 175, column: 22, scope: !482)
!485 = !DILocalVariable(name: "argv", arg: 2, scope: !482, file: !3, line: 175, type: !7)
!486 = !DILocation(line: 175, column: 35, scope: !482)
!487 = !DILocalVariable(name: "c", scope: !482, file: !3, line: 177, type: !6)
!488 = !DILocation(line: 177, column: 7, scope: !482)
!489 = !DILocalVariable(name: "toprint", scope: !482, file: !3, line: 178, type: !84)
!490 = !DILocation(line: 178, column: 16, scope: !482)
!491 = !DILocation(line: 180, column: 7, scope: !492)
!492 = distinct !DILexicalBlock(scope: !482, file: !3, line: 180, column: 7)
!493 = !DILocation(line: 180, column: 18, scope: !492)
!494 = !DILocation(line: 180, column: 7, scope: !482)
!495 = !DILocation(line: 182, column: 7, scope: !496)
!496 = distinct !DILexicalBlock(scope: !492, file: !3, line: 181, column: 5)
!497 = !DILocation(line: 182, column: 32, scope: !496)
!498 = !DILocation(line: 182, column: 38, scope: !496)
!499 = !DILocation(line: 182, column: 19, scope: !496)
!500 = !DILocation(line: 182, column: 17, scope: !496)
!501 = !DILocation(line: 183, column: 58, scope: !496)
!502 = !DILocation(line: 185, column: 19, scope: !503)
!503 = distinct !DILexicalBlock(scope: !496, file: !3, line: 184, column: 9)
!504 = !DILocation(line: 185, column: 11, scope: !503)
!505 = !DILocation(line: 187, column: 13, scope: !506)
!506 = distinct !DILexicalBlock(scope: !503, file: !3, line: 186, column: 13)
!507 = !DILocation(line: 189, column: 13, scope: !506)
!508 = !DILocation(line: 192, column: 15, scope: !506)
!509 = !DILocation(line: 195, column: 15, scope: !496)
!510 = !DILocation(line: 196, column: 5, scope: !496)
!511 = !DILocation(line: 199, column: 7, scope: !512)
!512 = distinct !DILexicalBlock(scope: !492, file: !3, line: 198, column: 5)
!513 = !DILocation(line: 199, column: 32, scope: !512)
!514 = !DILocation(line: 199, column: 38, scope: !512)
!515 = !DILocation(line: 199, column: 19, scope: !512)
!516 = !DILocation(line: 199, column: 17, scope: !512)
!517 = !DILocation(line: 200, column: 59, scope: !512)
!518 = !DILocation(line: 202, column: 19, scope: !519)
!519 = distinct !DILexicalBlock(scope: !512, file: !3, line: 201, column: 9)
!520 = !DILocation(line: 202, column: 11, scope: !519)
!521 = !DILocation(line: 205, column: 23, scope: !522)
!522 = distinct !DILexicalBlock(scope: !519, file: !3, line: 203, column: 13)
!523 = !DILocation(line: 206, column: 15, scope: !522)
!524 = !DILocation(line: 209, column: 23, scope: !522)
!525 = !DILocation(line: 210, column: 15, scope: !522)
!526 = !DILocation(line: 213, column: 23, scope: !522)
!527 = !DILocation(line: 214, column: 15, scope: !522)
!528 = !DILocation(line: 217, column: 23, scope: !522)
!529 = !DILocation(line: 218, column: 15, scope: !522)
!530 = !DILocation(line: 221, column: 23, scope: !522)
!531 = !DILocation(line: 222, column: 15, scope: !522)
!532 = !DILocation(line: 225, column: 23, scope: !522)
!533 = !DILocation(line: 226, column: 15, scope: !522)
!534 = !DILocation(line: 229, column: 23, scope: !522)
!535 = !DILocation(line: 230, column: 15, scope: !522)
!536 = !DILocation(line: 233, column: 23, scope: !522)
!537 = !DILocation(line: 234, column: 15, scope: !522)
!538 = !DILocation(line: 237, column: 23, scope: !522)
!539 = !DILocation(line: 238, column: 15, scope: !522)
!540 = !DILocation(line: 240, column: 13, scope: !522)
!541 = !DILocation(line: 242, column: 13, scope: !522)
!542 = !DILocation(line: 245, column: 15, scope: !522)
!543 = distinct !{!543, !511, !544}
!544 = !DILocation(line: 247, column: 9, scope: !512)
!545 = !DILocation(line: 250, column: 7, scope: !546)
!546 = distinct !DILexicalBlock(scope: !482, file: !3, line: 250, column: 7)
!547 = !DILocation(line: 250, column: 15, scope: !546)
!548 = !DILocation(line: 250, column: 12, scope: !546)
!549 = !DILocation(line: 250, column: 7, scope: !482)
!550 = !DILocation(line: 252, column: 20, scope: !551)
!551 = distinct !DILexicalBlock(scope: !546, file: !3, line: 251, column: 5)
!552 = !DILocation(line: 252, column: 50, scope: !551)
!553 = !DILocation(line: 252, column: 55, scope: !551)
!554 = !DILocation(line: 252, column: 43, scope: !551)
!555 = !DILocation(line: 252, column: 7, scope: !551)
!556 = !DILocation(line: 253, column: 7, scope: !551)
!557 = !DILocation(line: 256, column: 10, scope: !482)
!558 = !DILocation(line: 256, column: 3, scope: !482)
!559 = !DILocalVariable(name: "argc", arg: 1, scope: !560, file: !3, line: 175, type: !6)
!560 = distinct !DISubprogram(name: "decode_switches", scope: !3, file: !3, line: 175, type: !4, scopeLine: 176, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !561, retainedNodes: !11)
!561 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !12, globals: !562, nameTableKind: None)
!562 = !{!563, !566, !576, !579}
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "unknown", scope: !565, file: !3, line: 262, type: !42, isLocal: true, isDefinition: true)
!565 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 260, type: !4, scopeLine: 261, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !561, retainedNodes: !11)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "arch_long_options", scope: !561, file: !3, line: 107, type: !568, isLocal: true, isDefinition: true)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 768, elements: !29)
!569 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !20, line: 50, size: 256, elements: !571)
!571 = !{!572, !573, !574, !575}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !570, file: !20, line: 52, baseType: !23, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !570, file: !20, line: 55, baseType: !6, size: 32, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !570, file: !20, line: 56, baseType: !27, size: 64, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !570, file: !20, line: 57, baseType: !6, size: 32, offset: 192)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "uname_long_options", scope: !561, file: !3, line: 89, type: !578, isLocal: true, isDefinition: true)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 3584, elements: !34)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "printed", scope: !581, file: !3, line: 163, type: !41, isLocal: true, isDefinition: true)
!581 = distinct !DISubprogram(name: "print_element", scope: !3, file: !3, line: 161, type: !39, scopeLine: 162, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !561, retainedNodes: !11)
!582 = !DILocalVariable(name: "argv", arg: 2, scope: !560, file: !3, line: 175, type: !7)
!583 = !DILocalVariable(name: "c", scope: !560, file: !3, line: 177, type: !6)
!584 = !DILocalVariable(name: "toprint", scope: !560, file: !3, line: 178, type: !84)
!585 = !DILocalVariable(name: "element", arg: 1, scope: !38, file: !3, line: 161, type: !23)
!586 = !DILocation(line: 161, column: 28, scope: !38)
!587 = !DILocation(line: 164, column: 7, scope: !588)
!588 = distinct !DILexicalBlock(scope: !38, file: !3, line: 164, column: 7)
!589 = !DILocation(line: 164, column: 7, scope: !38)
!590 = !DILocation(line: 165, column: 5, scope: !588)
!591 = !DILocation(line: 166, column: 11, scope: !38)
!592 = !DILocation(line: 167, column: 3, scope: !38)
!593 = !DILocation(line: 168, column: 1, scope: !38)
!594 = !DILocalVariable(name: "element", arg: 1, scope: !595, file: !3, line: 161, type: !23)
!595 = distinct !DISubprogram(name: "print_element", scope: !3, file: !3, line: 161, type: !39, scopeLine: 162, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !596, retainedNodes: !11)
!596 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !12, globals: !597, nameTableKind: None)
!597 = !{!598, !601, !611, !614}
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "unknown", scope: !600, file: !3, line: 262, type: !42, isLocal: true, isDefinition: true)
!600 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 260, type: !4, scopeLine: 261, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !596, retainedNodes: !11)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(name: "arch_long_options", scope: !596, file: !3, line: 107, type: !603, isLocal: true, isDefinition: true)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !604, size: 768, elements: !29)
!604 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !20, line: 50, size: 256, elements: !606)
!606 = !{!607, !608, !609, !610}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !605, file: !20, line: 52, baseType: !23, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !605, file: !20, line: 55, baseType: !6, size: 32, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !605, file: !20, line: 56, baseType: !27, size: 64, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !605, file: !20, line: 57, baseType: !6, size: 32, offset: 192)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(name: "uname_long_options", scope: !596, file: !3, line: 89, type: !613, isLocal: true, isDefinition: true)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !604, size: 3584, elements: !34)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "printed", scope: !595, file: !3, line: 163, type: !41, isLocal: true, isDefinition: true)
!616 = distinct !DISubprogram(name: "close_stdout", scope: !62, file: !62, line: 117, type: !617, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !11)
!617 = !DISubroutineType(types: !618)
!618 = !{null}
!619 = !DILocation(line: 119, column: 21, scope: !620)
!620 = distinct !DILexicalBlock(scope: !616, file: !62, line: 119, column: 7)
!621 = !DILocation(line: 119, column: 7, scope: !620)
!622 = !DILocation(line: 119, column: 29, scope: !620)
!623 = !DILocation(line: 120, column: 7, scope: !620)
!624 = !DILocation(line: 120, column: 12, scope: !620)
!625 = !DILocation(line: 120, column: 25, scope: !620)
!626 = !DILocation(line: 120, column: 28, scope: !620)
!627 = !DILocation(line: 120, column: 34, scope: !620)
!628 = !DILocation(line: 119, column: 7, scope: !616)
!629 = !DILocalVariable(name: "write_error", scope: !630, file: !62, line: 122, type: !23)
!630 = distinct !DILexicalBlock(scope: !620, file: !62, line: 121, column: 5)
!631 = !DILocation(line: 122, column: 19, scope: !630)
!632 = !DILocation(line: 122, column: 33, scope: !630)
!633 = !DILocation(line: 123, column: 11, scope: !634)
!634 = distinct !DILexicalBlock(scope: !630, file: !62, line: 123, column: 11)
!635 = !DILocation(line: 123, column: 11, scope: !630)
!636 = !DILocation(line: 124, column: 19, scope: !634)
!637 = !DILocation(line: 124, column: 52, scope: !634)
!638 = !DILocation(line: 124, column: 36, scope: !634)
!639 = !DILocation(line: 125, column: 16, scope: !634)
!640 = !DILocation(line: 124, column: 9, scope: !634)
!641 = !DILocation(line: 127, column: 19, scope: !634)
!642 = !DILocation(line: 127, column: 32, scope: !634)
!643 = !DILocation(line: 127, column: 9, scope: !634)
!644 = !DILocation(line: 129, column: 14, scope: !630)
!645 = !DILocation(line: 129, column: 7, scope: !630)
!646 = !DILocation(line: 134, column: 42, scope: !647)
!647 = distinct !DILexicalBlock(scope: !616, file: !62, line: 134, column: 7)
!648 = !DILocation(line: 134, column: 28, scope: !647)
!649 = !DILocation(line: 134, column: 50, scope: !647)
!650 = !DILocation(line: 134, column: 7, scope: !616)
!651 = !DILocation(line: 135, column: 12, scope: !647)
!652 = !DILocation(line: 135, column: 5, scope: !647)
!653 = !DILocation(line: 136, column: 1, scope: !616)
!654 = distinct !DISubprogram(name: "set_program_name", scope: !76, file: !76, line: 39, type: !39, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !72, retainedNodes: !11)
!655 = !DILocalVariable(name: "argv0", arg: 1, scope: !654, file: !76, line: 39, type: !23)
!656 = !DILocation(line: 39, column: 31, scope: !654)
!657 = !DILocalVariable(name: "slash", scope: !654, file: !76, line: 46, type: !23)
!658 = !DILocation(line: 46, column: 15, scope: !654)
!659 = !DILocalVariable(name: "base", scope: !654, file: !76, line: 47, type: !23)
!660 = !DILocation(line: 47, column: 15, scope: !654)
!661 = !DILocation(line: 51, column: 7, scope: !662)
!662 = distinct !DILexicalBlock(scope: !654, file: !76, line: 51, column: 7)
!663 = !DILocation(line: 51, column: 13, scope: !662)
!664 = !DILocation(line: 51, column: 7, scope: !654)
!665 = !DILocation(line: 55, column: 14, scope: !666)
!666 = distinct !DILexicalBlock(scope: !662, file: !76, line: 52, column: 5)
!667 = !DILocation(line: 54, column: 7, scope: !666)
!668 = !DILocation(line: 56, column: 7, scope: !666)
!669 = !DILocation(line: 59, column: 20, scope: !654)
!670 = !DILocation(line: 59, column: 11, scope: !654)
!671 = !DILocation(line: 59, column: 9, scope: !654)
!672 = !DILocation(line: 60, column: 11, scope: !654)
!673 = !DILocation(line: 60, column: 17, scope: !654)
!674 = !DILocation(line: 60, column: 27, scope: !654)
!675 = !DILocation(line: 60, column: 33, scope: !654)
!676 = !DILocation(line: 60, column: 39, scope: !654)
!677 = !DILocation(line: 60, column: 8, scope: !654)
!678 = !DILocation(line: 61, column: 7, scope: !679)
!679 = distinct !DILexicalBlock(scope: !654, file: !76, line: 61, column: 7)
!680 = !DILocation(line: 61, column: 14, scope: !679)
!681 = !DILocation(line: 61, column: 12, scope: !679)
!682 = !DILocation(line: 61, column: 20, scope: !679)
!683 = !DILocation(line: 61, column: 25, scope: !679)
!684 = !DILocation(line: 61, column: 37, scope: !679)
!685 = !DILocation(line: 61, column: 42, scope: !679)
!686 = !DILocation(line: 61, column: 28, scope: !679)
!687 = !DILocation(line: 61, column: 61, scope: !679)
!688 = !DILocation(line: 61, column: 7, scope: !654)
!689 = !DILocation(line: 63, column: 15, scope: !690)
!690 = distinct !DILexicalBlock(scope: !679, file: !76, line: 62, column: 5)
!691 = !DILocation(line: 63, column: 13, scope: !690)
!692 = !DILocation(line: 64, column: 20, scope: !693)
!693 = distinct !DILexicalBlock(scope: !690, file: !76, line: 64, column: 11)
!694 = !DILocation(line: 64, column: 11, scope: !693)
!695 = !DILocation(line: 64, column: 36, scope: !693)
!696 = !DILocation(line: 64, column: 11, scope: !690)
!697 = !DILocation(line: 66, column: 19, scope: !698)
!698 = distinct !DILexicalBlock(scope: !693, file: !76, line: 65, column: 9)
!699 = !DILocation(line: 66, column: 24, scope: !698)
!700 = !DILocation(line: 66, column: 17, scope: !698)
!701 = !DILocation(line: 70, column: 52, scope: !698)
!702 = !DILocation(line: 70, column: 41, scope: !698)
!703 = !DILocation(line: 72, column: 9, scope: !698)
!704 = !DILocation(line: 73, column: 5, scope: !690)
!705 = !DILocation(line: 84, column: 18, scope: !654)
!706 = !DILocation(line: 84, column: 16, scope: !654)
!707 = !DILocation(line: 90, column: 38, scope: !654)
!708 = !DILocation(line: 90, column: 27, scope: !654)
!709 = !DILocation(line: 92, column: 1, scope: !654)
!710 = !DILocalVariable(name: "argv0", arg: 1, scope: !711, file: !76, line: 39, type: !23)
!711 = distinct !DISubprogram(name: "set_program_name", scope: !76, file: !76, line: 39, type: !39, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !712, retainedNodes: !11)
!712 = distinct !DICompileUnit(language: DW_LANG_C99, file: !73, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !74, globals: !713, nameTableKind: None)
!713 = !{!714}
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "program_name", scope: !712, file: !76, line: 33, type: !23, isLocal: false, isDefinition: true)
!716 = !DILocalVariable(name: "slash", scope: !711, file: !76, line: 46, type: !23)
!717 = !DILocalVariable(name: "base", scope: !711, file: !76, line: 47, type: !23)
!718 = distinct !DISubprogram(name: "set_char_quoting", scope: !105, file: !105, line: 152, type: !719, scopeLine: 153, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !79, retainedNodes: !11)
!719 = !DISubroutineType(types: !720)
!720 = !{!6, !721, !9, !6}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!722 = !DILocalVariable(name: "o", arg: 1, scope: !718, file: !105, line: 152, type: !721)
!723 = !DILocation(line: 152, column: 43, scope: !718)
!724 = !DILocalVariable(name: "c", arg: 2, scope: !718, file: !105, line: 152, type: !9)
!725 = !DILocation(line: 152, column: 51, scope: !718)
!726 = !DILocalVariable(name: "i", arg: 3, scope: !718, file: !105, line: 152, type: !6)
!727 = !DILocation(line: 152, column: 58, scope: !718)
!728 = !DILocalVariable(name: "uc", scope: !718, file: !105, line: 154, type: !167)
!729 = !DILocation(line: 154, column: 17, scope: !718)
!730 = !DILocation(line: 154, column: 22, scope: !718)
!731 = !DILocalVariable(name: "p", scope: !718, file: !105, line: 155, type: !732)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!733 = !DILocation(line: 155, column: 17, scope: !718)
!734 = !DILocation(line: 156, column: 6, scope: !718)
!735 = !DILocation(line: 156, column: 10, scope: !718)
!736 = !DILocation(line: 156, column: 41, scope: !718)
!737 = !DILocation(line: 156, column: 5, scope: !718)
!738 = !DILocation(line: 156, column: 59, scope: !718)
!739 = !DILocation(line: 156, column: 62, scope: !718)
!740 = !DILocation(line: 156, column: 57, scope: !718)
!741 = !DILocalVariable(name: "shift", scope: !718, file: !105, line: 157, type: !6)
!742 = !DILocation(line: 157, column: 7, scope: !718)
!743 = !DILocation(line: 157, column: 15, scope: !718)
!744 = !DILocation(line: 157, column: 18, scope: !718)
!745 = !DILocalVariable(name: "r", scope: !718, file: !105, line: 158, type: !6)
!746 = !DILocation(line: 158, column: 7, scope: !718)
!747 = !DILocation(line: 158, column: 13, scope: !718)
!748 = !DILocation(line: 158, column: 12, scope: !718)
!749 = !DILocation(line: 158, column: 18, scope: !718)
!750 = !DILocation(line: 158, column: 15, scope: !718)
!751 = !DILocation(line: 158, column: 25, scope: !718)
!752 = !DILocation(line: 159, column: 11, scope: !718)
!753 = !DILocation(line: 159, column: 13, scope: !718)
!754 = !DILocation(line: 159, column: 20, scope: !718)
!755 = !DILocation(line: 159, column: 18, scope: !718)
!756 = !DILocation(line: 159, column: 26, scope: !718)
!757 = !DILocation(line: 159, column: 23, scope: !718)
!758 = !DILocation(line: 159, column: 4, scope: !718)
!759 = !DILocation(line: 159, column: 6, scope: !718)
!760 = !DILocation(line: 160, column: 10, scope: !718)
!761 = !DILocation(line: 160, column: 3, scope: !718)
!762 = !DILocalVariable(name: "o", arg: 1, scope: !763, file: !105, line: 152, type: !766)
!763 = distinct !DISubprogram(name: "set_char_quoting", scope: !105, file: !105, line: 152, type: !764, scopeLine: 153, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !774, retainedNodes: !11)
!764 = !DISubroutineType(types: !765)
!765 = !{!6, !766, !9, !6}
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !105, line: 65, size: 448, elements: !768)
!768 = !{!769, !770, !771, !772, !773}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !767, file: !105, line: 68, baseType: !82, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !767, file: !105, line: 71, baseType: !6, size: 32, offset: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !767, file: !105, line: 75, baseType: !123, size: 256, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !767, file: !105, line: 78, baseType: !23, size: 64, offset: 320)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !767, file: !105, line: 81, baseType: !23, size: 64, offset: 384)
!774 = distinct !DICompileUnit(language: DW_LANG_C99, file: !80, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !81, retainedTypes: !97, globals: !775, nameTableKind: None)
!775 = !{!776, !778, !780, !782, !784, !786, !793, !795}
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !774, file: !105, line: 85, type: !106, isLocal: false, isDefinition: true)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !774, file: !105, line: 101, type: !112, isLocal: false, isDefinition: true)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !774, file: !105, line: 1052, type: !767, isLocal: false, isDefinition: true)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !774, file: !105, line: 116, type: !767, isLocal: true, isDefinition: true)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(name: "slot0", scope: !774, file: !105, line: 842, type: !128, isLocal: true, isDefinition: true)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "slotvec", scope: !774, file: !105, line: 845, type: !788, isLocal: true, isDefinition: true)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !105, line: 834, size: 128, elements: !790)
!790 = !{!791, !792}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !789, file: !105, line: 836, baseType: !99, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !789, file: !105, line: 837, baseType: !8, size: 64, offset: 64)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "nslots", scope: !774, file: !105, line: 843, type: !6, isLocal: true, isDefinition: true)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(name: "slotvec0", scope: !774, file: !105, line: 844, type: !789, isLocal: true, isDefinition: true)
!797 = !DILocalVariable(name: "c", arg: 2, scope: !763, file: !105, line: 152, type: !9)
!798 = !DILocalVariable(name: "i", arg: 3, scope: !763, file: !105, line: 152, type: !6)
!799 = !DILocalVariable(name: "uc", scope: !763, file: !105, line: 154, type: !167)
!800 = !DILocalVariable(name: "p", scope: !763, file: !105, line: 155, type: !732)
!801 = !DILocalVariable(name: "shift", scope: !802, file: !105, line: 157, type: !6)
!802 = distinct !DISubprogram(name: "set_char_quoting", scope: !105, file: !105, line: 152, type: !803, scopeLine: 153, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !813, retainedNodes: !11)
!803 = !DISubroutineType(types: !804)
!804 = !{!6, !805, !9, !6}
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !105, line: 65, size: 448, elements: !807)
!807 = !{!808, !809, !810, !811, !812}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !806, file: !105, line: 68, baseType: !82, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !806, file: !105, line: 71, baseType: !6, size: 32, offset: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !806, file: !105, line: 75, baseType: !123, size: 256, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !806, file: !105, line: 78, baseType: !23, size: 64, offset: 320)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !806, file: !105, line: 81, baseType: !23, size: 64, offset: 384)
!813 = distinct !DICompileUnit(language: DW_LANG_C99, file: !80, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !81, retainedTypes: !97, globals: !814, nameTableKind: None)
!814 = !{!815, !817, !819, !821, !823, !825, !832, !834}
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !813, file: !105, line: 85, type: !106, isLocal: false, isDefinition: true)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !813, file: !105, line: 101, type: !112, isLocal: false, isDefinition: true)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !813, file: !105, line: 1052, type: !806, isLocal: false, isDefinition: true)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !813, file: !105, line: 116, type: !806, isLocal: true, isDefinition: true)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(name: "slot0", scope: !813, file: !105, line: 842, type: !128, isLocal: true, isDefinition: true)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "slotvec", scope: !813, file: !105, line: 845, type: !827, isLocal: true, isDefinition: true)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !105, line: 834, size: 128, elements: !829)
!829 = !{!830, !831}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !828, file: !105, line: 836, baseType: !99, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !828, file: !105, line: 837, baseType: !8, size: 64, offset: 64)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(name: "nslots", scope: !813, file: !105, line: 843, type: !6, isLocal: true, isDefinition: true)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(name: "slotvec0", scope: !813, file: !105, line: 844, type: !828, isLocal: true, isDefinition: true)
!836 = !DILocalVariable(name: "r", scope: !802, file: !105, line: 158, type: !6)
!837 = distinct !DISubprogram(name: "quotearg_char_mem", scope: !105, file: !105, line: 982, type: !838, scopeLine: 983, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !79, retainedNodes: !11)
!838 = !DISubroutineType(types: !839)
!839 = !{!8, !23, !99, !9}
!840 = !DILocalVariable(name: "arg", arg: 1, scope: !837, file: !105, line: 982, type: !23)
!841 = !DILocation(line: 982, column: 32, scope: !837)
!842 = !DILocalVariable(name: "argsize", arg: 2, scope: !837, file: !105, line: 982, type: !99)
!843 = !DILocation(line: 982, column: 44, scope: !837)
!844 = !DILocalVariable(name: "ch", arg: 3, scope: !837, file: !105, line: 982, type: !9)
!845 = !DILocation(line: 982, column: 58, scope: !837)
!846 = !DILocalVariable(name: "options", scope: !837, file: !105, line: 984, type: !118)
!847 = !DILocation(line: 984, column: 26, scope: !837)
!848 = !DILocation(line: 985, column: 13, scope: !837)
!849 = !DILocation(line: 986, column: 31, scope: !837)
!850 = !DILocation(line: 986, column: 3, scope: !837)
!851 = !DILocation(line: 987, column: 33, scope: !837)
!852 = !DILocation(line: 987, column: 38, scope: !837)
!853 = !DILocation(line: 987, column: 10, scope: !837)
!854 = !DILocation(line: 987, column: 3, scope: !837)
!855 = distinct !DISubprogram(name: "quotearg_n_options", scope: !105, file: !105, line: 877, type: !856, scopeLine: 879, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !79, retainedNodes: !11)
!856 = !DISubroutineType(types: !857)
!857 = !{!8, !6, !23, !99, !858}
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!860 = !DILocalVariable(name: "n", arg: 1, scope: !855, file: !105, line: 877, type: !6)
!861 = !DILocation(line: 877, column: 25, scope: !855)
!862 = !DILocalVariable(name: "arg", arg: 2, scope: !855, file: !105, line: 877, type: !23)
!863 = !DILocation(line: 877, column: 40, scope: !855)
!864 = !DILocalVariable(name: "argsize", arg: 3, scope: !855, file: !105, line: 877, type: !99)
!865 = !DILocation(line: 877, column: 52, scope: !855)
!866 = !DILocalVariable(name: "options", arg: 4, scope: !855, file: !105, line: 878, type: !858)
!867 = !DILocation(line: 878, column: 51, scope: !855)
!868 = !DILocalVariable(name: "e", scope: !855, file: !105, line: 880, type: !6)
!869 = !DILocation(line: 880, column: 7, scope: !855)
!870 = !DILocation(line: 880, column: 11, scope: !855)
!871 = !DILocalVariable(name: "sv", scope: !855, file: !105, line: 882, type: !133)
!872 = !DILocation(line: 882, column: 19, scope: !855)
!873 = !DILocation(line: 882, column: 24, scope: !855)
!874 = !DILocation(line: 884, column: 7, scope: !875)
!875 = distinct !DILexicalBlock(scope: !855, file: !105, line: 884, column: 7)
!876 = !DILocation(line: 884, column: 9, scope: !875)
!877 = !DILocation(line: 884, column: 7, scope: !855)
!878 = !DILocation(line: 885, column: 5, scope: !875)
!879 = !DILocation(line: 887, column: 7, scope: !880)
!880 = distinct !DILexicalBlock(scope: !855, file: !105, line: 887, column: 7)
!881 = !DILocation(line: 887, column: 17, scope: !880)
!882 = !DILocation(line: 887, column: 14, scope: !880)
!883 = !DILocation(line: 887, column: 7, scope: !855)
!884 = !DILocalVariable(name: "preallocated", scope: !885, file: !105, line: 889, type: !41)
!885 = distinct !DILexicalBlock(scope: !880, file: !105, line: 888, column: 5)
!886 = !DILocation(line: 889, column: 12, scope: !885)
!887 = !DILocation(line: 889, column: 28, scope: !885)
!888 = !DILocation(line: 889, column: 31, scope: !885)
!889 = !DILocalVariable(name: "nmax", scope: !885, file: !105, line: 890, type: !6)
!890 = !DILocation(line: 890, column: 11, scope: !885)
!891 = !DILocation(line: 892, column: 11, scope: !892)
!892 = distinct !DILexicalBlock(scope: !885, file: !105, line: 892, column: 11)
!893 = !DILocation(line: 892, column: 18, scope: !892)
!894 = !DILocation(line: 892, column: 16, scope: !892)
!895 = !DILocation(line: 892, column: 11, scope: !885)
!896 = !DILocation(line: 893, column: 9, scope: !892)
!897 = !DILocation(line: 895, column: 32, scope: !885)
!898 = !DILocation(line: 895, column: 54, scope: !885)
!899 = !DILocation(line: 895, column: 59, scope: !885)
!900 = !DILocation(line: 895, column: 61, scope: !885)
!901 = !DILocation(line: 895, column: 58, scope: !885)
!902 = !DILocation(line: 895, column: 66, scope: !885)
!903 = !DILocation(line: 895, column: 22, scope: !885)
!904 = !DILocation(line: 895, column: 20, scope: !885)
!905 = !DILocation(line: 895, column: 15, scope: !885)
!906 = !DILocation(line: 896, column: 11, scope: !907)
!907 = distinct !DILexicalBlock(scope: !885, file: !105, line: 896, column: 11)
!908 = !DILocation(line: 896, column: 11, scope: !885)
!909 = !DILocation(line: 897, column: 10, scope: !907)
!910 = !DILocation(line: 897, column: 15, scope: !907)
!911 = !DILocation(line: 897, column: 9, scope: !907)
!912 = !DILocation(line: 898, column: 15, scope: !885)
!913 = !DILocation(line: 898, column: 20, scope: !885)
!914 = !DILocation(line: 898, column: 18, scope: !885)
!915 = !DILocation(line: 898, column: 7, scope: !885)
!916 = !DILocation(line: 898, column: 32, scope: !885)
!917 = !DILocation(line: 898, column: 34, scope: !885)
!918 = !DILocation(line: 898, column: 40, scope: !885)
!919 = !DILocation(line: 898, column: 38, scope: !885)
!920 = !DILocation(line: 898, column: 31, scope: !885)
!921 = !DILocation(line: 898, column: 48, scope: !885)
!922 = !DILocation(line: 899, column: 16, scope: !885)
!923 = !DILocation(line: 899, column: 18, scope: !885)
!924 = !DILocation(line: 899, column: 14, scope: !885)
!925 = !DILocation(line: 900, column: 5, scope: !885)
!926 = !DILocalVariable(name: "size", scope: !927, file: !105, line: 903, type: !99)
!927 = distinct !DILexicalBlock(scope: !855, file: !105, line: 902, column: 3)
!928 = !DILocation(line: 903, column: 12, scope: !927)
!929 = !DILocation(line: 903, column: 19, scope: !927)
!930 = !DILocation(line: 903, column: 22, scope: !927)
!931 = !DILocation(line: 903, column: 25, scope: !927)
!932 = !DILocalVariable(name: "val", scope: !927, file: !105, line: 904, type: !8)
!933 = !DILocation(line: 904, column: 11, scope: !927)
!934 = !DILocation(line: 904, column: 17, scope: !927)
!935 = !DILocation(line: 904, column: 20, scope: !927)
!936 = !DILocation(line: 904, column: 23, scope: !927)
!937 = !DILocalVariable(name: "flags", scope: !927, file: !105, line: 906, type: !6)
!938 = !DILocation(line: 906, column: 9, scope: !927)
!939 = !DILocation(line: 906, column: 17, scope: !927)
!940 = !DILocation(line: 906, column: 26, scope: !927)
!941 = !DILocation(line: 906, column: 32, scope: !927)
!942 = !DILocalVariable(name: "qsize", scope: !927, file: !105, line: 907, type: !99)
!943 = !DILocation(line: 907, column: 12, scope: !927)
!944 = !DILocation(line: 907, column: 46, scope: !927)
!945 = !DILocation(line: 907, column: 51, scope: !927)
!946 = !DILocation(line: 907, column: 57, scope: !927)
!947 = !DILocation(line: 907, column: 62, scope: !927)
!948 = !DILocation(line: 908, column: 46, scope: !927)
!949 = !DILocation(line: 908, column: 55, scope: !927)
!950 = !DILocation(line: 908, column: 62, scope: !927)
!951 = !DILocation(line: 909, column: 46, scope: !927)
!952 = !DILocation(line: 909, column: 55, scope: !927)
!953 = !DILocation(line: 910, column: 46, scope: !927)
!954 = !DILocation(line: 910, column: 55, scope: !927)
!955 = !DILocation(line: 911, column: 46, scope: !927)
!956 = !DILocation(line: 911, column: 55, scope: !927)
!957 = !DILocation(line: 907, column: 20, scope: !927)
!958 = !DILocation(line: 913, column: 9, scope: !959)
!959 = distinct !DILexicalBlock(scope: !927, file: !105, line: 913, column: 9)
!960 = !DILocation(line: 913, column: 17, scope: !959)
!961 = !DILocation(line: 913, column: 14, scope: !959)
!962 = !DILocation(line: 913, column: 9, scope: !927)
!963 = !DILocation(line: 915, column: 29, scope: !964)
!964 = distinct !DILexicalBlock(scope: !959, file: !105, line: 914, column: 7)
!965 = !DILocation(line: 915, column: 35, scope: !964)
!966 = !DILocation(line: 915, column: 27, scope: !964)
!967 = !DILocation(line: 915, column: 9, scope: !964)
!968 = !DILocation(line: 915, column: 12, scope: !964)
!969 = !DILocation(line: 915, column: 15, scope: !964)
!970 = !DILocation(line: 915, column: 20, scope: !964)
!971 = !DILocation(line: 916, column: 13, scope: !972)
!972 = distinct !DILexicalBlock(scope: !964, file: !105, line: 916, column: 13)
!973 = !DILocation(line: 916, column: 17, scope: !972)
!974 = !DILocation(line: 916, column: 13, scope: !964)
!975 = !DILocation(line: 917, column: 17, scope: !972)
!976 = !DILocation(line: 917, column: 11, scope: !972)
!977 = !DILocation(line: 918, column: 39, scope: !964)
!978 = !DILocation(line: 918, column: 27, scope: !964)
!979 = !DILocation(line: 918, column: 25, scope: !964)
!980 = !DILocation(line: 918, column: 9, scope: !964)
!981 = !DILocation(line: 918, column: 12, scope: !964)
!982 = !DILocation(line: 918, column: 15, scope: !964)
!983 = !DILocation(line: 918, column: 19, scope: !964)
!984 = !DILocation(line: 919, column: 35, scope: !964)
!985 = !DILocation(line: 919, column: 40, scope: !964)
!986 = !DILocation(line: 919, column: 46, scope: !964)
!987 = !DILocation(line: 919, column: 51, scope: !964)
!988 = !DILocation(line: 919, column: 60, scope: !964)
!989 = !DILocation(line: 919, column: 69, scope: !964)
!990 = !DILocation(line: 920, column: 35, scope: !964)
!991 = !DILocation(line: 920, column: 42, scope: !964)
!992 = !DILocation(line: 920, column: 51, scope: !964)
!993 = !DILocation(line: 921, column: 35, scope: !964)
!994 = !DILocation(line: 921, column: 44, scope: !964)
!995 = !DILocation(line: 922, column: 35, scope: !964)
!996 = !DILocation(line: 922, column: 44, scope: !964)
!997 = !DILocation(line: 919, column: 9, scope: !964)
!998 = !DILocation(line: 923, column: 7, scope: !964)
!999 = !DILocation(line: 925, column: 13, scope: !927)
!1000 = !DILocation(line: 925, column: 5, scope: !927)
!1001 = !DILocation(line: 925, column: 11, scope: !927)
!1002 = !DILocation(line: 926, column: 12, scope: !927)
!1003 = !DILocation(line: 926, column: 5, scope: !927)
!1004 = !DILocalVariable(name: "n", arg: 1, scope: !1005, file: !105, line: 877, type: !6)
!1005 = distinct !DISubprogram(name: "quotearg_n_options", scope: !105, file: !105, line: 877, type: !1006, scopeLine: 879, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1017, retainedNodes: !11)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!8, !6, !23, !99, !1008}
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1010)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !105, line: 65, size: 448, elements: !1011)
!1011 = !{!1012, !1013, !1014, !1015, !1016}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1010, file: !105, line: 68, baseType: !82, size: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1010, file: !105, line: 71, baseType: !6, size: 32, offset: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1010, file: !105, line: 75, baseType: !123, size: 256, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1010, file: !105, line: 78, baseType: !23, size: 64, offset: 320)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1010, file: !105, line: 81, baseType: !23, size: 64, offset: 384)
!1017 = distinct !DICompileUnit(language: DW_LANG_C99, file: !80, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !81, retainedTypes: !97, globals: !1018, nameTableKind: None)
!1018 = !{!1019, !1021, !1023, !1025, !1027, !1029, !1036, !1038}
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1017, file: !105, line: 85, type: !106, isLocal: false, isDefinition: true)
!1021 = !DIGlobalVariableExpression(var: !1022, expr: !DIExpression())
!1022 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1017, file: !105, line: 101, type: !112, isLocal: false, isDefinition: true)
!1023 = !DIGlobalVariableExpression(var: !1024, expr: !DIExpression())
!1024 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1017, file: !105, line: 1052, type: !1010, isLocal: false, isDefinition: true)
!1025 = !DIGlobalVariableExpression(var: !1026, expr: !DIExpression())
!1026 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1017, file: !105, line: 116, type: !1010, isLocal: true, isDefinition: true)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(name: "slot0", scope: !1017, file: !105, line: 842, type: !128, isLocal: true, isDefinition: true)
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
!1030 = distinct !DIGlobalVariable(name: "slotvec", scope: !1017, file: !105, line: 845, type: !1031, isLocal: true, isDefinition: true)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !105, line: 834, size: 128, elements: !1033)
!1033 = !{!1034, !1035}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1032, file: !105, line: 836, baseType: !99, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1032, file: !105, line: 837, baseType: !8, size: 64, offset: 64)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(name: "nslots", scope: !1017, file: !105, line: 843, type: !6, isLocal: true, isDefinition: true)
!1038 = !DIGlobalVariableExpression(var: !1039, expr: !DIExpression())
!1039 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1017, file: !105, line: 844, type: !1032, isLocal: true, isDefinition: true)
!1040 = !DILocalVariable(name: "arg", arg: 2, scope: !1005, file: !105, line: 877, type: !23)
!1041 = !DILocalVariable(name: "argsize", arg: 3, scope: !1005, file: !105, line: 877, type: !99)
!1042 = !DILocalVariable(name: "options", arg: 4, scope: !1005, file: !105, line: 878, type: !1008)
!1043 = !DILocalVariable(name: "e", scope: !1005, file: !105, line: 880, type: !6)
!1044 = !DILocalVariable(name: "sv", scope: !1005, file: !105, line: 882, type: !1031)
!1045 = !DILocalVariable(name: "nmax", scope: !1046, file: !105, line: 890, type: !6)
!1046 = distinct !DILexicalBlock(scope: !1047, file: !105, line: 888, column: 5)
!1047 = distinct !DILexicalBlock(scope: !1048, file: !105, line: 887, column: 7)
!1048 = distinct !DISubprogram(name: "quotearg_n_options", scope: !105, file: !105, line: 877, type: !1049, scopeLine: 879, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1060, retainedNodes: !11)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!8, !6, !23, !99, !1051}
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1053)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !105, line: 65, size: 448, elements: !1054)
!1054 = !{!1055, !1056, !1057, !1058, !1059}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1053, file: !105, line: 68, baseType: !82, size: 32)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1053, file: !105, line: 71, baseType: !6, size: 32, offset: 32)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1053, file: !105, line: 75, baseType: !123, size: 256, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1053, file: !105, line: 78, baseType: !23, size: 64, offset: 320)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1053, file: !105, line: 81, baseType: !23, size: 64, offset: 384)
!1060 = distinct !DICompileUnit(language: DW_LANG_C99, file: !80, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !81, retainedTypes: !97, globals: !1061, nameTableKind: None)
!1061 = !{!1062, !1064, !1066, !1068, !1070, !1072, !1079, !1081}
!1062 = !DIGlobalVariableExpression(var: !1063, expr: !DIExpression())
!1063 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1060, file: !105, line: 85, type: !106, isLocal: false, isDefinition: true)
!1064 = !DIGlobalVariableExpression(var: !1065, expr: !DIExpression())
!1065 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1060, file: !105, line: 101, type: !112, isLocal: false, isDefinition: true)
!1066 = !DIGlobalVariableExpression(var: !1067, expr: !DIExpression())
!1067 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1060, file: !105, line: 1052, type: !1053, isLocal: false, isDefinition: true)
!1068 = !DIGlobalVariableExpression(var: !1069, expr: !DIExpression())
!1069 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1060, file: !105, line: 116, type: !1053, isLocal: true, isDefinition: true)
!1070 = !DIGlobalVariableExpression(var: !1071, expr: !DIExpression())
!1071 = distinct !DIGlobalVariable(name: "slot0", scope: !1060, file: !105, line: 842, type: !128, isLocal: true, isDefinition: true)
!1072 = !DIGlobalVariableExpression(var: !1073, expr: !DIExpression())
!1073 = distinct !DIGlobalVariable(name: "slotvec", scope: !1060, file: !105, line: 845, type: !1074, isLocal: true, isDefinition: true)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !105, line: 834, size: 128, elements: !1076)
!1076 = !{!1077, !1078}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1075, file: !105, line: 836, baseType: !99, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1075, file: !105, line: 837, baseType: !8, size: 64, offset: 64)
!1079 = !DIGlobalVariableExpression(var: !1080, expr: !DIExpression())
!1080 = distinct !DIGlobalVariable(name: "nslots", scope: !1060, file: !105, line: 843, type: !6, isLocal: true, isDefinition: true)
!1081 = !DIGlobalVariableExpression(var: !1082, expr: !DIExpression())
!1082 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1060, file: !105, line: 844, type: !1075, isLocal: true, isDefinition: true)
!1083 = !DILocalVariable(name: "val", scope: !1084, file: !105, line: 904, type: !8)
!1084 = distinct !DILexicalBlock(scope: !1085, file: !105, line: 902, column: 3)
!1085 = distinct !DISubprogram(name: "quotearg_n_options", scope: !105, file: !105, line: 877, type: !1086, scopeLine: 879, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1097, retainedNodes: !11)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!8, !6, !23, !99, !1088}
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1090)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !105, line: 65, size: 448, elements: !1091)
!1091 = !{!1092, !1093, !1094, !1095, !1096}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1090, file: !105, line: 68, baseType: !82, size: 32)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1090, file: !105, line: 71, baseType: !6, size: 32, offset: 32)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1090, file: !105, line: 75, baseType: !123, size: 256, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1090, file: !105, line: 78, baseType: !23, size: 64, offset: 320)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1090, file: !105, line: 81, baseType: !23, size: 64, offset: 384)
!1097 = distinct !DICompileUnit(language: DW_LANG_C99, file: !80, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !81, retainedTypes: !97, globals: !1098, nameTableKind: None)
!1098 = !{!1099, !1101, !1103, !1105, !1107, !1109, !1116, !1118}
!1099 = !DIGlobalVariableExpression(var: !1100, expr: !DIExpression())
!1100 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1097, file: !105, line: 85, type: !106, isLocal: false, isDefinition: true)
!1101 = !DIGlobalVariableExpression(var: !1102, expr: !DIExpression())
!1102 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1097, file: !105, line: 101, type: !112, isLocal: false, isDefinition: true)
!1103 = !DIGlobalVariableExpression(var: !1104, expr: !DIExpression())
!1104 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1097, file: !105, line: 1052, type: !1090, isLocal: false, isDefinition: true)
!1105 = !DIGlobalVariableExpression(var: !1106, expr: !DIExpression())
!1106 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1097, file: !105, line: 116, type: !1090, isLocal: true, isDefinition: true)
!1107 = !DIGlobalVariableExpression(var: !1108, expr: !DIExpression())
!1108 = distinct !DIGlobalVariable(name: "slot0", scope: !1097, file: !105, line: 842, type: !128, isLocal: true, isDefinition: true)
!1109 = !DIGlobalVariableExpression(var: !1110, expr: !DIExpression())
!1110 = distinct !DIGlobalVariable(name: "slotvec", scope: !1097, file: !105, line: 845, type: !1111, isLocal: true, isDefinition: true)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !105, line: 834, size: 128, elements: !1113)
!1113 = !{!1114, !1115}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1112, file: !105, line: 836, baseType: !99, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1112, file: !105, line: 837, baseType: !8, size: 64, offset: 64)
!1116 = !DIGlobalVariableExpression(var: !1117, expr: !DIExpression())
!1117 = distinct !DIGlobalVariable(name: "nslots", scope: !1097, file: !105, line: 843, type: !6, isLocal: true, isDefinition: true)
!1118 = !DIGlobalVariableExpression(var: !1119, expr: !DIExpression())
!1119 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1097, file: !105, line: 844, type: !1112, isLocal: true, isDefinition: true)
!1120 = !DILocalVariable(name: "flags", scope: !1084, file: !105, line: 906, type: !6)
!1121 = !DILocalVariable(name: "qsize", scope: !1084, file: !105, line: 907, type: !99)
!1122 = distinct !DISubprogram(name: "quotearg_buffer_restyled", scope: !105, file: !105, line: 256, type: !1123, scopeLine: 262, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !79, retainedNodes: !11)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!99, !8, !99, !23, !99, !82, !6, !1125, !23, !23}
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!1127 = !DILocalVariable(name: "buffer", arg: 1, scope: !1122, file: !105, line: 256, type: !8)
!1128 = !DILocation(line: 256, column: 33, scope: !1122)
!1129 = !DILocalVariable(name: "buffersize", arg: 2, scope: !1122, file: !105, line: 256, type: !99)
!1130 = !DILocation(line: 256, column: 48, scope: !1122)
!1131 = !DILocalVariable(name: "arg", arg: 3, scope: !1122, file: !105, line: 257, type: !23)
!1132 = !DILocation(line: 257, column: 39, scope: !1122)
!1133 = !DILocalVariable(name: "argsize", arg: 4, scope: !1122, file: !105, line: 257, type: !99)
!1134 = !DILocation(line: 257, column: 51, scope: !1122)
!1135 = !DILocalVariable(name: "quoting_style", arg: 5, scope: !1122, file: !105, line: 258, type: !82)
!1136 = !DILocation(line: 258, column: 46, scope: !1122)
!1137 = !DILocalVariable(name: "flags", arg: 6, scope: !1122, file: !105, line: 258, type: !6)
!1138 = !DILocation(line: 258, column: 65, scope: !1122)
!1139 = !DILocalVariable(name: "quote_these_too", arg: 7, scope: !1122, file: !105, line: 259, type: !1125)
!1140 = !DILocation(line: 259, column: 47, scope: !1122)
!1141 = !DILocalVariable(name: "left_quote", arg: 8, scope: !1122, file: !105, line: 260, type: !23)
!1142 = !DILocation(line: 260, column: 39, scope: !1122)
!1143 = !DILocalVariable(name: "right_quote", arg: 9, scope: !1122, file: !105, line: 261, type: !23)
!1144 = !DILocation(line: 261, column: 39, scope: !1122)
!1145 = !DILocalVariable(name: "i", scope: !1122, file: !105, line: 263, type: !99)
!1146 = !DILocation(line: 263, column: 10, scope: !1122)
!1147 = !DILocalVariable(name: "len", scope: !1122, file: !105, line: 264, type: !99)
!1148 = !DILocation(line: 264, column: 10, scope: !1122)
!1149 = !DILocalVariable(name: "orig_buffersize", scope: !1122, file: !105, line: 265, type: !99)
!1150 = !DILocation(line: 265, column: 10, scope: !1122)
!1151 = !DILocalVariable(name: "quote_string", scope: !1122, file: !105, line: 266, type: !23)
!1152 = !DILocation(line: 266, column: 15, scope: !1122)
!1153 = !DILocalVariable(name: "quote_string_len", scope: !1122, file: !105, line: 267, type: !99)
!1154 = !DILocation(line: 267, column: 10, scope: !1122)
!1155 = !DILocalVariable(name: "backslash_escapes", scope: !1122, file: !105, line: 268, type: !41)
!1156 = !DILocation(line: 268, column: 8, scope: !1122)
!1157 = !DILocalVariable(name: "unibyte_locale", scope: !1122, file: !105, line: 269, type: !41)
!1158 = !DILocation(line: 269, column: 8, scope: !1122)
!1159 = !DILocation(line: 269, column: 25, scope: !1122)
!1160 = !DILocation(line: 269, column: 36, scope: !1122)
!1161 = !DILocalVariable(name: "elide_outer_quotes", scope: !1122, file: !105, line: 270, type: !41)
!1162 = !DILocation(line: 270, column: 8, scope: !1122)
!1163 = !DILocation(line: 270, column: 30, scope: !1122)
!1164 = !DILocation(line: 270, column: 36, scope: !1122)
!1165 = !DILocation(line: 270, column: 61, scope: !1122)
!1166 = !DILocalVariable(name: "pending_shell_escape_end", scope: !1122, file: !105, line: 271, type: !41)
!1167 = !DILocation(line: 271, column: 8, scope: !1122)
!1168 = !DILocalVariable(name: "encountered_single_quote", scope: !1122, file: !105, line: 272, type: !41)
!1169 = !DILocation(line: 272, column: 8, scope: !1122)
!1170 = !DILocalVariable(name: "all_c_and_shell_quote_compat", scope: !1122, file: !105, line: 273, type: !41)
!1171 = !DILocation(line: 273, column: 8, scope: !1122)
!1172 = !DILocation(line: 273, column: 3, scope: !1122)
!1173 = !DILabel(scope: !1122, name: "process_input", file: !105, line: 314)
!1174 = !DILocation(line: 314, column: 2, scope: !1122)
!1175 = !DILocation(line: 316, column: 11, scope: !1122)
!1176 = !DILocation(line: 316, column: 3, scope: !1122)
!1177 = !DILocation(line: 319, column: 21, scope: !1178)
!1178 = distinct !DILexicalBlock(scope: !1122, file: !105, line: 317, column: 5)
!1179 = !DILocation(line: 320, column: 26, scope: !1178)
!1180 = !DILocation(line: 321, column: 7, scope: !1178)
!1181 = !DILocation(line: 323, column: 12, scope: !1182)
!1182 = distinct !DILexicalBlock(scope: !1178, file: !105, line: 323, column: 11)
!1183 = !DILocation(line: 323, column: 11, scope: !1178)
!1184 = !DILocation(line: 324, column: 9, scope: !1182)
!1185 = !DILocation(line: 324, column: 9, scope: !1186)
!1186 = distinct !DILexicalBlock(scope: !1187, file: !105, line: 324, column: 9)
!1187 = distinct !DILexicalBlock(scope: !1182, file: !105, line: 324, column: 9)
!1188 = !DILocation(line: 324, column: 9, scope: !1187)
!1189 = !DILocation(line: 325, column: 25, scope: !1178)
!1190 = !DILocation(line: 326, column: 20, scope: !1178)
!1191 = !DILocation(line: 327, column: 24, scope: !1178)
!1192 = !DILocation(line: 328, column: 7, scope: !1178)
!1193 = !DILocation(line: 331, column: 25, scope: !1178)
!1194 = !DILocation(line: 332, column: 26, scope: !1178)
!1195 = !DILocation(line: 333, column: 7, scope: !1178)
!1196 = !DILocation(line: 339, column: 13, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1198, file: !105, line: 339, column: 13)
!1198 = distinct !DILexicalBlock(scope: !1178, file: !105, line: 338, column: 7)
!1199 = !DILocation(line: 339, column: 27, scope: !1197)
!1200 = !DILocation(line: 339, column: 13, scope: !1198)
!1201 = !DILocation(line: 362, column: 50, scope: !1202)
!1202 = distinct !DILexicalBlock(scope: !1197, file: !105, line: 340, column: 11)
!1203 = !DILocation(line: 362, column: 26, scope: !1202)
!1204 = !DILocation(line: 362, column: 24, scope: !1202)
!1205 = !DILocation(line: 363, column: 51, scope: !1202)
!1206 = !DILocation(line: 363, column: 27, scope: !1202)
!1207 = !DILocation(line: 363, column: 25, scope: !1202)
!1208 = !DILocation(line: 364, column: 11, scope: !1202)
!1209 = !DILocation(line: 365, column: 14, scope: !1210)
!1210 = distinct !DILexicalBlock(scope: !1198, file: !105, line: 365, column: 13)
!1211 = !DILocation(line: 365, column: 13, scope: !1198)
!1212 = !DILocation(line: 366, column: 31, scope: !1213)
!1213 = distinct !DILexicalBlock(scope: !1210, file: !105, line: 366, column: 11)
!1214 = !DILocation(line: 366, column: 29, scope: !1213)
!1215 = !DILocation(line: 366, column: 16, scope: !1213)
!1216 = !DILocation(line: 366, column: 44, scope: !1217)
!1217 = distinct !DILexicalBlock(scope: !1213, file: !105, line: 366, column: 11)
!1218 = !DILocation(line: 366, column: 43, scope: !1217)
!1219 = !DILocation(line: 366, column: 11, scope: !1213)
!1220 = !DILocation(line: 367, column: 13, scope: !1217)
!1221 = !DILocation(line: 367, column: 13, scope: !1222)
!1222 = distinct !DILexicalBlock(scope: !1223, file: !105, line: 367, column: 13)
!1223 = distinct !DILexicalBlock(scope: !1217, file: !105, line: 367, column: 13)
!1224 = !DILocation(line: 367, column: 13, scope: !1223)
!1225 = !DILocation(line: 366, column: 70, scope: !1217)
!1226 = !DILocation(line: 366, column: 11, scope: !1217)
!1227 = distinct !{!1227, !1219, !1228}
!1228 = !DILocation(line: 367, column: 13, scope: !1213)
!1229 = !DILocation(line: 368, column: 27, scope: !1198)
!1230 = !DILocation(line: 369, column: 24, scope: !1198)
!1231 = !DILocation(line: 369, column: 22, scope: !1198)
!1232 = !DILocation(line: 370, column: 36, scope: !1198)
!1233 = !DILocation(line: 370, column: 28, scope: !1198)
!1234 = !DILocation(line: 370, column: 26, scope: !1198)
