; ModuleID = '<stdin>'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.file_name = type { i8*, i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.dev_ino, %struct.dev_ino, %struct.dev_ino, [3 x i64] }
%struct.dev_ino = type { i64, i64 }
%struct.__dirstream = type opaque
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external dso_local global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [23 x i8] c"Usage: %s [OPTION]...\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 41, type: !10, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !9, nameTableKind: None)
!3 = !DIFile(filename: "src/pwd.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!4 = !{}
!5 = !{!6, !7}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !{!0}
!10 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 1280, elements: !23)
!11 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !14)
!13 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "")
!14 = !{!15, !18, !20, !22}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !12, file: !13, line: 52, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !12, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !12, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !12, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!23 = !{!24}
!24 = !DISubrange(count: 5)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "Version", scope: !27, file: !28, line: 2, type: !16, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !29, nameTableKind: None)
!28 = !DIFile(filename: "src/version.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!29 = !{!25}
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !32, file: !37, line: 56, type: !38, isLocal: true, isDefinition: true)
!32 = distinct !DICompileUnit(language: DW_LANG_C99, file: !33, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !34, nameTableKind: None)
!33 = !DIFile(filename: "./lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!34 = !{!35, !30}
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "file_name", scope: !32, file: !37, line: 46, type: !16, isLocal: true, isDefinition: true)
!37 = !DIFile(filename: "lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!38 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "exit_failure", scope: !41, file: !44, line: 24, type: !45, isLocal: false, isDefinition: true)
!41 = distinct !DICompileUnit(language: DW_LANG_C99, file: !42, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !43, nameTableKind: None)
!42 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!43 = !{!39}
!44 = !DIFile(filename: "lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!45 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !19)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "program_name", scope: !48, file: !51, line: 33, type: !16, isLocal: false, isDefinition: true)
!48 = distinct !DICompileUnit(language: DW_LANG_C99, file: !49, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !50, nameTableKind: None)
!49 = !DIFile(filename: "./lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!50 = !{!46}
!51 = !DIFile(filename: "lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !54, file: !80, line: 116, type: !93, isLocal: true, isDefinition: true)
!54 = distinct !DICompileUnit(language: DW_LANG_C99, file: !55, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, retainedTypes: !72, globals: !77, nameTableKind: None)
!55 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!56 = !{!57}
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !58, line: 32, baseType: !59, size: 32, elements: !60)
!58 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!59 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!60 = !{!61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71}
!61 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!62 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!63 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!64 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!65 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!66 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!67 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!68 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!69 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!70 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!71 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!72 = !{!19, !73, !74}
!73 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !75, line: 46, baseType: !76)
!75 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.1/include/stddef.h", directory: "")
!76 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!77 = !{!78, !85, !91, !52, !103, !108, !115, !117}
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !54, file: !80, line: 85, type: !81, isLocal: false, isDefinition: true)
!80 = !DIFile(filename: "lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 704, elements: !83)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!83 = !{!84}
!84 = !DISubrange(count: 11)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !54, file: !80, line: 101, type: !87, isLocal: false, isDefinition: true)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 320, elements: !89)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!89 = !{!90}
!90 = !DISubrange(count: 10)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !54, file: !80, line: 1052, type: !93, isLocal: false, isDefinition: true)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !80, line: 65, size: 448, elements: !94)
!94 = !{!95, !96, !97, !101, !102}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !93, file: !80, line: 68, baseType: !57, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !93, file: !80, line: 71, baseType: !19, size: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !93, file: !80, line: 75, baseType: !98, size: 256, offset: 64)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 256, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 8)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !93, file: !80, line: 78, baseType: !16, size: 64, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !93, file: !80, line: 81, baseType: !16, size: 64, offset: 384)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "slot0", scope: !54, file: !80, line: 842, type: !105, isLocal: true, isDefinition: true)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 256)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "slotvec", scope: !54, file: !80, line: 845, type: !110, isLocal: true, isDefinition: true)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !80, line: 834, size: 128, elements: !112)
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !111, file: !80, line: 836, baseType: !74, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !111, file: !80, line: 837, baseType: !7, size: 64, offset: 64)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "nslots", scope: !54, file: !80, line: 843, type: !19, isLocal: true, isDefinition: true)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "slotvec0", scope: !54, file: !80, line: 844, type: !111, isLocal: true, isDefinition: true)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !121, file: !124, line: 26, type: !125, isLocal: false, isDefinition: true)
!121 = distinct !DICompileUnit(language: DW_LANG_C99, file: !122, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !123, nameTableKind: None)
!122 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!123 = !{!119}
!124 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 376, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 47)
!128 = distinct !DICompileUnit(language: DW_LANG_C99, file: !129, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!129 = !DIFile(filename: "./lib/root-dev-ino.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!130 = distinct !DICompileUnit(language: DW_LANG_C99, file: !131, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!131 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!132 = !{!6}
!133 = distinct !DICompileUnit(language: DW_LANG_C99, file: !134, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !135, nameTableKind: None)
!134 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!135 = !{!74, !7, !6}
!136 = distinct !DICompileUnit(language: DW_LANG_C99, file: !137, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!137 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!138 = distinct !DICompileUnit(language: DW_LANG_C99, file: !139, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!139 = !DIFile(filename: "./lib/xgetcwd.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!140 = distinct !DICompileUnit(language: DW_LANG_C99, file: !141, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !142, nameTableKind: None)
!141 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!142 = !{!74}
!143 = distinct !DICompileUnit(language: DW_LANG_C99, file: !144, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !145, nameTableKind: None)
!144 = !DIFile(filename: "./lib/c-strcasecmp.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!145 = !{!146}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!149 = distinct !DICompileUnit(language: DW_LANG_C99, file: !150, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!150 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!151 = distinct !DICompileUnit(language: DW_LANG_C99, file: !152, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!152 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!153 = distinct !DICompileUnit(language: DW_LANG_C99, file: !154, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!154 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!155 = distinct !DICompileUnit(language: DW_LANG_C99, file: !156, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!156 = !DIFile(filename: "./lib/setlocale_null.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!157 = distinct !DICompileUnit(language: DW_LANG_C99, file: !158, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!158 = !DIFile(filename: "./lib/fclose.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!159 = distinct !DICompileUnit(language: DW_LANG_C99, file: !160, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!160 = !DIFile(filename: "./lib/fflush.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!161 = distinct !DICompileUnit(language: DW_LANG_C99, file: !162, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!162 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!163 = distinct !DICompileUnit(language: DW_LANG_C99, file: !164, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!164 = !DIFile(filename: "./lib/c-ctype.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!165 = !{!"clang version 9.0.1-12 "}
!166 = !{i32 2, !"Dwarf Version", i32 4}
!167 = !{i32 2, !"Debug Info Version", i32 3}
!168 = !{i32 1, !"wchar_size", i32 4}
!169 = !{i32 1, !"ThinLTO", i32 0}
!170 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!171 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 51, type: !172, scopeLine: 52, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !19}
!174 = !DILocalVariable(name: "status", arg: 1, scope: !171, file: !3, line: 51, type: !19)
!175 = !DILocation(line: 51, column: 12, scope: !171)
!176 = !DILocation(line: 53, column: 7, scope: !177)
!177 = distinct !DILexicalBlock(scope: !171, file: !3, line: 53, column: 7)
!178 = !DILocation(line: 53, column: 14, scope: !177)
!179 = !DILocation(line: 53, column: 7, scope: !171)
!180 = !DILocation(line: 54, column: 5, scope: !177)
!181 = !DILocation(line: 54, column: 5, scope: !182)
!182 = distinct !DILexicalBlock(scope: !177, file: !3, line: 54, column: 5)
!183 = !DILocation(line: 57, column: 15, scope: !184)
!184 = distinct !DILexicalBlock(scope: !177, file: !3, line: 56, column: 5)
!185 = !DILocation(line: 57, column: 45, scope: !184)
!186 = !DILocation(line: 57, column: 7, scope: !184)
!187 = !DILocation(line: 58, column: 7, scope: !184)
!188 = !DILocation(line: 62, column: 7, scope: !184)
!189 = !DILocation(line: 66, column: 7, scope: !184)
!190 = !DILocation(line: 67, column: 7, scope: !184)
!191 = !DILocation(line: 68, column: 7, scope: !184)
!192 = !DILocation(line: 71, column: 15, scope: !184)
!193 = !DILocation(line: 71, column: 7, scope: !184)
!194 = !DILocation(line: 72, column: 7, scope: !184)
!195 = !DILocation(line: 74, column: 9, scope: !171)
!196 = !DILocation(line: 74, column: 3, scope: !171)
!197 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !198, file: !198, line: 634, type: !199, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!198 = !DIFile(filename: "src/system.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!199 = !DISubroutineType(types: !200)
!200 = !{null, !16}
!201 = !DILocalVariable(name: "program", arg: 1, scope: !197, file: !198, line: 634, type: !16)
!202 = !DILocation(line: 634, column: 34, scope: !197)
!203 = !DILocalVariable(name: "infomap", scope: !197, file: !198, line: 636, type: !204)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 896, elements: !210)
!205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !197, file: !198, line: 636, size: 128, elements: !207)
!207 = !{!208, !209}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !206, file: !198, line: 636, baseType: !16, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !206, file: !198, line: 636, baseType: !16, size: 64, offset: 64)
!210 = !{!211}
!211 = !DISubrange(count: 7)
!212 = !DILocation(line: 636, column: 67, scope: !197)
!213 = !DILocalVariable(name: "node", scope: !197, file: !198, line: 646, type: !16)
!214 = !DILocation(line: 646, column: 15, scope: !197)
!215 = !DILocation(line: 646, column: 22, scope: !197)
!216 = !DILocalVariable(name: "map_prog", scope: !197, file: !198, line: 647, type: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!218 = !DILocation(line: 647, column: 25, scope: !197)
!219 = !DILocation(line: 647, column: 36, scope: !197)
!220 = !DILocation(line: 649, column: 3, scope: !197)
!221 = !DILocation(line: 649, column: 10, scope: !197)
!222 = !DILocation(line: 649, column: 20, scope: !197)
!223 = !DILocation(line: 649, column: 28, scope: !197)
!224 = !DILocation(line: 649, column: 33, scope: !197)
!225 = !DILocation(line: 649, column: 31, scope: !197)
!226 = !DILocation(line: 0, scope: !197)
!227 = !DILocation(line: 650, column: 13, scope: !197)
!228 = distinct !{!228, !220, !227}
!229 = !DILocation(line: 652, column: 7, scope: !230)
!230 = distinct !DILexicalBlock(scope: !197, file: !198, line: 652, column: 7)
!231 = !DILocation(line: 652, column: 17, scope: !230)
!232 = !DILocation(line: 652, column: 7, scope: !197)
!233 = !DILocation(line: 653, column: 12, scope: !230)
!234 = !DILocation(line: 653, column: 22, scope: !230)
!235 = !DILocation(line: 653, column: 10, scope: !230)
!236 = !DILocation(line: 653, column: 5, scope: !230)
!237 = !DILocation(line: 655, column: 11, scope: !197)
!238 = !DILocation(line: 655, column: 3, scope: !197)
!239 = !DILocalVariable(name: "lc_messages", scope: !197, file: !198, line: 659, type: !16)
!240 = !DILocation(line: 659, column: 15, scope: !197)
!241 = !DILocation(line: 659, column: 29, scope: !197)
!242 = !DILocation(line: 660, column: 7, scope: !243)
!243 = distinct !DILexicalBlock(scope: !197, file: !198, line: 660, column: 7)
!244 = !DILocation(line: 660, column: 19, scope: !243)
!245 = !DILocation(line: 660, column: 22, scope: !243)
!246 = !DILocation(line: 660, column: 7, scope: !197)
!247 = !DILocation(line: 666, column: 7, scope: !248)
!248 = distinct !DILexicalBlock(scope: !243, file: !198, line: 661, column: 5)
!249 = !DILocation(line: 668, column: 5, scope: !248)
!250 = !DILocation(line: 669, column: 11, scope: !197)
!251 = !DILocation(line: 670, column: 24, scope: !197)
!252 = !DILocation(line: 669, column: 3, scope: !197)
!253 = !DILocation(line: 671, column: 11, scope: !197)
!254 = !DILocation(line: 672, column: 11, scope: !197)
!255 = !DILocation(line: 672, column: 17, scope: !197)
!256 = !DILocation(line: 672, column: 25, scope: !197)
!257 = !DILocation(line: 672, column: 22, scope: !197)
!258 = !DILocation(line: 671, column: 3, scope: !197)
!259 = !DILocation(line: 673, column: 1, scope: !197)
!260 = !DILocalVariable(name: "lc_messages", scope: !261, file: !198, line: 659, type: !16)
!261 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !198, file: !198, line: 634, type: !199, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !262, retainedNodes: !4)
!262 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !263, nameTableKind: None)
!263 = !{!264}
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "longopts", scope: !262, file: !3, line: 41, type: !266, isLocal: true, isDefinition: true)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 1280, elements: !23)
!267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !269)
!269 = !{!270, !271, !272, !273}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !268, file: !13, line: 52, baseType: !16, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !268, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !268, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !268, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!274 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 327, type: !275, scopeLine: 328, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!275 = !DISubroutineType(types: !276)
!276 = !{!19, !19, !277}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!278 = !DILocalVariable(name: "argc", arg: 1, scope: !274, file: !3, line: 327, type: !19)
!279 = !DILocation(line: 327, column: 11, scope: !274)
!280 = !DILocalVariable(name: "argv", arg: 2, scope: !274, file: !3, line: 327, type: !277)
!281 = !DILocation(line: 327, column: 24, scope: !274)
!282 = !DILocalVariable(name: "wd", scope: !274, file: !3, line: 329, type: !7)
!283 = !DILocation(line: 329, column: 9, scope: !274)
!284 = !DILocalVariable(name: "logical", scope: !274, file: !3, line: 333, type: !38)
!285 = !DILocation(line: 333, column: 8, scope: !274)
!286 = !DILocation(line: 333, column: 19, scope: !274)
!287 = !DILocation(line: 333, column: 46, scope: !274)
!288 = !DILocation(line: 336, column: 21, scope: !274)
!289 = !DILocation(line: 336, column: 3, scope: !274)
!290 = !DILocation(line: 337, column: 3, scope: !274)
!291 = !DILocation(line: 338, column: 3, scope: !274)
!292 = !DILocation(line: 339, column: 3, scope: !274)
!293 = !DILocation(line: 341, column: 3, scope: !274)
!294 = !DILocation(line: 343, column: 3, scope: !274)
!295 = !DILocalVariable(name: "c", scope: !296, file: !3, line: 345, type: !19)
!296 = distinct !DILexicalBlock(scope: !274, file: !3, line: 344, column: 5)
!297 = !DILocation(line: 345, column: 11, scope: !296)
!298 = !DILocation(line: 345, column: 28, scope: !296)
!299 = !DILocation(line: 345, column: 34, scope: !296)
!300 = !DILocation(line: 345, column: 15, scope: !296)
!301 = !DILocation(line: 346, column: 11, scope: !302)
!302 = distinct !DILexicalBlock(scope: !296, file: !3, line: 346, column: 11)
!303 = !DILocation(line: 346, column: 13, scope: !302)
!304 = !DILocation(line: 347, column: 9, scope: !302)
!305 = !DILocation(line: 348, column: 15, scope: !296)
!306 = !DILocation(line: 348, column: 7, scope: !296)
!307 = !DILocation(line: 351, column: 19, scope: !308)
!308 = distinct !DILexicalBlock(scope: !296, file: !3, line: 349, column: 9)
!309 = !DILocation(line: 352, column: 11, scope: !308)
!310 = !DILocation(line: 354, column: 19, scope: !308)
!311 = !DILocation(line: 355, column: 11, scope: !308)
!312 = !DILocation(line: 357, column: 9, scope: !308)
!313 = !DILocation(line: 359, column: 9, scope: !308)
!314 = !DILocation(line: 362, column: 11, scope: !308)
!315 = distinct !{!315, !294, !316}
!316 = !DILocation(line: 364, column: 5, scope: !274)
!317 = !DILocation(line: 366, column: 7, scope: !318)
!318 = distinct !DILexicalBlock(scope: !274, file: !3, line: 366, column: 7)
!319 = !DILocation(line: 366, column: 16, scope: !318)
!320 = !DILocation(line: 366, column: 14, scope: !318)
!321 = !DILocation(line: 366, column: 7, scope: !274)
!322 = !DILocation(line: 367, column: 18, scope: !318)
!323 = !DILocation(line: 367, column: 5, scope: !318)
!324 = !DILocation(line: 369, column: 7, scope: !325)
!325 = distinct !DILexicalBlock(scope: !274, file: !3, line: 369, column: 7)
!326 = !DILocation(line: 369, column: 7, scope: !274)
!327 = !DILocation(line: 371, column: 12, scope: !328)
!328 = distinct !DILexicalBlock(scope: !325, file: !3, line: 370, column: 5)
!329 = !DILocation(line: 371, column: 10, scope: !328)
!330 = !DILocation(line: 372, column: 11, scope: !331)
!331 = distinct !DILexicalBlock(scope: !328, file: !3, line: 372, column: 11)
!332 = !DILocation(line: 372, column: 11, scope: !328)
!333 = !DILocation(line: 374, column: 17, scope: !334)
!334 = distinct !DILexicalBlock(scope: !331, file: !3, line: 373, column: 9)
!335 = !DILocation(line: 374, column: 11, scope: !334)
!336 = !DILocation(line: 375, column: 11, scope: !334)
!337 = !DILocation(line: 377, column: 5, scope: !328)
!338 = !DILocation(line: 379, column: 8, scope: !274)
!339 = !DILocation(line: 379, column: 6, scope: !274)
!340 = !DILocation(line: 380, column: 7, scope: !341)
!341 = distinct !DILexicalBlock(scope: !274, file: !3, line: 380, column: 7)
!342 = !DILocation(line: 380, column: 10, scope: !341)
!343 = !DILocation(line: 380, column: 7, scope: !274)
!344 = !DILocation(line: 382, column: 13, scope: !345)
!345 = distinct !DILexicalBlock(scope: !341, file: !3, line: 381, column: 5)
!346 = !DILocation(line: 382, column: 7, scope: !345)
!347 = !DILocation(line: 383, column: 13, scope: !345)
!348 = !DILocation(line: 383, column: 7, scope: !345)
!349 = !DILocation(line: 384, column: 5, scope: !345)
!350 = !DILocalVariable(name: "file_name", scope: !351, file: !3, line: 387, type: !352)
!351 = distinct !DILexicalBlock(scope: !341, file: !3, line: 386, column: 5)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 34, size: 192, elements: !354)
!354 = !{!355, !356, !357}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !353, file: !3, line: 36, baseType: !7, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !353, file: !3, line: 37, baseType: !74, size: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !353, file: !3, line: 38, baseType: !7, size: 64, offset: 128)
!358 = !DILocation(line: 387, column: 25, scope: !351)
!359 = !DILocation(line: 387, column: 37, scope: !351)
!360 = !DILocation(line: 388, column: 22, scope: !351)
!361 = !DILocation(line: 388, column: 7, scope: !351)
!362 = !DILocation(line: 389, column: 13, scope: !351)
!363 = !DILocation(line: 389, column: 24, scope: !351)
!364 = !DILocation(line: 389, column: 7, scope: !351)
!365 = !DILocation(line: 390, column: 23, scope: !351)
!366 = !DILocation(line: 390, column: 7, scope: !351)
!367 = !DILocation(line: 393, column: 3, scope: !274)
!368 = !DILocation(line: 394, column: 1, scope: !274)
!369 = distinct !DISubprogram(name: "logical_getcwd", scope: !3, file: !3, line: 300, type: !370, scopeLine: 301, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!370 = !DISubroutineType(types: !371)
!371 = !{!7}
!372 = !DILocalVariable(name: "st1", scope: !369, file: !3, line: 302, type: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !374, line: 46, size: 1152, elements: !375)
!374 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!375 = !{!376, !379, !381, !383, !385, !387, !389, !390, !391, !394, !396, !398, !406, !407, !408}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !373, file: !374, line: 48, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !378, line: 145, baseType: !76)
!378 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!379 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !373, file: !374, line: 53, baseType: !380, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !378, line: 148, baseType: !76)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !373, file: !374, line: 61, baseType: !382, size: 64, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !378, line: 151, baseType: !76)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !373, file: !374, line: 62, baseType: !384, size: 32, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !378, line: 150, baseType: !59)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !373, file: !374, line: 64, baseType: !386, size: 32, offset: 224)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !378, line: 146, baseType: !59)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !373, file: !374, line: 65, baseType: !388, size: 32, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !378, line: 147, baseType: !59)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !373, file: !374, line: 67, baseType: !19, size: 32, offset: 288)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !373, file: !374, line: 69, baseType: !377, size: 64, offset: 320)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !373, file: !374, line: 74, baseType: !392, size: 64, offset: 384)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !378, line: 152, baseType: !393)
!393 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !373, file: !374, line: 78, baseType: !395, size: 64, offset: 448)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !378, line: 174, baseType: !393)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !373, file: !374, line: 80, baseType: !397, size: 64, offset: 512)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !378, line: 179, baseType: !393)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !373, file: !374, line: 91, baseType: !399, size: 128, offset: 576)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !400, line: 10, size: 128, elements: !401)
!400 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!401 = !{!402, !404}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !399, file: !400, line: 12, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !378, line: 160, baseType: !393)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !399, file: !400, line: 16, baseType: !405, size: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !378, line: 196, baseType: !393)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !373, file: !374, line: 92, baseType: !399, size: 128, offset: 704)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !373, file: !374, line: 93, baseType: !399, size: 128, offset: 832)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !373, file: !374, line: 106, baseType: !409, size: 192, offset: 960)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 192, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 3)
!412 = !DILocation(line: 302, column: 15, scope: !369)
!413 = !DILocalVariable(name: "st2", scope: !369, file: !3, line: 303, type: !373)
!414 = !DILocation(line: 303, column: 15, scope: !369)
!415 = !DILocalVariable(name: "wd", scope: !369, file: !3, line: 304, type: !7)
!416 = !DILocation(line: 304, column: 9, scope: !369)
!417 = !DILocation(line: 304, column: 14, scope: !369)
!418 = !DILocalVariable(name: "p", scope: !369, file: !3, line: 305, type: !7)
!419 = !DILocation(line: 305, column: 9, scope: !369)
!420 = !DILocation(line: 308, column: 8, scope: !421)
!421 = distinct !DILexicalBlock(scope: !369, file: !3, line: 308, column: 7)
!422 = !DILocation(line: 308, column: 11, scope: !421)
!423 = !DILocation(line: 308, column: 14, scope: !421)
!424 = !DILocation(line: 308, column: 20, scope: !421)
!425 = !DILocation(line: 308, column: 7, scope: !369)
!426 = !DILocation(line: 309, column: 5, scope: !421)
!427 = !DILocation(line: 310, column: 7, scope: !369)
!428 = !DILocation(line: 310, column: 5, scope: !369)
!429 = !DILocation(line: 311, column: 3, scope: !369)
!430 = !DILocation(line: 311, column: 23, scope: !369)
!431 = !DILocation(line: 311, column: 15, scope: !369)
!432 = !DILocation(line: 311, column: 13, scope: !369)
!433 = !DILocation(line: 313, column: 12, scope: !434)
!434 = distinct !DILexicalBlock(scope: !435, file: !3, line: 313, column: 11)
!435 = distinct !DILexicalBlock(scope: !369, file: !3, line: 312, column: 5)
!436 = !DILocation(line: 313, column: 17, scope: !434)
!437 = !DILocation(line: 313, column: 20, scope: !434)
!438 = !DILocation(line: 313, column: 25, scope: !434)
!439 = !DILocation(line: 314, column: 11, scope: !434)
!440 = !DILocation(line: 314, column: 15, scope: !434)
!441 = !DILocation(line: 314, column: 20, scope: !434)
!442 = !DILocation(line: 314, column: 27, scope: !434)
!443 = !DILocation(line: 314, column: 32, scope: !434)
!444 = !DILocation(line: 314, column: 37, scope: !434)
!445 = !DILocation(line: 314, column: 40, scope: !434)
!446 = !DILocation(line: 314, column: 45, scope: !434)
!447 = !DILocation(line: 313, column: 11, scope: !435)
!448 = !DILocation(line: 315, column: 9, scope: !434)
!449 = !DILocation(line: 316, column: 8, scope: !435)
!450 = distinct !{!450, !429, !451}
!451 = !DILocation(line: 317, column: 5, scope: !369)
!452 = !DILocation(line: 320, column: 13, scope: !453)
!453 = distinct !DILexicalBlock(scope: !369, file: !3, line: 320, column: 7)
!454 = !DILocation(line: 320, column: 7, scope: !453)
!455 = !DILocation(line: 320, column: 23, scope: !453)
!456 = !DILocation(line: 320, column: 31, scope: !453)
!457 = !DILocation(line: 320, column: 48, scope: !453)
!458 = !DILocation(line: 320, column: 56, scope: !453)
!459 = !DILocation(line: 320, column: 7, scope: !369)
!460 = !DILocation(line: 321, column: 12, scope: !453)
!461 = !DILocation(line: 321, column: 5, scope: !453)
!462 = !DILocation(line: 322, column: 3, scope: !369)
!463 = !DILocation(line: 323, column: 1, scope: !369)
!464 = !DILocalVariable(name: "st1", scope: !465, file: !3, line: 302, type: !478)
!465 = distinct !DISubprogram(name: "logical_getcwd", scope: !3, file: !3, line: 300, type: !370, scopeLine: 301, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !466, retainedNodes: !4)
!466 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !467, nameTableKind: None)
!467 = !{!468}
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "longopts", scope: !466, file: !3, line: 41, type: !470, isLocal: true, isDefinition: true)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 1280, elements: !23)
!471 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !473)
!473 = !{!474, !475, !476, !477}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !472, file: !13, line: 52, baseType: !16, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !472, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !472, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !472, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !374, line: 46, size: 1152, elements: !479)
!479 = !{!480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !496, !497, !498}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !478, file: !374, line: 48, baseType: !377, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !478, file: !374, line: 53, baseType: !380, size: 64, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !478, file: !374, line: 61, baseType: !382, size: 64, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !478, file: !374, line: 62, baseType: !384, size: 32, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !478, file: !374, line: 64, baseType: !386, size: 32, offset: 224)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !478, file: !374, line: 65, baseType: !388, size: 32, offset: 256)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !478, file: !374, line: 67, baseType: !19, size: 32, offset: 288)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !478, file: !374, line: 69, baseType: !377, size: 64, offset: 320)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !478, file: !374, line: 74, baseType: !392, size: 64, offset: 384)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !478, file: !374, line: 78, baseType: !395, size: 64, offset: 448)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !478, file: !374, line: 80, baseType: !397, size: 64, offset: 512)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !478, file: !374, line: 91, baseType: !492, size: 128, offset: 576)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !400, line: 10, size: 128, elements: !493)
!493 = !{!494, !495}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !492, file: !400, line: 12, baseType: !403, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !492, file: !400, line: 16, baseType: !405, size: 64, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !478, file: !374, line: 92, baseType: !492, size: 128, offset: 704)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !478, file: !374, line: 93, baseType: !492, size: 128, offset: 832)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !478, file: !374, line: 106, baseType: !409, size: 192, offset: 960)
!499 = !DILocalVariable(name: "st2", scope: !465, file: !3, line: 303, type: !478)
!500 = !DILocalVariable(name: "wd", scope: !465, file: !3, line: 304, type: !7)
!501 = !DILocalVariable(name: "p", scope: !465, file: !3, line: 305, type: !7)
!502 = distinct !DISubprogram(name: "file_name_init", scope: !3, file: !3, line: 85, type: !503, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!503 = !DISubroutineType(types: !504)
!504 = !{!352}
!505 = !DILocalVariable(name: "p", scope: !502, file: !3, line: 87, type: !352)
!506 = !DILocation(line: 87, column: 21, scope: !502)
!507 = !DILocation(line: 87, column: 25, scope: !502)
!508 = !DILocation(line: 91, column: 3, scope: !502)
!509 = !DILocation(line: 91, column: 6, scope: !502)
!510 = !DILocation(line: 91, column: 14, scope: !502)
!511 = !DILocation(line: 93, column: 21, scope: !502)
!512 = !DILocation(line: 93, column: 24, scope: !502)
!513 = !DILocation(line: 93, column: 12, scope: !502)
!514 = !DILocation(line: 93, column: 3, scope: !502)
!515 = !DILocation(line: 93, column: 6, scope: !502)
!516 = !DILocation(line: 93, column: 10, scope: !502)
!517 = !DILocation(line: 94, column: 14, scope: !502)
!518 = !DILocation(line: 94, column: 17, scope: !502)
!519 = !DILocation(line: 94, column: 24, scope: !502)
!520 = !DILocation(line: 94, column: 27, scope: !502)
!521 = !DILocation(line: 94, column: 35, scope: !502)
!522 = !DILocation(line: 94, column: 21, scope: !502)
!523 = !DILocation(line: 94, column: 3, scope: !502)
!524 = !DILocation(line: 94, column: 6, scope: !502)
!525 = !DILocation(line: 94, column: 12, scope: !502)
!526 = !DILocation(line: 95, column: 3, scope: !502)
!527 = !DILocation(line: 95, column: 6, scope: !502)
!528 = !DILocation(line: 95, column: 15, scope: !502)
!529 = !DILocation(line: 96, column: 10, scope: !502)
!530 = !DILocation(line: 96, column: 3, scope: !502)
!531 = distinct !DISubprogram(name: "robust_getcwd", scope: !3, file: !3, line: 268, type: !532, scopeLine: 269, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!532 = !DISubroutineType(types: !533)
!533 = !{null, !352}
!534 = !DILocalVariable(name: "file_name", arg: 1, scope: !531, file: !3, line: 268, type: !352)
!535 = !DILocation(line: 268, column: 34, scope: !531)
!536 = !DILocalVariable(name: "height", scope: !531, file: !3, line: 270, type: !74)
!537 = !DILocation(line: 270, column: 10, scope: !531)
!538 = !DILocalVariable(name: "dev_ino_buf", scope: !531, file: !3, line: 271, type: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !540, line: 7, size: 128, elements: !541)
!540 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!541 = !{!542, !545}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !539, file: !540, line: 9, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !544, line: 47, baseType: !380)
!544 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!545 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !539, file: !540, line: 10, baseType: !546, size: 64, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !544, line: 59, baseType: !377)
!547 = !DILocation(line: 271, column: 18, scope: !531)
!548 = !DILocalVariable(name: "root_dev_ino", scope: !531, file: !3, line: 272, type: !549)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!550 = !DILocation(line: 272, column: 19, scope: !531)
!551 = !DILocation(line: 272, column: 34, scope: !531)
!552 = !DILocalVariable(name: "dot_sb", scope: !531, file: !3, line: 273, type: !373)
!553 = !DILocation(line: 273, column: 15, scope: !531)
!554 = !DILocation(line: 275, column: 7, scope: !555)
!555 = distinct !DILexicalBlock(scope: !531, file: !3, line: 275, column: 7)
!556 = !DILocation(line: 275, column: 20, scope: !555)
!557 = !DILocation(line: 275, column: 7, scope: !531)
!558 = !DILocation(line: 276, column: 5, scope: !555)
!559 = !DILocation(line: 279, column: 7, scope: !560)
!560 = distinct !DILexicalBlock(scope: !531, file: !3, line: 279, column: 7)
!561 = !DILocation(line: 279, column: 27, scope: !560)
!562 = !DILocation(line: 279, column: 7, scope: !531)
!563 = !DILocation(line: 280, column: 5, scope: !560)
!564 = !DILocation(line: 282, column: 3, scope: !531)
!565 = !DILocation(line: 285, column: 11, scope: !566)
!566 = distinct !DILexicalBlock(scope: !567, file: !3, line: 285, column: 11)
!567 = distinct !DILexicalBlock(scope: !531, file: !3, line: 283, column: 5)
!568 = !DILocation(line: 285, column: 11, scope: !567)
!569 = !DILocation(line: 286, column: 9, scope: !566)
!570 = !DILocation(line: 288, column: 32, scope: !567)
!571 = !DILocation(line: 288, column: 49, scope: !567)
!572 = !DILocation(line: 288, column: 7, scope: !567)
!573 = distinct !{!573, !564, !574}
!574 = !DILocation(line: 289, column: 5, scope: !531)
!575 = !DILocation(line: 292, column: 7, scope: !576)
!576 = distinct !DILexicalBlock(scope: !531, file: !3, line: 292, column: 7)
!577 = !DILocation(line: 292, column: 18, scope: !576)
!578 = !DILocation(line: 292, column: 27, scope: !576)
!579 = !DILocation(line: 292, column: 7, scope: !531)
!580 = !DILocation(line: 293, column: 24, scope: !576)
!581 = !DILocation(line: 293, column: 5, scope: !576)
!582 = !DILocation(line: 294, column: 1, scope: !531)
!583 = !DILocalVariable(name: "file_name", arg: 1, scope: !584, file: !3, line: 268, type: !587)
!584 = distinct !DISubprogram(name: "robust_getcwd", scope: !3, file: !3, line: 268, type: !585, scopeLine: 269, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !593, retainedNodes: !4)
!585 = !DISubroutineType(types: !586)
!586 = !{null, !587}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 34, size: 192, elements: !589)
!589 = !{!590, !591, !592}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !588, file: !3, line: 36, baseType: !7, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !588, file: !3, line: 37, baseType: !74, size: 64, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !588, file: !3, line: 38, baseType: !7, size: 64, offset: 128)
!593 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !594, nameTableKind: None)
!594 = !{!595}
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "longopts", scope: !593, file: !3, line: 41, type: !597, isLocal: true, isDefinition: true)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !598, size: 1280, elements: !23)
!598 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !600)
!600 = !{!601, !602, !603, !604}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !599, file: !13, line: 52, baseType: !16, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !599, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !599, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !599, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!605 = !DILocalVariable(name: "height", scope: !584, file: !3, line: 270, type: !74)
!606 = !DILocalVariable(name: "dev_ino_buf", scope: !584, file: !3, line: 271, type: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !540, line: 7, size: 128, elements: !608)
!608 = !{!609, !610}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !607, file: !540, line: 9, baseType: !543, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !607, file: !540, line: 10, baseType: !546, size: 64, offset: 64)
!611 = !DILocalVariable(name: "root_dev_ino", scope: !584, file: !3, line: 272, type: !612)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!613 = !DILocalVariable(name: "dot_sb", scope: !584, file: !3, line: 273, type: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !374, line: 46, size: 1152, elements: !615)
!615 = !{!616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !632, !633, !634}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !614, file: !374, line: 48, baseType: !377, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !614, file: !374, line: 53, baseType: !380, size: 64, offset: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !614, file: !374, line: 61, baseType: !382, size: 64, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !614, file: !374, line: 62, baseType: !384, size: 32, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !614, file: !374, line: 64, baseType: !386, size: 32, offset: 224)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !614, file: !374, line: 65, baseType: !388, size: 32, offset: 256)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !614, file: !374, line: 67, baseType: !19, size: 32, offset: 288)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !614, file: !374, line: 69, baseType: !377, size: 64, offset: 320)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !614, file: !374, line: 74, baseType: !392, size: 64, offset: 384)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !614, file: !374, line: 78, baseType: !395, size: 64, offset: 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !614, file: !374, line: 80, baseType: !397, size: 64, offset: 512)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !614, file: !374, line: 91, baseType: !628, size: 128, offset: 576)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !400, line: 10, size: 128, elements: !629)
!629 = !{!630, !631}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !628, file: !400, line: 12, baseType: !403, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !628, file: !400, line: 16, baseType: !405, size: 64, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !614, file: !374, line: 92, baseType: !628, size: 128, offset: 704)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !614, file: !374, line: 93, baseType: !628, size: 128, offset: 832)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !614, file: !374, line: 106, baseType: !409, size: 192, offset: 960)
!635 = distinct !DISubprogram(name: "file_name_free", scope: !3, file: !3, line: 78, type: !532, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!636 = !DILocalVariable(name: "p", arg: 1, scope: !635, file: !3, line: 78, type: !352)
!637 = !DILocation(line: 78, column: 35, scope: !635)
!638 = !DILocation(line: 80, column: 9, scope: !635)
!639 = !DILocation(line: 80, column: 12, scope: !635)
!640 = !DILocation(line: 80, column: 3, scope: !635)
!641 = !DILocation(line: 81, column: 9, scope: !635)
!642 = !DILocation(line: 81, column: 3, scope: !635)
!643 = !DILocation(line: 82, column: 1, scope: !635)
!644 = !DILocalVariable(name: "p", arg: 1, scope: !645, file: !3, line: 78, type: !648)
!645 = distinct !DISubprogram(name: "file_name_free", scope: !3, file: !3, line: 78, type: !646, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !654, retainedNodes: !4)
!646 = !DISubroutineType(types: !647)
!647 = !{null, !648}
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 34, size: 192, elements: !650)
!650 = !{!651, !652, !653}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !649, file: !3, line: 36, baseType: !7, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !649, file: !3, line: 37, baseType: !74, size: 64, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !649, file: !3, line: 38, baseType: !7, size: 64, offset: 128)
!654 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !655, nameTableKind: None)
!655 = !{!656}
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "longopts", scope: !654, file: !3, line: 41, type: !658, isLocal: true, isDefinition: true)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !659, size: 1280, elements: !23)
!659 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !661)
!661 = !{!662, !663, !664, !665}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !660, file: !13, line: 52, baseType: !16, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !660, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !660, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !660, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!666 = distinct !DISubprogram(name: "find_dir_entry", scope: !3, file: !3, line: 153, type: !667, scopeLine: 155, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!667 = !DISubroutineType(types: !668)
!668 = !{null, !669, !352, !74}
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!670 = !DILocalVariable(name: "dot_sb", arg: 1, scope: !666, file: !3, line: 153, type: !669)
!671 = !DILocation(line: 153, column: 30, scope: !666)
!672 = !DILocalVariable(name: "file_name", arg: 2, scope: !666, file: !3, line: 153, type: !352)
!673 = !DILocation(line: 153, column: 56, scope: !666)
!674 = !DILocalVariable(name: "parent_height", arg: 3, scope: !666, file: !3, line: 154, type: !74)
!675 = !DILocation(line: 154, column: 24, scope: !666)
!676 = !DILocalVariable(name: "dirp", scope: !666, file: !3, line: 156, type: !677)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !679, line: 127, baseType: !680)
!679 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !679, line: 127, flags: DIFlagFwdDecl)
!681 = !DILocation(line: 156, column: 8, scope: !666)
!682 = !DILocalVariable(name: "fd", scope: !666, file: !3, line: 157, type: !19)
!683 = !DILocation(line: 157, column: 7, scope: !666)
!684 = !DILocalVariable(name: "parent_sb", scope: !666, file: !3, line: 158, type: !373)
!685 = !DILocation(line: 158, column: 15, scope: !666)
!686 = !DILocalVariable(name: "use_lstat", scope: !666, file: !3, line: 159, type: !38)
!687 = !DILocation(line: 159, column: 8, scope: !666)
!688 = !DILocalVariable(name: "found", scope: !666, file: !3, line: 160, type: !38)
!689 = !DILocation(line: 160, column: 8, scope: !666)
!690 = !DILocation(line: 162, column: 10, scope: !666)
!691 = !DILocation(line: 162, column: 8, scope: !666)
!692 = !DILocation(line: 163, column: 7, scope: !693)
!693 = distinct !DILexicalBlock(scope: !666, file: !3, line: 163, column: 7)
!694 = !DILocation(line: 163, column: 12, scope: !693)
!695 = !DILocation(line: 163, column: 7, scope: !666)
!696 = !DILocation(line: 164, column: 5, scope: !693)
!697 = !DILocation(line: 167, column: 15, scope: !666)
!698 = !DILocation(line: 167, column: 8, scope: !666)
!699 = !DILocation(line: 167, column: 6, scope: !666)
!700 = !DILocation(line: 168, column: 13, scope: !701)
!701 = distinct !DILexicalBlock(scope: !666, file: !3, line: 168, column: 7)
!702 = !DILocation(line: 168, column: 10, scope: !701)
!703 = !DILocation(line: 168, column: 8, scope: !701)
!704 = !DILocation(line: 168, column: 26, scope: !701)
!705 = !DILocation(line: 168, column: 18, scope: !701)
!706 = !DILocation(line: 168, column: 32, scope: !701)
!707 = !DILocation(line: 168, column: 46, scope: !701)
!708 = !DILocation(line: 168, column: 7, scope: !666)
!709 = !DILocation(line: 169, column: 5, scope: !701)
!710 = !DILocation(line: 172, column: 13, scope: !711)
!711 = distinct !DILexicalBlock(scope: !666, file: !3, line: 172, column: 7)
!712 = !DILocation(line: 172, column: 10, scope: !711)
!713 = !DILocation(line: 172, column: 8, scope: !711)
!714 = !DILocation(line: 172, column: 25, scope: !711)
!715 = !DILocation(line: 172, column: 18, scope: !711)
!716 = !DILocation(line: 172, column: 43, scope: !711)
!717 = !DILocation(line: 172, column: 67, scope: !711)
!718 = !DILocation(line: 172, column: 7, scope: !666)
!719 = !DILocation(line: 173, column: 5, scope: !711)
!720 = !DILocation(line: 178, column: 26, scope: !666)
!721 = !DILocation(line: 178, column: 36, scope: !666)
!722 = !DILocation(line: 178, column: 44, scope: !666)
!723 = !DILocation(line: 178, column: 33, scope: !666)
!724 = !DILocation(line: 178, column: 13, scope: !666)
!725 = !DILocation(line: 180, column: 9, scope: !666)
!726 = !DILocation(line: 181, column: 3, scope: !666)
!727 = !DILocalVariable(name: "dp", scope: !728, file: !3, line: 183, type: !729)
!728 = distinct !DILexicalBlock(scope: !666, file: !3, line: 182, column: 5)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !732, line: 22, size: 2240, elements: !733)
!732 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!733 = !{!734, !735, !736, !737, !738}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !731, file: !732, line: 25, baseType: !380, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !731, file: !732, line: 26, baseType: !392, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !731, file: !732, line: 31, baseType: !73, size: 16, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !731, file: !732, line: 32, baseType: !148, size: 8, offset: 144)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !731, file: !732, line: 33, baseType: !105, size: 2048, offset: 152)
!739 = !DILocation(line: 183, column: 28, scope: !728)
!740 = !DILocalVariable(name: "ent_sb", scope: !728, file: !3, line: 184, type: !373)
!741 = !DILocation(line: 184, column: 19, scope: !728)
!742 = !DILocalVariable(name: "ino", scope: !728, file: !3, line: 185, type: !543)
!743 = !DILocation(line: 185, column: 13, scope: !728)
!744 = !DILocation(line: 187, column: 7, scope: !728)
!745 = !DILocation(line: 187, column: 13, scope: !728)
!746 = !DILocation(line: 188, column: 50, scope: !747)
!747 = distinct !DILexicalBlock(scope: !728, file: !3, line: 188, column: 11)
!748 = !DILocation(line: 188, column: 17, scope: !747)
!749 = !DILocation(line: 188, column: 15, scope: !747)
!750 = !DILocation(line: 188, column: 57, scope: !747)
!751 = !DILocation(line: 188, column: 11, scope: !728)
!752 = !DILocation(line: 190, column: 15, scope: !753)
!753 = distinct !DILexicalBlock(scope: !754, file: !3, line: 190, column: 15)
!754 = distinct !DILexicalBlock(scope: !747, file: !3, line: 189, column: 9)
!755 = !DILocation(line: 190, column: 15, scope: !754)
!756 = !DILocalVariable(name: "e", scope: !757, file: !3, line: 193, type: !19)
!757 = distinct !DILexicalBlock(scope: !753, file: !3, line: 191, column: 13)
!758 = !DILocation(line: 193, column: 19, scope: !757)
!759 = !DILocation(line: 193, column: 23, scope: !757)
!760 = !DILocation(line: 194, column: 25, scope: !757)
!761 = !DILocation(line: 194, column: 15, scope: !757)
!762 = !DILocation(line: 195, column: 23, scope: !757)
!763 = !DILocation(line: 195, column: 15, scope: !757)
!764 = !DILocation(line: 195, column: 21, scope: !757)
!765 = !DILocation(line: 198, column: 20, scope: !757)
!766 = !DILocation(line: 199, column: 13, scope: !757)
!767 = !DILocation(line: 200, column: 11, scope: !754)
!768 = !DILocation(line: 203, column: 13, scope: !728)
!769 = !DILocation(line: 203, column: 11, scope: !728)
!770 = !DILocation(line: 205, column: 11, scope: !771)
!771 = distinct !DILexicalBlock(scope: !728, file: !3, line: 205, column: 11)
!772 = !DILocation(line: 205, column: 15, scope: !771)
!773 = !DILocation(line: 205, column: 38, scope: !771)
!774 = !DILocation(line: 205, column: 41, scope: !771)
!775 = !DILocation(line: 205, column: 11, scope: !728)
!776 = !DILocation(line: 207, column: 22, scope: !777)
!777 = distinct !DILexicalBlock(scope: !778, file: !3, line: 207, column: 15)
!778 = distinct !DILexicalBlock(scope: !771, file: !3, line: 206, column: 9)
!779 = !DILocation(line: 207, column: 26, scope: !777)
!780 = !DILocation(line: 207, column: 15, scope: !777)
!781 = !DILocation(line: 207, column: 43, scope: !777)
!782 = !DILocation(line: 207, column: 15, scope: !778)
!783 = !DILocation(line: 210, column: 15, scope: !784)
!784 = distinct !DILexicalBlock(scope: !777, file: !3, line: 208, column: 13)
!785 = distinct !{!785, !726, !786}
!786 = !DILocation(line: 226, column: 5, scope: !666)
!787 = !DILocation(line: 212, column: 24, scope: !778)
!788 = !DILocation(line: 212, column: 15, scope: !778)
!789 = !DILocation(line: 213, column: 9, scope: !778)
!790 = !DILocation(line: 215, column: 11, scope: !791)
!791 = distinct !DILexicalBlock(scope: !728, file: !3, line: 215, column: 11)
!792 = !DILocation(line: 215, column: 18, scope: !791)
!793 = !DILocation(line: 215, column: 26, scope: !791)
!794 = !DILocation(line: 215, column: 15, scope: !791)
!795 = !DILocation(line: 215, column: 11, scope: !728)
!796 = !DILocation(line: 216, column: 9, scope: !791)
!797 = !DILocation(line: 220, column: 14, scope: !798)
!798 = distinct !DILexicalBlock(scope: !728, file: !3, line: 220, column: 12)
!799 = !DILocation(line: 220, column: 24, scope: !798)
!800 = !DILocation(line: 220, column: 34, scope: !798)
!801 = !DILocation(line: 220, column: 44, scope: !798)
!802 = !DILocation(line: 220, column: 52, scope: !798)
!803 = !DILocation(line: 220, column: 41, scope: !798)
!804 = !DILocation(line: 220, column: 12, scope: !728)
!805 = !DILocation(line: 222, column: 30, scope: !806)
!806 = distinct !DILexicalBlock(scope: !798, file: !3, line: 221, column: 9)
!807 = !DILocation(line: 222, column: 41, scope: !806)
!808 = !DILocation(line: 222, column: 45, scope: !806)
!809 = !DILocation(line: 222, column: 53, scope: !806)
!810 = !DILocation(line: 222, column: 11, scope: !806)
!811 = !DILocation(line: 223, column: 17, scope: !806)
!812 = !DILocation(line: 224, column: 11, scope: !806)
!813 = !DILocation(line: 228, column: 7, scope: !814)
!814 = distinct !DILexicalBlock(scope: !666, file: !3, line: 228, column: 7)
!815 = !DILocation(line: 228, column: 12, scope: !814)
!816 = !DILocation(line: 228, column: 20, scope: !814)
!817 = !DILocation(line: 228, column: 33, scope: !814)
!818 = !DILocation(line: 228, column: 23, scope: !814)
!819 = !DILocation(line: 228, column: 39, scope: !814)
!820 = !DILocation(line: 228, column: 7, scope: !666)
!821 = !DILocation(line: 232, column: 7, scope: !822)
!822 = distinct !DILexicalBlock(scope: !814, file: !3, line: 229, column: 5)
!823 = !DILocation(line: 236, column: 10, scope: !824)
!824 = distinct !DILexicalBlock(scope: !666, file: !3, line: 236, column: 8)
!825 = !DILocation(line: 236, column: 8, scope: !666)
!826 = !DILocation(line: 237, column: 5, scope: !824)
!827 = !DILocation(line: 241, column: 4, scope: !666)
!828 = !DILocation(line: 241, column: 13, scope: !666)
!829 = !DILocation(line: 242, column: 1, scope: !666)
!830 = distinct !DISubprogram(name: "file_name_prepend", scope: !3, file: !3, line: 101, type: !831, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!831 = !DISubroutineType(types: !832)
!832 = !{null, !352, !16, !74}
!833 = !DILocalVariable(name: "p", arg: 1, scope: !830, file: !3, line: 101, type: !352)
!834 = !DILocation(line: 101, column: 38, scope: !830)
!835 = !DILocalVariable(name: "s", arg: 2, scope: !830, file: !3, line: 101, type: !16)
!836 = !DILocation(line: 101, column: 53, scope: !830)
!837 = !DILocalVariable(name: "s_len", arg: 3, scope: !830, file: !3, line: 101, type: !74)
!838 = !DILocation(line: 101, column: 63, scope: !830)
!839 = !DILocalVariable(name: "n_free", scope: !830, file: !3, line: 103, type: !74)
!840 = !DILocation(line: 103, column: 10, scope: !830)
!841 = !DILocation(line: 103, column: 19, scope: !830)
!842 = !DILocation(line: 103, column: 22, scope: !830)
!843 = !DILocation(line: 103, column: 30, scope: !830)
!844 = !DILocation(line: 103, column: 33, scope: !830)
!845 = !DILocation(line: 103, column: 28, scope: !830)
!846 = !DILocation(line: 104, column: 7, scope: !847)
!847 = distinct !DILexicalBlock(scope: !830, file: !3, line: 104, column: 7)
!848 = !DILocation(line: 104, column: 20, scope: !847)
!849 = !DILocation(line: 104, column: 18, scope: !847)
!850 = !DILocation(line: 104, column: 14, scope: !847)
!851 = !DILocation(line: 104, column: 7, scope: !830)
!852 = !DILocalVariable(name: "half", scope: !853, file: !3, line: 106, type: !74)
!853 = distinct !DILexicalBlock(scope: !847, file: !3, line: 105, column: 5)
!854 = !DILocation(line: 106, column: 14, scope: !853)
!855 = !DILocation(line: 106, column: 21, scope: !853)
!856 = !DILocation(line: 106, column: 24, scope: !853)
!857 = !DILocation(line: 106, column: 32, scope: !853)
!858 = !DILocation(line: 106, column: 38, scope: !853)
!859 = !DILocation(line: 106, column: 36, scope: !853)
!860 = !DILocalVariable(name: "q", scope: !853, file: !3, line: 111, type: !7)
!861 = !DILocation(line: 111, column: 13, scope: !853)
!862 = !DILocation(line: 111, column: 30, scope: !853)
!863 = !DILocation(line: 111, column: 17, scope: !853)
!864 = !DILocalVariable(name: "n_used", scope: !853, file: !3, line: 112, type: !74)
!865 = !DILocation(line: 112, column: 14, scope: !853)
!866 = !DILocation(line: 112, column: 23, scope: !853)
!867 = !DILocation(line: 112, column: 26, scope: !853)
!868 = !DILocation(line: 112, column: 36, scope: !853)
!869 = !DILocation(line: 112, column: 34, scope: !853)
!870 = !DILocation(line: 113, column: 18, scope: !853)
!871 = !DILocation(line: 113, column: 26, scope: !853)
!872 = !DILocation(line: 113, column: 24, scope: !853)
!873 = !DILocation(line: 113, column: 20, scope: !853)
!874 = !DILocation(line: 113, column: 33, scope: !853)
!875 = !DILocation(line: 113, column: 31, scope: !853)
!876 = !DILocation(line: 113, column: 7, scope: !853)
!877 = !DILocation(line: 113, column: 10, scope: !853)
!878 = !DILocation(line: 113, column: 16, scope: !853)
!879 = !DILocation(line: 114, column: 15, scope: !853)
!880 = !DILocation(line: 114, column: 18, scope: !853)
!881 = !DILocation(line: 114, column: 25, scope: !853)
!882 = !DILocation(line: 114, column: 28, scope: !853)
!883 = !DILocation(line: 114, column: 34, scope: !853)
!884 = !DILocation(line: 114, column: 32, scope: !853)
!885 = !DILocation(line: 114, column: 42, scope: !853)
!886 = !DILocation(line: 114, column: 7, scope: !853)
!887 = !DILocation(line: 115, column: 13, scope: !853)
!888 = !DILocation(line: 115, column: 16, scope: !853)
!889 = !DILocation(line: 115, column: 7, scope: !853)
!890 = !DILocation(line: 116, column: 16, scope: !853)
!891 = !DILocation(line: 116, column: 7, scope: !853)
!892 = !DILocation(line: 116, column: 10, scope: !853)
!893 = !DILocation(line: 116, column: 14, scope: !853)
!894 = !DILocation(line: 117, column: 24, scope: !853)
!895 = !DILocation(line: 117, column: 22, scope: !853)
!896 = !DILocation(line: 117, column: 7, scope: !853)
!897 = !DILocation(line: 117, column: 10, scope: !853)
!898 = !DILocation(line: 117, column: 18, scope: !853)
!899 = !DILocation(line: 118, column: 5, scope: !853)
!900 = !DILocation(line: 120, column: 19, scope: !830)
!901 = !DILocation(line: 120, column: 17, scope: !830)
!902 = !DILocation(line: 120, column: 3, scope: !830)
!903 = !DILocation(line: 120, column: 6, scope: !830)
!904 = !DILocation(line: 120, column: 12, scope: !830)
!905 = !DILocation(line: 121, column: 3, scope: !830)
!906 = !DILocation(line: 121, column: 6, scope: !830)
!907 = !DILocation(line: 121, column: 15, scope: !830)
!908 = !DILocation(line: 122, column: 11, scope: !830)
!909 = !DILocation(line: 122, column: 14, scope: !830)
!910 = !DILocation(line: 122, column: 20, scope: !830)
!911 = !DILocation(line: 122, column: 25, scope: !830)
!912 = !DILocation(line: 122, column: 28, scope: !830)
!913 = !DILocation(line: 122, column: 3, scope: !830)
!914 = !DILocation(line: 123, column: 1, scope: !830)
!915 = !DILocalVariable(name: "q", scope: !916, file: !3, line: 111, type: !7)
!916 = distinct !DILexicalBlock(scope: !917, file: !3, line: 105, column: 5)
!917 = distinct !DILexicalBlock(scope: !918, file: !3, line: 104, column: 7)
!918 = distinct !DISubprogram(name: "file_name_prepend", scope: !3, file: !3, line: 101, type: !919, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !927, retainedNodes: !4)
!919 = !DISubroutineType(types: !920)
!920 = !{null, !921, !16, !74}
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 34, size: 192, elements: !923)
!923 = !{!924, !925, !926}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !922, file: !3, line: 36, baseType: !7, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !922, file: !3, line: 37, baseType: !74, size: 64, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !922, file: !3, line: 38, baseType: !7, size: 64, offset: 128)
!927 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !928, nameTableKind: None)
!928 = !{!929}
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(name: "longopts", scope: !927, file: !3, line: 41, type: !931, isLocal: true, isDefinition: true)
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !932, size: 1280, elements: !23)
!932 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !933)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !934)
!934 = !{!935, !936, !937, !938}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !933, file: !13, line: 52, baseType: !16, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !933, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !933, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !933, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!939 = !DILocalVariable(name: "n_used", scope: !916, file: !3, line: 112, type: !74)
!940 = distinct !DISubprogram(name: "nth_parent", scope: !3, file: !3, line: 127, type: !941, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!941 = !DISubroutineType(types: !942)
!942 = !{!7, !74}
!943 = !DILocalVariable(name: "n", arg: 1, scope: !940, file: !3, line: 127, type: !74)
!944 = !DILocation(line: 127, column: 20, scope: !940)
!945 = !DILocalVariable(name: "buf", scope: !940, file: !3, line: 129, type: !7)
!946 = !DILocation(line: 129, column: 9, scope: !940)
!947 = !DILocation(line: 129, column: 28, scope: !940)
!948 = !DILocation(line: 129, column: 15, scope: !940)
!949 = !DILocalVariable(name: "p", scope: !940, file: !3, line: 130, type: !7)
!950 = !DILocation(line: 130, column: 9, scope: !940)
!951 = !DILocation(line: 130, column: 13, scope: !940)
!952 = !DILocalVariable(name: "i", scope: !953, file: !3, line: 132, type: !74)
!953 = distinct !DILexicalBlock(scope: !940, file: !3, line: 132, column: 3)
!954 = !DILocation(line: 132, column: 15, scope: !953)
!955 = !DILocation(line: 132, column: 8, scope: !953)
!956 = !DILocation(line: 132, column: 22, scope: !957)
!957 = distinct !DILexicalBlock(scope: !953, file: !3, line: 132, column: 3)
!958 = !DILocation(line: 132, column: 26, scope: !957)
!959 = !DILocation(line: 132, column: 24, scope: !957)
!960 = !DILocation(line: 132, column: 3, scope: !953)
!961 = !DILocation(line: 134, column: 15, scope: !962)
!962 = distinct !DILexicalBlock(scope: !957, file: !3, line: 133, column: 5)
!963 = !DILocation(line: 134, column: 7, scope: !962)
!964 = !DILocation(line: 135, column: 9, scope: !962)
!965 = !DILocation(line: 136, column: 5, scope: !962)
!966 = !DILocation(line: 132, column: 30, scope: !957)
!967 = !DILocation(line: 132, column: 3, scope: !957)
!968 = distinct !{!968, !960, !969}
!969 = !DILocation(line: 136, column: 5, scope: !953)
!970 = !DILocation(line: 137, column: 3, scope: !940)
!971 = !DILocation(line: 137, column: 9, scope: !940)
!972 = !DILocation(line: 138, column: 10, scope: !940)
!973 = !DILocation(line: 138, column: 3, scope: !940)
!974 = distinct !DISubprogram(name: "readdir_ignoring_dot_and_dotdot", scope: !198, file: !198, line: 278, type: !975, scopeLine: 279, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!975 = !DISubroutineType(types: !976)
!976 = !{!729, !677}
!977 = !DILocalVariable(name: "dirp", arg: 1, scope: !974, file: !198, line: 278, type: !677)
!978 = !DILocation(line: 278, column: 39, scope: !974)
!979 = !DILocation(line: 280, column: 3, scope: !974)
!980 = !DILocalVariable(name: "dp", scope: !981, file: !198, line: 282, type: !729)
!981 = distinct !DILexicalBlock(scope: !974, file: !198, line: 281, column: 5)
!982 = !DILocation(line: 282, column: 28, scope: !981)
!983 = !DILocation(line: 282, column: 42, scope: !981)
!984 = !DILocation(line: 282, column: 33, scope: !981)
!985 = !DILocation(line: 283, column: 11, scope: !986)
!986 = distinct !DILexicalBlock(scope: !981, file: !198, line: 283, column: 11)
!987 = !DILocation(line: 283, column: 14, scope: !986)
!988 = !DILocation(line: 283, column: 22, scope: !986)
!989 = !DILocation(line: 283, column: 42, scope: !986)
!990 = !DILocation(line: 283, column: 46, scope: !986)
!991 = !DILocation(line: 283, column: 27, scope: !986)
!992 = !DILocation(line: 283, column: 11, scope: !981)
!993 = !DILocation(line: 284, column: 16, scope: !986)
!994 = !DILocation(line: 284, column: 9, scope: !986)
!995 = distinct !{!995, !979, !996}
!996 = !DILocation(line: 285, column: 5, scope: !974)
!997 = !DILocalVariable(name: "dirp", arg: 1, scope: !998, file: !198, line: 278, type: !677)
!998 = distinct !DISubprogram(name: "readdir_ignoring_dot_and_dotdot", scope: !198, file: !198, line: 278, type: !999, scopeLine: 279, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1010, retainedNodes: !4)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!1001, !677}
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1003)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !732, line: 22, size: 2240, elements: !1004)
!1004 = !{!1005, !1006, !1007, !1008, !1009}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !1003, file: !732, line: 25, baseType: !380, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !1003, file: !732, line: 26, baseType: !392, size: 64, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !1003, file: !732, line: 31, baseType: !73, size: 16, offset: 128)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !1003, file: !732, line: 32, baseType: !148, size: 8, offset: 144)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !1003, file: !732, line: 33, baseType: !105, size: 2048, offset: 152)
!1010 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !1011, nameTableKind: None)
!1011 = !{!1012}
!1012 = !DIGlobalVariableExpression(var: !1013, expr: !DIExpression())
!1013 = distinct !DIGlobalVariable(name: "longopts", scope: !1010, file: !3, line: 41, type: !1014, isLocal: true, isDefinition: true)
!1014 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1015, size: 1280, elements: !23)
!1015 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1016)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !1017)
!1017 = !{!1018, !1019, !1020, !1021}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1016, file: !13, line: 52, baseType: !16, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !1016, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1016, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1016, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!1022 = distinct !DISubprogram(name: "dot_or_dotdot", scope: !198, file: !198, line: 265, type: !1023, scopeLine: 266, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!38, !16}
!1025 = !DILocalVariable(name: "file_name", arg: 1, scope: !1022, file: !198, line: 265, type: !16)
!1026 = !DILocation(line: 265, column: 28, scope: !1022)
!1027 = !DILocation(line: 267, column: 7, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !1022, file: !198, line: 267, column: 7)
!1029 = !DILocation(line: 267, column: 20, scope: !1028)
!1030 = !DILocation(line: 267, column: 7, scope: !1022)
!1031 = !DILocalVariable(name: "sep", scope: !1032, file: !198, line: 269, type: !8)
!1032 = distinct !DILexicalBlock(scope: !1028, file: !198, line: 268, column: 5)
!1033 = !DILocation(line: 269, column: 12, scope: !1032)
!1034 = !DILocation(line: 269, column: 18, scope: !1032)
!1035 = !DILocation(line: 269, column: 29, scope: !1032)
!1036 = !DILocation(line: 269, column: 42, scope: !1032)
!1037 = !DILocation(line: 269, column: 50, scope: !1032)
!1038 = !DILocation(line: 270, column: 17, scope: !1032)
!1039 = !DILocation(line: 270, column: 21, scope: !1032)
!1040 = !DILocation(line: 270, column: 24, scope: !1032)
!1041 = !DILocation(line: 270, column: 7, scope: !1032)
!1042 = !DILocation(line: 273, column: 5, scope: !1028)
!1043 = !DILocation(line: 274, column: 1, scope: !1022)
!1044 = distinct !DISubprogram(name: "close_stdout", scope: !37, file: !37, line: 117, type: !1045, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !32, retainedNodes: !4)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{null}
!1047 = !DILocation(line: 119, column: 21, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !1044, file: !37, line: 119, column: 7)
!1049 = !DILocation(line: 119, column: 7, scope: !1048)
!1050 = !DILocation(line: 119, column: 29, scope: !1048)
!1051 = !DILocation(line: 120, column: 7, scope: !1048)
!1052 = !DILocation(line: 120, column: 12, scope: !1048)
!1053 = !DILocation(line: 120, column: 25, scope: !1048)
!1054 = !DILocation(line: 120, column: 28, scope: !1048)
!1055 = !DILocation(line: 120, column: 34, scope: !1048)
!1056 = !DILocation(line: 119, column: 7, scope: !1044)
!1057 = !DILocalVariable(name: "write_error", scope: !1058, file: !37, line: 122, type: !16)
!1058 = distinct !DILexicalBlock(scope: !1048, file: !37, line: 121, column: 5)
!1059 = !DILocation(line: 122, column: 19, scope: !1058)
!1060 = !DILocation(line: 122, column: 33, scope: !1058)
!1061 = !DILocation(line: 123, column: 11, scope: !1062)
!1062 = distinct !DILexicalBlock(scope: !1058, file: !37, line: 123, column: 11)
!1063 = !DILocation(line: 123, column: 11, scope: !1058)
!1064 = !DILocation(line: 124, column: 19, scope: !1062)
!1065 = !DILocation(line: 124, column: 52, scope: !1062)
!1066 = !DILocation(line: 124, column: 36, scope: !1062)
!1067 = !DILocation(line: 125, column: 16, scope: !1062)
!1068 = !DILocation(line: 124, column: 9, scope: !1062)
!1069 = !DILocation(line: 127, column: 19, scope: !1062)
!1070 = !DILocation(line: 127, column: 32, scope: !1062)
!1071 = !DILocation(line: 127, column: 9, scope: !1062)
!1072 = !DILocation(line: 129, column: 14, scope: !1058)
!1073 = !DILocation(line: 129, column: 7, scope: !1058)
!1074 = !DILocation(line: 134, column: 42, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1044, file: !37, line: 134, column: 7)
!1076 = !DILocation(line: 134, column: 28, scope: !1075)
!1077 = !DILocation(line: 134, column: 50, scope: !1075)
!1078 = !DILocation(line: 134, column: 7, scope: !1044)
!1079 = !DILocation(line: 135, column: 12, scope: !1075)
!1080 = !DILocation(line: 135, column: 5, scope: !1075)
!1081 = !DILocation(line: 136, column: 1, scope: !1044)
!1082 = distinct !DISubprogram(name: "set_program_name", scope: !51, file: !51, line: 39, type: !199, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !4)
!1083 = !DILocalVariable(name: "argv0", arg: 1, scope: !1082, file: !51, line: 39, type: !16)
!1084 = !DILocation(line: 39, column: 31, scope: !1082)
!1085 = !DILocalVariable(name: "slash", scope: !1082, file: !51, line: 46, type: !16)
!1086 = !DILocation(line: 46, column: 15, scope: !1082)
!1087 = !DILocalVariable(name: "base", scope: !1082, file: !51, line: 47, type: !16)
!1088 = !DILocation(line: 47, column: 15, scope: !1082)
!1089 = !DILocation(line: 51, column: 7, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !1082, file: !51, line: 51, column: 7)
!1091 = !DILocation(line: 51, column: 13, scope: !1090)
!1092 = !DILocation(line: 51, column: 7, scope: !1082)
!1093 = !DILocation(line: 55, column: 14, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !1090, file: !51, line: 52, column: 5)
!1095 = !DILocation(line: 54, column: 7, scope: !1094)
!1096 = !DILocation(line: 56, column: 7, scope: !1094)
!1097 = !DILocation(line: 59, column: 20, scope: !1082)
!1098 = !DILocation(line: 59, column: 11, scope: !1082)
!1099 = !DILocation(line: 59, column: 9, scope: !1082)
!1100 = !DILocation(line: 60, column: 11, scope: !1082)
!1101 = !DILocation(line: 60, column: 17, scope: !1082)
!1102 = !DILocation(line: 60, column: 27, scope: !1082)
!1103 = !DILocation(line: 60, column: 33, scope: !1082)
!1104 = !DILocation(line: 60, column: 39, scope: !1082)
!1105 = !DILocation(line: 60, column: 8, scope: !1082)
!1106 = !DILocation(line: 61, column: 7, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1082, file: !51, line: 61, column: 7)
!1108 = !DILocation(line: 61, column: 14, scope: !1107)
!1109 = !DILocation(line: 61, column: 12, scope: !1107)
!1110 = !DILocation(line: 61, column: 20, scope: !1107)
!1111 = !DILocation(line: 61, column: 25, scope: !1107)
!1112 = !DILocation(line: 61, column: 37, scope: !1107)
!1113 = !DILocation(line: 61, column: 42, scope: !1107)
!1114 = !DILocation(line: 61, column: 28, scope: !1107)
!1115 = !DILocation(line: 61, column: 61, scope: !1107)
!1116 = !DILocation(line: 61, column: 7, scope: !1082)
!1117 = !DILocation(line: 63, column: 15, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !1107, file: !51, line: 62, column: 5)
!1119 = !DILocation(line: 63, column: 13, scope: !1118)
!1120 = !DILocation(line: 64, column: 20, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1118, file: !51, line: 64, column: 11)
!1122 = !DILocation(line: 64, column: 11, scope: !1121)
!1123 = !DILocation(line: 64, column: 36, scope: !1121)
!1124 = !DILocation(line: 64, column: 11, scope: !1118)
!1125 = !DILocation(line: 66, column: 19, scope: !1126)
!1126 = distinct !DILexicalBlock(scope: !1121, file: !51, line: 65, column: 9)
!1127 = !DILocation(line: 66, column: 24, scope: !1126)
!1128 = !DILocation(line: 66, column: 17, scope: !1126)
!1129 = !DILocation(line: 70, column: 52, scope: !1126)
!1130 = !DILocation(line: 70, column: 41, scope: !1126)
!1131 = !DILocation(line: 72, column: 9, scope: !1126)
!1132 = !DILocation(line: 73, column: 5, scope: !1118)
!1133 = !DILocation(line: 84, column: 18, scope: !1082)
!1134 = !DILocation(line: 84, column: 16, scope: !1082)
!1135 = !DILocation(line: 90, column: 38, scope: !1082)
!1136 = !DILocation(line: 90, column: 27, scope: !1082)
!1137 = !DILocation(line: 92, column: 1, scope: !1082)
!1138 = !DILocalVariable(name: "argv0", arg: 1, scope: !1139, file: !51, line: 39, type: !16)
!1139 = distinct !DISubprogram(name: "set_program_name", scope: !51, file: !51, line: 39, type: !199, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1140, retainedNodes: !4)
!1140 = distinct !DICompileUnit(language: DW_LANG_C99, file: !49, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !1141, nameTableKind: None)
!1141 = !{!1142}
!1142 = !DIGlobalVariableExpression(var: !1143, expr: !DIExpression())
!1143 = distinct !DIGlobalVariable(name: "program_name", scope: !1140, file: !51, line: 33, type: !16, isLocal: false, isDefinition: true)
!1144 = !DILocalVariable(name: "slash", scope: !1139, file: !51, line: 46, type: !16)
!1145 = !DILocalVariable(name: "base", scope: !1139, file: !51, line: 47, type: !16)
!1146 = distinct !DISubprogram(name: "set_char_quoting", scope: !80, file: !80, line: 152, type: !1147, scopeLine: 153, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !54, retainedNodes: !4)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{!19, !1149, !8, !19}
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!1150 = !DILocalVariable(name: "o", arg: 1, scope: !1146, file: !80, line: 152, type: !1149)
!1151 = !DILocation(line: 152, column: 43, scope: !1146)
!1152 = !DILocalVariable(name: "c", arg: 2, scope: !1146, file: !80, line: 152, type: !8)
!1153 = !DILocation(line: 152, column: 51, scope: !1146)
!1154 = !DILocalVariable(name: "i", arg: 3, scope: !1146, file: !80, line: 152, type: !19)
!1155 = !DILocation(line: 152, column: 58, scope: !1146)
!1156 = !DILocalVariable(name: "uc", scope: !1146, file: !80, line: 154, type: !148)
!1157 = !DILocation(line: 154, column: 17, scope: !1146)
!1158 = !DILocation(line: 154, column: 22, scope: !1146)
!1159 = !DILocalVariable(name: "p", scope: !1146, file: !80, line: 155, type: !1160)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!1161 = !DILocation(line: 155, column: 17, scope: !1146)
!1162 = !DILocation(line: 156, column: 6, scope: !1146)
!1163 = !DILocation(line: 156, column: 10, scope: !1146)
!1164 = !DILocation(line: 156, column: 41, scope: !1146)
!1165 = !DILocation(line: 156, column: 5, scope: !1146)
!1166 = !DILocation(line: 156, column: 59, scope: !1146)
!1167 = !DILocation(line: 156, column: 62, scope: !1146)
!1168 = !DILocation(line: 156, column: 57, scope: !1146)
!1169 = !DILocalVariable(name: "shift", scope: !1146, file: !80, line: 157, type: !19)
!1170 = !DILocation(line: 157, column: 7, scope: !1146)
!1171 = !DILocation(line: 157, column: 15, scope: !1146)
!1172 = !DILocation(line: 157, column: 18, scope: !1146)
!1173 = !DILocalVariable(name: "r", scope: !1146, file: !80, line: 158, type: !19)
!1174 = !DILocation(line: 158, column: 7, scope: !1146)
!1175 = !DILocation(line: 158, column: 13, scope: !1146)
!1176 = !DILocation(line: 158, column: 12, scope: !1146)
!1177 = !DILocation(line: 158, column: 18, scope: !1146)
!1178 = !DILocation(line: 158, column: 15, scope: !1146)
!1179 = !DILocation(line: 158, column: 25, scope: !1146)
!1180 = !DILocation(line: 159, column: 11, scope: !1146)
!1181 = !DILocation(line: 159, column: 13, scope: !1146)
!1182 = !DILocation(line: 159, column: 20, scope: !1146)
!1183 = !DILocation(line: 159, column: 18, scope: !1146)
!1184 = !DILocation(line: 159, column: 26, scope: !1146)
!1185 = !DILocation(line: 159, column: 23, scope: !1146)
!1186 = !DILocation(line: 159, column: 4, scope: !1146)
!1187 = !DILocation(line: 159, column: 6, scope: !1146)
!1188 = !DILocation(line: 160, column: 10, scope: !1146)
!1189 = !DILocation(line: 160, column: 3, scope: !1146)
!1190 = !DILocalVariable(name: "shift", scope: !1191, file: !80, line: 157, type: !19)
!1191 = distinct !DISubprogram(name: "set_char_quoting", scope: !80, file: !80, line: 152, type: !1192, scopeLine: 153, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1202, retainedNodes: !4)
!1192 = !DISubroutineType(types: !1193)
!1193 = !{!19, !1194, !8, !19}
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !80, line: 65, size: 448, elements: !1196)
!1196 = !{!1197, !1198, !1199, !1200, !1201}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1195, file: !80, line: 68, baseType: !57, size: 32)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1195, file: !80, line: 71, baseType: !19, size: 32, offset: 32)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1195, file: !80, line: 75, baseType: !98, size: 256, offset: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1195, file: !80, line: 78, baseType: !16, size: 64, offset: 320)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1195, file: !80, line: 81, baseType: !16, size: 64, offset: 384)
!1202 = distinct !DICompileUnit(language: DW_LANG_C99, file: !55, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, retainedTypes: !72, globals: !1203, nameTableKind: None)
!1203 = !{!1204, !1206, !1208, !1210, !1212, !1214, !1221, !1223}
!1204 = !DIGlobalVariableExpression(var: !1205, expr: !DIExpression())
!1205 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1202, file: !80, line: 85, type: !81, isLocal: false, isDefinition: true)
!1206 = !DIGlobalVariableExpression(var: !1207, expr: !DIExpression())
!1207 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1202, file: !80, line: 101, type: !87, isLocal: false, isDefinition: true)
!1208 = !DIGlobalVariableExpression(var: !1209, expr: !DIExpression())
!1209 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1202, file: !80, line: 1052, type: !1195, isLocal: false, isDefinition: true)
!1210 = !DIGlobalVariableExpression(var: !1211, expr: !DIExpression())
!1211 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1202, file: !80, line: 116, type: !1195, isLocal: true, isDefinition: true)
!1212 = !DIGlobalVariableExpression(var: !1213, expr: !DIExpression())
!1213 = distinct !DIGlobalVariable(name: "slot0", scope: !1202, file: !80, line: 842, type: !105, isLocal: true, isDefinition: true)
!1214 = !DIGlobalVariableExpression(var: !1215, expr: !DIExpression())
!1215 = distinct !DIGlobalVariable(name: "slotvec", scope: !1202, file: !80, line: 845, type: !1216, isLocal: true, isDefinition: true)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !80, line: 834, size: 128, elements: !1218)
!1218 = !{!1219, !1220}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1217, file: !80, line: 836, baseType: !74, size: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1217, file: !80, line: 837, baseType: !7, size: 64, offset: 64)
!1221 = !DIGlobalVariableExpression(var: !1222, expr: !DIExpression())
!1222 = distinct !DIGlobalVariable(name: "nslots", scope: !1202, file: !80, line: 843, type: !19, isLocal: true, isDefinition: true)
!1223 = !DIGlobalVariableExpression(var: !1224, expr: !DIExpression())
!1224 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1202, file: !80, line: 844, type: !1217, isLocal: true, isDefinition: true)
!1225 = !DILocalVariable(name: "r", scope: !1191, file: !80, line: 158, type: !19)
!1226 = distinct !DISubprogram(name: "quotearg_n_style", scope: !80, file: !80, line: 955, type: !1227, scopeLine: 956, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !54, retainedNodes: !4)
!1227 = !DISubroutineType(types: !1228)
!1228 = !{!7, !19, !57, !16}
!1229 = !DILocalVariable(name: "n", arg: 1, scope: !1226, file: !80, line: 955, type: !19)
!1230 = !DILocation(line: 955, column: 23, scope: !1226)
!1231 = !DILocalVariable(name: "s", arg: 2, scope: !1226, file: !80, line: 955, type: !57)
!1232 = !DILocation(line: 955, column: 45, scope: !1226)
!1233 = !DILocalVariable(name: "arg", arg: 3, scope: !1226, file: !80, line: 955, type: !16)
!1234 = !DILocation(line: 955, column: 60, scope: !1226)
!1235 = !DILocalVariable(name: "o", scope: !1226, file: !80, line: 957, type: !1236)
!1236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!1237 = !DILocation(line: 957, column: 32, scope: !1226)
!1238 = !DILocation(line: 957, column: 64, scope: !1226)
!1239 = !DILocation(line: 957, column: 36, scope: !1226)
!1240 = !DILocation(line: 958, column: 30, scope: !1226)
!1241 = !DILocation(line: 958, column: 33, scope: !1226)
!1242 = !DILocation(line: 958, column: 10, scope: !1226)
!1243 = !DILocation(line: 958, column: 3, scope: !1226)
!1244 = !DILocalVariable(name: "n", arg: 1, scope: !1245, file: !80, line: 955, type: !19)
!1245 = distinct !DISubprogram(name: "quotearg_n_style", scope: !80, file: !80, line: 955, type: !1227, scopeLine: 956, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1246, retainedNodes: !4)
!1246 = distinct !DICompileUnit(language: DW_LANG_C99, file: !55, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, retainedTypes: !72, globals: !1247, nameTableKind: None)
!1247 = !{!1248, !1250, !1252, !1261, !1263, !1265, !1272, !1274}
!1248 = !DIGlobalVariableExpression(var: !1249, expr: !DIExpression())
!1249 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1246, file: !80, line: 85, type: !81, isLocal: false, isDefinition: true)
!1250 = !DIGlobalVariableExpression(var: !1251, expr: !DIExpression())
!1251 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1246, file: !80, line: 101, type: !87, isLocal: false, isDefinition: true)
!1252 = !DIGlobalVariableExpression(var: !1253, expr: !DIExpression())
!1253 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1246, file: !80, line: 1052, type: !1254, isLocal: false, isDefinition: true)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !80, line: 65, size: 448, elements: !1255)
!1255 = !{!1256, !1257, !1258, !1259, !1260}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1254, file: !80, line: 68, baseType: !57, size: 32)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1254, file: !80, line: 71, baseType: !19, size: 32, offset: 32)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1254, file: !80, line: 75, baseType: !98, size: 256, offset: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1254, file: !80, line: 78, baseType: !16, size: 64, offset: 320)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1254, file: !80, line: 81, baseType: !16, size: 64, offset: 384)
!1261 = !DIGlobalVariableExpression(var: !1262, expr: !DIExpression())
!1262 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1246, file: !80, line: 116, type: !1254, isLocal: true, isDefinition: true)
!1263 = !DIGlobalVariableExpression(var: !1264, expr: !DIExpression())
!1264 = distinct !DIGlobalVariable(name: "slot0", scope: !1246, file: !80, line: 842, type: !105, isLocal: true, isDefinition: true)
!1265 = !DIGlobalVariableExpression(var: !1266, expr: !DIExpression())
