; ModuleID = '<stdin>'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.file_name = type { i8*, i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.dev_ino, %struct.dev_ino, %struct.dev_ino, [3 x i64] }
%struct.dev_ino = type { i64, i64 }
%struct.__dirstream = type opaque
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external dso_local global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [23 x i8] c"Usage: %s [OPTION]...\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 41, type: !10, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !9, nameTableKind: None)
!3 = !DIFile(filename: "src/pwd.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!4 = !{}
!5 = !{!6, !7}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !{!0}
!10 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 1280, elements: !23)
!11 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !14)
!13 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "")
!14 = !{!15, !18, !20, !22}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !12, file: !13, line: 52, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !12, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !12, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !12, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!23 = !{!24}
!24 = !DISubrange(count: 5)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "Version", scope: !27, file: !28, line: 2, type: !16, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !29, nameTableKind: None)
!28 = !DIFile(filename: "src/version.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!29 = !{!25}
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !32, file: !37, line: 56, type: !38, isLocal: true, isDefinition: true)
!32 = distinct !DICompileUnit(language: DW_LANG_C99, file: !33, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !34, nameTableKind: None)
!33 = !DIFile(filename: "./lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!34 = !{!35, !30}
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "file_name", scope: !32, file: !37, line: 46, type: !16, isLocal: true, isDefinition: true)
!37 = !DIFile(filename: "lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!38 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "exit_failure", scope: !41, file: !44, line: 24, type: !45, isLocal: false, isDefinition: true)
!41 = distinct !DICompileUnit(language: DW_LANG_C99, file: !42, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !43, nameTableKind: None)
!42 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!43 = !{!39}
!44 = !DIFile(filename: "lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!45 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !19)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "program_name", scope: !48, file: !51, line: 33, type: !16, isLocal: false, isDefinition: true)
!48 = distinct !DICompileUnit(language: DW_LANG_C99, file: !49, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !50, nameTableKind: None)
!49 = !DIFile(filename: "./lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!50 = !{!46}
!51 = !DIFile(filename: "lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !54, file: !80, line: 116, type: !93, isLocal: true, isDefinition: true)
!54 = distinct !DICompileUnit(language: DW_LANG_C99, file: !55, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, retainedTypes: !72, globals: !77, nameTableKind: None)
!55 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!56 = !{!57}
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !58, line: 32, baseType: !59, size: 32, elements: !60)
!58 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!59 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!60 = !{!61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71}
!61 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!62 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!63 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!64 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!65 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!66 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!67 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!68 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!69 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!70 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!71 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!72 = !{!19, !73, !74}
!73 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !75, line: 46, baseType: !76)
!75 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.1/include/stddef.h", directory: "")
!76 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!77 = !{!78, !85, !91, !52, !103, !108, !115, !117}
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !54, file: !80, line: 85, type: !81, isLocal: false, isDefinition: true)
!80 = !DIFile(filename: "lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 704, elements: !83)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!83 = !{!84}
!84 = !DISubrange(count: 11)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !54, file: !80, line: 101, type: !87, isLocal: false, isDefinition: true)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 320, elements: !89)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!89 = !{!90}
!90 = !DISubrange(count: 10)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !54, file: !80, line: 1052, type: !93, isLocal: false, isDefinition: true)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !80, line: 65, size: 448, elements: !94)
!94 = !{!95, !96, !97, !101, !102}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !93, file: !80, line: 68, baseType: !57, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !93, file: !80, line: 71, baseType: !19, size: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !93, file: !80, line: 75, baseType: !98, size: 256, offset: 64)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 256, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 8)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !93, file: !80, line: 78, baseType: !16, size: 64, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !93, file: !80, line: 81, baseType: !16, size: 64, offset: 384)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "slot0", scope: !54, file: !80, line: 842, type: !105, isLocal: true, isDefinition: true)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 256)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "slotvec", scope: !54, file: !80, line: 845, type: !110, isLocal: true, isDefinition: true)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !80, line: 834, size: 128, elements: !112)
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !111, file: !80, line: 836, baseType: !74, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !111, file: !80, line: 837, baseType: !7, size: 64, offset: 64)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "nslots", scope: !54, file: !80, line: 843, type: !19, isLocal: true, isDefinition: true)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "slotvec0", scope: !54, file: !80, line: 844, type: !111, isLocal: true, isDefinition: true)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !121, file: !124, line: 26, type: !125, isLocal: false, isDefinition: true)
!121 = distinct !DICompileUnit(language: DW_LANG_C99, file: !122, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !123, nameTableKind: None)
!122 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!123 = !{!119}
!124 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 376, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 47)
!128 = distinct !DICompileUnit(language: DW_LANG_C99, file: !129, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!129 = !DIFile(filename: "./lib/root-dev-ino.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!130 = distinct !DICompileUnit(language: DW_LANG_C99, file: !131, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!131 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!132 = !{!6}
!133 = distinct !DICompileUnit(language: DW_LANG_C99, file: !134, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !135, nameTableKind: None)
!134 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!135 = !{!74, !7, !6}
!136 = distinct !DICompileUnit(language: DW_LANG_C99, file: !137, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!137 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!138 = distinct !DICompileUnit(language: DW_LANG_C99, file: !139, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!139 = !DIFile(filename: "./lib/xgetcwd.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!140 = distinct !DICompileUnit(language: DW_LANG_C99, file: !141, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !142, nameTableKind: None)
!141 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!142 = !{!74}
!143 = distinct !DICompileUnit(language: DW_LANG_C99, file: !144, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !145, nameTableKind: None)
!144 = !DIFile(filename: "./lib/c-strcasecmp.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!145 = !{!146}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!149 = distinct !DICompileUnit(language: DW_LANG_C99, file: !150, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!150 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!151 = distinct !DICompileUnit(language: DW_LANG_C99, file: !152, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!152 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!153 = distinct !DICompileUnit(language: DW_LANG_C99, file: !154, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!154 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!155 = distinct !DICompileUnit(language: DW_LANG_C99, file: !156, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!156 = !DIFile(filename: "./lib/setlocale_null.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!157 = distinct !DICompileUnit(language: DW_LANG_C99, file: !158, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!158 = !DIFile(filename: "./lib/fclose.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!159 = distinct !DICompileUnit(language: DW_LANG_C99, file: !160, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!160 = !DIFile(filename: "./lib/fflush.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!161 = distinct !DICompileUnit(language: DW_LANG_C99, file: !162, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!162 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!163 = distinct !DICompileUnit(language: DW_LANG_C99, file: !164, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!164 = !DIFile(filename: "./lib/c-ctype.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!165 = !{!"clang version 9.0.1-12 "}
!166 = !{i32 2, !"Dwarf Version", i32 4}
!167 = !{i32 2, !"Debug Info Version", i32 3}
!168 = !{i32 1, !"wchar_size", i32 4}
!169 = !{i32 1, !"ThinLTO", i32 0}
!170 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!171 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 51, type: !172, scopeLine: 52, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !19}
!174 = !DILocalVariable(name: "status", arg: 1, scope: !171, file: !3, line: 51, type: !19)
!175 = !DILocation(line: 51, column: 12, scope: !171)
!176 = !DILocation(line: 53, column: 7, scope: !177)
!177 = distinct !DILexicalBlock(scope: !171, file: !3, line: 53, column: 7)
!178 = !DILocation(line: 53, column: 14, scope: !177)
!179 = !DILocation(line: 53, column: 7, scope: !171)
!180 = !DILocation(line: 54, column: 5, scope: !177)
!181 = !DILocation(line: 54, column: 5, scope: !182)
!182 = distinct !DILexicalBlock(scope: !177, file: !3, line: 54, column: 5)
!183 = !DILocation(line: 57, column: 15, scope: !184)
!184 = distinct !DILexicalBlock(scope: !177, file: !3, line: 56, column: 5)
!185 = !DILocation(line: 57, column: 45, scope: !184)
!186 = !DILocation(line: 57, column: 7, scope: !184)
!187 = !DILocation(line: 58, column: 7, scope: !184)
!188 = !DILocation(line: 62, column: 7, scope: !184)
!189 = !DILocation(line: 66, column: 7, scope: !184)
!190 = !DILocation(line: 67, column: 7, scope: !184)
!191 = !DILocation(line: 68, column: 7, scope: !184)
!192 = !DILocation(line: 71, column: 15, scope: !184)
!193 = !DILocation(line: 71, column: 7, scope: !184)
!194 = !DILocation(line: 72, column: 7, scope: !184)
!195 = !DILocation(line: 74, column: 9, scope: !171)
!196 = !DILocation(line: 74, column: 3, scope: !171)
!197 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !198, file: !198, line: 634, type: !199, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!198 = !DIFile(filename: "src/system.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!199 = !DISubroutineType(types: !200)
!200 = !{null, !16}
!201 = !DILocalVariable(name: "program", arg: 1, scope: !197, file: !198, line: 634, type: !16)
!202 = !DILocation(line: 634, column: 34, scope: !197)
!203 = !DILocalVariable(name: "infomap", scope: !197, file: !198, line: 636, type: !204)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 896, elements: !210)
!205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !197, file: !198, line: 636, size: 128, elements: !207)
!207 = !{!208, !209}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !206, file: !198, line: 636, baseType: !16, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !206, file: !198, line: 636, baseType: !16, size: 64, offset: 64)
!210 = !{!211}
!211 = !DISubrange(count: 7)
!212 = !DILocation(line: 636, column: 67, scope: !197)
!213 = !DILocalVariable(name: "node", scope: !197, file: !198, line: 646, type: !16)
!214 = !DILocation(line: 646, column: 15, scope: !197)
!215 = !DILocation(line: 646, column: 22, scope: !197)
!216 = !DILocalVariable(name: "map_prog", scope: !197, file: !198, line: 647, type: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!218 = !DILocation(line: 647, column: 25, scope: !197)
!219 = !DILocation(line: 647, column: 36, scope: !197)
!220 = !DILocation(line: 649, column: 3, scope: !197)
!221 = !DILocation(line: 649, column: 10, scope: !197)
!222 = !DILocation(line: 649, column: 20, scope: !197)
!223 = !DILocation(line: 649, column: 28, scope: !197)
!224 = !DILocation(line: 649, column: 33, scope: !197)
!225 = !DILocation(line: 649, column: 31, scope: !197)
!226 = !DILocation(line: 0, scope: !197)
!227 = !DILocation(line: 650, column: 13, scope: !197)
!228 = distinct !{!228, !220, !227}
!229 = !DILocation(line: 652, column: 7, scope: !230)
!230 = distinct !DILexicalBlock(scope: !197, file: !198, line: 652, column: 7)
!231 = !DILocation(line: 652, column: 17, scope: !230)
!232 = !DILocation(line: 652, column: 7, scope: !197)
!233 = !DILocation(line: 653, column: 12, scope: !230)
!234 = !DILocation(line: 653, column: 22, scope: !230)
!235 = !DILocation(line: 653, column: 10, scope: !230)
!236 = !DILocation(line: 653, column: 5, scope: !230)
!237 = !DILocation(line: 655, column: 11, scope: !197)
!238 = !DILocation(line: 655, column: 3, scope: !197)
!239 = !DILocalVariable(name: "lc_messages", scope: !197, file: !198, line: 659, type: !16)
!240 = !DILocation(line: 659, column: 15, scope: !197)
!241 = !DILocation(line: 659, column: 29, scope: !197)
!242 = !DILocation(line: 660, column: 7, scope: !243)
!243 = distinct !DILexicalBlock(scope: !197, file: !198, line: 660, column: 7)
!244 = !DILocation(line: 660, column: 19, scope: !243)
!245 = !DILocation(line: 660, column: 22, scope: !243)
!246 = !DILocation(line: 660, column: 7, scope: !197)
!247 = !DILocation(line: 666, column: 7, scope: !248)
!248 = distinct !DILexicalBlock(scope: !243, file: !198, line: 661, column: 5)
!249 = !DILocation(line: 668, column: 5, scope: !248)
!250 = !DILocation(line: 669, column: 11, scope: !197)
!251 = !DILocation(line: 670, column: 24, scope: !197)
!252 = !DILocation(line: 669, column: 3, scope: !197)
!253 = !DILocation(line: 671, column: 11, scope: !197)
!254 = !DILocation(line: 672, column: 11, scope: !197)
!255 = !DILocation(line: 672, column: 17, scope: !197)
!256 = !DILocation(line: 672, column: 25, scope: !197)
!257 = !DILocation(line: 672, column: 22, scope: !197)
!258 = !DILocation(line: 671, column: 3, scope: !197)
!259 = !DILocation(line: 673, column: 1, scope: !197)
!260 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 327, type: !261, scopeLine: 328, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!261 = !DISubroutineType(types: !262)
!262 = !{!19, !19, !263}
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!264 = !DILocalVariable(name: "argc", arg: 1, scope: !260, file: !3, line: 327, type: !19)
!265 = !DILocation(line: 327, column: 11, scope: !260)
!266 = !DILocalVariable(name: "argv", arg: 2, scope: !260, file: !3, line: 327, type: !263)
!267 = !DILocation(line: 327, column: 24, scope: !260)
!268 = !DILocalVariable(name: "wd", scope: !260, file: !3, line: 329, type: !7)
!269 = !DILocation(line: 329, column: 9, scope: !260)
!270 = !DILocalVariable(name: "logical", scope: !260, file: !3, line: 333, type: !38)
!271 = !DILocation(line: 333, column: 8, scope: !260)
!272 = !DILocation(line: 333, column: 19, scope: !260)
!273 = !DILocation(line: 333, column: 46, scope: !260)
!274 = !DILocation(line: 336, column: 21, scope: !260)
!275 = !DILocation(line: 336, column: 3, scope: !260)
!276 = !DILocation(line: 337, column: 3, scope: !260)
!277 = !DILocation(line: 338, column: 3, scope: !260)
!278 = !DILocation(line: 339, column: 3, scope: !260)
!279 = !DILocation(line: 341, column: 3, scope: !260)
!280 = !DILocation(line: 343, column: 3, scope: !260)
!281 = !DILocalVariable(name: "c", scope: !282, file: !3, line: 345, type: !19)
!282 = distinct !DILexicalBlock(scope: !260, file: !3, line: 344, column: 5)
!283 = !DILocation(line: 345, column: 11, scope: !282)
!284 = !DILocation(line: 345, column: 28, scope: !282)
!285 = !DILocation(line: 345, column: 34, scope: !282)
!286 = !DILocation(line: 345, column: 15, scope: !282)
!287 = !DILocation(line: 346, column: 11, scope: !288)
!288 = distinct !DILexicalBlock(scope: !282, file: !3, line: 346, column: 11)
!289 = !DILocation(line: 346, column: 13, scope: !288)
!290 = !DILocation(line: 347, column: 9, scope: !288)
!291 = !DILocation(line: 348, column: 15, scope: !282)
!292 = !DILocation(line: 348, column: 7, scope: !282)
!293 = !DILocation(line: 351, column: 19, scope: !294)
!294 = distinct !DILexicalBlock(scope: !282, file: !3, line: 349, column: 9)
!295 = !DILocation(line: 352, column: 11, scope: !294)
!296 = !DILocation(line: 354, column: 19, scope: !294)
!297 = !DILocation(line: 355, column: 11, scope: !294)
!298 = !DILocation(line: 357, column: 9, scope: !294)
!299 = !DILocation(line: 359, column: 9, scope: !294)
!300 = !DILocation(line: 362, column: 11, scope: !294)
!301 = distinct !{!301, !280, !302}
!302 = !DILocation(line: 364, column: 5, scope: !260)
!303 = !DILocation(line: 366, column: 7, scope: !304)
!304 = distinct !DILexicalBlock(scope: !260, file: !3, line: 366, column: 7)
!305 = !DILocation(line: 366, column: 16, scope: !304)
!306 = !DILocation(line: 366, column: 14, scope: !304)
!307 = !DILocation(line: 366, column: 7, scope: !260)
!308 = !DILocation(line: 367, column: 18, scope: !304)
!309 = !DILocation(line: 367, column: 5, scope: !304)
!310 = !DILocation(line: 369, column: 7, scope: !311)
!311 = distinct !DILexicalBlock(scope: !260, file: !3, line: 369, column: 7)
!312 = !DILocation(line: 369, column: 7, scope: !260)
!313 = !DILocation(line: 371, column: 12, scope: !314)
!314 = distinct !DILexicalBlock(scope: !311, file: !3, line: 370, column: 5)
!315 = !DILocation(line: 371, column: 10, scope: !314)
!316 = !DILocation(line: 372, column: 11, scope: !317)
!317 = distinct !DILexicalBlock(scope: !314, file: !3, line: 372, column: 11)
!318 = !DILocation(line: 372, column: 11, scope: !314)
!319 = !DILocation(line: 374, column: 17, scope: !320)
!320 = distinct !DILexicalBlock(scope: !317, file: !3, line: 373, column: 9)
!321 = !DILocation(line: 374, column: 11, scope: !320)
!322 = !DILocation(line: 375, column: 11, scope: !320)
!323 = !DILocation(line: 377, column: 5, scope: !314)
!324 = !DILocation(line: 379, column: 8, scope: !260)
!325 = !DILocation(line: 379, column: 6, scope: !260)
!326 = !DILocation(line: 380, column: 7, scope: !327)
!327 = distinct !DILexicalBlock(scope: !260, file: !3, line: 380, column: 7)
!328 = !DILocation(line: 380, column: 10, scope: !327)
!329 = !DILocation(line: 380, column: 7, scope: !260)
!330 = !DILocation(line: 382, column: 13, scope: !331)
!331 = distinct !DILexicalBlock(scope: !327, file: !3, line: 381, column: 5)
!332 = !DILocation(line: 382, column: 7, scope: !331)
!333 = !DILocation(line: 383, column: 13, scope: !331)
!334 = !DILocation(line: 383, column: 7, scope: !331)
!335 = !DILocation(line: 384, column: 5, scope: !331)
!336 = !DILocalVariable(name: "file_name", scope: !337, file: !3, line: 387, type: !338)
!337 = distinct !DILexicalBlock(scope: !327, file: !3, line: 386, column: 5)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 34, size: 192, elements: !340)
!340 = !{!341, !342, !343}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !339, file: !3, line: 36, baseType: !7, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !339, file: !3, line: 37, baseType: !74, size: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !339, file: !3, line: 38, baseType: !7, size: 64, offset: 128)
!344 = !DILocation(line: 387, column: 25, scope: !337)
!345 = !DILocation(line: 387, column: 37, scope: !337)
!346 = !DILocation(line: 388, column: 22, scope: !337)
!347 = !DILocation(line: 388, column: 7, scope: !337)
!348 = !DILocation(line: 389, column: 13, scope: !337)
!349 = !DILocation(line: 389, column: 24, scope: !337)
!350 = !DILocation(line: 389, column: 7, scope: !337)
!351 = !DILocation(line: 390, column: 23, scope: !337)
!352 = !DILocation(line: 390, column: 7, scope: !337)
!353 = !DILocation(line: 393, column: 3, scope: !260)
!354 = !DILocation(line: 394, column: 1, scope: !260)
!355 = distinct !DISubprogram(name: "logical_getcwd", scope: !3, file: !3, line: 300, type: !356, scopeLine: 301, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!356 = !DISubroutineType(types: !357)
!357 = !{!7}
!358 = !DILocalVariable(name: "st1", scope: !355, file: !3, line: 302, type: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !360, line: 46, size: 1152, elements: !361)
!360 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!361 = !{!362, !365, !367, !369, !371, !373, !375, !376, !377, !380, !382, !384, !392, !393, !394}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !359, file: !360, line: 48, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !364, line: 145, baseType: !76)
!364 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!365 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !359, file: !360, line: 53, baseType: !366, size: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !364, line: 148, baseType: !76)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !359, file: !360, line: 61, baseType: !368, size: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !364, line: 151, baseType: !76)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !359, file: !360, line: 62, baseType: !370, size: 32, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !364, line: 150, baseType: !59)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !359, file: !360, line: 64, baseType: !372, size: 32, offset: 224)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !364, line: 146, baseType: !59)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !359, file: !360, line: 65, baseType: !374, size: 32, offset: 256)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !364, line: 147, baseType: !59)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !359, file: !360, line: 67, baseType: !19, size: 32, offset: 288)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !359, file: !360, line: 69, baseType: !363, size: 64, offset: 320)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !359, file: !360, line: 74, baseType: !378, size: 64, offset: 384)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !364, line: 152, baseType: !379)
!379 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !359, file: !360, line: 78, baseType: !381, size: 64, offset: 448)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !364, line: 174, baseType: !379)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !359, file: !360, line: 80, baseType: !383, size: 64, offset: 512)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !364, line: 179, baseType: !379)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !359, file: !360, line: 91, baseType: !385, size: 128, offset: 576)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !386, line: 10, size: 128, elements: !387)
!386 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!387 = !{!388, !390}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !385, file: !386, line: 12, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !364, line: 160, baseType: !379)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !385, file: !386, line: 16, baseType: !391, size: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !364, line: 196, baseType: !379)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !359, file: !360, line: 92, baseType: !385, size: 128, offset: 704)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !359, file: !360, line: 93, baseType: !385, size: 128, offset: 832)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !359, file: !360, line: 106, baseType: !395, size: 192, offset: 960)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 192, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 3)
!398 = !DILocation(line: 302, column: 15, scope: !355)
!399 = !DILocalVariable(name: "st2", scope: !355, file: !3, line: 303, type: !359)
!400 = !DILocation(line: 303, column: 15, scope: !355)
!401 = !DILocalVariable(name: "wd", scope: !355, file: !3, line: 304, type: !7)
!402 = !DILocation(line: 304, column: 9, scope: !355)
!403 = !DILocation(line: 304, column: 14, scope: !355)
!404 = !DILocalVariable(name: "p", scope: !355, file: !3, line: 305, type: !7)
!405 = !DILocation(line: 305, column: 9, scope: !355)
!406 = !DILocation(line: 308, column: 8, scope: !407)
!407 = distinct !DILexicalBlock(scope: !355, file: !3, line: 308, column: 7)
!408 = !DILocation(line: 308, column: 11, scope: !407)
!409 = !DILocation(line: 308, column: 14, scope: !407)
!410 = !DILocation(line: 308, column: 20, scope: !407)
!411 = !DILocation(line: 308, column: 7, scope: !355)
!412 = !DILocation(line: 309, column: 5, scope: !407)
!413 = !DILocation(line: 310, column: 7, scope: !355)
!414 = !DILocation(line: 310, column: 5, scope: !355)
!415 = !DILocation(line: 311, column: 3, scope: !355)
!416 = !DILocation(line: 311, column: 23, scope: !355)
!417 = !DILocation(line: 311, column: 15, scope: !355)
!418 = !DILocation(line: 311, column: 13, scope: !355)
!419 = !DILocation(line: 313, column: 12, scope: !420)
!420 = distinct !DILexicalBlock(scope: !421, file: !3, line: 313, column: 11)
!421 = distinct !DILexicalBlock(scope: !355, file: !3, line: 312, column: 5)
!422 = !DILocation(line: 313, column: 17, scope: !420)
!423 = !DILocation(line: 313, column: 20, scope: !420)
!424 = !DILocation(line: 313, column: 25, scope: !420)
!425 = !DILocation(line: 314, column: 11, scope: !420)
!426 = !DILocation(line: 314, column: 15, scope: !420)
!427 = !DILocation(line: 314, column: 20, scope: !420)
!428 = !DILocation(line: 314, column: 27, scope: !420)
!429 = !DILocation(line: 314, column: 32, scope: !420)
!430 = !DILocation(line: 314, column: 37, scope: !420)
!431 = !DILocation(line: 314, column: 40, scope: !420)
!432 = !DILocation(line: 314, column: 45, scope: !420)
!433 = !DILocation(line: 313, column: 11, scope: !421)
!434 = !DILocation(line: 315, column: 9, scope: !420)
!435 = !DILocation(line: 316, column: 8, scope: !421)
!436 = distinct !{!436, !415, !437}
!437 = !DILocation(line: 317, column: 5, scope: !355)
!438 = !DILocation(line: 320, column: 13, scope: !439)
!439 = distinct !DILexicalBlock(scope: !355, file: !3, line: 320, column: 7)
!440 = !DILocation(line: 320, column: 7, scope: !439)
!441 = !DILocation(line: 320, column: 23, scope: !439)
!442 = !DILocation(line: 320, column: 31, scope: !439)
!443 = !DILocation(line: 320, column: 48, scope: !439)
!444 = !DILocation(line: 320, column: 56, scope: !439)
!445 = !DILocation(line: 320, column: 7, scope: !355)
!446 = !DILocation(line: 321, column: 12, scope: !439)
!447 = !DILocation(line: 321, column: 5, scope: !439)
!448 = !DILocation(line: 322, column: 3, scope: !355)
!449 = !DILocation(line: 323, column: 1, scope: !355)
!450 = !DILocalVariable(name: "st1", scope: !451, file: !3, line: 302, type: !464)
!451 = distinct !DISubprogram(name: "logical_getcwd", scope: !3, file: !3, line: 300, type: !356, scopeLine: 301, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !452, retainedNodes: !4)
!452 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !453, nameTableKind: None)
!453 = !{!454}
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "longopts", scope: !452, file: !3, line: 41, type: !456, isLocal: true, isDefinition: true)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 1280, elements: !23)
!457 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !459)
!459 = !{!460, !461, !462, !463}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !458, file: !13, line: 52, baseType: !16, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !458, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !458, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !458, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !360, line: 46, size: 1152, elements: !465)
!465 = !{!466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !482, !483, !484}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !464, file: !360, line: 48, baseType: !363, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !464, file: !360, line: 53, baseType: !366, size: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !464, file: !360, line: 61, baseType: !368, size: 64, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !464, file: !360, line: 62, baseType: !370, size: 32, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !464, file: !360, line: 64, baseType: !372, size: 32, offset: 224)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !464, file: !360, line: 65, baseType: !374, size: 32, offset: 256)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !464, file: !360, line: 67, baseType: !19, size: 32, offset: 288)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !464, file: !360, line: 69, baseType: !363, size: 64, offset: 320)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !464, file: !360, line: 74, baseType: !378, size: 64, offset: 384)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !464, file: !360, line: 78, baseType: !381, size: 64, offset: 448)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !464, file: !360, line: 80, baseType: !383, size: 64, offset: 512)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !464, file: !360, line: 91, baseType: !478, size: 128, offset: 576)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !386, line: 10, size: 128, elements: !479)
!479 = !{!480, !481}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !478, file: !386, line: 12, baseType: !389, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !478, file: !386, line: 16, baseType: !391, size: 64, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !464, file: !360, line: 92, baseType: !478, size: 128, offset: 704)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !464, file: !360, line: 93, baseType: !478, size: 128, offset: 832)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !464, file: !360, line: 106, baseType: !395, size: 192, offset: 960)
!485 = !DILocalVariable(name: "st2", scope: !451, file: !3, line: 303, type: !464)
!486 = !DILocalVariable(name: "wd", scope: !451, file: !3, line: 304, type: !7)
!487 = !DILocalVariable(name: "p", scope: !451, file: !3, line: 305, type: !7)
!488 = distinct !DISubprogram(name: "file_name_init", scope: !3, file: !3, line: 85, type: !489, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!489 = !DISubroutineType(types: !490)
!490 = !{!338}
!491 = !DILocalVariable(name: "p", scope: !488, file: !3, line: 87, type: !338)
!492 = !DILocation(line: 87, column: 21, scope: !488)
!493 = !DILocation(line: 87, column: 25, scope: !488)
!494 = !DILocation(line: 91, column: 3, scope: !488)
!495 = !DILocation(line: 91, column: 6, scope: !488)
!496 = !DILocation(line: 91, column: 14, scope: !488)
!497 = !DILocation(line: 93, column: 21, scope: !488)
!498 = !DILocation(line: 93, column: 24, scope: !488)
!499 = !DILocation(line: 93, column: 12, scope: !488)
!500 = !DILocation(line: 93, column: 3, scope: !488)
!501 = !DILocation(line: 93, column: 6, scope: !488)
!502 = !DILocation(line: 93, column: 10, scope: !488)
!503 = !DILocation(line: 94, column: 14, scope: !488)
!504 = !DILocation(line: 94, column: 17, scope: !488)
!505 = !DILocation(line: 94, column: 24, scope: !488)
!506 = !DILocation(line: 94, column: 27, scope: !488)
!507 = !DILocation(line: 94, column: 35, scope: !488)
!508 = !DILocation(line: 94, column: 21, scope: !488)
!509 = !DILocation(line: 94, column: 3, scope: !488)
!510 = !DILocation(line: 94, column: 6, scope: !488)
!511 = !DILocation(line: 94, column: 12, scope: !488)
!512 = !DILocation(line: 95, column: 3, scope: !488)
!513 = !DILocation(line: 95, column: 6, scope: !488)
!514 = !DILocation(line: 95, column: 15, scope: !488)
!515 = !DILocation(line: 96, column: 10, scope: !488)
!516 = !DILocation(line: 96, column: 3, scope: !488)
!517 = distinct !DISubprogram(name: "robust_getcwd", scope: !3, file: !3, line: 268, type: !518, scopeLine: 269, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!518 = !DISubroutineType(types: !519)
!519 = !{null, !338}
!520 = !DILocalVariable(name: "file_name", arg: 1, scope: !517, file: !3, line: 268, type: !338)
!521 = !DILocation(line: 268, column: 34, scope: !517)
!522 = !DILocalVariable(name: "height", scope: !517, file: !3, line: 270, type: !74)
!523 = !DILocation(line: 270, column: 10, scope: !517)
!524 = !DILocalVariable(name: "dev_ino_buf", scope: !517, file: !3, line: 271, type: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !526, line: 7, size: 128, elements: !527)
!526 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!527 = !{!528, !531}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !525, file: !526, line: 9, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !530, line: 47, baseType: !366)
!530 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!531 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !525, file: !526, line: 10, baseType: !532, size: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !530, line: 59, baseType: !363)
!533 = !DILocation(line: 271, column: 18, scope: !517)
!534 = !DILocalVariable(name: "root_dev_ino", scope: !517, file: !3, line: 272, type: !535)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!536 = !DILocation(line: 272, column: 19, scope: !517)
!537 = !DILocation(line: 272, column: 34, scope: !517)
!538 = !DILocalVariable(name: "dot_sb", scope: !517, file: !3, line: 273, type: !359)
!539 = !DILocation(line: 273, column: 15, scope: !517)
!540 = !DILocation(line: 275, column: 7, scope: !541)
!541 = distinct !DILexicalBlock(scope: !517, file: !3, line: 275, column: 7)
!542 = !DILocation(line: 275, column: 20, scope: !541)
!543 = !DILocation(line: 275, column: 7, scope: !517)
!544 = !DILocation(line: 276, column: 5, scope: !541)
!545 = !DILocation(line: 279, column: 7, scope: !546)
!546 = distinct !DILexicalBlock(scope: !517, file: !3, line: 279, column: 7)
!547 = !DILocation(line: 279, column: 27, scope: !546)
!548 = !DILocation(line: 279, column: 7, scope: !517)
!549 = !DILocation(line: 280, column: 5, scope: !546)
!550 = !DILocation(line: 282, column: 3, scope: !517)
!551 = !DILocation(line: 285, column: 11, scope: !552)
!552 = distinct !DILexicalBlock(scope: !553, file: !3, line: 285, column: 11)
!553 = distinct !DILexicalBlock(scope: !517, file: !3, line: 283, column: 5)
!554 = !DILocation(line: 285, column: 11, scope: !553)
!555 = !DILocation(line: 286, column: 9, scope: !552)
!556 = !DILocation(line: 288, column: 32, scope: !553)
!557 = !DILocation(line: 288, column: 49, scope: !553)
!558 = !DILocation(line: 288, column: 7, scope: !553)
!559 = distinct !{!559, !550, !560}
!560 = !DILocation(line: 289, column: 5, scope: !517)
!561 = !DILocation(line: 292, column: 7, scope: !562)
!562 = distinct !DILexicalBlock(scope: !517, file: !3, line: 292, column: 7)
!563 = !DILocation(line: 292, column: 18, scope: !562)
!564 = !DILocation(line: 292, column: 27, scope: !562)
!565 = !DILocation(line: 292, column: 7, scope: !517)
!566 = !DILocation(line: 293, column: 24, scope: !562)
!567 = !DILocation(line: 293, column: 5, scope: !562)
!568 = !DILocation(line: 294, column: 1, scope: !517)
!569 = distinct !DISubprogram(name: "file_name_free", scope: !3, file: !3, line: 78, type: !518, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!570 = !DILocalVariable(name: "p", arg: 1, scope: !569, file: !3, line: 78, type: !338)
!571 = !DILocation(line: 78, column: 35, scope: !569)
!572 = !DILocation(line: 80, column: 9, scope: !569)
!573 = !DILocation(line: 80, column: 12, scope: !569)
!574 = !DILocation(line: 80, column: 3, scope: !569)
!575 = !DILocation(line: 81, column: 9, scope: !569)
!576 = !DILocation(line: 81, column: 3, scope: !569)
!577 = !DILocation(line: 82, column: 1, scope: !569)
!578 = !DILocalVariable(name: "p", arg: 1, scope: !579, file: !3, line: 78, type: !582)
!579 = distinct !DISubprogram(name: "file_name_free", scope: !3, file: !3, line: 78, type: !580, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !588, retainedNodes: !4)
!580 = !DISubroutineType(types: !581)
!581 = !{null, !582}
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 34, size: 192, elements: !584)
!584 = !{!585, !586, !587}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !583, file: !3, line: 36, baseType: !7, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !583, file: !3, line: 37, baseType: !74, size: 64, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !583, file: !3, line: 38, baseType: !7, size: 64, offset: 128)
!588 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !589, nameTableKind: None)
!589 = !{!590}
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(name: "longopts", scope: !588, file: !3, line: 41, type: !592, isLocal: true, isDefinition: true)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !593, size: 1280, elements: !23)
!593 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !595)
!595 = !{!596, !597, !598, !599}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !594, file: !13, line: 52, baseType: !16, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !594, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !594, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !594, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!600 = distinct !DISubprogram(name: "find_dir_entry", scope: !3, file: !3, line: 153, type: !601, scopeLine: 155, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!601 = !DISubroutineType(types: !602)
!602 = !{null, !603, !338, !74}
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!604 = !DILocalVariable(name: "dot_sb", arg: 1, scope: !600, file: !3, line: 153, type: !603)
!605 = !DILocation(line: 153, column: 30, scope: !600)
!606 = !DILocalVariable(name: "file_name", arg: 2, scope: !600, file: !3, line: 153, type: !338)
!607 = !DILocation(line: 153, column: 56, scope: !600)
!608 = !DILocalVariable(name: "parent_height", arg: 3, scope: !600, file: !3, line: 154, type: !74)
!609 = !DILocation(line: 154, column: 24, scope: !600)
!610 = !DILocalVariable(name: "dirp", scope: !600, file: !3, line: 156, type: !611)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !613, line: 127, baseType: !614)
!613 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!614 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !613, line: 127, flags: DIFlagFwdDecl)
!615 = !DILocation(line: 156, column: 8, scope: !600)
!616 = !DILocalVariable(name: "fd", scope: !600, file: !3, line: 157, type: !19)
!617 = !DILocation(line: 157, column: 7, scope: !600)
!618 = !DILocalVariable(name: "parent_sb", scope: !600, file: !3, line: 158, type: !359)
!619 = !DILocation(line: 158, column: 15, scope: !600)
!620 = !DILocalVariable(name: "use_lstat", scope: !600, file: !3, line: 159, type: !38)
!621 = !DILocation(line: 159, column: 8, scope: !600)
!622 = !DILocalVariable(name: "found", scope: !600, file: !3, line: 160, type: !38)
!623 = !DILocation(line: 160, column: 8, scope: !600)
!624 = !DILocation(line: 162, column: 10, scope: !600)
!625 = !DILocation(line: 162, column: 8, scope: !600)
!626 = !DILocation(line: 163, column: 7, scope: !627)
!627 = distinct !DILexicalBlock(scope: !600, file: !3, line: 163, column: 7)
!628 = !DILocation(line: 163, column: 12, scope: !627)
!629 = !DILocation(line: 163, column: 7, scope: !600)
!630 = !DILocation(line: 164, column: 5, scope: !627)
!631 = !DILocation(line: 167, column: 15, scope: !600)
!632 = !DILocation(line: 167, column: 8, scope: !600)
!633 = !DILocation(line: 167, column: 6, scope: !600)
!634 = !DILocation(line: 168, column: 13, scope: !635)
!635 = distinct !DILexicalBlock(scope: !600, file: !3, line: 168, column: 7)
!636 = !DILocation(line: 168, column: 10, scope: !635)
!637 = !DILocation(line: 168, column: 8, scope: !635)
!638 = !DILocation(line: 168, column: 26, scope: !635)
!639 = !DILocation(line: 168, column: 18, scope: !635)
!640 = !DILocation(line: 168, column: 32, scope: !635)
!641 = !DILocation(line: 168, column: 46, scope: !635)
!642 = !DILocation(line: 168, column: 7, scope: !600)
!643 = !DILocation(line: 169, column: 5, scope: !635)
!644 = !DILocation(line: 172, column: 13, scope: !645)
!645 = distinct !DILexicalBlock(scope: !600, file: !3, line: 172, column: 7)
!646 = !DILocation(line: 172, column: 10, scope: !645)
!647 = !DILocation(line: 172, column: 8, scope: !645)
!648 = !DILocation(line: 172, column: 25, scope: !645)
!649 = !DILocation(line: 172, column: 18, scope: !645)
!650 = !DILocation(line: 172, column: 43, scope: !645)
!651 = !DILocation(line: 172, column: 67, scope: !645)
!652 = !DILocation(line: 172, column: 7, scope: !600)
!653 = !DILocation(line: 173, column: 5, scope: !645)
!654 = !DILocation(line: 178, column: 26, scope: !600)
!655 = !DILocation(line: 178, column: 36, scope: !600)
!656 = !DILocation(line: 178, column: 44, scope: !600)
!657 = !DILocation(line: 178, column: 33, scope: !600)
!658 = !DILocation(line: 178, column: 13, scope: !600)
!659 = !DILocation(line: 180, column: 9, scope: !600)
!660 = !DILocation(line: 181, column: 3, scope: !600)
!661 = !DILocalVariable(name: "dp", scope: !662, file: !3, line: 183, type: !663)
!662 = distinct !DILexicalBlock(scope: !600, file: !3, line: 182, column: 5)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !665)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !666, line: 22, size: 2240, elements: !667)
!666 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!667 = !{!668, !669, !670, !671, !672}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !665, file: !666, line: 25, baseType: !366, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !665, file: !666, line: 26, baseType: !378, size: 64, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !665, file: !666, line: 31, baseType: !73, size: 16, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !665, file: !666, line: 32, baseType: !148, size: 8, offset: 144)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !665, file: !666, line: 33, baseType: !105, size: 2048, offset: 152)
!673 = !DILocation(line: 183, column: 28, scope: !662)
!674 = !DILocalVariable(name: "ent_sb", scope: !662, file: !3, line: 184, type: !359)
!675 = !DILocation(line: 184, column: 19, scope: !662)
!676 = !DILocalVariable(name: "ino", scope: !662, file: !3, line: 185, type: !529)
!677 = !DILocation(line: 185, column: 13, scope: !662)
!678 = !DILocation(line: 187, column: 7, scope: !662)
!679 = !DILocation(line: 187, column: 13, scope: !662)
!680 = !DILocation(line: 188, column: 50, scope: !681)
!681 = distinct !DILexicalBlock(scope: !662, file: !3, line: 188, column: 11)
!682 = !DILocation(line: 188, column: 17, scope: !681)
!683 = !DILocation(line: 188, column: 15, scope: !681)
!684 = !DILocation(line: 188, column: 57, scope: !681)
!685 = !DILocation(line: 188, column: 11, scope: !662)
!686 = !DILocation(line: 190, column: 15, scope: !687)
!687 = distinct !DILexicalBlock(scope: !688, file: !3, line: 190, column: 15)
!688 = distinct !DILexicalBlock(scope: !681, file: !3, line: 189, column: 9)
!689 = !DILocation(line: 190, column: 15, scope: !688)
!690 = !DILocalVariable(name: "e", scope: !691, file: !3, line: 193, type: !19)
!691 = distinct !DILexicalBlock(scope: !687, file: !3, line: 191, column: 13)
!692 = !DILocation(line: 193, column: 19, scope: !691)
!693 = !DILocation(line: 193, column: 23, scope: !691)
!694 = !DILocation(line: 194, column: 25, scope: !691)
!695 = !DILocation(line: 194, column: 15, scope: !691)
!696 = !DILocation(line: 195, column: 23, scope: !691)
!697 = !DILocation(line: 195, column: 15, scope: !691)
!698 = !DILocation(line: 195, column: 21, scope: !691)
!699 = !DILocation(line: 198, column: 20, scope: !691)
!700 = !DILocation(line: 199, column: 13, scope: !691)
!701 = !DILocation(line: 200, column: 11, scope: !688)
!702 = !DILocation(line: 203, column: 13, scope: !662)
!703 = !DILocation(line: 203, column: 11, scope: !662)
!704 = !DILocation(line: 205, column: 11, scope: !705)
!705 = distinct !DILexicalBlock(scope: !662, file: !3, line: 205, column: 11)
!706 = !DILocation(line: 205, column: 15, scope: !705)
!707 = !DILocation(line: 205, column: 38, scope: !705)
!708 = !DILocation(line: 205, column: 41, scope: !705)
!709 = !DILocation(line: 205, column: 11, scope: !662)
!710 = !DILocation(line: 207, column: 22, scope: !711)
!711 = distinct !DILexicalBlock(scope: !712, file: !3, line: 207, column: 15)
!712 = distinct !DILexicalBlock(scope: !705, file: !3, line: 206, column: 9)
!713 = !DILocation(line: 207, column: 26, scope: !711)
!714 = !DILocation(line: 207, column: 15, scope: !711)
!715 = !DILocation(line: 207, column: 43, scope: !711)
!716 = !DILocation(line: 207, column: 15, scope: !712)
!717 = !DILocation(line: 210, column: 15, scope: !718)
!718 = distinct !DILexicalBlock(scope: !711, file: !3, line: 208, column: 13)
!719 = distinct !{!719, !660, !720}
!720 = !DILocation(line: 226, column: 5, scope: !600)
!721 = !DILocation(line: 212, column: 24, scope: !712)
!722 = !DILocation(line: 212, column: 15, scope: !712)
!723 = !DILocation(line: 213, column: 9, scope: !712)
!724 = !DILocation(line: 215, column: 11, scope: !725)
!725 = distinct !DILexicalBlock(scope: !662, file: !3, line: 215, column: 11)
!726 = !DILocation(line: 215, column: 18, scope: !725)
!727 = !DILocation(line: 215, column: 26, scope: !725)
!728 = !DILocation(line: 215, column: 15, scope: !725)
!729 = !DILocation(line: 215, column: 11, scope: !662)
!730 = !DILocation(line: 216, column: 9, scope: !725)
!731 = !DILocation(line: 220, column: 14, scope: !732)
!732 = distinct !DILexicalBlock(scope: !662, file: !3, line: 220, column: 12)
!733 = !DILocation(line: 220, column: 24, scope: !732)
!734 = !DILocation(line: 220, column: 34, scope: !732)
!735 = !DILocation(line: 220, column: 44, scope: !732)
!736 = !DILocation(line: 220, column: 52, scope: !732)
!737 = !DILocation(line: 220, column: 41, scope: !732)
!738 = !DILocation(line: 220, column: 12, scope: !662)
!739 = !DILocation(line: 222, column: 30, scope: !740)
!740 = distinct !DILexicalBlock(scope: !732, file: !3, line: 221, column: 9)
!741 = !DILocation(line: 222, column: 41, scope: !740)
!742 = !DILocation(line: 222, column: 45, scope: !740)
!743 = !DILocation(line: 222, column: 53, scope: !740)
!744 = !DILocation(line: 222, column: 11, scope: !740)
!745 = !DILocation(line: 223, column: 17, scope: !740)
!746 = !DILocation(line: 224, column: 11, scope: !740)
!747 = !DILocation(line: 228, column: 7, scope: !748)
!748 = distinct !DILexicalBlock(scope: !600, file: !3, line: 228, column: 7)
!749 = !DILocation(line: 228, column: 12, scope: !748)
!750 = !DILocation(line: 228, column: 20, scope: !748)
!751 = !DILocation(line: 228, column: 33, scope: !748)
!752 = !DILocation(line: 228, column: 23, scope: !748)
!753 = !DILocation(line: 228, column: 39, scope: !748)
!754 = !DILocation(line: 228, column: 7, scope: !600)
!755 = !DILocation(line: 232, column: 7, scope: !756)
!756 = distinct !DILexicalBlock(scope: !748, file: !3, line: 229, column: 5)
!757 = !DILocation(line: 236, column: 10, scope: !758)
!758 = distinct !DILexicalBlock(scope: !600, file: !3, line: 236, column: 8)
!759 = !DILocation(line: 236, column: 8, scope: !600)
!760 = !DILocation(line: 237, column: 5, scope: !758)
!761 = !DILocation(line: 241, column: 4, scope: !600)
!762 = !DILocation(line: 241, column: 13, scope: !600)
!763 = !DILocation(line: 242, column: 1, scope: !600)
!764 = distinct !DISubprogram(name: "file_name_prepend", scope: !3, file: !3, line: 101, type: !765, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!765 = !DISubroutineType(types: !766)
!766 = !{null, !338, !16, !74}
!767 = !DILocalVariable(name: "p", arg: 1, scope: !764, file: !3, line: 101, type: !338)
!768 = !DILocation(line: 101, column: 38, scope: !764)
!769 = !DILocalVariable(name: "s", arg: 2, scope: !764, file: !3, line: 101, type: !16)
!770 = !DILocation(line: 101, column: 53, scope: !764)
!771 = !DILocalVariable(name: "s_len", arg: 3, scope: !764, file: !3, line: 101, type: !74)
!772 = !DILocation(line: 101, column: 63, scope: !764)
!773 = !DILocalVariable(name: "n_free", scope: !764, file: !3, line: 103, type: !74)
!774 = !DILocation(line: 103, column: 10, scope: !764)
!775 = !DILocation(line: 103, column: 19, scope: !764)
!776 = !DILocation(line: 103, column: 22, scope: !764)
!777 = !DILocation(line: 103, column: 30, scope: !764)
!778 = !DILocation(line: 103, column: 33, scope: !764)
!779 = !DILocation(line: 103, column: 28, scope: !764)
!780 = !DILocation(line: 104, column: 7, scope: !781)
!781 = distinct !DILexicalBlock(scope: !764, file: !3, line: 104, column: 7)
!782 = !DILocation(line: 104, column: 20, scope: !781)
!783 = !DILocation(line: 104, column: 18, scope: !781)
!784 = !DILocation(line: 104, column: 14, scope: !781)
!785 = !DILocation(line: 104, column: 7, scope: !764)
!786 = !DILocalVariable(name: "half", scope: !787, file: !3, line: 106, type: !74)
!787 = distinct !DILexicalBlock(scope: !781, file: !3, line: 105, column: 5)
!788 = !DILocation(line: 106, column: 14, scope: !787)
!789 = !DILocation(line: 106, column: 21, scope: !787)
!790 = !DILocation(line: 106, column: 24, scope: !787)
!791 = !DILocation(line: 106, column: 32, scope: !787)
!792 = !DILocation(line: 106, column: 38, scope: !787)
!793 = !DILocation(line: 106, column: 36, scope: !787)
!794 = !DILocalVariable(name: "q", scope: !787, file: !3, line: 111, type: !7)
!795 = !DILocation(line: 111, column: 13, scope: !787)
!796 = !DILocation(line: 111, column: 30, scope: !787)
!797 = !DILocation(line: 111, column: 17, scope: !787)
!798 = !DILocalVariable(name: "n_used", scope: !787, file: !3, line: 112, type: !74)
!799 = !DILocation(line: 112, column: 14, scope: !787)
!800 = !DILocation(line: 112, column: 23, scope: !787)
!801 = !DILocation(line: 112, column: 26, scope: !787)
!802 = !DILocation(line: 112, column: 36, scope: !787)
!803 = !DILocation(line: 112, column: 34, scope: !787)
!804 = !DILocation(line: 113, column: 18, scope: !787)
!805 = !DILocation(line: 113, column: 26, scope: !787)
!806 = !DILocation(line: 113, column: 24, scope: !787)
!807 = !DILocation(line: 113, column: 20, scope: !787)
!808 = !DILocation(line: 113, column: 33, scope: !787)
!809 = !DILocation(line: 113, column: 31, scope: !787)
!810 = !DILocation(line: 113, column: 7, scope: !787)
!811 = !DILocation(line: 113, column: 10, scope: !787)
!812 = !DILocation(line: 113, column: 16, scope: !787)
!813 = !DILocation(line: 114, column: 15, scope: !787)
!814 = !DILocation(line: 114, column: 18, scope: !787)
!815 = !DILocation(line: 114, column: 25, scope: !787)
!816 = !DILocation(line: 114, column: 28, scope: !787)
!817 = !DILocation(line: 114, column: 34, scope: !787)
!818 = !DILocation(line: 114, column: 32, scope: !787)
!819 = !DILocation(line: 114, column: 42, scope: !787)
!820 = !DILocation(line: 114, column: 7, scope: !787)
!821 = !DILocation(line: 115, column: 13, scope: !787)
!822 = !DILocation(line: 115, column: 16, scope: !787)
!823 = !DILocation(line: 115, column: 7, scope: !787)
!824 = !DILocation(line: 116, column: 16, scope: !787)
!825 = !DILocation(line: 116, column: 7, scope: !787)
!826 = !DILocation(line: 116, column: 10, scope: !787)
!827 = !DILocation(line: 116, column: 14, scope: !787)
!828 = !DILocation(line: 117, column: 24, scope: !787)
!829 = !DILocation(line: 117, column: 22, scope: !787)
!830 = !DILocation(line: 117, column: 7, scope: !787)
!831 = !DILocation(line: 117, column: 10, scope: !787)
!832 = !DILocation(line: 117, column: 18, scope: !787)
!833 = !DILocation(line: 118, column: 5, scope: !787)
!834 = !DILocation(line: 120, column: 19, scope: !764)
!835 = !DILocation(line: 120, column: 17, scope: !764)
!836 = !DILocation(line: 120, column: 3, scope: !764)
!837 = !DILocation(line: 120, column: 6, scope: !764)
!838 = !DILocation(line: 120, column: 12, scope: !764)
!839 = !DILocation(line: 121, column: 3, scope: !764)
!840 = !DILocation(line: 121, column: 6, scope: !764)
!841 = !DILocation(line: 121, column: 15, scope: !764)
!842 = !DILocation(line: 122, column: 11, scope: !764)
!843 = !DILocation(line: 122, column: 14, scope: !764)
!844 = !DILocation(line: 122, column: 20, scope: !764)
!845 = !DILocation(line: 122, column: 25, scope: !764)
!846 = !DILocation(line: 122, column: 28, scope: !764)
!847 = !DILocation(line: 122, column: 3, scope: !764)
!848 = !DILocation(line: 123, column: 1, scope: !764)
!849 = !DILocalVariable(name: "q", scope: !850, file: !3, line: 111, type: !7)
!850 = distinct !DILexicalBlock(scope: !851, file: !3, line: 105, column: 5)
!851 = distinct !DILexicalBlock(scope: !852, file: !3, line: 104, column: 7)
!852 = distinct !DISubprogram(name: "file_name_prepend", scope: !3, file: !3, line: 101, type: !853, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !861, retainedNodes: !4)
!853 = !DISubroutineType(types: !854)
!854 = !{null, !855, !16, !74}
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 34, size: 192, elements: !857)
!857 = !{!858, !859, !860}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !856, file: !3, line: 36, baseType: !7, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !856, file: !3, line: 37, baseType: !74, size: 64, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !856, file: !3, line: 38, baseType: !7, size: 64, offset: 128)
!861 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !862, nameTableKind: None)
!862 = !{!863}
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(name: "longopts", scope: !861, file: !3, line: 41, type: !865, isLocal: true, isDefinition: true)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !866, size: 1280, elements: !23)
!866 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !868)
!868 = !{!869, !870, !871, !872}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !867, file: !13, line: 52, baseType: !16, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !867, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !867, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !867, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!873 = !DILocalVariable(name: "n_used", scope: !850, file: !3, line: 112, type: !74)
!874 = distinct !DISubprogram(name: "nth_parent", scope: !3, file: !3, line: 127, type: !875, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!875 = !DISubroutineType(types: !876)
!876 = !{!7, !74}
!877 = !DILocalVariable(name: "n", arg: 1, scope: !874, file: !3, line: 127, type: !74)
!878 = !DILocation(line: 127, column: 20, scope: !874)
!879 = !DILocalVariable(name: "buf", scope: !874, file: !3, line: 129, type: !7)
!880 = !DILocation(line: 129, column: 9, scope: !874)
!881 = !DILocation(line: 129, column: 28, scope: !874)
!882 = !DILocation(line: 129, column: 15, scope: !874)
!883 = !DILocalVariable(name: "p", scope: !874, file: !3, line: 130, type: !7)
!884 = !DILocation(line: 130, column: 9, scope: !874)
!885 = !DILocation(line: 130, column: 13, scope: !874)
!886 = !DILocalVariable(name: "i", scope: !887, file: !3, line: 132, type: !74)
!887 = distinct !DILexicalBlock(scope: !874, file: !3, line: 132, column: 3)
!888 = !DILocation(line: 132, column: 15, scope: !887)
!889 = !DILocation(line: 132, column: 8, scope: !887)
!890 = !DILocation(line: 132, column: 22, scope: !891)
!891 = distinct !DILexicalBlock(scope: !887, file: !3, line: 132, column: 3)
!892 = !DILocation(line: 132, column: 26, scope: !891)
!893 = !DILocation(line: 132, column: 24, scope: !891)
!894 = !DILocation(line: 132, column: 3, scope: !887)
!895 = !DILocation(line: 134, column: 15, scope: !896)
!896 = distinct !DILexicalBlock(scope: !891, file: !3, line: 133, column: 5)
!897 = !DILocation(line: 134, column: 7, scope: !896)
!898 = !DILocation(line: 135, column: 9, scope: !896)
!899 = !DILocation(line: 136, column: 5, scope: !896)
!900 = !DILocation(line: 132, column: 30, scope: !891)
!901 = !DILocation(line: 132, column: 3, scope: !891)
!902 = distinct !{!902, !894, !903}
!903 = !DILocation(line: 136, column: 5, scope: !887)
!904 = !DILocation(line: 137, column: 3, scope: !874)
!905 = !DILocation(line: 137, column: 9, scope: !874)
!906 = !DILocation(line: 138, column: 10, scope: !874)
!907 = !DILocation(line: 138, column: 3, scope: !874)
!908 = distinct !DISubprogram(name: "readdir_ignoring_dot_and_dotdot", scope: !198, file: !198, line: 278, type: !909, scopeLine: 279, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!909 = !DISubroutineType(types: !910)
!910 = !{!663, !611}
!911 = !DILocalVariable(name: "dirp", arg: 1, scope: !908, file: !198, line: 278, type: !611)
!912 = !DILocation(line: 278, column: 39, scope: !908)
!913 = !DILocation(line: 280, column: 3, scope: !908)
!914 = !DILocalVariable(name: "dp", scope: !915, file: !198, line: 282, type: !663)
!915 = distinct !DILexicalBlock(scope: !908, file: !198, line: 281, column: 5)
!916 = !DILocation(line: 282, column: 28, scope: !915)
!917 = !DILocation(line: 282, column: 42, scope: !915)
!918 = !DILocation(line: 282, column: 33, scope: !915)
!919 = !DILocation(line: 283, column: 11, scope: !920)
!920 = distinct !DILexicalBlock(scope: !915, file: !198, line: 283, column: 11)
!921 = !DILocation(line: 283, column: 14, scope: !920)
!922 = !DILocation(line: 283, column: 22, scope: !920)
!923 = !DILocation(line: 283, column: 42, scope: !920)
!924 = !DILocation(line: 283, column: 46, scope: !920)
!925 = !DILocation(line: 283, column: 27, scope: !920)
!926 = !DILocation(line: 283, column: 11, scope: !915)
!927 = !DILocation(line: 284, column: 16, scope: !920)
!928 = !DILocation(line: 284, column: 9, scope: !920)
!929 = distinct !{!929, !913, !930}
!930 = !DILocation(line: 285, column: 5, scope: !908)
!931 = distinct !DISubprogram(name: "dot_or_dotdot", scope: !198, file: !198, line: 265, type: !932, scopeLine: 266, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!932 = !DISubroutineType(types: !933)
!933 = !{!38, !16}
!934 = !DILocalVariable(name: "file_name", arg: 1, scope: !931, file: !198, line: 265, type: !16)
!935 = !DILocation(line: 265, column: 28, scope: !931)
!936 = !DILocation(line: 267, column: 7, scope: !937)
!937 = distinct !DILexicalBlock(scope: !931, file: !198, line: 267, column: 7)
!938 = !DILocation(line: 267, column: 20, scope: !937)
!939 = !DILocation(line: 267, column: 7, scope: !931)
!940 = !DILocalVariable(name: "sep", scope: !941, file: !198, line: 269, type: !8)
!941 = distinct !DILexicalBlock(scope: !937, file: !198, line: 268, column: 5)
!942 = !DILocation(line: 269, column: 12, scope: !941)
!943 = !DILocation(line: 269, column: 18, scope: !941)
!944 = !DILocation(line: 269, column: 29, scope: !941)
!945 = !DILocation(line: 269, column: 42, scope: !941)
!946 = !DILocation(line: 269, column: 50, scope: !941)
!947 = !DILocation(line: 270, column: 17, scope: !941)
!948 = !DILocation(line: 270, column: 21, scope: !941)
!949 = !DILocation(line: 270, column: 24, scope: !941)
!950 = !DILocation(line: 270, column: 7, scope: !941)
!951 = !DILocation(line: 273, column: 5, scope: !937)
!952 = !DILocation(line: 274, column: 1, scope: !931)
!953 = distinct !DISubprogram(name: "close_stdout", scope: !37, file: !37, line: 117, type: !954, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !32, retainedNodes: !4)
!954 = !DISubroutineType(types: !955)
!955 = !{null}
!956 = !DILocation(line: 119, column: 21, scope: !957)
!957 = distinct !DILexicalBlock(scope: !953, file: !37, line: 119, column: 7)
!958 = !DILocation(line: 119, column: 7, scope: !957)
!959 = !DILocation(line: 119, column: 29, scope: !957)
!960 = !DILocation(line: 120, column: 7, scope: !957)
!961 = !DILocation(line: 120, column: 12, scope: !957)
!962 = !DILocation(line: 120, column: 25, scope: !957)
!963 = !DILocation(line: 120, column: 28, scope: !957)
!964 = !DILocation(line: 120, column: 34, scope: !957)
!965 = !DILocation(line: 119, column: 7, scope: !953)
!966 = !DILocalVariable(name: "write_error", scope: !967, file: !37, line: 122, type: !16)
!967 = distinct !DILexicalBlock(scope: !957, file: !37, line: 121, column: 5)
!968 = !DILocation(line: 122, column: 19, scope: !967)
!969 = !DILocation(line: 122, column: 33, scope: !967)
!970 = !DILocation(line: 123, column: 11, scope: !971)
!971 = distinct !DILexicalBlock(scope: !967, file: !37, line: 123, column: 11)
!972 = !DILocation(line: 123, column: 11, scope: !967)
!973 = !DILocation(line: 124, column: 19, scope: !971)
!974 = !DILocation(line: 124, column: 52, scope: !971)
!975 = !DILocation(line: 124, column: 36, scope: !971)
!976 = !DILocation(line: 125, column: 16, scope: !971)
!977 = !DILocation(line: 124, column: 9, scope: !971)
!978 = !DILocation(line: 127, column: 19, scope: !971)
!979 = !DILocation(line: 127, column: 32, scope: !971)
!980 = !DILocation(line: 127, column: 9, scope: !971)
!981 = !DILocation(line: 129, column: 14, scope: !967)
!982 = !DILocation(line: 129, column: 7, scope: !967)
!983 = !DILocation(line: 134, column: 42, scope: !984)
!984 = distinct !DILexicalBlock(scope: !953, file: !37, line: 134, column: 7)
!985 = !DILocation(line: 134, column: 28, scope: !984)
!986 = !DILocation(line: 134, column: 50, scope: !984)
!987 = !DILocation(line: 134, column: 7, scope: !953)
!988 = !DILocation(line: 135, column: 12, scope: !984)
!989 = !DILocation(line: 135, column: 5, scope: !984)
!990 = !DILocation(line: 136, column: 1, scope: !953)
!991 = distinct !DISubprogram(name: "set_program_name", scope: !51, file: !51, line: 39, type: !199, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !4)
!992 = !DILocalVariable(name: "argv0", arg: 1, scope: !991, file: !51, line: 39, type: !16)
!993 = !DILocation(line: 39, column: 31, scope: !991)
!994 = !DILocalVariable(name: "slash", scope: !991, file: !51, line: 46, type: !16)
!995 = !DILocation(line: 46, column: 15, scope: !991)
!996 = !DILocalVariable(name: "base", scope: !991, file: !51, line: 47, type: !16)
!997 = !DILocation(line: 47, column: 15, scope: !991)
!998 = !DILocation(line: 51, column: 7, scope: !999)
!999 = distinct !DILexicalBlock(scope: !991, file: !51, line: 51, column: 7)
!1000 = !DILocation(line: 51, column: 13, scope: !999)
!1001 = !DILocation(line: 51, column: 7, scope: !991)
!1002 = !DILocation(line: 55, column: 14, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !999, file: !51, line: 52, column: 5)
!1004 = !DILocation(line: 54, column: 7, scope: !1003)
!1005 = !DILocation(line: 56, column: 7, scope: !1003)
!1006 = !DILocation(line: 59, column: 20, scope: !991)
!1007 = !DILocation(line: 59, column: 11, scope: !991)
!1008 = !DILocation(line: 59, column: 9, scope: !991)
!1009 = !DILocation(line: 60, column: 11, scope: !991)
!1010 = !DILocation(line: 60, column: 17, scope: !991)
!1011 = !DILocation(line: 60, column: 27, scope: !991)
!1012 = !DILocation(line: 60, column: 33, scope: !991)
!1013 = !DILocation(line: 60, column: 39, scope: !991)
!1014 = !DILocation(line: 60, column: 8, scope: !991)
!1015 = !DILocation(line: 61, column: 7, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !991, file: !51, line: 61, column: 7)
!1017 = !DILocation(line: 61, column: 14, scope: !1016)
!1018 = !DILocation(line: 61, column: 12, scope: !1016)
!1019 = !DILocation(line: 61, column: 20, scope: !1016)
!1020 = !DILocation(line: 61, column: 25, scope: !1016)
!1021 = !DILocation(line: 61, column: 37, scope: !1016)
!1022 = !DILocation(line: 61, column: 42, scope: !1016)
!1023 = !DILocation(line: 61, column: 28, scope: !1016)
!1024 = !DILocation(line: 61, column: 61, scope: !1016)
!1025 = !DILocation(line: 61, column: 7, scope: !991)
!1026 = !DILocation(line: 63, column: 15, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !1016, file: !51, line: 62, column: 5)
!1028 = !DILocation(line: 63, column: 13, scope: !1027)
!1029 = !DILocation(line: 64, column: 20, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !1027, file: !51, line: 64, column: 11)
!1031 = !DILocation(line: 64, column: 11, scope: !1030)
!1032 = !DILocation(line: 64, column: 36, scope: !1030)
!1033 = !DILocation(line: 64, column: 11, scope: !1027)
!1034 = !DILocation(line: 66, column: 19, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !1030, file: !51, line: 65, column: 9)
!1036 = !DILocation(line: 66, column: 24, scope: !1035)
!1037 = !DILocation(line: 66, column: 17, scope: !1035)
!1038 = !DILocation(line: 70, column: 52, scope: !1035)
!1039 = !DILocation(line: 70, column: 41, scope: !1035)
!1040 = !DILocation(line: 72, column: 9, scope: !1035)
!1041 = !DILocation(line: 73, column: 5, scope: !1027)
!1042 = !DILocation(line: 84, column: 18, scope: !991)
!1043 = !DILocation(line: 84, column: 16, scope: !991)
!1044 = !DILocation(line: 90, column: 38, scope: !991)
!1045 = !DILocation(line: 90, column: 27, scope: !991)
!1046 = !DILocation(line: 92, column: 1, scope: !991)
!1047 = !DILocalVariable(name: "argv0", arg: 1, scope: !1048, file: !51, line: 39, type: !16)
!1048 = distinct !DISubprogram(name: "set_program_name", scope: !51, file: !51, line: 39, type: !199, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1049, retainedNodes: !4)
!1049 = distinct !DICompileUnit(language: DW_LANG_C99, file: !49, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !1050, nameTableKind: None)
!1050 = !{!1051}
!1051 = !DIGlobalVariableExpression(var: !1052, expr: !DIExpression())
!1052 = distinct !DIGlobalVariable(name: "program_name", scope: !1049, file: !51, line: 33, type: !16, isLocal: false, isDefinition: true)
!1053 = !DILocalVariable(name: "slash", scope: !1048, file: !51, line: 46, type: !16)
!1054 = !DILocalVariable(name: "base", scope: !1048, file: !51, line: 47, type: !16)
!1055 = distinct !DISubprogram(name: "set_char_quoting", scope: !80, file: !80, line: 152, type: !1056, scopeLine: 153, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !54, retainedNodes: !4)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!19, !1058, !8, !19}
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!1059 = !DILocalVariable(name: "o", arg: 1, scope: !1055, file: !80, line: 152, type: !1058)
!1060 = !DILocation(line: 152, column: 43, scope: !1055)
!1061 = !DILocalVariable(name: "c", arg: 2, scope: !1055, file: !80, line: 152, type: !8)
!1062 = !DILocation(line: 152, column: 51, scope: !1055)
!1063 = !DILocalVariable(name: "i", arg: 3, scope: !1055, file: !80, line: 152, type: !19)
!1064 = !DILocation(line: 152, column: 58, scope: !1055)
!1065 = !DILocalVariable(name: "uc", scope: !1055, file: !80, line: 154, type: !148)
!1066 = !DILocation(line: 154, column: 17, scope: !1055)
!1067 = !DILocation(line: 154, column: 22, scope: !1055)
!1068 = !DILocalVariable(name: "p", scope: !1055, file: !80, line: 155, type: !1069)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!1070 = !DILocation(line: 155, column: 17, scope: !1055)
!1071 = !DILocation(line: 156, column: 6, scope: !1055)
!1072 = !DILocation(line: 156, column: 10, scope: !1055)
!1073 = !DILocation(line: 156, column: 41, scope: !1055)
!1074 = !DILocation(line: 156, column: 5, scope: !1055)
!1075 = !DILocation(line: 156, column: 59, scope: !1055)
!1076 = !DILocation(line: 156, column: 62, scope: !1055)
!1077 = !DILocation(line: 156, column: 57, scope: !1055)
!1078 = !DILocalVariable(name: "shift", scope: !1055, file: !80, line: 157, type: !19)
!1079 = !DILocation(line: 157, column: 7, scope: !1055)
!1080 = !DILocation(line: 157, column: 15, scope: !1055)
!1081 = !DILocation(line: 157, column: 18, scope: !1055)
!1082 = !DILocalVariable(name: "r", scope: !1055, file: !80, line: 158, type: !19)
!1083 = !DILocation(line: 158, column: 7, scope: !1055)
!1084 = !DILocation(line: 158, column: 13, scope: !1055)
!1085 = !DILocation(line: 158, column: 12, scope: !1055)
!1086 = !DILocation(line: 158, column: 18, scope: !1055)
!1087 = !DILocation(line: 158, column: 15, scope: !1055)
!1088 = !DILocation(line: 158, column: 25, scope: !1055)
!1089 = !DILocation(line: 159, column: 11, scope: !1055)
!1090 = !DILocation(line: 159, column: 13, scope: !1055)
!1091 = !DILocation(line: 159, column: 20, scope: !1055)
!1092 = !DILocation(line: 159, column: 18, scope: !1055)
!1093 = !DILocation(line: 159, column: 26, scope: !1055)
!1094 = !DILocation(line: 159, column: 23, scope: !1055)
!1095 = !DILocation(line: 159, column: 4, scope: !1055)
!1096 = !DILocation(line: 159, column: 6, scope: !1055)
!1097 = !DILocation(line: 160, column: 10, scope: !1055)
!1098 = !DILocation(line: 160, column: 3, scope: !1055)
!1099 = !DILocalVariable(name: "o", arg: 1, scope: !1100, file: !80, line: 152, type: !1103)
!1100 = distinct !DISubprogram(name: "set_char_quoting", scope: !80, file: !80, line: 152, type: !1101, scopeLine: 153, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1111, retainedNodes: !4)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{!19, !1103, !8, !19}
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !80, line: 65, size: 448, elements: !1105)
!1105 = !{!1106, !1107, !1108, !1109, !1110}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1104, file: !80, line: 68, baseType: !57, size: 32)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1104, file: !80, line: 71, baseType: !19, size: 32, offset: 32)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1104, file: !80, line: 75, baseType: !98, size: 256, offset: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1104, file: !80, line: 78, baseType: !16, size: 64, offset: 320)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1104, file: !80, line: 81, baseType: !16, size: 64, offset: 384)
!1111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !55, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, retainedTypes: !72, globals: !1112, nameTableKind: None)
!1112 = !{!1113, !1115, !1117, !1119, !1121, !1123, !1130, !1132}
!1113 = !DIGlobalVariableExpression(var: !1114, expr: !DIExpression())
!1114 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1111, file: !80, line: 85, type: !81, isLocal: false, isDefinition: true)
!1115 = !DIGlobalVariableExpression(var: !1116, expr: !DIExpression())
!1116 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1111, file: !80, line: 101, type: !87, isLocal: false, isDefinition: true)
!1117 = !DIGlobalVariableExpression(var: !1118, expr: !DIExpression())
!1118 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1111, file: !80, line: 1052, type: !1104, isLocal: false, isDefinition: true)
!1119 = !DIGlobalVariableExpression(var: !1120, expr: !DIExpression())
!1120 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1111, file: !80, line: 116, type: !1104, isLocal: true, isDefinition: true)
!1121 = !DIGlobalVariableExpression(var: !1122, expr: !DIExpression())
!1122 = distinct !DIGlobalVariable(name: "slot0", scope: !1111, file: !80, line: 842, type: !105, isLocal: true, isDefinition: true)
!1123 = !DIGlobalVariableExpression(var: !1124, expr: !DIExpression())
!1124 = distinct !DIGlobalVariable(name: "slotvec", scope: !1111, file: !80, line: 845, type: !1125, isLocal: true, isDefinition: true)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !80, line: 834, size: 128, elements: !1127)
!1127 = !{!1128, !1129}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1126, file: !80, line: 836, baseType: !74, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1126, file: !80, line: 837, baseType: !7, size: 64, offset: 64)
!1130 = !DIGlobalVariableExpression(var: !1131, expr: !DIExpression())
!1131 = distinct !DIGlobalVariable(name: "nslots", scope: !1111, file: !80, line: 843, type: !19, isLocal: true, isDefinition: true)
!1132 = !DIGlobalVariableExpression(var: !1133, expr: !DIExpression())
!1133 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1111, file: !80, line: 844, type: !1126, isLocal: true, isDefinition: true)
!1134 = !DILocalVariable(name: "c", arg: 2, scope: !1100, file: !80, line: 152, type: !8)
!1135 = !DILocalVariable(name: "i", arg: 3, scope: !1100, file: !80, line: 152, type: !19)
!1136 = !DILocalVariable(name: "uc", scope: !1100, file: !80, line: 154, type: !148)
!1137 = !DILocalVariable(name: "p", scope: !1100, file: !80, line: 155, type: !1069)
!1138 = distinct !DISubprogram(name: "quotearg_n_style", scope: !80, file: !80, line: 955, type: !1139, scopeLine: 956, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !54, retainedNodes: !4)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!7, !19, !57, !16}
!1141 = !DILocalVariable(name: "n", arg: 1, scope: !1138, file: !80, line: 955, type: !19)
!1142 = !DILocation(line: 955, column: 23, scope: !1138)
!1143 = !DILocalVariable(name: "s", arg: 2, scope: !1138, file: !80, line: 955, type: !57)
!1144 = !DILocation(line: 955, column: 45, scope: !1138)
!1145 = !DILocalVariable(name: "arg", arg: 3, scope: !1138, file: !80, line: 955, type: !16)
!1146 = !DILocation(line: 955, column: 60, scope: !1138)
!1147 = !DILocalVariable(name: "o", scope: !1138, file: !80, line: 957, type: !1148)
!1148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!1149 = !DILocation(line: 957, column: 32, scope: !1138)
!1150 = !DILocation(line: 957, column: 64, scope: !1138)
!1151 = !DILocation(line: 957, column: 36, scope: !1138)
!1152 = !DILocation(line: 958, column: 30, scope: !1138)
!1153 = !DILocation(line: 958, column: 33, scope: !1138)
!1154 = !DILocation(line: 958, column: 10, scope: !1138)
!1155 = !DILocation(line: 958, column: 3, scope: !1138)
!1156 = distinct !DISubprogram(name: "quoting_options_from_style", scope: !80, file: !80, line: 193, type: !1157, scopeLine: 194, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !54, retainedNodes: !4)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!93, !57}
!1159 = !DILocalVariable(name: "style", arg: 1, scope: !1156, file: !80, line: 193, type: !57)
!1160 = !DILocation(line: 193, column: 48, scope: !1156)
!1161 = !DILocalVariable(name: "o", scope: !1156, file: !80, line: 195, type: !93)
!1162 = !DILocation(line: 195, column: 26, scope: !1156)
!1163 = !DILocation(line: 196, column: 7, scope: !1164)
!1164 = distinct !DILexicalBlock(scope: !1156, file: !80, line: 196, column: 7)
!1165 = !DILocation(line: 196, column: 13, scope: !1164)
!1166 = !DILocation(line: 196, column: 7, scope: !1156)
!1167 = !DILocation(line: 197, column: 5, scope: !1164)
!1168 = !DILocation(line: 198, column: 13, scope: !1156)
!1169 = !DILocation(line: 198, column: 5, scope: !1156)
!1170 = !DILocation(line: 198, column: 11, scope: !1156)
!1171 = !DILocation(line: 199, column: 3, scope: !1156)
!1172 = distinct !DISubprogram(name: "quotearg_n_options", scope: !80, file: !80, line: 877, type: !1173, scopeLine: 879, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !54, retainedNodes: !4)
!1173 = !DISubroutineType(types: !1174)
!1174 = !{!7, !19, !16, !74, !1175}
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64)
!1176 = !DILocalVariable(name: "n", arg: 1, scope: !1172, file: !80, line: 877, type: !19)
!1177 = !DILocation(line: 877, column: 25, scope: !1172)
!1178 = !DILocalVariable(name: "arg", arg: 2, scope: !1172, file: !80, line: 877, type: !16)
!1179 = !DILocation(line: 877, column: 40, scope: !1172)
!1180 = !DILocalVariable(name: "argsize", arg: 3, scope: !1172, file: !80, line: 877, type: !74)
!1181 = !DILocation(line: 877, column: 52, scope: !1172)
!1182 = !DILocalVariable(name: "options", arg: 4, scope: !1172, file: !80, line: 878, type: !1175)
!1183 = !DILocation(line: 878, column: 51, scope: !1172)
!1184 = !DILocalVariable(name: "e", scope: !1172, file: !80, line: 880, type: !19)
!1185 = !DILocation(line: 880, column: 7, scope: !1172)
!1186 = !DILocation(line: 880, column: 11, scope: !1172)
!1187 = !DILocalVariable(name: "sv", scope: !1172, file: !80, line: 882, type: !110)
!1188 = !DILocation(line: 882, column: 19, scope: !1172)
!1189 = !DILocation(line: 882, column: 24, scope: !1172)
!1190 = !DILocation(line: 884, column: 7, scope: !1191)
!1191 = distinct !DILexicalBlock(scope: !1172, file: !80, line: 884, column: 7)
!1192 = !DILocation(line: 884, column: 9, scope: !1191)
!1193 = !DILocation(line: 884, column: 7, scope: !1172)
!1194 = !DILocation(line: 885, column: 5, scope: !1191)
!1195 = !DILocation(line: 887, column: 7, scope: !1196)
!1196 = distinct !DILexicalBlock(scope: !1172, file: !80, line: 887, column: 7)
!1197 = !DILocation(line: 887, column: 17, scope: !1196)
!1198 = !DILocation(line: 887, column: 14, scope: !1196)
!1199 = !DILocation(line: 887, column: 7, scope: !1172)
!1200 = !DILocalVariable(name: "preallocated", scope: !1201, file: !80, line: 889, type: !38)
!1201 = distinct !DILexicalBlock(scope: !1196, file: !80, line: 888, column: 5)
!1202 = !DILocation(line: 889, column: 12, scope: !1201)
!1203 = !DILocation(line: 889, column: 28, scope: !1201)
!1204 = !DILocation(line: 889, column: 31, scope: !1201)
!1205 = !DILocalVariable(name: "nmax", scope: !1201, file: !80, line: 890, type: !19)
!1206 = !DILocation(line: 890, column: 11, scope: !1201)
!1207 = !DILocation(line: 892, column: 11, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !1201, file: !80, line: 892, column: 11)
!1209 = !DILocation(line: 892, column: 18, scope: !1208)
!1210 = !DILocation(line: 892, column: 16, scope: !1208)
!1211 = !DILocation(line: 892, column: 11, scope: !1201)
!1212 = !DILocation(line: 893, column: 9, scope: !1208)
!1213 = !DILocation(line: 895, column: 32, scope: !1201)
!1214 = !DILocation(line: 895, column: 54, scope: !1201)
!1215 = !DILocation(line: 895, column: 59, scope: !1201)
!1216 = !DILocation(line: 895, column: 61, scope: !1201)
!1217 = !DILocation(line: 895, column: 58, scope: !1201)
!1218 = !DILocation(line: 895, column: 66, scope: !1201)
!1219 = !DILocation(line: 895, column: 22, scope: !1201)
!1220 = !DILocation(line: 895, column: 20, scope: !1201)
!1221 = !DILocation(line: 895, column: 15, scope: !1201)
!1222 = !DILocation(line: 896, column: 11, scope: !1223)
!1223 = distinct !DILexicalBlock(scope: !1201, file: !80, line: 896, column: 11)
!1224 = !DILocation(line: 896, column: 11, scope: !1201)
!1225 = !DILocation(line: 897, column: 10, scope: !1223)
!1226 = !DILocation(line: 897, column: 15, scope: !1223)
!1227 = !DILocation(line: 897, column: 9, scope: !1223)
!1228 = !DILocation(line: 898, column: 15, scope: !1201)
!1229 = !DILocation(line: 898, column: 20, scope: !1201)
!1230 = !DILocation(line: 898, column: 18, scope: !1201)
!1231 = !DILocation(line: 898, column: 7, scope: !1201)
!1232 = !DILocation(line: 898, column: 32, scope: !1201)
!1233 = !DILocation(line: 898, column: 34, scope: !1201)
!1234 = !DILocation(line: 898, column: 40, scope: !1201)
!1235 = !DILocation(line: 898, column: 38, scope: !1201)
!1236 = !DILocation(line: 898, column: 31, scope: !1201)
!1237 = !DILocation(line: 898, column: 48, scope: !1201)
!1238 = !DILocation(line: 899, column: 16, scope: !1201)
!1239 = !DILocation(line: 899, column: 18, scope: !1201)
!1240 = !DILocation(line: 899, column: 14, scope: !1201)
!1241 = !DILocation(line: 900, column: 5, scope: !1201)
!1242 = !DILocalVariable(name: "size", scope: !1243, file: !80, line: 903, type: !74)
!1243 = distinct !DILexicalBlock(scope: !1172, file: !80, line: 902, column: 3)
!1244 = !DILocation(line: 903, column: 12, scope: !1243)
!1245 = !DILocation(line: 903, column: 19, scope: !1243)
!1246 = !DILocation(line: 903, column: 22, scope: !1243)
!1247 = !DILocation(line: 903, column: 25, scope: !1243)
!1248 = !DILocalVariable(name: "val", scope: !1243, file: !80, line: 904, type: !7)
!1249 = !DILocation(line: 904, column: 11, scope: !1243)
!1250 = !DILocation(line: 904, column: 17, scope: !1243)
!1251 = !DILocation(line: 904, column: 20, scope: !1243)
!1252 = !DILocation(line: 904, column: 23, scope: !1243)
!1253 = !DILocalVariable(name: "flags", scope: !1243, file: !80, line: 906, type: !19)
!1254 = !DILocation(line: 906, column: 9, scope: !1243)
!1255 = !DILocation(line: 906, column: 17, scope: !1243)
!1256 = !DILocation(line: 906, column: 26, scope: !1243)
!1257 = !DILocation(line: 906, column: 32, scope: !1243)
!1258 = !DILocalVariable(name: "qsize", scope: !1243, file: !80, line: 907, type: !74)
!1259 = !DILocation(line: 907, column: 12, scope: !1243)
!1260 = !DILocation(line: 907, column: 46, scope: !1243)
!1261 = !DILocation(line: 907, column: 51, scope: !1243)
!1262 = !DILocation(line: 907, column: 57, scope: !1243)
!1263 = !DILocation(line: 907, column: 62, scope: !1243)
!1264 = !DILocation(line: 908, column: 46, scope: !1243)
!1265 = !DILocation(line: 908, column: 55, scope: !1243)
!1266 = !DILocation(line: 908, column: 62, scope: !1243)
!1267 = !DILocation(line: 909, column: 46, scope: !1243)
!1268 = !DILocation(line: 909, column: 55, scope: !1243)
!1269 = !DILocation(line: 910, column: 46, scope: !1243)
!1270 = !DILocation(line: 910, column: 55, scope: !1243)
!1271 = !DILocation(line: 911, column: 46, scope: !1243)
!1272 = !DILocation(line: 911, column: 55, scope: !1243)
!1273 = !DILocation(line: 907, column: 20, scope: !1243)
!1274 = !DILocation(line: 913, column: 9, scope: !1275)
!1275 = distinct !DILexicalBlock(scope: !1243, file: !80, line: 913, column: 9)
!1276 = !DILocation(line: 913, column: 17, scope: !1275)
!1277 = !DILocation(line: 913, column: 14, scope: !1275)
!1278 = !DILocation(line: 913, column: 9, scope: !1243)
!1279 = !DILocation(line: 915, column: 29, scope: !1280)
!1280 = distinct !DILexicalBlock(scope: !1275, file: !80, line: 914, column: 7)
!1281 = !DILocation(line: 915, column: 35, scope: !1280)
!1282 = !DILocation(line: 915, column: 27, scope: !1280)
!1283 = !DILocation(line: 915, column: 9, scope: !1280)
!1284 = !DILocation(line: 915, column: 12, scope: !1280)
!1285 = !DILocation(line: 915, column: 15, scope: !1280)
!1286 = !DILocation(line: 915, column: 20, scope: !1280)
!1287 = !DILocation(line: 916, column: 13, scope: !1288)
!1288 = distinct !DILexicalBlock(scope: !1280, file: !80, line: 916, column: 13)
!1289 = !DILocation(line: 916, column: 17, scope: !1288)
!1290 = !DILocation(line: 916, column: 13, scope: !1280)
!1291 = !DILocation(line: 917, column: 17, scope: !1288)
!1292 = !DILocation(line: 917, column: 11, scope: !1288)
!1293 = !DILocation(line: 918, column: 39, scope: !1280)
!1294 = !DILocation(line: 918, column: 27, scope: !1280)
!1295 = !DILocation(line: 918, column: 25, scope: !1280)
!1296 = !DILocation(line: 918, column: 9, scope: !1280)
!1297 = !DILocation(line: 918, column: 12, scope: !1280)
!1298 = !DILocation(line: 918, column: 15, scope: !1280)
!1299 = !DILocation(line: 918, column: 19, scope: !1280)
!1300 = !DILocation(line: 919, column: 35, scope: !1280)
!1301 = !DILocation(line: 919, column: 40, scope: !1280)
!1302 = !DILocation(line: 919, column: 46, scope: !1280)
!1303 = !DILocation(line: 919, column: 51, scope: !1280)
!1304 = !DILocation(line: 919, column: 60, scope: !1280)
!1305 = !DILocation(line: 919, column: 69, scope: !1280)
!1306 = !DILocation(line: 920, column: 35, scope: !1280)
!1307 = !DILocation(line: 920, column: 42, scope: !1280)
!1308 = !DILocation(line: 920, column: 51, scope: !1280)
!1309 = !DILocation(line: 921, column: 35, scope: !1280)
!1310 = !DILocation(line: 921, column: 44, scope: !1280)
!1311 = !DILocation(line: 922, column: 35, scope: !1280)
!1312 = !DILocation(line: 922, column: 44, scope: !1280)
!1313 = !DILocation(line: 919, column: 9, scope: !1280)
!1314 = !DILocation(line: 923, column: 7, scope: !1280)
!1315 = !DILocation(line: 925, column: 13, scope: !1243)
!1316 = !DILocation(line: 925, column: 5, scope: !1243)
!1317 = !DILocation(line: 925, column: 11, scope: !1243)
!1318 = !DILocation(line: 926, column: 12, scope: !1243)
!1319 = !DILocation(line: 926, column: 5, scope: !1243)
!1320 = !DILocalVariable(name: "nmax", scope: !1321, file: !80, line: 890, type: !19)
!1321 = distinct !DILexicalBlock(scope: !1322, file: !80, line: 888, column: 5)
!1322 = distinct !DILexicalBlock(scope: !1323, file: !80, line: 887, column: 7)
!1323 = distinct !DISubprogram(name: "quotearg_n_options", scope: !80, file: !80, line: 877, type: !1324, scopeLine: 879, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1335, retainedNodes: !4)
!1324 = !DISubroutineType(types: !1325)
!1325 = !{!7, !19, !16, !74, !1326}
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64)
!1327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1328)
!1328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !80, line: 65, size: 448, elements: !1329)
!1329 = !{!1330, !1331, !1332, !1333, !1334}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1328, file: !80, line: 68, baseType: !57, size: 32)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1328, file: !80, line: 71, baseType: !19, size: 32, offset: 32)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1328, file: !80, line: 75, baseType: !98, size: 256, offset: 64)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1328, file: !80, line: 78, baseType: !16, size: 64, offset: 320)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1328, file: !80, line: 81, baseType: !16, size: 64, offset: 384)
!1335 = distinct !DICompileUnit(language: DW_LANG_C99, file: !55, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, retainedTypes: !72, globals: !1336, nameTableKind: None)
!1336 = !{!1337, !1339, !1341, !1343, !1345, !1347, !1354, !1356}
!1337 = !DIGlobalVariableExpression(var: !1338, expr: !DIExpression())
!1338 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1335, file: !80, line: 85, type: !81, isLocal: false, isDefinition: true)
