; ModuleID = '<stdin>'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.file_name = type { i8*, i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.dev_ino, %struct.dev_ino, %struct.dev_ino, [3 x i64] }
%struct.dev_ino = type { i64, i64 }
%struct.__dirstream = type opaque
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external dso_local global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [23 x i8] c"Usage: %s [OPTION]...\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 41, type: !10, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !9, nameTableKind: None)
!3 = !DIFile(filename: "src/pwd.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!4 = !{}
!5 = !{!6, !7}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !{!0}
!10 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 1280, elements: !23)
!11 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !14)
!13 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "")
!14 = !{!15, !18, !20, !22}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !12, file: !13, line: 52, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !12, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !12, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !12, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!23 = !{!24}
!24 = !DISubrange(count: 5)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "Version", scope: !27, file: !28, line: 2, type: !16, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !29, nameTableKind: None)
!28 = !DIFile(filename: "src/version.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!29 = !{!25}
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !32, file: !37, line: 56, type: !38, isLocal: true, isDefinition: true)
!32 = distinct !DICompileUnit(language: DW_LANG_C99, file: !33, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !34, nameTableKind: None)
!33 = !DIFile(filename: "./lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!34 = !{!35, !30}
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "file_name", scope: !32, file: !37, line: 46, type: !16, isLocal: true, isDefinition: true)
!37 = !DIFile(filename: "lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!38 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "exit_failure", scope: !41, file: !44, line: 24, type: !45, isLocal: false, isDefinition: true)
!41 = distinct !DICompileUnit(language: DW_LANG_C99, file: !42, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !43, nameTableKind: None)
!42 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!43 = !{!39}
!44 = !DIFile(filename: "lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!45 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !19)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "program_name", scope: !48, file: !51, line: 33, type: !16, isLocal: false, isDefinition: true)
!48 = distinct !DICompileUnit(language: DW_LANG_C99, file: !49, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !50, nameTableKind: None)
!49 = !DIFile(filename: "./lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!50 = !{!46}
!51 = !DIFile(filename: "lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !54, file: !80, line: 116, type: !93, isLocal: true, isDefinition: true)
!54 = distinct !DICompileUnit(language: DW_LANG_C99, file: !55, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, retainedTypes: !72, globals: !77, nameTableKind: None)
!55 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!56 = !{!57}
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !58, line: 32, baseType: !59, size: 32, elements: !60)
!58 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!59 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!60 = !{!61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71}
!61 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!62 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!63 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!64 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!65 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!66 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!67 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!68 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!69 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!70 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!71 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!72 = !{!19, !73, !74}
!73 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !75, line: 46, baseType: !76)
!75 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.1/include/stddef.h", directory: "")
!76 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!77 = !{!78, !85, !91, !52, !103, !108, !115, !117}
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !54, file: !80, line: 85, type: !81, isLocal: false, isDefinition: true)
!80 = !DIFile(filename: "lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 704, elements: !83)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!83 = !{!84}
!84 = !DISubrange(count: 11)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !54, file: !80, line: 101, type: !87, isLocal: false, isDefinition: true)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 320, elements: !89)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!89 = !{!90}
!90 = !DISubrange(count: 10)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !54, file: !80, line: 1052, type: !93, isLocal: false, isDefinition: true)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !80, line: 65, size: 448, elements: !94)
!94 = !{!95, !96, !97, !101, !102}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !93, file: !80, line: 68, baseType: !57, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !93, file: !80, line: 71, baseType: !19, size: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !93, file: !80, line: 75, baseType: !98, size: 256, offset: 64)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 256, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 8)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !93, file: !80, line: 78, baseType: !16, size: 64, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !93, file: !80, line: 81, baseType: !16, size: 64, offset: 384)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "slot0", scope: !54, file: !80, line: 842, type: !105, isLocal: true, isDefinition: true)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 256)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "slotvec", scope: !54, file: !80, line: 845, type: !110, isLocal: true, isDefinition: true)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !80, line: 834, size: 128, elements: !112)
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !111, file: !80, line: 836, baseType: !74, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !111, file: !80, line: 837, baseType: !7, size: 64, offset: 64)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "nslots", scope: !54, file: !80, line: 843, type: !19, isLocal: true, isDefinition: true)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "slotvec0", scope: !54, file: !80, line: 844, type: !111, isLocal: true, isDefinition: true)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !121, file: !124, line: 26, type: !125, isLocal: false, isDefinition: true)
!121 = distinct !DICompileUnit(language: DW_LANG_C99, file: !122, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !123, nameTableKind: None)
!122 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!123 = !{!119}
!124 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 376, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 47)
!128 = distinct !DICompileUnit(language: DW_LANG_C99, file: !129, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!129 = !DIFile(filename: "./lib/root-dev-ino.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!130 = distinct !DICompileUnit(language: DW_LANG_C99, file: !131, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!131 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!132 = !{!6}
!133 = distinct !DICompileUnit(language: DW_LANG_C99, file: !134, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !135, nameTableKind: None)
!134 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!135 = !{!74, !7, !6}
!136 = distinct !DICompileUnit(language: DW_LANG_C99, file: !137, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!137 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!138 = distinct !DICompileUnit(language: DW_LANG_C99, file: !139, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!139 = !DIFile(filename: "./lib/xgetcwd.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!140 = distinct !DICompileUnit(language: DW_LANG_C99, file: !141, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !142, nameTableKind: None)
!141 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!142 = !{!74}
!143 = distinct !DICompileUnit(language: DW_LANG_C99, file: !144, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !145, nameTableKind: None)
!144 = !DIFile(filename: "./lib/c-strcasecmp.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!145 = !{!146}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!149 = distinct !DICompileUnit(language: DW_LANG_C99, file: !150, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!150 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!151 = distinct !DICompileUnit(language: DW_LANG_C99, file: !152, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!152 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!153 = distinct !DICompileUnit(language: DW_LANG_C99, file: !154, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!154 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!155 = distinct !DICompileUnit(language: DW_LANG_C99, file: !156, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!156 = !DIFile(filename: "./lib/setlocale_null.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!157 = distinct !DICompileUnit(language: DW_LANG_C99, file: !158, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!158 = !DIFile(filename: "./lib/fclose.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!159 = distinct !DICompileUnit(language: DW_LANG_C99, file: !160, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!160 = !DIFile(filename: "./lib/fflush.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!161 = distinct !DICompileUnit(language: DW_LANG_C99, file: !162, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!162 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!163 = distinct !DICompileUnit(language: DW_LANG_C99, file: !164, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!164 = !DIFile(filename: "./lib/c-ctype.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!165 = !{!"clang version 9.0.1-12 "}
!166 = !{i32 2, !"Dwarf Version", i32 4}
!167 = !{i32 2, !"Debug Info Version", i32 3}
!168 = !{i32 1, !"wchar_size", i32 4}
!169 = !{i32 1, !"ThinLTO", i32 0}
!170 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!171 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 51, type: !172, scopeLine: 52, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !19}
!174 = !DILocalVariable(name: "status", arg: 1, scope: !171, file: !3, line: 51, type: !19)
!175 = !DILocation(line: 51, column: 12, scope: !171)
!176 = !DILocation(line: 53, column: 7, scope: !177)
!177 = distinct !DILexicalBlock(scope: !171, file: !3, line: 53, column: 7)
!178 = !DILocation(line: 53, column: 14, scope: !177)
!179 = !DILocation(line: 53, column: 7, scope: !171)
!180 = !DILocation(line: 54, column: 5, scope: !177)
!181 = !DILocation(line: 54, column: 5, scope: !182)
!182 = distinct !DILexicalBlock(scope: !177, file: !3, line: 54, column: 5)
!183 = !DILocation(line: 57, column: 15, scope: !184)
!184 = distinct !DILexicalBlock(scope: !177, file: !3, line: 56, column: 5)
!185 = !DILocation(line: 57, column: 45, scope: !184)
!186 = !DILocation(line: 57, column: 7, scope: !184)
!187 = !DILocation(line: 58, column: 7, scope: !184)
!188 = !DILocation(line: 62, column: 7, scope: !184)
!189 = !DILocation(line: 66, column: 7, scope: !184)
!190 = !DILocation(line: 67, column: 7, scope: !184)
!191 = !DILocation(line: 68, column: 7, scope: !184)
!192 = !DILocation(line: 71, column: 15, scope: !184)
!193 = !DILocation(line: 71, column: 7, scope: !184)
!194 = !DILocation(line: 72, column: 7, scope: !184)
!195 = !DILocation(line: 74, column: 9, scope: !171)
!196 = !DILocation(line: 74, column: 3, scope: !171)
!197 = !DILocalVariable(name: "status", arg: 1, scope: !198, file: !3, line: 51, type: !19)
!198 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 51, type: !172, scopeLine: 52, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !199, retainedNodes: !4)
!199 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !200, nameTableKind: None)
!200 = !{!201}
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "longopts", scope: !199, file: !3, line: 41, type: !203, isLocal: true, isDefinition: true)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 1280, elements: !23)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !206)
!206 = !{!207, !208, !209, !210}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !205, file: !13, line: 52, baseType: !16, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !205, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !205, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !205, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!211 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !212, file: !212, line: 634, type: !213, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!212 = !DIFile(filename: "src/system.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!213 = !DISubroutineType(types: !214)
!214 = !{null, !16}
!215 = !DILocalVariable(name: "program", arg: 1, scope: !211, file: !212, line: 634, type: !16)
!216 = !DILocation(line: 634, column: 34, scope: !211)
!217 = !DILocalVariable(name: "infomap", scope: !211, file: !212, line: 636, type: !218)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 896, elements: !224)
!219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !211, file: !212, line: 636, size: 128, elements: !221)
!221 = !{!222, !223}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !220, file: !212, line: 636, baseType: !16, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !220, file: !212, line: 636, baseType: !16, size: 64, offset: 64)
!224 = !{!225}
!225 = !DISubrange(count: 7)
!226 = !DILocation(line: 636, column: 67, scope: !211)
!227 = !DILocalVariable(name: "node", scope: !211, file: !212, line: 646, type: !16)
!228 = !DILocation(line: 646, column: 15, scope: !211)
!229 = !DILocation(line: 646, column: 22, scope: !211)
!230 = !DILocalVariable(name: "map_prog", scope: !211, file: !212, line: 647, type: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!232 = !DILocation(line: 647, column: 25, scope: !211)
!233 = !DILocation(line: 647, column: 36, scope: !211)
!234 = !DILocation(line: 649, column: 3, scope: !211)
!235 = !DILocation(line: 649, column: 10, scope: !211)
!236 = !DILocation(line: 649, column: 20, scope: !211)
!237 = !DILocation(line: 649, column: 28, scope: !211)
!238 = !DILocation(line: 649, column: 33, scope: !211)
!239 = !DILocation(line: 649, column: 31, scope: !211)
!240 = !DILocation(line: 0, scope: !211)
!241 = !DILocation(line: 650, column: 13, scope: !211)
!242 = distinct !{!242, !234, !241}
!243 = !DILocation(line: 652, column: 7, scope: !244)
!244 = distinct !DILexicalBlock(scope: !211, file: !212, line: 652, column: 7)
!245 = !DILocation(line: 652, column: 17, scope: !244)
!246 = !DILocation(line: 652, column: 7, scope: !211)
!247 = !DILocation(line: 653, column: 12, scope: !244)
!248 = !DILocation(line: 653, column: 22, scope: !244)
!249 = !DILocation(line: 653, column: 10, scope: !244)
!250 = !DILocation(line: 653, column: 5, scope: !244)
!251 = !DILocation(line: 655, column: 11, scope: !211)
!252 = !DILocation(line: 655, column: 3, scope: !211)
!253 = !DILocalVariable(name: "lc_messages", scope: !211, file: !212, line: 659, type: !16)
!254 = !DILocation(line: 659, column: 15, scope: !211)
!255 = !DILocation(line: 659, column: 29, scope: !211)
!256 = !DILocation(line: 660, column: 7, scope: !257)
!257 = distinct !DILexicalBlock(scope: !211, file: !212, line: 660, column: 7)
!258 = !DILocation(line: 660, column: 19, scope: !257)
!259 = !DILocation(line: 660, column: 22, scope: !257)
!260 = !DILocation(line: 660, column: 7, scope: !211)
!261 = !DILocation(line: 666, column: 7, scope: !262)
!262 = distinct !DILexicalBlock(scope: !257, file: !212, line: 661, column: 5)
!263 = !DILocation(line: 668, column: 5, scope: !262)
!264 = !DILocation(line: 669, column: 11, scope: !211)
!265 = !DILocation(line: 670, column: 24, scope: !211)
!266 = !DILocation(line: 669, column: 3, scope: !211)
!267 = !DILocation(line: 671, column: 11, scope: !211)
!268 = !DILocation(line: 672, column: 11, scope: !211)
!269 = !DILocation(line: 672, column: 17, scope: !211)
!270 = !DILocation(line: 672, column: 25, scope: !211)
!271 = !DILocation(line: 672, column: 22, scope: !211)
!272 = !DILocation(line: 671, column: 3, scope: !211)
!273 = !DILocation(line: 673, column: 1, scope: !211)
!274 = !DILocalVariable(name: "program", arg: 1, scope: !275, file: !212, line: 634, type: !16)
!275 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !212, file: !212, line: 634, type: !213, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !276, retainedNodes: !4)
!276 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !277, nameTableKind: None)
!277 = !{!278}
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "longopts", scope: !276, file: !3, line: 41, type: !280, isLocal: true, isDefinition: true)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 1280, elements: !23)
!281 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !283)
!283 = !{!284, !285, !286, !287}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !282, file: !13, line: 52, baseType: !16, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !282, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !282, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !282, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!288 = !DILocalVariable(name: "infomap", scope: !275, file: !212, line: 636, type: !289)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 896, elements: !224)
!290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !275, file: !212, line: 636, size: 128, elements: !292)
!292 = !{!293, !294}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !291, file: !212, line: 636, baseType: !16, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !291, file: !212, line: 636, baseType: !16, size: 64, offset: 64)
!295 = !DILocalVariable(name: "node", scope: !275, file: !212, line: 646, type: !16)
!296 = !DILocalVariable(name: "map_prog", scope: !275, file: !212, line: 647, type: !297)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!298 = !DILocalVariable(name: "lc_messages", scope: !299, file: !212, line: 659, type: !16)
!299 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !212, file: !212, line: 634, type: !213, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !300, retainedNodes: !4)
!300 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !301, nameTableKind: None)
!301 = !{!302}
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "longopts", scope: !300, file: !3, line: 41, type: !304, isLocal: true, isDefinition: true)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 1280, elements: !23)
!305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !307)
!307 = !{!308, !309, !310, !311}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !306, file: !13, line: 52, baseType: !16, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !306, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !306, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !306, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!312 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 327, type: !313, scopeLine: 328, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!313 = !DISubroutineType(types: !314)
!314 = !{!19, !19, !315}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!316 = !DILocalVariable(name: "argc", arg: 1, scope: !312, file: !3, line: 327, type: !19)
!317 = !DILocation(line: 327, column: 11, scope: !312)
!318 = !DILocalVariable(name: "argv", arg: 2, scope: !312, file: !3, line: 327, type: !315)
!319 = !DILocation(line: 327, column: 24, scope: !312)
!320 = !DILocalVariable(name: "wd", scope: !312, file: !3, line: 329, type: !7)
!321 = !DILocation(line: 329, column: 9, scope: !312)
!322 = !DILocalVariable(name: "logical", scope: !312, file: !3, line: 333, type: !38)
!323 = !DILocation(line: 333, column: 8, scope: !312)
!324 = !DILocation(line: 333, column: 19, scope: !312)
!325 = !DILocation(line: 333, column: 46, scope: !312)
!326 = !DILocation(line: 336, column: 21, scope: !312)
!327 = !DILocation(line: 336, column: 3, scope: !312)
!328 = !DILocation(line: 337, column: 3, scope: !312)
!329 = !DILocation(line: 338, column: 3, scope: !312)
!330 = !DILocation(line: 339, column: 3, scope: !312)
!331 = !DILocation(line: 341, column: 3, scope: !312)
!332 = !DILocation(line: 343, column: 3, scope: !312)
!333 = !DILocalVariable(name: "c", scope: !334, file: !3, line: 345, type: !19)
!334 = distinct !DILexicalBlock(scope: !312, file: !3, line: 344, column: 5)
!335 = !DILocation(line: 345, column: 11, scope: !334)
!336 = !DILocation(line: 345, column: 28, scope: !334)
!337 = !DILocation(line: 345, column: 34, scope: !334)
!338 = !DILocation(line: 345, column: 15, scope: !334)
!339 = !DILocation(line: 346, column: 11, scope: !340)
!340 = distinct !DILexicalBlock(scope: !334, file: !3, line: 346, column: 11)
!341 = !DILocation(line: 346, column: 13, scope: !340)
!342 = !DILocation(line: 347, column: 9, scope: !340)
!343 = !DILocation(line: 348, column: 15, scope: !334)
!344 = !DILocation(line: 348, column: 7, scope: !334)
!345 = !DILocation(line: 351, column: 19, scope: !346)
!346 = distinct !DILexicalBlock(scope: !334, file: !3, line: 349, column: 9)
!347 = !DILocation(line: 352, column: 11, scope: !346)
!348 = !DILocation(line: 354, column: 19, scope: !346)
!349 = !DILocation(line: 355, column: 11, scope: !346)
!350 = !DILocation(line: 357, column: 9, scope: !346)
!351 = !DILocation(line: 359, column: 9, scope: !346)
!352 = !DILocation(line: 362, column: 11, scope: !346)
!353 = distinct !{!353, !332, !354}
!354 = !DILocation(line: 364, column: 5, scope: !312)
!355 = !DILocation(line: 366, column: 7, scope: !356)
!356 = distinct !DILexicalBlock(scope: !312, file: !3, line: 366, column: 7)
!357 = !DILocation(line: 366, column: 16, scope: !356)
!358 = !DILocation(line: 366, column: 14, scope: !356)
!359 = !DILocation(line: 366, column: 7, scope: !312)
!360 = !DILocation(line: 367, column: 18, scope: !356)
!361 = !DILocation(line: 367, column: 5, scope: !356)
!362 = !DILocation(line: 369, column: 7, scope: !363)
!363 = distinct !DILexicalBlock(scope: !312, file: !3, line: 369, column: 7)
!364 = !DILocation(line: 369, column: 7, scope: !312)
!365 = !DILocation(line: 371, column: 12, scope: !366)
!366 = distinct !DILexicalBlock(scope: !363, file: !3, line: 370, column: 5)
!367 = !DILocation(line: 371, column: 10, scope: !366)
!368 = !DILocation(line: 372, column: 11, scope: !369)
!369 = distinct !DILexicalBlock(scope: !366, file: !3, line: 372, column: 11)
!370 = !DILocation(line: 372, column: 11, scope: !366)
!371 = !DILocation(line: 374, column: 17, scope: !372)
!372 = distinct !DILexicalBlock(scope: !369, file: !3, line: 373, column: 9)
!373 = !DILocation(line: 374, column: 11, scope: !372)
!374 = !DILocation(line: 375, column: 11, scope: !372)
!375 = !DILocation(line: 377, column: 5, scope: !366)
!376 = !DILocation(line: 379, column: 8, scope: !312)
!377 = !DILocation(line: 379, column: 6, scope: !312)
!378 = !DILocation(line: 380, column: 7, scope: !379)
!379 = distinct !DILexicalBlock(scope: !312, file: !3, line: 380, column: 7)
!380 = !DILocation(line: 380, column: 10, scope: !379)
!381 = !DILocation(line: 380, column: 7, scope: !312)
!382 = !DILocation(line: 382, column: 13, scope: !383)
!383 = distinct !DILexicalBlock(scope: !379, file: !3, line: 381, column: 5)
!384 = !DILocation(line: 382, column: 7, scope: !383)
!385 = !DILocation(line: 383, column: 13, scope: !383)
!386 = !DILocation(line: 383, column: 7, scope: !383)
!387 = !DILocation(line: 384, column: 5, scope: !383)
!388 = !DILocalVariable(name: "file_name", scope: !389, file: !3, line: 387, type: !390)
!389 = distinct !DILexicalBlock(scope: !379, file: !3, line: 386, column: 5)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 34, size: 192, elements: !392)
!392 = !{!393, !394, !395}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !391, file: !3, line: 36, baseType: !7, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !391, file: !3, line: 37, baseType: !74, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !391, file: !3, line: 38, baseType: !7, size: 64, offset: 128)
!396 = !DILocation(line: 387, column: 25, scope: !389)
!397 = !DILocation(line: 387, column: 37, scope: !389)
!398 = !DILocation(line: 388, column: 22, scope: !389)
!399 = !DILocation(line: 388, column: 7, scope: !389)
!400 = !DILocation(line: 389, column: 13, scope: !389)
!401 = !DILocation(line: 389, column: 24, scope: !389)
!402 = !DILocation(line: 389, column: 7, scope: !389)
!403 = !DILocation(line: 390, column: 23, scope: !389)
!404 = !DILocation(line: 390, column: 7, scope: !389)
!405 = !DILocation(line: 393, column: 3, scope: !312)
!406 = !DILocation(line: 394, column: 1, scope: !312)
!407 = !DILocalVariable(name: "argc", arg: 1, scope: !408, file: !3, line: 327, type: !19)
!408 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 327, type: !313, scopeLine: 328, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !409, retainedNodes: !4)
!409 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !410, nameTableKind: None)
!410 = !{!411}
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "longopts", scope: !409, file: !3, line: 41, type: !413, isLocal: true, isDefinition: true)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 1280, elements: !23)
!414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !416)
!416 = !{!417, !418, !419, !420}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !415, file: !13, line: 52, baseType: !16, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !415, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !415, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !415, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!421 = !DILocalVariable(name: "argv", arg: 2, scope: !408, file: !3, line: 327, type: !315)
!422 = !DILocalVariable(name: "wd", scope: !408, file: !3, line: 329, type: !7)
!423 = !DILocalVariable(name: "logical", scope: !408, file: !3, line: 333, type: !38)
!424 = distinct !DISubprogram(name: "logical_getcwd", scope: !3, file: !3, line: 300, type: !425, scopeLine: 301, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!425 = !DISubroutineType(types: !426)
!426 = !{!7}
!427 = !DILocalVariable(name: "st1", scope: !424, file: !3, line: 302, type: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !429, line: 46, size: 1152, elements: !430)
!429 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!430 = !{!431, !434, !436, !438, !440, !442, !444, !445, !446, !449, !451, !453, !461, !462, !463}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !428, file: !429, line: 48, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !433, line: 145, baseType: !76)
!433 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!434 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !428, file: !429, line: 53, baseType: !435, size: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !433, line: 148, baseType: !76)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !428, file: !429, line: 61, baseType: !437, size: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !433, line: 151, baseType: !76)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !428, file: !429, line: 62, baseType: !439, size: 32, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !433, line: 150, baseType: !59)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !428, file: !429, line: 64, baseType: !441, size: 32, offset: 224)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !433, line: 146, baseType: !59)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !428, file: !429, line: 65, baseType: !443, size: 32, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !433, line: 147, baseType: !59)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !428, file: !429, line: 67, baseType: !19, size: 32, offset: 288)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !428, file: !429, line: 69, baseType: !432, size: 64, offset: 320)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !428, file: !429, line: 74, baseType: !447, size: 64, offset: 384)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !433, line: 152, baseType: !448)
!448 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !428, file: !429, line: 78, baseType: !450, size: 64, offset: 448)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !433, line: 174, baseType: !448)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !428, file: !429, line: 80, baseType: !452, size: 64, offset: 512)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !433, line: 179, baseType: !448)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !428, file: !429, line: 91, baseType: !454, size: 128, offset: 576)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !455, line: 10, size: 128, elements: !456)
!455 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!456 = !{!457, !459}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !454, file: !455, line: 12, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !433, line: 160, baseType: !448)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !454, file: !455, line: 16, baseType: !460, size: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !433, line: 196, baseType: !448)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !428, file: !429, line: 92, baseType: !454, size: 128, offset: 704)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !428, file: !429, line: 93, baseType: !454, size: 128, offset: 832)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !428, file: !429, line: 106, baseType: !464, size: 192, offset: 960)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 192, elements: !465)
!465 = !{!466}
!466 = !DISubrange(count: 3)
!467 = !DILocation(line: 302, column: 15, scope: !424)
!468 = !DILocalVariable(name: "st2", scope: !424, file: !3, line: 303, type: !428)
!469 = !DILocation(line: 303, column: 15, scope: !424)
!470 = !DILocalVariable(name: "wd", scope: !424, file: !3, line: 304, type: !7)
!471 = !DILocation(line: 304, column: 9, scope: !424)
!472 = !DILocation(line: 304, column: 14, scope: !424)
!473 = !DILocalVariable(name: "p", scope: !424, file: !3, line: 305, type: !7)
!474 = !DILocation(line: 305, column: 9, scope: !424)
!475 = !DILocation(line: 308, column: 8, scope: !476)
!476 = distinct !DILexicalBlock(scope: !424, file: !3, line: 308, column: 7)
!477 = !DILocation(line: 308, column: 11, scope: !476)
!478 = !DILocation(line: 308, column: 14, scope: !476)
!479 = !DILocation(line: 308, column: 20, scope: !476)
!480 = !DILocation(line: 308, column: 7, scope: !424)
!481 = !DILocation(line: 309, column: 5, scope: !476)
!482 = !DILocation(line: 310, column: 7, scope: !424)
!483 = !DILocation(line: 310, column: 5, scope: !424)
!484 = !DILocation(line: 311, column: 3, scope: !424)
!485 = !DILocation(line: 311, column: 23, scope: !424)
!486 = !DILocation(line: 311, column: 15, scope: !424)
!487 = !DILocation(line: 311, column: 13, scope: !424)
!488 = !DILocation(line: 313, column: 12, scope: !489)
!489 = distinct !DILexicalBlock(scope: !490, file: !3, line: 313, column: 11)
!490 = distinct !DILexicalBlock(scope: !424, file: !3, line: 312, column: 5)
!491 = !DILocation(line: 313, column: 17, scope: !489)
!492 = !DILocation(line: 313, column: 20, scope: !489)
!493 = !DILocation(line: 313, column: 25, scope: !489)
!494 = !DILocation(line: 314, column: 11, scope: !489)
!495 = !DILocation(line: 314, column: 15, scope: !489)
!496 = !DILocation(line: 314, column: 20, scope: !489)
!497 = !DILocation(line: 314, column: 27, scope: !489)
!498 = !DILocation(line: 314, column: 32, scope: !489)
!499 = !DILocation(line: 314, column: 37, scope: !489)
!500 = !DILocation(line: 314, column: 40, scope: !489)
!501 = !DILocation(line: 314, column: 45, scope: !489)
!502 = !DILocation(line: 313, column: 11, scope: !490)
!503 = !DILocation(line: 315, column: 9, scope: !489)
!504 = !DILocation(line: 316, column: 8, scope: !490)
!505 = distinct !{!505, !484, !506}
!506 = !DILocation(line: 317, column: 5, scope: !424)
!507 = !DILocation(line: 320, column: 13, scope: !508)
!508 = distinct !DILexicalBlock(scope: !424, file: !3, line: 320, column: 7)
!509 = !DILocation(line: 320, column: 7, scope: !508)
!510 = !DILocation(line: 320, column: 23, scope: !508)
!511 = !DILocation(line: 320, column: 31, scope: !508)
!512 = !DILocation(line: 320, column: 48, scope: !508)
!513 = !DILocation(line: 320, column: 56, scope: !508)
!514 = !DILocation(line: 320, column: 7, scope: !424)
!515 = !DILocation(line: 321, column: 12, scope: !508)
!516 = !DILocation(line: 321, column: 5, scope: !508)
!517 = !DILocation(line: 322, column: 3, scope: !424)
!518 = !DILocation(line: 323, column: 1, scope: !424)
!519 = !DILocalVariable(name: "st1", scope: !520, file: !3, line: 302, type: !533)
!520 = distinct !DISubprogram(name: "logical_getcwd", scope: !3, file: !3, line: 300, type: !425, scopeLine: 301, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !521, retainedNodes: !4)
!521 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !522, nameTableKind: None)
!522 = !{!523}
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "longopts", scope: !521, file: !3, line: 41, type: !525, isLocal: true, isDefinition: true)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !526, size: 1280, elements: !23)
!526 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !528)
!528 = !{!529, !530, !531, !532}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !527, file: !13, line: 52, baseType: !16, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !527, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !527, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !527, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !429, line: 46, size: 1152, elements: !534)
!534 = !{!535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !551, !552, !553}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !533, file: !429, line: 48, baseType: !432, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !533, file: !429, line: 53, baseType: !435, size: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !533, file: !429, line: 61, baseType: !437, size: 64, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !533, file: !429, line: 62, baseType: !439, size: 32, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !533, file: !429, line: 64, baseType: !441, size: 32, offset: 224)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !533, file: !429, line: 65, baseType: !443, size: 32, offset: 256)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !533, file: !429, line: 67, baseType: !19, size: 32, offset: 288)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !533, file: !429, line: 69, baseType: !432, size: 64, offset: 320)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !533, file: !429, line: 74, baseType: !447, size: 64, offset: 384)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !533, file: !429, line: 78, baseType: !450, size: 64, offset: 448)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !533, file: !429, line: 80, baseType: !452, size: 64, offset: 512)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !533, file: !429, line: 91, baseType: !547, size: 128, offset: 576)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !455, line: 10, size: 128, elements: !548)
!548 = !{!549, !550}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !547, file: !455, line: 12, baseType: !458, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !547, file: !455, line: 16, baseType: !460, size: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !533, file: !429, line: 92, baseType: !547, size: 128, offset: 704)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !533, file: !429, line: 93, baseType: !547, size: 128, offset: 832)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !533, file: !429, line: 106, baseType: !464, size: 192, offset: 960)
!554 = !DILocalVariable(name: "st2", scope: !520, file: !3, line: 303, type: !533)
!555 = !DILocalVariable(name: "wd", scope: !520, file: !3, line: 304, type: !7)
!556 = !DILocalVariable(name: "p", scope: !520, file: !3, line: 305, type: !7)
!557 = distinct !DISubprogram(name: "file_name_init", scope: !3, file: !3, line: 85, type: !558, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!558 = !DISubroutineType(types: !559)
!559 = !{!390}
!560 = !DILocalVariable(name: "p", scope: !557, file: !3, line: 87, type: !390)
!561 = !DILocation(line: 87, column: 21, scope: !557)
!562 = !DILocation(line: 87, column: 25, scope: !557)
!563 = !DILocation(line: 91, column: 3, scope: !557)
!564 = !DILocation(line: 91, column: 6, scope: !557)
!565 = !DILocation(line: 91, column: 14, scope: !557)
!566 = !DILocation(line: 93, column: 21, scope: !557)
!567 = !DILocation(line: 93, column: 24, scope: !557)
!568 = !DILocation(line: 93, column: 12, scope: !557)
!569 = !DILocation(line: 93, column: 3, scope: !557)
!570 = !DILocation(line: 93, column: 6, scope: !557)
!571 = !DILocation(line: 93, column: 10, scope: !557)
!572 = !DILocation(line: 94, column: 14, scope: !557)
!573 = !DILocation(line: 94, column: 17, scope: !557)
!574 = !DILocation(line: 94, column: 24, scope: !557)
!575 = !DILocation(line: 94, column: 27, scope: !557)
!576 = !DILocation(line: 94, column: 35, scope: !557)
!577 = !DILocation(line: 94, column: 21, scope: !557)
!578 = !DILocation(line: 94, column: 3, scope: !557)
!579 = !DILocation(line: 94, column: 6, scope: !557)
!580 = !DILocation(line: 94, column: 12, scope: !557)
!581 = !DILocation(line: 95, column: 3, scope: !557)
!582 = !DILocation(line: 95, column: 6, scope: !557)
!583 = !DILocation(line: 95, column: 15, scope: !557)
!584 = !DILocation(line: 96, column: 10, scope: !557)
!585 = !DILocation(line: 96, column: 3, scope: !557)
!586 = distinct !DISubprogram(name: "robust_getcwd", scope: !3, file: !3, line: 268, type: !587, scopeLine: 269, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!587 = !DISubroutineType(types: !588)
!588 = !{null, !390}
!589 = !DILocalVariable(name: "file_name", arg: 1, scope: !586, file: !3, line: 268, type: !390)
!590 = !DILocation(line: 268, column: 34, scope: !586)
!591 = !DILocalVariable(name: "height", scope: !586, file: !3, line: 270, type: !74)
!592 = !DILocation(line: 270, column: 10, scope: !586)
!593 = !DILocalVariable(name: "dev_ino_buf", scope: !586, file: !3, line: 271, type: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !595, line: 7, size: 128, elements: !596)
!595 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!596 = !{!597, !600}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !594, file: !595, line: 9, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !599, line: 47, baseType: !435)
!599 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!600 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !594, file: !595, line: 10, baseType: !601, size: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !599, line: 59, baseType: !432)
!602 = !DILocation(line: 271, column: 18, scope: !586)
!603 = !DILocalVariable(name: "root_dev_ino", scope: !586, file: !3, line: 272, type: !604)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!605 = !DILocation(line: 272, column: 19, scope: !586)
!606 = !DILocation(line: 272, column: 34, scope: !586)
!607 = !DILocalVariable(name: "dot_sb", scope: !586, file: !3, line: 273, type: !428)
!608 = !DILocation(line: 273, column: 15, scope: !586)
!609 = !DILocation(line: 275, column: 7, scope: !610)
!610 = distinct !DILexicalBlock(scope: !586, file: !3, line: 275, column: 7)
!611 = !DILocation(line: 275, column: 20, scope: !610)
!612 = !DILocation(line: 275, column: 7, scope: !586)
!613 = !DILocation(line: 276, column: 5, scope: !610)
!614 = !DILocation(line: 279, column: 7, scope: !615)
!615 = distinct !DILexicalBlock(scope: !586, file: !3, line: 279, column: 7)
!616 = !DILocation(line: 279, column: 27, scope: !615)
!617 = !DILocation(line: 279, column: 7, scope: !586)
!618 = !DILocation(line: 280, column: 5, scope: !615)
!619 = !DILocation(line: 282, column: 3, scope: !586)
!620 = !DILocation(line: 285, column: 11, scope: !621)
!621 = distinct !DILexicalBlock(scope: !622, file: !3, line: 285, column: 11)
!622 = distinct !DILexicalBlock(scope: !586, file: !3, line: 283, column: 5)
!623 = !DILocation(line: 285, column: 11, scope: !622)
!624 = !DILocation(line: 286, column: 9, scope: !621)
!625 = !DILocation(line: 288, column: 32, scope: !622)
!626 = !DILocation(line: 288, column: 49, scope: !622)
!627 = !DILocation(line: 288, column: 7, scope: !622)
!628 = distinct !{!628, !619, !629}
!629 = !DILocation(line: 289, column: 5, scope: !586)
!630 = !DILocation(line: 292, column: 7, scope: !631)
!631 = distinct !DILexicalBlock(scope: !586, file: !3, line: 292, column: 7)
!632 = !DILocation(line: 292, column: 18, scope: !631)
!633 = !DILocation(line: 292, column: 27, scope: !631)
!634 = !DILocation(line: 292, column: 7, scope: !586)
!635 = !DILocation(line: 293, column: 24, scope: !631)
!636 = !DILocation(line: 293, column: 5, scope: !631)
!637 = !DILocation(line: 294, column: 1, scope: !586)
!638 = distinct !DISubprogram(name: "file_name_free", scope: !3, file: !3, line: 78, type: !587, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!639 = !DILocalVariable(name: "p", arg: 1, scope: !638, file: !3, line: 78, type: !390)
!640 = !DILocation(line: 78, column: 35, scope: !638)
!641 = !DILocation(line: 80, column: 9, scope: !638)
!642 = !DILocation(line: 80, column: 12, scope: !638)
!643 = !DILocation(line: 80, column: 3, scope: !638)
!644 = !DILocation(line: 81, column: 9, scope: !638)
!645 = !DILocation(line: 81, column: 3, scope: !638)
!646 = !DILocation(line: 82, column: 1, scope: !638)
!647 = distinct !DISubprogram(name: "find_dir_entry", scope: !3, file: !3, line: 153, type: !648, scopeLine: 155, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!648 = !DISubroutineType(types: !649)
!649 = !{null, !650, !390, !74}
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!651 = !DILocalVariable(name: "dot_sb", arg: 1, scope: !647, file: !3, line: 153, type: !650)
!652 = !DILocation(line: 153, column: 30, scope: !647)
!653 = !DILocalVariable(name: "file_name", arg: 2, scope: !647, file: !3, line: 153, type: !390)
!654 = !DILocation(line: 153, column: 56, scope: !647)
!655 = !DILocalVariable(name: "parent_height", arg: 3, scope: !647, file: !3, line: 154, type: !74)
!656 = !DILocation(line: 154, column: 24, scope: !647)
!657 = !DILocalVariable(name: "dirp", scope: !647, file: !3, line: 156, type: !658)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !660, line: 127, baseType: !661)
!660 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !660, line: 127, flags: DIFlagFwdDecl)
!662 = !DILocation(line: 156, column: 8, scope: !647)
!663 = !DILocalVariable(name: "fd", scope: !647, file: !3, line: 157, type: !19)
!664 = !DILocation(line: 157, column: 7, scope: !647)
!665 = !DILocalVariable(name: "parent_sb", scope: !647, file: !3, line: 158, type: !428)
!666 = !DILocation(line: 158, column: 15, scope: !647)
!667 = !DILocalVariable(name: "use_lstat", scope: !647, file: !3, line: 159, type: !38)
!668 = !DILocation(line: 159, column: 8, scope: !647)
!669 = !DILocalVariable(name: "found", scope: !647, file: !3, line: 160, type: !38)
!670 = !DILocation(line: 160, column: 8, scope: !647)
!671 = !DILocation(line: 162, column: 10, scope: !647)
!672 = !DILocation(line: 162, column: 8, scope: !647)
!673 = !DILocation(line: 163, column: 7, scope: !674)
!674 = distinct !DILexicalBlock(scope: !647, file: !3, line: 163, column: 7)
!675 = !DILocation(line: 163, column: 12, scope: !674)
!676 = !DILocation(line: 163, column: 7, scope: !647)
!677 = !DILocation(line: 164, column: 5, scope: !674)
!678 = !DILocation(line: 167, column: 15, scope: !647)
!679 = !DILocation(line: 167, column: 8, scope: !647)
!680 = !DILocation(line: 167, column: 6, scope: !647)
!681 = !DILocation(line: 168, column: 13, scope: !682)
!682 = distinct !DILexicalBlock(scope: !647, file: !3, line: 168, column: 7)
!683 = !DILocation(line: 168, column: 10, scope: !682)
!684 = !DILocation(line: 168, column: 8, scope: !682)
!685 = !DILocation(line: 168, column: 26, scope: !682)
!686 = !DILocation(line: 168, column: 18, scope: !682)
!687 = !DILocation(line: 168, column: 32, scope: !682)
!688 = !DILocation(line: 168, column: 46, scope: !682)
!689 = !DILocation(line: 168, column: 7, scope: !647)
!690 = !DILocation(line: 169, column: 5, scope: !682)
!691 = !DILocation(line: 172, column: 13, scope: !692)
!692 = distinct !DILexicalBlock(scope: !647, file: !3, line: 172, column: 7)
!693 = !DILocation(line: 172, column: 10, scope: !692)
!694 = !DILocation(line: 172, column: 8, scope: !692)
!695 = !DILocation(line: 172, column: 25, scope: !692)
!696 = !DILocation(line: 172, column: 18, scope: !692)
!697 = !DILocation(line: 172, column: 43, scope: !692)
!698 = !DILocation(line: 172, column: 67, scope: !692)
!699 = !DILocation(line: 172, column: 7, scope: !647)
!700 = !DILocation(line: 173, column: 5, scope: !692)
!701 = !DILocation(line: 178, column: 26, scope: !647)
!702 = !DILocation(line: 178, column: 36, scope: !647)
!703 = !DILocation(line: 178, column: 44, scope: !647)
!704 = !DILocation(line: 178, column: 33, scope: !647)
!705 = !DILocation(line: 178, column: 13, scope: !647)
!706 = !DILocation(line: 180, column: 9, scope: !647)
!707 = !DILocation(line: 181, column: 3, scope: !647)
!708 = !DILocalVariable(name: "dp", scope: !709, file: !3, line: 183, type: !710)
!709 = distinct !DILexicalBlock(scope: !647, file: !3, line: 182, column: 5)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !713, line: 22, size: 2240, elements: !714)
!713 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!714 = !{!715, !716, !717, !718, !719}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !712, file: !713, line: 25, baseType: !435, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !712, file: !713, line: 26, baseType: !447, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !712, file: !713, line: 31, baseType: !73, size: 16, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !712, file: !713, line: 32, baseType: !148, size: 8, offset: 144)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !712, file: !713, line: 33, baseType: !105, size: 2048, offset: 152)
!720 = !DILocation(line: 183, column: 28, scope: !709)
!721 = !DILocalVariable(name: "ent_sb", scope: !709, file: !3, line: 184, type: !428)
!722 = !DILocation(line: 184, column: 19, scope: !709)
!723 = !DILocalVariable(name: "ino", scope: !709, file: !3, line: 185, type: !598)
!724 = !DILocation(line: 185, column: 13, scope: !709)
!725 = !DILocation(line: 187, column: 7, scope: !709)
!726 = !DILocation(line: 187, column: 13, scope: !709)
!727 = !DILocation(line: 188, column: 50, scope: !728)
!728 = distinct !DILexicalBlock(scope: !709, file: !3, line: 188, column: 11)
!729 = !DILocation(line: 188, column: 17, scope: !728)
!730 = !DILocation(line: 188, column: 15, scope: !728)
!731 = !DILocation(line: 188, column: 57, scope: !728)
!732 = !DILocation(line: 188, column: 11, scope: !709)
!733 = !DILocation(line: 190, column: 15, scope: !734)
!734 = distinct !DILexicalBlock(scope: !735, file: !3, line: 190, column: 15)
!735 = distinct !DILexicalBlock(scope: !728, file: !3, line: 189, column: 9)
!736 = !DILocation(line: 190, column: 15, scope: !735)
!737 = !DILocalVariable(name: "e", scope: !738, file: !3, line: 193, type: !19)
!738 = distinct !DILexicalBlock(scope: !734, file: !3, line: 191, column: 13)
!739 = !DILocation(line: 193, column: 19, scope: !738)
!740 = !DILocation(line: 193, column: 23, scope: !738)
!741 = !DILocation(line: 194, column: 25, scope: !738)
!742 = !DILocation(line: 194, column: 15, scope: !738)
!743 = !DILocation(line: 195, column: 23, scope: !738)
!744 = !DILocation(line: 195, column: 15, scope: !738)
!745 = !DILocation(line: 195, column: 21, scope: !738)
!746 = !DILocation(line: 198, column: 20, scope: !738)
!747 = !DILocation(line: 199, column: 13, scope: !738)
!748 = !DILocation(line: 200, column: 11, scope: !735)
!749 = !DILocation(line: 203, column: 13, scope: !709)
!750 = !DILocation(line: 203, column: 11, scope: !709)
!751 = !DILocation(line: 205, column: 11, scope: !752)
!752 = distinct !DILexicalBlock(scope: !709, file: !3, line: 205, column: 11)
!753 = !DILocation(line: 205, column: 15, scope: !752)
!754 = !DILocation(line: 205, column: 38, scope: !752)
!755 = !DILocation(line: 205, column: 41, scope: !752)
!756 = !DILocation(line: 205, column: 11, scope: !709)
!757 = !DILocation(line: 207, column: 22, scope: !758)
!758 = distinct !DILexicalBlock(scope: !759, file: !3, line: 207, column: 15)
!759 = distinct !DILexicalBlock(scope: !752, file: !3, line: 206, column: 9)
!760 = !DILocation(line: 207, column: 26, scope: !758)
!761 = !DILocation(line: 207, column: 15, scope: !758)
!762 = !DILocation(line: 207, column: 43, scope: !758)
!763 = !DILocation(line: 207, column: 15, scope: !759)
!764 = !DILocation(line: 210, column: 15, scope: !765)
!765 = distinct !DILexicalBlock(scope: !758, file: !3, line: 208, column: 13)
!766 = distinct !{!766, !707, !767}
!767 = !DILocation(line: 226, column: 5, scope: !647)
!768 = !DILocation(line: 212, column: 24, scope: !759)
!769 = !DILocation(line: 212, column: 15, scope: !759)
!770 = !DILocation(line: 213, column: 9, scope: !759)
!771 = !DILocation(line: 215, column: 11, scope: !772)
!772 = distinct !DILexicalBlock(scope: !709, file: !3, line: 215, column: 11)
!773 = !DILocation(line: 215, column: 18, scope: !772)
!774 = !DILocation(line: 215, column: 26, scope: !772)
!775 = !DILocation(line: 215, column: 15, scope: !772)
!776 = !DILocation(line: 215, column: 11, scope: !709)
!777 = !DILocation(line: 216, column: 9, scope: !772)
!778 = !DILocation(line: 220, column: 14, scope: !779)
!779 = distinct !DILexicalBlock(scope: !709, file: !3, line: 220, column: 12)
!780 = !DILocation(line: 220, column: 24, scope: !779)
!781 = !DILocation(line: 220, column: 34, scope: !779)
!782 = !DILocation(line: 220, column: 44, scope: !779)
!783 = !DILocation(line: 220, column: 52, scope: !779)
!784 = !DILocation(line: 220, column: 41, scope: !779)
!785 = !DILocation(line: 220, column: 12, scope: !709)
!786 = !DILocation(line: 222, column: 30, scope: !787)
!787 = distinct !DILexicalBlock(scope: !779, file: !3, line: 221, column: 9)
!788 = !DILocation(line: 222, column: 41, scope: !787)
!789 = !DILocation(line: 222, column: 45, scope: !787)
!790 = !DILocation(line: 222, column: 53, scope: !787)
!791 = !DILocation(line: 222, column: 11, scope: !787)
!792 = !DILocation(line: 223, column: 17, scope: !787)
!793 = !DILocation(line: 224, column: 11, scope: !787)
!794 = !DILocation(line: 228, column: 7, scope: !795)
!795 = distinct !DILexicalBlock(scope: !647, file: !3, line: 228, column: 7)
!796 = !DILocation(line: 228, column: 12, scope: !795)
!797 = !DILocation(line: 228, column: 20, scope: !795)
!798 = !DILocation(line: 228, column: 33, scope: !795)
!799 = !DILocation(line: 228, column: 23, scope: !795)
!800 = !DILocation(line: 228, column: 39, scope: !795)
!801 = !DILocation(line: 228, column: 7, scope: !647)
!802 = !DILocation(line: 232, column: 7, scope: !803)
!803 = distinct !DILexicalBlock(scope: !795, file: !3, line: 229, column: 5)
!804 = !DILocation(line: 236, column: 10, scope: !805)
!805 = distinct !DILexicalBlock(scope: !647, file: !3, line: 236, column: 8)
!806 = !DILocation(line: 236, column: 8, scope: !647)
!807 = !DILocation(line: 237, column: 5, scope: !805)
!808 = !DILocation(line: 241, column: 4, scope: !647)
!809 = !DILocation(line: 241, column: 13, scope: !647)
!810 = !DILocation(line: 242, column: 1, scope: !647)
!811 = distinct !DISubprogram(name: "file_name_prepend", scope: !3, file: !3, line: 101, type: !812, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!812 = !DISubroutineType(types: !813)
!813 = !{null, !390, !16, !74}
!814 = !DILocalVariable(name: "p", arg: 1, scope: !811, file: !3, line: 101, type: !390)
!815 = !DILocation(line: 101, column: 38, scope: !811)
!816 = !DILocalVariable(name: "s", arg: 2, scope: !811, file: !3, line: 101, type: !16)
!817 = !DILocation(line: 101, column: 53, scope: !811)
!818 = !DILocalVariable(name: "s_len", arg: 3, scope: !811, file: !3, line: 101, type: !74)
!819 = !DILocation(line: 101, column: 63, scope: !811)
!820 = !DILocalVariable(name: "n_free", scope: !811, file: !3, line: 103, type: !74)
!821 = !DILocation(line: 103, column: 10, scope: !811)
!822 = !DILocation(line: 103, column: 19, scope: !811)
!823 = !DILocation(line: 103, column: 22, scope: !811)
!824 = !DILocation(line: 103, column: 30, scope: !811)
!825 = !DILocation(line: 103, column: 33, scope: !811)
!826 = !DILocation(line: 103, column: 28, scope: !811)
!827 = !DILocation(line: 104, column: 7, scope: !828)
!828 = distinct !DILexicalBlock(scope: !811, file: !3, line: 104, column: 7)
!829 = !DILocation(line: 104, column: 20, scope: !828)
!830 = !DILocation(line: 104, column: 18, scope: !828)
!831 = !DILocation(line: 104, column: 14, scope: !828)
!832 = !DILocation(line: 104, column: 7, scope: !811)
!833 = !DILocalVariable(name: "half", scope: !834, file: !3, line: 106, type: !74)
!834 = distinct !DILexicalBlock(scope: !828, file: !3, line: 105, column: 5)
!835 = !DILocation(line: 106, column: 14, scope: !834)
!836 = !DILocation(line: 106, column: 21, scope: !834)
!837 = !DILocation(line: 106, column: 24, scope: !834)
!838 = !DILocation(line: 106, column: 32, scope: !834)
!839 = !DILocation(line: 106, column: 38, scope: !834)
!840 = !DILocation(line: 106, column: 36, scope: !834)
!841 = !DILocalVariable(name: "q", scope: !834, file: !3, line: 111, type: !7)
!842 = !DILocation(line: 111, column: 13, scope: !834)
!843 = !DILocation(line: 111, column: 30, scope: !834)
!844 = !DILocation(line: 111, column: 17, scope: !834)
!845 = !DILocalVariable(name: "n_used", scope: !834, file: !3, line: 112, type: !74)
!846 = !DILocation(line: 112, column: 14, scope: !834)
!847 = !DILocation(line: 112, column: 23, scope: !834)
!848 = !DILocation(line: 112, column: 26, scope: !834)
!849 = !DILocation(line: 112, column: 36, scope: !834)
!850 = !DILocation(line: 112, column: 34, scope: !834)
!851 = !DILocation(line: 113, column: 18, scope: !834)
!852 = !DILocation(line: 113, column: 26, scope: !834)
!853 = !DILocation(line: 113, column: 24, scope: !834)
!854 = !DILocation(line: 113, column: 20, scope: !834)
!855 = !DILocation(line: 113, column: 33, scope: !834)
!856 = !DILocation(line: 113, column: 31, scope: !834)
!857 = !DILocation(line: 113, column: 7, scope: !834)
!858 = !DILocation(line: 113, column: 10, scope: !834)
!859 = !DILocation(line: 113, column: 16, scope: !834)
!860 = !DILocation(line: 114, column: 15, scope: !834)
!861 = !DILocation(line: 114, column: 18, scope: !834)
!862 = !DILocation(line: 114, column: 25, scope: !834)
!863 = !DILocation(line: 114, column: 28, scope: !834)
!864 = !DILocation(line: 114, column: 34, scope: !834)
!865 = !DILocation(line: 114, column: 32, scope: !834)
!866 = !DILocation(line: 114, column: 42, scope: !834)
!867 = !DILocation(line: 114, column: 7, scope: !834)
!868 = !DILocation(line: 115, column: 13, scope: !834)
!869 = !DILocation(line: 115, column: 16, scope: !834)
!870 = !DILocation(line: 115, column: 7, scope: !834)
!871 = !DILocation(line: 116, column: 16, scope: !834)
!872 = !DILocation(line: 116, column: 7, scope: !834)
!873 = !DILocation(line: 116, column: 10, scope: !834)
!874 = !DILocation(line: 116, column: 14, scope: !834)
!875 = !DILocation(line: 117, column: 24, scope: !834)
!876 = !DILocation(line: 117, column: 22, scope: !834)
!877 = !DILocation(line: 117, column: 7, scope: !834)
!878 = !DILocation(line: 117, column: 10, scope: !834)
!879 = !DILocation(line: 117, column: 18, scope: !834)
!880 = !DILocation(line: 118, column: 5, scope: !834)
!881 = !DILocation(line: 120, column: 19, scope: !811)
!882 = !DILocation(line: 120, column: 17, scope: !811)
!883 = !DILocation(line: 120, column: 3, scope: !811)
!884 = !DILocation(line: 120, column: 6, scope: !811)
!885 = !DILocation(line: 120, column: 12, scope: !811)
!886 = !DILocation(line: 121, column: 3, scope: !811)
!887 = !DILocation(line: 121, column: 6, scope: !811)
!888 = !DILocation(line: 121, column: 15, scope: !811)
!889 = !DILocation(line: 122, column: 11, scope: !811)
!890 = !DILocation(line: 122, column: 14, scope: !811)
!891 = !DILocation(line: 122, column: 20, scope: !811)
!892 = !DILocation(line: 122, column: 25, scope: !811)
!893 = !DILocation(line: 122, column: 28, scope: !811)
!894 = !DILocation(line: 122, column: 3, scope: !811)
!895 = !DILocation(line: 123, column: 1, scope: !811)
!896 = distinct !DISubprogram(name: "nth_parent", scope: !3, file: !3, line: 127, type: !897, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!897 = !DISubroutineType(types: !898)
!898 = !{!7, !74}
!899 = !DILocalVariable(name: "n", arg: 1, scope: !896, file: !3, line: 127, type: !74)
!900 = !DILocation(line: 127, column: 20, scope: !896)
!901 = !DILocalVariable(name: "buf", scope: !896, file: !3, line: 129, type: !7)
!902 = !DILocation(line: 129, column: 9, scope: !896)
!903 = !DILocation(line: 129, column: 28, scope: !896)
!904 = !DILocation(line: 129, column: 15, scope: !896)
!905 = !DILocalVariable(name: "p", scope: !896, file: !3, line: 130, type: !7)
!906 = !DILocation(line: 130, column: 9, scope: !896)
!907 = !DILocation(line: 130, column: 13, scope: !896)
!908 = !DILocalVariable(name: "i", scope: !909, file: !3, line: 132, type: !74)
!909 = distinct !DILexicalBlock(scope: !896, file: !3, line: 132, column: 3)
!910 = !DILocation(line: 132, column: 15, scope: !909)
!911 = !DILocation(line: 132, column: 8, scope: !909)
!912 = !DILocation(line: 132, column: 22, scope: !913)
!913 = distinct !DILexicalBlock(scope: !909, file: !3, line: 132, column: 3)
!914 = !DILocation(line: 132, column: 26, scope: !913)
!915 = !DILocation(line: 132, column: 24, scope: !913)
!916 = !DILocation(line: 132, column: 3, scope: !909)
!917 = !DILocation(line: 134, column: 15, scope: !918)
!918 = distinct !DILexicalBlock(scope: !913, file: !3, line: 133, column: 5)
!919 = !DILocation(line: 134, column: 7, scope: !918)
!920 = !DILocation(line: 135, column: 9, scope: !918)
!921 = !DILocation(line: 136, column: 5, scope: !918)
!922 = !DILocation(line: 132, column: 30, scope: !913)
!923 = !DILocation(line: 132, column: 3, scope: !913)
!924 = distinct !{!924, !916, !925}
!925 = !DILocation(line: 136, column: 5, scope: !909)
!926 = !DILocation(line: 137, column: 3, scope: !896)
!927 = !DILocation(line: 137, column: 9, scope: !896)
!928 = !DILocation(line: 138, column: 10, scope: !896)
!929 = !DILocation(line: 138, column: 3, scope: !896)
!930 = distinct !DISubprogram(name: "readdir_ignoring_dot_and_dotdot", scope: !212, file: !212, line: 278, type: !931, scopeLine: 279, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!931 = !DISubroutineType(types: !932)
!932 = !{!710, !658}
!933 = !DILocalVariable(name: "dirp", arg: 1, scope: !930, file: !212, line: 278, type: !658)
!934 = !DILocation(line: 278, column: 39, scope: !930)
!935 = !DILocation(line: 280, column: 3, scope: !930)
!936 = !DILocalVariable(name: "dp", scope: !937, file: !212, line: 282, type: !710)
!937 = distinct !DILexicalBlock(scope: !930, file: !212, line: 281, column: 5)
!938 = !DILocation(line: 282, column: 28, scope: !937)
!939 = !DILocation(line: 282, column: 42, scope: !937)
!940 = !DILocation(line: 282, column: 33, scope: !937)
!941 = !DILocation(line: 283, column: 11, scope: !942)
!942 = distinct !DILexicalBlock(scope: !937, file: !212, line: 283, column: 11)
!943 = !DILocation(line: 283, column: 14, scope: !942)
!944 = !DILocation(line: 283, column: 22, scope: !942)
!945 = !DILocation(line: 283, column: 42, scope: !942)
!946 = !DILocation(line: 283, column: 46, scope: !942)
!947 = !DILocation(line: 283, column: 27, scope: !942)
!948 = !DILocation(line: 283, column: 11, scope: !937)
!949 = !DILocation(line: 284, column: 16, scope: !942)
!950 = !DILocation(line: 284, column: 9, scope: !942)
!951 = distinct !{!951, !935, !952}
!952 = !DILocation(line: 285, column: 5, scope: !930)
!953 = distinct !DISubprogram(name: "dot_or_dotdot", scope: !212, file: !212, line: 265, type: !954, scopeLine: 266, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!954 = !DISubroutineType(types: !955)
!955 = !{!38, !16}
!956 = !DILocalVariable(name: "file_name", arg: 1, scope: !953, file: !212, line: 265, type: !16)
!957 = !DILocation(line: 265, column: 28, scope: !953)
!958 = !DILocation(line: 267, column: 7, scope: !959)
!959 = distinct !DILexicalBlock(scope: !953, file: !212, line: 267, column: 7)
!960 = !DILocation(line: 267, column: 20, scope: !959)
!961 = !DILocation(line: 267, column: 7, scope: !953)
!962 = !DILocalVariable(name: "sep", scope: !963, file: !212, line: 269, type: !8)
!963 = distinct !DILexicalBlock(scope: !959, file: !212, line: 268, column: 5)
!964 = !DILocation(line: 269, column: 12, scope: !963)
!965 = !DILocation(line: 269, column: 18, scope: !963)
!966 = !DILocation(line: 269, column: 29, scope: !963)
!967 = !DILocation(line: 269, column: 42, scope: !963)
!968 = !DILocation(line: 269, column: 50, scope: !963)
!969 = !DILocation(line: 270, column: 17, scope: !963)
!970 = !DILocation(line: 270, column: 21, scope: !963)
!971 = !DILocation(line: 270, column: 24, scope: !963)
!972 = !DILocation(line: 270, column: 7, scope: !963)
!973 = !DILocation(line: 273, column: 5, scope: !959)
!974 = !DILocation(line: 274, column: 1, scope: !953)
!975 = distinct !DISubprogram(name: "close_stdout", scope: !37, file: !37, line: 117, type: !976, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !32, retainedNodes: !4)
!976 = !DISubroutineType(types: !977)
!977 = !{null}
!978 = !DILocation(line: 119, column: 21, scope: !979)
!979 = distinct !DILexicalBlock(scope: !975, file: !37, line: 119, column: 7)
!980 = !DILocation(line: 119, column: 7, scope: !979)
!981 = !DILocation(line: 119, column: 29, scope: !979)
!982 = !DILocation(line: 120, column: 7, scope: !979)
!983 = !DILocation(line: 120, column: 12, scope: !979)
!984 = !DILocation(line: 120, column: 25, scope: !979)
!985 = !DILocation(line: 120, column: 28, scope: !979)
!986 = !DILocation(line: 120, column: 34, scope: !979)
!987 = !DILocation(line: 119, column: 7, scope: !975)
!988 = !DILocalVariable(name: "write_error", scope: !989, file: !37, line: 122, type: !16)
!989 = distinct !DILexicalBlock(scope: !979, file: !37, line: 121, column: 5)
!990 = !DILocation(line: 122, column: 19, scope: !989)
!991 = !DILocation(line: 122, column: 33, scope: !989)
!992 = !DILocation(line: 123, column: 11, scope: !993)
!993 = distinct !DILexicalBlock(scope: !989, file: !37, line: 123, column: 11)
!994 = !DILocation(line: 123, column: 11, scope: !989)
!995 = !DILocation(line: 124, column: 19, scope: !993)
!996 = !DILocation(line: 124, column: 52, scope: !993)
!997 = !DILocation(line: 124, column: 36, scope: !993)
!998 = !DILocation(line: 125, column: 16, scope: !993)
!999 = !DILocation(line: 124, column: 9, scope: !993)
!1000 = !DILocation(line: 127, column: 19, scope: !993)
!1001 = !DILocation(line: 127, column: 32, scope: !993)
!1002 = !DILocation(line: 127, column: 9, scope: !993)
!1003 = !DILocation(line: 129, column: 14, scope: !989)
!1004 = !DILocation(line: 129, column: 7, scope: !989)
!1005 = !DILocation(line: 134, column: 42, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !975, file: !37, line: 134, column: 7)
!1007 = !DILocation(line: 134, column: 28, scope: !1006)
!1008 = !DILocation(line: 134, column: 50, scope: !1006)
!1009 = !DILocation(line: 134, column: 7, scope: !975)
!1010 = !DILocation(line: 135, column: 12, scope: !1006)
!1011 = !DILocation(line: 135, column: 5, scope: !1006)
!1012 = !DILocation(line: 136, column: 1, scope: !975)
!1013 = distinct !DISubprogram(name: "set_program_name", scope: !51, file: !51, line: 39, type: !213, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !4)
!1014 = !DILocalVariable(name: "argv0", arg: 1, scope: !1013, file: !51, line: 39, type: !16)
!1015 = !DILocation(line: 39, column: 31, scope: !1013)
!1016 = !DILocalVariable(name: "slash", scope: !1013, file: !51, line: 46, type: !16)
!1017 = !DILocation(line: 46, column: 15, scope: !1013)
!1018 = !DILocalVariable(name: "base", scope: !1013, file: !51, line: 47, type: !16)
!1019 = !DILocation(line: 47, column: 15, scope: !1013)
!1020 = !DILocation(line: 51, column: 7, scope: !1021)
!1021 = distinct !DILexicalBlock(scope: !1013, file: !51, line: 51, column: 7)
!1022 = !DILocation(line: 51, column: 13, scope: !1021)
!1023 = !DILocation(line: 51, column: 7, scope: !1013)
!1024 = !DILocation(line: 55, column: 14, scope: !1025)
!1025 = distinct !DILexicalBlock(scope: !1021, file: !51, line: 52, column: 5)
!1026 = !DILocation(line: 54, column: 7, scope: !1025)
!1027 = !DILocation(line: 56, column: 7, scope: !1025)
!1028 = !DILocation(line: 59, column: 20, scope: !1013)
!1029 = !DILocation(line: 59, column: 11, scope: !1013)
!1030 = !DILocation(line: 59, column: 9, scope: !1013)
!1031 = !DILocation(line: 60, column: 11, scope: !1013)
!1032 = !DILocation(line: 60, column: 17, scope: !1013)
!1033 = !DILocation(line: 60, column: 27, scope: !1013)
!1034 = !DILocation(line: 60, column: 33, scope: !1013)
!1035 = !DILocation(line: 60, column: 39, scope: !1013)
!1036 = !DILocation(line: 60, column: 8, scope: !1013)
!1037 = !DILocation(line: 61, column: 7, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !1013, file: !51, line: 61, column: 7)
!1039 = !DILocation(line: 61, column: 14, scope: !1038)
!1040 = !DILocation(line: 61, column: 12, scope: !1038)
!1041 = !DILocation(line: 61, column: 20, scope: !1038)
!1042 = !DILocation(line: 61, column: 25, scope: !1038)
!1043 = !DILocation(line: 61, column: 37, scope: !1038)
!1044 = !DILocation(line: 61, column: 42, scope: !1038)
!1045 = !DILocation(line: 61, column: 28, scope: !1038)
!1046 = !DILocation(line: 61, column: 61, scope: !1038)
!1047 = !DILocation(line: 61, column: 7, scope: !1013)
!1048 = !DILocation(line: 63, column: 15, scope: !1049)
!1049 = distinct !DILexicalBlock(scope: !1038, file: !51, line: 62, column: 5)
!1050 = !DILocation(line: 63, column: 13, scope: !1049)
!1051 = !DILocation(line: 64, column: 20, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !1049, file: !51, line: 64, column: 11)
!1053 = !DILocation(line: 64, column: 11, scope: !1052)
!1054 = !DILocation(line: 64, column: 36, scope: !1052)
!1055 = !DILocation(line: 64, column: 11, scope: !1049)
!1056 = !DILocation(line: 66, column: 19, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !1052, file: !51, line: 65, column: 9)
!1058 = !DILocation(line: 66, column: 24, scope: !1057)
!1059 = !DILocation(line: 66, column: 17, scope: !1057)
!1060 = !DILocation(line: 70, column: 52, scope: !1057)
!1061 = !DILocation(line: 70, column: 41, scope: !1057)
!1062 = !DILocation(line: 72, column: 9, scope: !1057)
!1063 = !DILocation(line: 73, column: 5, scope: !1049)
!1064 = !DILocation(line: 84, column: 18, scope: !1013)
!1065 = !DILocation(line: 84, column: 16, scope: !1013)
!1066 = !DILocation(line: 90, column: 38, scope: !1013)
!1067 = !DILocation(line: 90, column: 27, scope: !1013)
!1068 = !DILocation(line: 92, column: 1, scope: !1013)
!1069 = distinct !DISubprogram(name: "set_char_quoting", scope: !80, file: !80, line: 152, type: !1070, scopeLine: 153, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !54, retainedNodes: !4)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!19, !1072, !8, !19}
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!1073 = !DILocalVariable(name: "o", arg: 1, scope: !1069, file: !80, line: 152, type: !1072)
!1074 = !DILocation(line: 152, column: 43, scope: !1069)
!1075 = !DILocalVariable(name: "c", arg: 2, scope: !1069, file: !80, line: 152, type: !8)
!1076 = !DILocation(line: 152, column: 51, scope: !1069)
!1077 = !DILocalVariable(name: "i", arg: 3, scope: !1069, file: !80, line: 152, type: !19)
!1078 = !DILocation(line: 152, column: 58, scope: !1069)
!1079 = !DILocalVariable(name: "uc", scope: !1069, file: !80, line: 154, type: !148)
!1080 = !DILocation(line: 154, column: 17, scope: !1069)
!1081 = !DILocation(line: 154, column: 22, scope: !1069)
!1082 = !DILocalVariable(name: "p", scope: !1069, file: !80, line: 155, type: !1083)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!1084 = !DILocation(line: 155, column: 17, scope: !1069)
!1085 = !DILocation(line: 156, column: 6, scope: !1069)
!1086 = !DILocation(line: 156, column: 10, scope: !1069)
!1087 = !DILocation(line: 156, column: 41, scope: !1069)
!1088 = !DILocation(line: 156, column: 5, scope: !1069)
!1089 = !DILocation(line: 156, column: 59, scope: !1069)
!1090 = !DILocation(line: 156, column: 62, scope: !1069)
!1091 = !DILocation(line: 156, column: 57, scope: !1069)
!1092 = !DILocalVariable(name: "shift", scope: !1069, file: !80, line: 157, type: !19)
!1093 = !DILocation(line: 157, column: 7, scope: !1069)
!1094 = !DILocation(line: 157, column: 15, scope: !1069)
!1095 = !DILocation(line: 157, column: 18, scope: !1069)
!1096 = !DILocalVariable(name: "r", scope: !1069, file: !80, line: 158, type: !19)
!1097 = !DILocation(line: 158, column: 7, scope: !1069)
!1098 = !DILocation(line: 158, column: 13, scope: !1069)
!1099 = !DILocation(line: 158, column: 12, scope: !1069)
!1100 = !DILocation(line: 158, column: 18, scope: !1069)
!1101 = !DILocation(line: 158, column: 15, scope: !1069)
!1102 = !DILocation(line: 158, column: 25, scope: !1069)
!1103 = !DILocation(line: 159, column: 11, scope: !1069)
!1104 = !DILocation(line: 159, column: 13, scope: !1069)
!1105 = !DILocation(line: 159, column: 20, scope: !1069)
!1106 = !DILocation(line: 159, column: 18, scope: !1069)
!1107 = !DILocation(line: 159, column: 26, scope: !1069)
!1108 = !DILocation(line: 159, column: 23, scope: !1069)
!1109 = !DILocation(line: 159, column: 4, scope: !1069)
!1110 = !DILocation(line: 159, column: 6, scope: !1069)
!1111 = !DILocation(line: 160, column: 10, scope: !1069)
!1112 = !DILocation(line: 160, column: 3, scope: !1069)
!1113 = !DILocalVariable(name: "o", arg: 1, scope: !1114, file: !80, line: 152, type: !1117)
!1114 = distinct !DISubprogram(name: "set_char_quoting", scope: !80, file: !80, line: 152, type: !1115, scopeLine: 153, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1125, retainedNodes: !4)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!19, !1117, !8, !19}
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !80, line: 65, size: 448, elements: !1119)
!1119 = !{!1120, !1121, !1122, !1123, !1124}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1118, file: !80, line: 68, baseType: !57, size: 32)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1118, file: !80, line: 71, baseType: !19, size: 32, offset: 32)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1118, file: !80, line: 75, baseType: !98, size: 256, offset: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1118, file: !80, line: 78, baseType: !16, size: 64, offset: 320)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1118, file: !80, line: 81, baseType: !16, size: 64, offset: 384)
!1125 = distinct !DICompileUnit(language: DW_LANG_C99, file: !55, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, retainedTypes: !72, globals: !1126, nameTableKind: None)
!1126 = !{!1127, !1129, !1131, !1133, !1135, !1137, !1144, !1146}
!1127 = !DIGlobalVariableExpression(var: !1128, expr: !DIExpression())
!1128 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1125, file: !80, line: 85, type: !81, isLocal: false, isDefinition: true)
!1129 = !DIGlobalVariableExpression(var: !1130, expr: !DIExpression())
!1130 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1125, file: !80, line: 101, type: !87, isLocal: false, isDefinition: true)
!1131 = !DIGlobalVariableExpression(var: !1132, expr: !DIExpression())
!1132 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1125, file: !80, line: 1052, type: !1118, isLocal: false, isDefinition: true)
!1133 = !DIGlobalVariableExpression(var: !1134, expr: !DIExpression())
!1134 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1125, file: !80, line: 116, type: !1118, isLocal: true, isDefinition: true)
!1135 = !DIGlobalVariableExpression(var: !1136, expr: !DIExpression())
!1136 = distinct !DIGlobalVariable(name: "slot0", scope: !1125, file: !80, line: 842, type: !105, isLocal: true, isDefinition: true)
!1137 = !DIGlobalVariableExpression(var: !1138, expr: !DIExpression())
!1138 = distinct !DIGlobalVariable(name: "slotvec", scope: !1125, file: !80, line: 845, type: !1139, isLocal: true, isDefinition: true)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !80, line: 834, size: 128, elements: !1141)
!1141 = !{!1142, !1143}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1140, file: !80, line: 836, baseType: !74, size: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1140, file: !80, line: 837, baseType: !7, size: 64, offset: 64)
!1144 = !DIGlobalVariableExpression(var: !1145, expr: !DIExpression())
!1145 = distinct !DIGlobalVariable(name: "nslots", scope: !1125, file: !80, line: 843, type: !19, isLocal: true, isDefinition: true)
!1146 = !DIGlobalVariableExpression(var: !1147, expr: !DIExpression())
!1147 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1125, file: !80, line: 844, type: !1140, isLocal: true, isDefinition: true)
!1148 = !DILocalVariable(name: "c", arg: 2, scope: !1114, file: !80, line: 152, type: !8)
!1149 = !DILocalVariable(name: "i", arg: 3, scope: !1114, file: !80, line: 152, type: !19)
!1150 = !DILocalVariable(name: "uc", scope: !1114, file: !80, line: 154, type: !148)
!1151 = !DILocalVariable(name: "p", scope: !1114, file: !80, line: 155, type: !1083)
!1152 = distinct !DISubprogram(name: "quotearg_n_style", scope: !80, file: !80, line: 955, type: !1153, scopeLine: 956, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !54, retainedNodes: !4)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{!7, !19, !57, !16}
!1155 = !DILocalVariable(name: "n", arg: 1, scope: !1152, file: !80, line: 955, type: !19)
!1156 = !DILocation(line: 955, column: 23, scope: !1152)
!1157 = !DILocalVariable(name: "s", arg: 2, scope: !1152, file: !80, line: 955, type: !57)
!1158 = !DILocation(line: 955, column: 45, scope: !1152)
!1159 = !DILocalVariable(name: "arg", arg: 3, scope: !1152, file: !80, line: 955, type: !16)
!1160 = !DILocation(line: 955, column: 60, scope: !1152)
!1161 = !DILocalVariable(name: "o", scope: !1152, file: !80, line: 957, type: !1162)
!1162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!1163 = !DILocation(line: 957, column: 32, scope: !1152)
!1164 = !DILocation(line: 957, column: 64, scope: !1152)
!1165 = !DILocation(line: 957, column: 36, scope: !1152)
!1166 = !DILocation(line: 958, column: 30, scope: !1152)
!1167 = !DILocation(line: 958, column: 33, scope: !1152)
!1168 = !DILocation(line: 958, column: 10, scope: !1152)
!1169 = !DILocation(line: 958, column: 3, scope: !1152)
!1170 = !DILocalVariable(name: "n", arg: 1, scope: !1171, file: !80, line: 955, type: !19)
!1171 = distinct !DISubprogram(name: "quotearg_n_style", scope: !80, file: !80, line: 955, type: !1153, scopeLine: 956, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1172, retainedNodes: !4)
!1172 = distinct !DICompileUnit(language: DW_LANG_C99, file: !55, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, retainedTypes: !72, globals: !1173, nameTableKind: None)
!1173 = !{!1174, !1176, !1178, !1187, !1189, !1191, !1198, !1200}
!1174 = !DIGlobalVariableExpression(var: !1175, expr: !DIExpression())
!1175 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1172, file: !80, line: 85, type: !81, isLocal: false, isDefinition: true)
!1176 = !DIGlobalVariableExpression(var: !1177, expr: !DIExpression())
!1177 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1172, file: !80, line: 101, type: !87, isLocal: false, isDefinition: true)
!1178 = !DIGlobalVariableExpression(var: !1179, expr: !DIExpression())
!1179 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1172, file: !80, line: 1052, type: !1180, isLocal: false, isDefinition: true)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !80, line: 65, size: 448, elements: !1181)
!1181 = !{!1182, !1183, !1184, !1185, !1186}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1180, file: !80, line: 68, baseType: !57, size: 32)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1180, file: !80, line: 71, baseType: !19, size: 32, offset: 32)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1180, file: !80, line: 75, baseType: !98, size: 256, offset: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1180, file: !80, line: 78, baseType: !16, size: 64, offset: 320)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1180, file: !80, line: 81, baseType: !16, size: 64, offset: 384)
!1187 = !DIGlobalVariableExpression(var: !1188, expr: !DIExpression())
!1188 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1172, file: !80, line: 116, type: !1180, isLocal: true, isDefinition: true)
!1189 = !DIGlobalVariableExpression(var: !1190, expr: !DIExpression())
!1190 = distinct !DIGlobalVariable(name: "slot0", scope: !1172, file: !80, line: 842, type: !105, isLocal: true, isDefinition: true)
!1191 = !DIGlobalVariableExpression(var: !1192, expr: !DIExpression())
!1192 = distinct !DIGlobalVariable(name: "slotvec", scope: !1172, file: !80, line: 845, type: !1193, isLocal: true, isDefinition: true)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !80, line: 834, size: 128, elements: !1195)
!1195 = !{!1196, !1197}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1194, file: !80, line: 836, baseType: !74, size: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1194, file: !80, line: 837, baseType: !7, size: 64, offset: 64)
!1198 = !DIGlobalVariableExpression(var: !1199, expr: !DIExpression())
!1199 = distinct !DIGlobalVariable(name: "nslots", scope: !1172, file: !80, line: 843, type: !19, isLocal: true, isDefinition: true)
!1200 = !DIGlobalVariableExpression(var: !1201, expr: !DIExpression())
!1201 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1172, file: !80, line: 844, type: !1194, isLocal: true, isDefinition: true)
!1202 = !DILocalVariable(name: "s", arg: 2, scope: !1171, file: !80, line: 955, type: !57)
!1203 = !DILocalVariable(name: "arg", arg: 3, scope: !1171, file: !80, line: 955, type: !16)
!1204 = !DILocalVariable(name: "o", scope: !1171, file: !80, line: 957, type: !1205)
!1205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1180)
!1206 = distinct !DISubprogram(name: "quoting_options_from_style", scope: !80, file: !80, line: 193, type: !1207, scopeLine: 194, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !54, retainedNodes: !4)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{!93, !57}
!1209 = !DILocalVariable(name: "style", arg: 1, scope: !1206, file: !80, line: 193, type: !57)
!1210 = !DILocation(line: 193, column: 48, scope: !1206)
!1211 = !DILocalVariable(name: "o", scope: !1206, file: !80, line: 195, type: !93)
!1212 = !DILocation(line: 195, column: 26, scope: !1206)
!1213 = !DILocation(line: 196, column: 7, scope: !1214)
!1214 = distinct !DILexicalBlock(scope: !1206, file: !80, line: 196, column: 7)
!1215 = !DILocation(line: 196, column: 13, scope: !1214)
!1216 = !DILocation(line: 196, column: 7, scope: !1206)
!1217 = !DILocation(line: 197, column: 5, scope: !1214)
!1218 = !DILocation(line: 198, column: 13, scope: !1206)
!1219 = !DILocation(line: 198, column: 5, scope: !1206)
!1220 = !DILocation(line: 198, column: 11, scope: !1206)
!1221 = !DILocation(line: 199, column: 3, scope: !1206)
!1222 = distinct !DISubprogram(name: "quotearg_n_options", scope: !80, file: !80, line: 877, type: !1223, scopeLine: 879, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !54, retainedNodes: !4)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{!7, !19, !16, !74, !1225}
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1226 = !DILocalVariable(name: "n", arg: 1, scope: !1222, file: !80, line: 877, type: !19)
!1227 = !DILocation(line: 877, column: 25, scope: !1222)
!1228 = !DILocalVariable(name: "arg", arg: 2, scope: !1222, file: !80, line: 877, type: !16)
!1229 = !DILocation(line: 877, column: 40, scope: !1222)
!1230 = !DILocalVariable(name: "argsize", arg: 3, scope: !1222, file: !80, line: 877, type: !74)
!1231 = !DILocation(line: 877, column: 52, scope: !1222)
!1232 = !DILocalVariable(name: "options", arg: 4, scope: !1222, file: !80, line: 878, type: !1225)
!1233 = !DILocation(line: 878, column: 51, scope: !1222)
!1234 = !DILocalVariable(name: "e", scope: !1222, file: !80, line: 880, type: !19)
!1235 = !DILocation(line: 880, column: 7, scope: !1222)
!1236 = !DILocation(line: 880, column: 11, scope: !1222)
!1237 = !DILocalVariable(name: "sv", scope: !1222, file: !80, line: 882, type: !110)
!1238 = !DILocation(line: 882, column: 19, scope: !1222)
!1239 = !DILocation(line: 882, column: 24, scope: !1222)
!1240 = !DILocation(line: 884, column: 7, scope: !1241)
!1241 = distinct !DILexicalBlock(scope: !1222, file: !80, line: 884, column: 7)
!1242 = !DILocation(line: 884, column: 9, scope: !1241)
!1243 = !DILocation(line: 884, column: 7, scope: !1222)
!1244 = !DILocation(line: 885, column: 5, scope: !1241)
!1245 = !DILocation(line: 887, column: 7, scope: !1246)
!1246 = distinct !DILexicalBlock(scope: !1222, file: !80, line: 887, column: 7)
!1247 = !DILocation(line: 887, column: 17, scope: !1246)
!1248 = !DILocation(line: 887, column: 14, scope: !1246)
!1249 = !DILocation(line: 887, column: 7, scope: !1222)
!1250 = !DILocalVariable(name: "preallocated", scope: !1251, file: !80, line: 889, type: !38)
!1251 = distinct !DILexicalBlock(scope: !1246, file: !80, line: 888, column: 5)
!1252 = !DILocation(line: 889, column: 12, scope: !1251)
!1253 = !DILocation(line: 889, column: 28, scope: !1251)
!1254 = !DILocation(line: 889, column: 31, scope: !1251)
!1255 = !DILocalVariable(name: "nmax", scope: !1251, file: !80, line: 890, type: !19)
!1256 = !DILocation(line: 890, column: 11, scope: !1251)
!1257 = !DILocation(line: 892, column: 11, scope: !1258)
!1258 = distinct !DILexicalBlock(scope: !1251, file: !80, line: 892, column: 11)
!1259 = !DILocation(line: 892, column: 18, scope: !1258)
!1260 = !DILocation(line: 892, column: 16, scope: !1258)
!1261 = !DILocation(line: 892, column: 11, scope: !1251)
!1262 = !DILocation(line: 893, column: 9, scope: !1258)
!1263 = !DILocation(line: 895, column: 32, scope: !1251)
!1264 = !DILocation(line: 895, column: 54, scope: !1251)
!1265 = !DILocation(line: 895, column: 59, scope: !1251)
!1266 = !DILocation(line: 895, column: 61, scope: !1251)
!1267 = !DILocation(line: 895, column: 58, scope: !1251)
!1268 = !DILocation(line: 895, column: 66, scope: !1251)
!1269 = !DILocation(line: 895, column: 22, scope: !1251)
!1270 = !DILocation(line: 895, column: 20, scope: !1251)
!1271 = !DILocation(line: 895, column: 15, scope: !1251)
!1272 = !DILocation(line: 896, column: 11, scope: !1273)
!1273 = distinct !DILexicalBlock(scope: !1251, file: !80, line: 896, column: 11)
!1274 = !DILocation(line: 896, column: 11, scope: !1251)
!1275 = !DILocation(line: 897, column: 10, scope: !1273)
!1276 = !DILocation(line: 897, column: 15, scope: !1273)
!1277 = !DILocation(line: 897, column: 9, scope: !1273)
!1278 = !DILocation(line: 898, column: 15, scope: !1251)
!1279 = !DILocation(line: 898, column: 20, scope: !1251)
!1280 = !DILocation(line: 898, column: 18, scope: !1251)
!1281 = !DILocation(line: 898, column: 7, scope: !1251)
!1282 = !DILocation(line: 898, column: 32, scope: !1251)
!1283 = !DILocation(line: 898, column: 34, scope: !1251)
!1284 = !DILocation(line: 898, column: 40, scope: !1251)
!1285 = !DILocation(line: 898, column: 38, scope: !1251)
!1286 = !DILocation(line: 898, column: 31, scope: !1251)
!1287 = !DILocation(line: 898, column: 48, scope: !1251)
!1288 = !DILocation(line: 899, column: 16, scope: !1251)
!1289 = !DILocation(line: 899, column: 18, scope: !1251)
!1290 = !DILocation(line: 899, column: 14, scope: !1251)
!1291 = !DILocation(line: 900, column: 5, scope: !1251)
!1292 = !DILocalVariable(name: "size", scope: !1293, file: !80, line: 903, type: !74)
!1293 = distinct !DILexicalBlock(scope: !1222, file: !80, line: 902, column: 3)
!1294 = !DILocation(line: 903, column: 12, scope: !1293)
!1295 = !DILocation(line: 903, column: 19, scope: !1293)
!1296 = !DILocation(line: 903, column: 22, scope: !1293)
!1297 = !DILocation(line: 903, column: 25, scope: !1293)
!1298 = !DILocalVariable(name: "val", scope: !1293, file: !80, line: 904, type: !7)
!1299 = !DILocation(line: 904, column: 11, scope: !1293)
!1300 = !DILocation(line: 904, column: 17, scope: !1293)
!1301 = !DILocation(line: 904, column: 20, scope: !1293)
!1302 = !DILocation(line: 904, column: 23, scope: !1293)
!1303 = !DILocalVariable(name: "flags", scope: !1293, file: !80, line: 906, type: !19)
!1304 = !DILocation(line: 906, column: 9, scope: !1293)
!1305 = !DILocation(line: 906, column: 17, scope: !1293)
