; ModuleID = '<stdin>'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.file_name = type { i8*, i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.dev_ino, %struct.dev_ino, %struct.dev_ino, [3 x i64] }
%struct.dev_ino = type { i64, i64 }
%struct.__dirstream = type opaque
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external dso_local global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [23 x i8] c"Usage: %s [OPTION]...\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 41, type: !10, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !9, nameTableKind: None)
!3 = !DIFile(filename: "src/pwd.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!4 = !{}
!5 = !{!6, !7}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !{!0}
!10 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 1280, elements: !23)
!11 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !14)
!13 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "")
!14 = !{!15, !18, !20, !22}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !12, file: !13, line: 52, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !12, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !12, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !12, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!23 = !{!24}
!24 = !DISubrange(count: 5)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "Version", scope: !27, file: !28, line: 2, type: !16, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !29, nameTableKind: None)
!28 = !DIFile(filename: "src/version.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!29 = !{!25}
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !32, file: !37, line: 56, type: !38, isLocal: true, isDefinition: true)
!32 = distinct !DICompileUnit(language: DW_LANG_C99, file: !33, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !34, nameTableKind: None)
!33 = !DIFile(filename: "./lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!34 = !{!35, !30}
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "file_name", scope: !32, file: !37, line: 46, type: !16, isLocal: true, isDefinition: true)
!37 = !DIFile(filename: "lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!38 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "exit_failure", scope: !41, file: !44, line: 24, type: !45, isLocal: false, isDefinition: true)
!41 = distinct !DICompileUnit(language: DW_LANG_C99, file: !42, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !43, nameTableKind: None)
!42 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!43 = !{!39}
!44 = !DIFile(filename: "lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!45 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !19)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "program_name", scope: !48, file: !51, line: 33, type: !16, isLocal: false, isDefinition: true)
!48 = distinct !DICompileUnit(language: DW_LANG_C99, file: !49, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !50, nameTableKind: None)
!49 = !DIFile(filename: "./lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!50 = !{!46}
!51 = !DIFile(filename: "lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !54, file: !80, line: 116, type: !93, isLocal: true, isDefinition: true)
!54 = distinct !DICompileUnit(language: DW_LANG_C99, file: !55, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, retainedTypes: !72, globals: !77, nameTableKind: None)
!55 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!56 = !{!57}
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !58, line: 32, baseType: !59, size: 32, elements: !60)
!58 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!59 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!60 = !{!61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71}
!61 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!62 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!63 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!64 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!65 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!66 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!67 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!68 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!69 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!70 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!71 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!72 = !{!19, !73, !74}
!73 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !75, line: 46, baseType: !76)
!75 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.1/include/stddef.h", directory: "")
!76 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!77 = !{!78, !85, !91, !52, !103, !108, !115, !117}
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !54, file: !80, line: 85, type: !81, isLocal: false, isDefinition: true)
!80 = !DIFile(filename: "lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 704, elements: !83)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!83 = !{!84}
!84 = !DISubrange(count: 11)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !54, file: !80, line: 101, type: !87, isLocal: false, isDefinition: true)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 320, elements: !89)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!89 = !{!90}
!90 = !DISubrange(count: 10)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !54, file: !80, line: 1052, type: !93, isLocal: false, isDefinition: true)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !80, line: 65, size: 448, elements: !94)
!94 = !{!95, !96, !97, !101, !102}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !93, file: !80, line: 68, baseType: !57, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !93, file: !80, line: 71, baseType: !19, size: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !93, file: !80, line: 75, baseType: !98, size: 256, offset: 64)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 256, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 8)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !93, file: !80, line: 78, baseType: !16, size: 64, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !93, file: !80, line: 81, baseType: !16, size: 64, offset: 384)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "slot0", scope: !54, file: !80, line: 842, type: !105, isLocal: true, isDefinition: true)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 256)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "slotvec", scope: !54, file: !80, line: 845, type: !110, isLocal: true, isDefinition: true)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !80, line: 834, size: 128, elements: !112)
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !111, file: !80, line: 836, baseType: !74, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !111, file: !80, line: 837, baseType: !7, size: 64, offset: 64)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "nslots", scope: !54, file: !80, line: 843, type: !19, isLocal: true, isDefinition: true)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "slotvec0", scope: !54, file: !80, line: 844, type: !111, isLocal: true, isDefinition: true)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !121, file: !124, line: 26, type: !125, isLocal: false, isDefinition: true)
!121 = distinct !DICompileUnit(language: DW_LANG_C99, file: !122, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !123, nameTableKind: None)
!122 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!123 = !{!119}
!124 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 376, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 47)
!128 = distinct !DICompileUnit(language: DW_LANG_C99, file: !129, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!129 = !DIFile(filename: "./lib/root-dev-ino.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!130 = distinct !DICompileUnit(language: DW_LANG_C99, file: !131, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!131 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!132 = !{!6}
!133 = distinct !DICompileUnit(language: DW_LANG_C99, file: !134, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !135, nameTableKind: None)
!134 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!135 = !{!74, !7, !6}
!136 = distinct !DICompileUnit(language: DW_LANG_C99, file: !137, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!137 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!138 = distinct !DICompileUnit(language: DW_LANG_C99, file: !139, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!139 = !DIFile(filename: "./lib/xgetcwd.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!140 = distinct !DICompileUnit(language: DW_LANG_C99, file: !141, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !142, nameTableKind: None)
!141 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!142 = !{!74}
!143 = distinct !DICompileUnit(language: DW_LANG_C99, file: !144, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !145, nameTableKind: None)
!144 = !DIFile(filename: "./lib/c-strcasecmp.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!145 = !{!146}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!149 = distinct !DICompileUnit(language: DW_LANG_C99, file: !150, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!150 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!151 = distinct !DICompileUnit(language: DW_LANG_C99, file: !152, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!152 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!153 = distinct !DICompileUnit(language: DW_LANG_C99, file: !154, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!154 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!155 = distinct !DICompileUnit(language: DW_LANG_C99, file: !156, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!156 = !DIFile(filename: "./lib/setlocale_null.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!157 = distinct !DICompileUnit(language: DW_LANG_C99, file: !158, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!158 = !DIFile(filename: "./lib/fclose.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!159 = distinct !DICompileUnit(language: DW_LANG_C99, file: !160, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!160 = !DIFile(filename: "./lib/fflush.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!161 = distinct !DICompileUnit(language: DW_LANG_C99, file: !162, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!162 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!163 = distinct !DICompileUnit(language: DW_LANG_C99, file: !164, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!164 = !DIFile(filename: "./lib/c-ctype.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!165 = !{!"clang version 9.0.1-12 "}
!166 = !{i32 2, !"Dwarf Version", i32 4}
!167 = !{i32 2, !"Debug Info Version", i32 3}
!168 = !{i32 1, !"wchar_size", i32 4}
!169 = !{i32 1, !"ThinLTO", i32 0}
!170 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!171 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 51, type: !172, scopeLine: 52, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !19}
!174 = !DILocalVariable(name: "status", arg: 1, scope: !171, file: !3, line: 51, type: !19)
!175 = !DILocation(line: 51, column: 12, scope: !171)
!176 = !DILocation(line: 53, column: 7, scope: !177)
!177 = distinct !DILexicalBlock(scope: !171, file: !3, line: 53, column: 7)
!178 = !DILocation(line: 53, column: 14, scope: !177)
!179 = !DILocation(line: 53, column: 7, scope: !171)
!180 = !DILocation(line: 54, column: 5, scope: !177)
!181 = !DILocation(line: 54, column: 5, scope: !182)
!182 = distinct !DILexicalBlock(scope: !177, file: !3, line: 54, column: 5)
!183 = !DILocation(line: 57, column: 15, scope: !184)
!184 = distinct !DILexicalBlock(scope: !177, file: !3, line: 56, column: 5)
!185 = !DILocation(line: 57, column: 45, scope: !184)
!186 = !DILocation(line: 57, column: 7, scope: !184)
!187 = !DILocation(line: 58, column: 7, scope: !184)
!188 = !DILocation(line: 62, column: 7, scope: !184)
!189 = !DILocation(line: 66, column: 7, scope: !184)
!190 = !DILocation(line: 67, column: 7, scope: !184)
!191 = !DILocation(line: 68, column: 7, scope: !184)
!192 = !DILocation(line: 71, column: 15, scope: !184)
!193 = !DILocation(line: 71, column: 7, scope: !184)
!194 = !DILocation(line: 72, column: 7, scope: !184)
!195 = !DILocation(line: 74, column: 9, scope: !171)
!196 = !DILocation(line: 74, column: 3, scope: !171)
!197 = !DILocalVariable(name: "status", arg: 1, scope: !198, file: !3, line: 51, type: !19)
!198 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 51, type: !172, scopeLine: 52, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !199, retainedNodes: !4)
!199 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !200, nameTableKind: None)
!200 = !{!201}
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "longopts", scope: !199, file: !3, line: 41, type: !203, isLocal: true, isDefinition: true)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 1280, elements: !23)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !206)
!206 = !{!207, !208, !209, !210}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !205, file: !13, line: 52, baseType: !16, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !205, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !205, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !205, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!211 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !212, file: !212, line: 634, type: !213, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!212 = !DIFile(filename: "src/system.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!213 = !DISubroutineType(types: !214)
!214 = !{null, !16}
!215 = !DILocalVariable(name: "program", arg: 1, scope: !211, file: !212, line: 634, type: !16)
!216 = !DILocation(line: 634, column: 34, scope: !211)
!217 = !DILocalVariable(name: "infomap", scope: !211, file: !212, line: 636, type: !218)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 896, elements: !224)
!219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !211, file: !212, line: 636, size: 128, elements: !221)
!221 = !{!222, !223}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !220, file: !212, line: 636, baseType: !16, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !220, file: !212, line: 636, baseType: !16, size: 64, offset: 64)
!224 = !{!225}
!225 = !DISubrange(count: 7)
!226 = !DILocation(line: 636, column: 67, scope: !211)
!227 = !DILocalVariable(name: "node", scope: !211, file: !212, line: 646, type: !16)
!228 = !DILocation(line: 646, column: 15, scope: !211)
!229 = !DILocation(line: 646, column: 22, scope: !211)
!230 = !DILocalVariable(name: "map_prog", scope: !211, file: !212, line: 647, type: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!232 = !DILocation(line: 647, column: 25, scope: !211)
!233 = !DILocation(line: 647, column: 36, scope: !211)
!234 = !DILocation(line: 649, column: 3, scope: !211)
!235 = !DILocation(line: 649, column: 10, scope: !211)
!236 = !DILocation(line: 649, column: 20, scope: !211)
!237 = !DILocation(line: 649, column: 28, scope: !211)
!238 = !DILocation(line: 649, column: 33, scope: !211)
!239 = !DILocation(line: 649, column: 31, scope: !211)
!240 = !DILocation(line: 0, scope: !211)
!241 = !DILocation(line: 650, column: 13, scope: !211)
!242 = distinct !{!242, !234, !241}
!243 = !DILocation(line: 652, column: 7, scope: !244)
!244 = distinct !DILexicalBlock(scope: !211, file: !212, line: 652, column: 7)
!245 = !DILocation(line: 652, column: 17, scope: !244)
!246 = !DILocation(line: 652, column: 7, scope: !211)
!247 = !DILocation(line: 653, column: 12, scope: !244)
!248 = !DILocation(line: 653, column: 22, scope: !244)
!249 = !DILocation(line: 653, column: 10, scope: !244)
!250 = !DILocation(line: 653, column: 5, scope: !244)
!251 = !DILocation(line: 655, column: 11, scope: !211)
!252 = !DILocation(line: 655, column: 3, scope: !211)
!253 = !DILocalVariable(name: "lc_messages", scope: !211, file: !212, line: 659, type: !16)
!254 = !DILocation(line: 659, column: 15, scope: !211)
!255 = !DILocation(line: 659, column: 29, scope: !211)
!256 = !DILocation(line: 660, column: 7, scope: !257)
!257 = distinct !DILexicalBlock(scope: !211, file: !212, line: 660, column: 7)
!258 = !DILocation(line: 660, column: 19, scope: !257)
!259 = !DILocation(line: 660, column: 22, scope: !257)
!260 = !DILocation(line: 660, column: 7, scope: !211)
!261 = !DILocation(line: 666, column: 7, scope: !262)
!262 = distinct !DILexicalBlock(scope: !257, file: !212, line: 661, column: 5)
!263 = !DILocation(line: 668, column: 5, scope: !262)
!264 = !DILocation(line: 669, column: 11, scope: !211)
!265 = !DILocation(line: 670, column: 24, scope: !211)
!266 = !DILocation(line: 669, column: 3, scope: !211)
!267 = !DILocation(line: 671, column: 11, scope: !211)
!268 = !DILocation(line: 672, column: 11, scope: !211)
!269 = !DILocation(line: 672, column: 17, scope: !211)
!270 = !DILocation(line: 672, column: 25, scope: !211)
!271 = !DILocation(line: 672, column: 22, scope: !211)
!272 = !DILocation(line: 671, column: 3, scope: !211)
!273 = !DILocation(line: 673, column: 1, scope: !211)
!274 = !DILocalVariable(name: "program", arg: 1, scope: !275, file: !212, line: 634, type: !16)
!275 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !212, file: !212, line: 634, type: !213, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !276, retainedNodes: !4)
!276 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !277, nameTableKind: None)
!277 = !{!278}
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "longopts", scope: !276, file: !3, line: 41, type: !280, isLocal: true, isDefinition: true)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 1280, elements: !23)
!281 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !283)
!283 = !{!284, !285, !286, !287}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !282, file: !13, line: 52, baseType: !16, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !282, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !282, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !282, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!288 = !DILocalVariable(name: "infomap", scope: !275, file: !212, line: 636, type: !289)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 896, elements: !224)
!290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !275, file: !212, line: 636, size: 128, elements: !292)
!292 = !{!293, !294}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !291, file: !212, line: 636, baseType: !16, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !291, file: !212, line: 636, baseType: !16, size: 64, offset: 64)
!295 = !DILocalVariable(name: "node", scope: !275, file: !212, line: 646, type: !16)
!296 = !DILocalVariable(name: "map_prog", scope: !275, file: !212, line: 647, type: !297)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!298 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 327, type: !299, scopeLine: 328, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!299 = !DISubroutineType(types: !300)
!300 = !{!19, !19, !301}
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!302 = !DILocalVariable(name: "argc", arg: 1, scope: !298, file: !3, line: 327, type: !19)
!303 = !DILocation(line: 327, column: 11, scope: !298)
!304 = !DILocalVariable(name: "argv", arg: 2, scope: !298, file: !3, line: 327, type: !301)
!305 = !DILocation(line: 327, column: 24, scope: !298)
!306 = !DILocalVariable(name: "wd", scope: !298, file: !3, line: 329, type: !7)
!307 = !DILocation(line: 329, column: 9, scope: !298)
!308 = !DILocalVariable(name: "logical", scope: !298, file: !3, line: 333, type: !38)
!309 = !DILocation(line: 333, column: 8, scope: !298)
!310 = !DILocation(line: 333, column: 19, scope: !298)
!311 = !DILocation(line: 333, column: 46, scope: !298)
!312 = !DILocation(line: 336, column: 21, scope: !298)
!313 = !DILocation(line: 336, column: 3, scope: !298)
!314 = !DILocation(line: 337, column: 3, scope: !298)
!315 = !DILocation(line: 338, column: 3, scope: !298)
!316 = !DILocation(line: 339, column: 3, scope: !298)
!317 = !DILocation(line: 341, column: 3, scope: !298)
!318 = !DILocation(line: 343, column: 3, scope: !298)
!319 = !DILocalVariable(name: "c", scope: !320, file: !3, line: 345, type: !19)
!320 = distinct !DILexicalBlock(scope: !298, file: !3, line: 344, column: 5)
!321 = !DILocation(line: 345, column: 11, scope: !320)
!322 = !DILocation(line: 345, column: 28, scope: !320)
!323 = !DILocation(line: 345, column: 34, scope: !320)
!324 = !DILocation(line: 345, column: 15, scope: !320)
!325 = !DILocation(line: 346, column: 11, scope: !326)
!326 = distinct !DILexicalBlock(scope: !320, file: !3, line: 346, column: 11)
!327 = !DILocation(line: 346, column: 13, scope: !326)
!328 = !DILocation(line: 347, column: 9, scope: !326)
!329 = !DILocation(line: 348, column: 15, scope: !320)
!330 = !DILocation(line: 348, column: 7, scope: !320)
!331 = !DILocation(line: 351, column: 19, scope: !332)
!332 = distinct !DILexicalBlock(scope: !320, file: !3, line: 349, column: 9)
!333 = !DILocation(line: 352, column: 11, scope: !332)
!334 = !DILocation(line: 354, column: 19, scope: !332)
!335 = !DILocation(line: 355, column: 11, scope: !332)
!336 = !DILocation(line: 357, column: 9, scope: !332)
!337 = !DILocation(line: 359, column: 9, scope: !332)
!338 = !DILocation(line: 362, column: 11, scope: !332)
!339 = distinct !{!339, !318, !340}
!340 = !DILocation(line: 364, column: 5, scope: !298)
!341 = !DILocation(line: 366, column: 7, scope: !342)
!342 = distinct !DILexicalBlock(scope: !298, file: !3, line: 366, column: 7)
!343 = !DILocation(line: 366, column: 16, scope: !342)
!344 = !DILocation(line: 366, column: 14, scope: !342)
!345 = !DILocation(line: 366, column: 7, scope: !298)
!346 = !DILocation(line: 367, column: 18, scope: !342)
!347 = !DILocation(line: 367, column: 5, scope: !342)
!348 = !DILocation(line: 369, column: 7, scope: !349)
!349 = distinct !DILexicalBlock(scope: !298, file: !3, line: 369, column: 7)
!350 = !DILocation(line: 369, column: 7, scope: !298)
!351 = !DILocation(line: 371, column: 12, scope: !352)
!352 = distinct !DILexicalBlock(scope: !349, file: !3, line: 370, column: 5)
!353 = !DILocation(line: 371, column: 10, scope: !352)
!354 = !DILocation(line: 372, column: 11, scope: !355)
!355 = distinct !DILexicalBlock(scope: !352, file: !3, line: 372, column: 11)
!356 = !DILocation(line: 372, column: 11, scope: !352)
!357 = !DILocation(line: 374, column: 17, scope: !358)
!358 = distinct !DILexicalBlock(scope: !355, file: !3, line: 373, column: 9)
!359 = !DILocation(line: 374, column: 11, scope: !358)
!360 = !DILocation(line: 375, column: 11, scope: !358)
!361 = !DILocation(line: 377, column: 5, scope: !352)
!362 = !DILocation(line: 379, column: 8, scope: !298)
!363 = !DILocation(line: 379, column: 6, scope: !298)
!364 = !DILocation(line: 380, column: 7, scope: !365)
!365 = distinct !DILexicalBlock(scope: !298, file: !3, line: 380, column: 7)
!366 = !DILocation(line: 380, column: 10, scope: !365)
!367 = !DILocation(line: 380, column: 7, scope: !298)
!368 = !DILocation(line: 382, column: 13, scope: !369)
!369 = distinct !DILexicalBlock(scope: !365, file: !3, line: 381, column: 5)
!370 = !DILocation(line: 382, column: 7, scope: !369)
!371 = !DILocation(line: 383, column: 13, scope: !369)
!372 = !DILocation(line: 383, column: 7, scope: !369)
!373 = !DILocation(line: 384, column: 5, scope: !369)
!374 = !DILocalVariable(name: "file_name", scope: !375, file: !3, line: 387, type: !376)
!375 = distinct !DILexicalBlock(scope: !365, file: !3, line: 386, column: 5)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 34, size: 192, elements: !378)
!378 = !{!379, !380, !381}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !377, file: !3, line: 36, baseType: !7, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !377, file: !3, line: 37, baseType: !74, size: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !377, file: !3, line: 38, baseType: !7, size: 64, offset: 128)
!382 = !DILocation(line: 387, column: 25, scope: !375)
!383 = !DILocation(line: 387, column: 37, scope: !375)
!384 = !DILocation(line: 388, column: 22, scope: !375)
!385 = !DILocation(line: 388, column: 7, scope: !375)
!386 = !DILocation(line: 389, column: 13, scope: !375)
!387 = !DILocation(line: 389, column: 24, scope: !375)
!388 = !DILocation(line: 389, column: 7, scope: !375)
!389 = !DILocation(line: 390, column: 23, scope: !375)
!390 = !DILocation(line: 390, column: 7, scope: !375)
!391 = !DILocation(line: 393, column: 3, scope: !298)
!392 = !DILocation(line: 394, column: 1, scope: !298)
!393 = distinct !DISubprogram(name: "logical_getcwd", scope: !3, file: !3, line: 300, type: !394, scopeLine: 301, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!394 = !DISubroutineType(types: !395)
!395 = !{!7}
!396 = !DILocalVariable(name: "st1", scope: !393, file: !3, line: 302, type: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !398, line: 46, size: 1152, elements: !399)
!398 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!399 = !{!400, !403, !405, !407, !409, !411, !413, !414, !415, !418, !420, !422, !430, !431, !432}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !397, file: !398, line: 48, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !402, line: 145, baseType: !76)
!402 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!403 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !397, file: !398, line: 53, baseType: !404, size: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !402, line: 148, baseType: !76)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !397, file: !398, line: 61, baseType: !406, size: 64, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !402, line: 151, baseType: !76)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !397, file: !398, line: 62, baseType: !408, size: 32, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !402, line: 150, baseType: !59)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !397, file: !398, line: 64, baseType: !410, size: 32, offset: 224)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !402, line: 146, baseType: !59)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !397, file: !398, line: 65, baseType: !412, size: 32, offset: 256)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !402, line: 147, baseType: !59)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !397, file: !398, line: 67, baseType: !19, size: 32, offset: 288)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !397, file: !398, line: 69, baseType: !401, size: 64, offset: 320)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !397, file: !398, line: 74, baseType: !416, size: 64, offset: 384)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !402, line: 152, baseType: !417)
!417 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !397, file: !398, line: 78, baseType: !419, size: 64, offset: 448)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !402, line: 174, baseType: !417)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !397, file: !398, line: 80, baseType: !421, size: 64, offset: 512)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !402, line: 179, baseType: !417)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !397, file: !398, line: 91, baseType: !423, size: 128, offset: 576)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !424, line: 10, size: 128, elements: !425)
!424 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!425 = !{!426, !428}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !423, file: !424, line: 12, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !402, line: 160, baseType: !417)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !423, file: !424, line: 16, baseType: !429, size: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !402, line: 196, baseType: !417)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !397, file: !398, line: 92, baseType: !423, size: 128, offset: 704)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !397, file: !398, line: 93, baseType: !423, size: 128, offset: 832)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !397, file: !398, line: 106, baseType: !433, size: 192, offset: 960)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !429, size: 192, elements: !434)
!434 = !{!435}
!435 = !DISubrange(count: 3)
!436 = !DILocation(line: 302, column: 15, scope: !393)
!437 = !DILocalVariable(name: "st2", scope: !393, file: !3, line: 303, type: !397)
!438 = !DILocation(line: 303, column: 15, scope: !393)
!439 = !DILocalVariable(name: "wd", scope: !393, file: !3, line: 304, type: !7)
!440 = !DILocation(line: 304, column: 9, scope: !393)
!441 = !DILocation(line: 304, column: 14, scope: !393)
!442 = !DILocalVariable(name: "p", scope: !393, file: !3, line: 305, type: !7)
!443 = !DILocation(line: 305, column: 9, scope: !393)
!444 = !DILocation(line: 308, column: 8, scope: !445)
!445 = distinct !DILexicalBlock(scope: !393, file: !3, line: 308, column: 7)
!446 = !DILocation(line: 308, column: 11, scope: !445)
!447 = !DILocation(line: 308, column: 14, scope: !445)
!448 = !DILocation(line: 308, column: 20, scope: !445)
!449 = !DILocation(line: 308, column: 7, scope: !393)
!450 = !DILocation(line: 309, column: 5, scope: !445)
!451 = !DILocation(line: 310, column: 7, scope: !393)
!452 = !DILocation(line: 310, column: 5, scope: !393)
!453 = !DILocation(line: 311, column: 3, scope: !393)
!454 = !DILocation(line: 311, column: 23, scope: !393)
!455 = !DILocation(line: 311, column: 15, scope: !393)
!456 = !DILocation(line: 311, column: 13, scope: !393)
!457 = !DILocation(line: 313, column: 12, scope: !458)
!458 = distinct !DILexicalBlock(scope: !459, file: !3, line: 313, column: 11)
!459 = distinct !DILexicalBlock(scope: !393, file: !3, line: 312, column: 5)
!460 = !DILocation(line: 313, column: 17, scope: !458)
!461 = !DILocation(line: 313, column: 20, scope: !458)
!462 = !DILocation(line: 313, column: 25, scope: !458)
!463 = !DILocation(line: 314, column: 11, scope: !458)
!464 = !DILocation(line: 314, column: 15, scope: !458)
!465 = !DILocation(line: 314, column: 20, scope: !458)
!466 = !DILocation(line: 314, column: 27, scope: !458)
!467 = !DILocation(line: 314, column: 32, scope: !458)
!468 = !DILocation(line: 314, column: 37, scope: !458)
!469 = !DILocation(line: 314, column: 40, scope: !458)
!470 = !DILocation(line: 314, column: 45, scope: !458)
!471 = !DILocation(line: 313, column: 11, scope: !459)
!472 = !DILocation(line: 315, column: 9, scope: !458)
!473 = !DILocation(line: 316, column: 8, scope: !459)
!474 = distinct !{!474, !453, !475}
!475 = !DILocation(line: 317, column: 5, scope: !393)
!476 = !DILocation(line: 320, column: 13, scope: !477)
!477 = distinct !DILexicalBlock(scope: !393, file: !3, line: 320, column: 7)
!478 = !DILocation(line: 320, column: 7, scope: !477)
!479 = !DILocation(line: 320, column: 23, scope: !477)
!480 = !DILocation(line: 320, column: 31, scope: !477)
!481 = !DILocation(line: 320, column: 48, scope: !477)
!482 = !DILocation(line: 320, column: 56, scope: !477)
!483 = !DILocation(line: 320, column: 7, scope: !393)
!484 = !DILocation(line: 321, column: 12, scope: !477)
!485 = !DILocation(line: 321, column: 5, scope: !477)
!486 = !DILocation(line: 322, column: 3, scope: !393)
!487 = !DILocation(line: 323, column: 1, scope: !393)
!488 = distinct !DISubprogram(name: "file_name_init", scope: !3, file: !3, line: 85, type: !489, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!489 = !DISubroutineType(types: !490)
!490 = !{!376}
!491 = !DILocalVariable(name: "p", scope: !488, file: !3, line: 87, type: !376)
!492 = !DILocation(line: 87, column: 21, scope: !488)
!493 = !DILocation(line: 87, column: 25, scope: !488)
!494 = !DILocation(line: 91, column: 3, scope: !488)
!495 = !DILocation(line: 91, column: 6, scope: !488)
!496 = !DILocation(line: 91, column: 14, scope: !488)
!497 = !DILocation(line: 93, column: 21, scope: !488)
!498 = !DILocation(line: 93, column: 24, scope: !488)
!499 = !DILocation(line: 93, column: 12, scope: !488)
!500 = !DILocation(line: 93, column: 3, scope: !488)
!501 = !DILocation(line: 93, column: 6, scope: !488)
!502 = !DILocation(line: 93, column: 10, scope: !488)
!503 = !DILocation(line: 94, column: 14, scope: !488)
!504 = !DILocation(line: 94, column: 17, scope: !488)
!505 = !DILocation(line: 94, column: 24, scope: !488)
!506 = !DILocation(line: 94, column: 27, scope: !488)
!507 = !DILocation(line: 94, column: 35, scope: !488)
!508 = !DILocation(line: 94, column: 21, scope: !488)
!509 = !DILocation(line: 94, column: 3, scope: !488)
!510 = !DILocation(line: 94, column: 6, scope: !488)
!511 = !DILocation(line: 94, column: 12, scope: !488)
!512 = !DILocation(line: 95, column: 3, scope: !488)
!513 = !DILocation(line: 95, column: 6, scope: !488)
!514 = !DILocation(line: 95, column: 15, scope: !488)
!515 = !DILocation(line: 96, column: 10, scope: !488)
!516 = !DILocation(line: 96, column: 3, scope: !488)
!517 = distinct !DISubprogram(name: "robust_getcwd", scope: !3, file: !3, line: 268, type: !518, scopeLine: 269, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!518 = !DISubroutineType(types: !519)
!519 = !{null, !376}
!520 = !DILocalVariable(name: "file_name", arg: 1, scope: !517, file: !3, line: 268, type: !376)
!521 = !DILocation(line: 268, column: 34, scope: !517)
!522 = !DILocalVariable(name: "height", scope: !517, file: !3, line: 270, type: !74)
!523 = !DILocation(line: 270, column: 10, scope: !517)
!524 = !DILocalVariable(name: "dev_ino_buf", scope: !517, file: !3, line: 271, type: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !526, line: 7, size: 128, elements: !527)
!526 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!527 = !{!528, !531}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !525, file: !526, line: 9, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !530, line: 47, baseType: !404)
!530 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!531 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !525, file: !526, line: 10, baseType: !532, size: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !530, line: 59, baseType: !401)
!533 = !DILocation(line: 271, column: 18, scope: !517)
!534 = !DILocalVariable(name: "root_dev_ino", scope: !517, file: !3, line: 272, type: !535)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!536 = !DILocation(line: 272, column: 19, scope: !517)
!537 = !DILocation(line: 272, column: 34, scope: !517)
!538 = !DILocalVariable(name: "dot_sb", scope: !517, file: !3, line: 273, type: !397)
!539 = !DILocation(line: 273, column: 15, scope: !517)
!540 = !DILocation(line: 275, column: 7, scope: !541)
!541 = distinct !DILexicalBlock(scope: !517, file: !3, line: 275, column: 7)
!542 = !DILocation(line: 275, column: 20, scope: !541)
!543 = !DILocation(line: 275, column: 7, scope: !517)
!544 = !DILocation(line: 276, column: 5, scope: !541)
!545 = !DILocation(line: 279, column: 7, scope: !546)
!546 = distinct !DILexicalBlock(scope: !517, file: !3, line: 279, column: 7)
!547 = !DILocation(line: 279, column: 27, scope: !546)
!548 = !DILocation(line: 279, column: 7, scope: !517)
!549 = !DILocation(line: 280, column: 5, scope: !546)
!550 = !DILocation(line: 282, column: 3, scope: !517)
!551 = !DILocation(line: 285, column: 11, scope: !552)
!552 = distinct !DILexicalBlock(scope: !553, file: !3, line: 285, column: 11)
!553 = distinct !DILexicalBlock(scope: !517, file: !3, line: 283, column: 5)
!554 = !DILocation(line: 285, column: 11, scope: !553)
!555 = !DILocation(line: 286, column: 9, scope: !552)
!556 = !DILocation(line: 288, column: 32, scope: !553)
!557 = !DILocation(line: 288, column: 49, scope: !553)
!558 = !DILocation(line: 288, column: 7, scope: !553)
!559 = distinct !{!559, !550, !560}
!560 = !DILocation(line: 289, column: 5, scope: !517)
!561 = !DILocation(line: 292, column: 7, scope: !562)
!562 = distinct !DILexicalBlock(scope: !517, file: !3, line: 292, column: 7)
!563 = !DILocation(line: 292, column: 18, scope: !562)
!564 = !DILocation(line: 292, column: 27, scope: !562)
!565 = !DILocation(line: 292, column: 7, scope: !517)
!566 = !DILocation(line: 293, column: 24, scope: !562)
!567 = !DILocation(line: 293, column: 5, scope: !562)
!568 = !DILocation(line: 294, column: 1, scope: !517)
!569 = distinct !DISubprogram(name: "file_name_free", scope: !3, file: !3, line: 78, type: !518, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!570 = !DILocalVariable(name: "p", arg: 1, scope: !569, file: !3, line: 78, type: !376)
!571 = !DILocation(line: 78, column: 35, scope: !569)
!572 = !DILocation(line: 80, column: 9, scope: !569)
!573 = !DILocation(line: 80, column: 12, scope: !569)
!574 = !DILocation(line: 80, column: 3, scope: !569)
!575 = !DILocation(line: 81, column: 9, scope: !569)
!576 = !DILocation(line: 81, column: 3, scope: !569)
!577 = !DILocation(line: 82, column: 1, scope: !569)
!578 = distinct !DISubprogram(name: "find_dir_entry", scope: !3, file: !3, line: 153, type: !579, scopeLine: 155, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!579 = !DISubroutineType(types: !580)
!580 = !{null, !581, !376, !74}
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!582 = !DILocalVariable(name: "dot_sb", arg: 1, scope: !578, file: !3, line: 153, type: !581)
!583 = !DILocation(line: 153, column: 30, scope: !578)
!584 = !DILocalVariable(name: "file_name", arg: 2, scope: !578, file: !3, line: 153, type: !376)
!585 = !DILocation(line: 153, column: 56, scope: !578)
!586 = !DILocalVariable(name: "parent_height", arg: 3, scope: !578, file: !3, line: 154, type: !74)
!587 = !DILocation(line: 154, column: 24, scope: !578)
!588 = !DILocalVariable(name: "dirp", scope: !578, file: !3, line: 156, type: !589)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !591, line: 127, baseType: !592)
!591 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!592 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !591, line: 127, flags: DIFlagFwdDecl)
!593 = !DILocation(line: 156, column: 8, scope: !578)
!594 = !DILocalVariable(name: "fd", scope: !578, file: !3, line: 157, type: !19)
!595 = !DILocation(line: 157, column: 7, scope: !578)
!596 = !DILocalVariable(name: "parent_sb", scope: !578, file: !3, line: 158, type: !397)
!597 = !DILocation(line: 158, column: 15, scope: !578)
!598 = !DILocalVariable(name: "use_lstat", scope: !578, file: !3, line: 159, type: !38)
!599 = !DILocation(line: 159, column: 8, scope: !578)
!600 = !DILocalVariable(name: "found", scope: !578, file: !3, line: 160, type: !38)
!601 = !DILocation(line: 160, column: 8, scope: !578)
!602 = !DILocation(line: 162, column: 10, scope: !578)
!603 = !DILocation(line: 162, column: 8, scope: !578)
!604 = !DILocation(line: 163, column: 7, scope: !605)
!605 = distinct !DILexicalBlock(scope: !578, file: !3, line: 163, column: 7)
!606 = !DILocation(line: 163, column: 12, scope: !605)
!607 = !DILocation(line: 163, column: 7, scope: !578)
!608 = !DILocation(line: 164, column: 5, scope: !605)
!609 = !DILocation(line: 167, column: 15, scope: !578)
!610 = !DILocation(line: 167, column: 8, scope: !578)
!611 = !DILocation(line: 167, column: 6, scope: !578)
!612 = !DILocation(line: 168, column: 13, scope: !613)
!613 = distinct !DILexicalBlock(scope: !578, file: !3, line: 168, column: 7)
!614 = !DILocation(line: 168, column: 10, scope: !613)
!615 = !DILocation(line: 168, column: 8, scope: !613)
!616 = !DILocation(line: 168, column: 26, scope: !613)
!617 = !DILocation(line: 168, column: 18, scope: !613)
!618 = !DILocation(line: 168, column: 32, scope: !613)
!619 = !DILocation(line: 168, column: 46, scope: !613)
!620 = !DILocation(line: 168, column: 7, scope: !578)
!621 = !DILocation(line: 169, column: 5, scope: !613)
!622 = !DILocation(line: 172, column: 13, scope: !623)
!623 = distinct !DILexicalBlock(scope: !578, file: !3, line: 172, column: 7)
!624 = !DILocation(line: 172, column: 10, scope: !623)
!625 = !DILocation(line: 172, column: 8, scope: !623)
!626 = !DILocation(line: 172, column: 25, scope: !623)
!627 = !DILocation(line: 172, column: 18, scope: !623)
!628 = !DILocation(line: 172, column: 43, scope: !623)
!629 = !DILocation(line: 172, column: 67, scope: !623)
!630 = !DILocation(line: 172, column: 7, scope: !578)
!631 = !DILocation(line: 173, column: 5, scope: !623)
!632 = !DILocation(line: 178, column: 26, scope: !578)
!633 = !DILocation(line: 178, column: 36, scope: !578)
!634 = !DILocation(line: 178, column: 44, scope: !578)
!635 = !DILocation(line: 178, column: 33, scope: !578)
!636 = !DILocation(line: 178, column: 13, scope: !578)
!637 = !DILocation(line: 180, column: 9, scope: !578)
!638 = !DILocation(line: 181, column: 3, scope: !578)
!639 = !DILocalVariable(name: "dp", scope: !640, file: !3, line: 183, type: !641)
!640 = distinct !DILexicalBlock(scope: !578, file: !3, line: 182, column: 5)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !644, line: 22, size: 2240, elements: !645)
!644 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!645 = !{!646, !647, !648, !649, !650}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !643, file: !644, line: 25, baseType: !404, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !643, file: !644, line: 26, baseType: !416, size: 64, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !643, file: !644, line: 31, baseType: !73, size: 16, offset: 128)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !643, file: !644, line: 32, baseType: !148, size: 8, offset: 144)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !643, file: !644, line: 33, baseType: !105, size: 2048, offset: 152)
!651 = !DILocation(line: 183, column: 28, scope: !640)
!652 = !DILocalVariable(name: "ent_sb", scope: !640, file: !3, line: 184, type: !397)
!653 = !DILocation(line: 184, column: 19, scope: !640)
!654 = !DILocalVariable(name: "ino", scope: !640, file: !3, line: 185, type: !529)
!655 = !DILocation(line: 185, column: 13, scope: !640)
!656 = !DILocation(line: 187, column: 7, scope: !640)
!657 = !DILocation(line: 187, column: 13, scope: !640)
!658 = !DILocation(line: 188, column: 50, scope: !659)
!659 = distinct !DILexicalBlock(scope: !640, file: !3, line: 188, column: 11)
!660 = !DILocation(line: 188, column: 17, scope: !659)
!661 = !DILocation(line: 188, column: 15, scope: !659)
!662 = !DILocation(line: 188, column: 57, scope: !659)
!663 = !DILocation(line: 188, column: 11, scope: !640)
!664 = !DILocation(line: 190, column: 15, scope: !665)
!665 = distinct !DILexicalBlock(scope: !666, file: !3, line: 190, column: 15)
!666 = distinct !DILexicalBlock(scope: !659, file: !3, line: 189, column: 9)
!667 = !DILocation(line: 190, column: 15, scope: !666)
!668 = !DILocalVariable(name: "e", scope: !669, file: !3, line: 193, type: !19)
!669 = distinct !DILexicalBlock(scope: !665, file: !3, line: 191, column: 13)
!670 = !DILocation(line: 193, column: 19, scope: !669)
!671 = !DILocation(line: 193, column: 23, scope: !669)
!672 = !DILocation(line: 194, column: 25, scope: !669)
!673 = !DILocation(line: 194, column: 15, scope: !669)
!674 = !DILocation(line: 195, column: 23, scope: !669)
!675 = !DILocation(line: 195, column: 15, scope: !669)
!676 = !DILocation(line: 195, column: 21, scope: !669)
!677 = !DILocation(line: 198, column: 20, scope: !669)
!678 = !DILocation(line: 199, column: 13, scope: !669)
!679 = !DILocation(line: 200, column: 11, scope: !666)
!680 = !DILocation(line: 203, column: 13, scope: !640)
!681 = !DILocation(line: 203, column: 11, scope: !640)
!682 = !DILocation(line: 205, column: 11, scope: !683)
!683 = distinct !DILexicalBlock(scope: !640, file: !3, line: 205, column: 11)
!684 = !DILocation(line: 205, column: 15, scope: !683)
!685 = !DILocation(line: 205, column: 38, scope: !683)
!686 = !DILocation(line: 205, column: 41, scope: !683)
!687 = !DILocation(line: 205, column: 11, scope: !640)
!688 = !DILocation(line: 207, column: 22, scope: !689)
!689 = distinct !DILexicalBlock(scope: !690, file: !3, line: 207, column: 15)
!690 = distinct !DILexicalBlock(scope: !683, file: !3, line: 206, column: 9)
!691 = !DILocation(line: 207, column: 26, scope: !689)
!692 = !DILocation(line: 207, column: 15, scope: !689)
!693 = !DILocation(line: 207, column: 43, scope: !689)
!694 = !DILocation(line: 207, column: 15, scope: !690)
!695 = !DILocation(line: 210, column: 15, scope: !696)
!696 = distinct !DILexicalBlock(scope: !689, file: !3, line: 208, column: 13)
!697 = distinct !{!697, !638, !698}
!698 = !DILocation(line: 226, column: 5, scope: !578)
!699 = !DILocation(line: 212, column: 24, scope: !690)
!700 = !DILocation(line: 212, column: 15, scope: !690)
!701 = !DILocation(line: 213, column: 9, scope: !690)
!702 = !DILocation(line: 215, column: 11, scope: !703)
!703 = distinct !DILexicalBlock(scope: !640, file: !3, line: 215, column: 11)
!704 = !DILocation(line: 215, column: 18, scope: !703)
!705 = !DILocation(line: 215, column: 26, scope: !703)
!706 = !DILocation(line: 215, column: 15, scope: !703)
!707 = !DILocation(line: 215, column: 11, scope: !640)
!708 = !DILocation(line: 216, column: 9, scope: !703)
!709 = !DILocation(line: 220, column: 14, scope: !710)
!710 = distinct !DILexicalBlock(scope: !640, file: !3, line: 220, column: 12)
!711 = !DILocation(line: 220, column: 24, scope: !710)
!712 = !DILocation(line: 220, column: 34, scope: !710)
!713 = !DILocation(line: 220, column: 44, scope: !710)
!714 = !DILocation(line: 220, column: 52, scope: !710)
!715 = !DILocation(line: 220, column: 41, scope: !710)
!716 = !DILocation(line: 220, column: 12, scope: !640)
!717 = !DILocation(line: 222, column: 30, scope: !718)
!718 = distinct !DILexicalBlock(scope: !710, file: !3, line: 221, column: 9)
!719 = !DILocation(line: 222, column: 41, scope: !718)
!720 = !DILocation(line: 222, column: 45, scope: !718)
!721 = !DILocation(line: 222, column: 53, scope: !718)
!722 = !DILocation(line: 222, column: 11, scope: !718)
!723 = !DILocation(line: 223, column: 17, scope: !718)
!724 = !DILocation(line: 224, column: 11, scope: !718)
!725 = !DILocation(line: 228, column: 7, scope: !726)
!726 = distinct !DILexicalBlock(scope: !578, file: !3, line: 228, column: 7)
!727 = !DILocation(line: 228, column: 12, scope: !726)
!728 = !DILocation(line: 228, column: 20, scope: !726)
!729 = !DILocation(line: 228, column: 33, scope: !726)
!730 = !DILocation(line: 228, column: 23, scope: !726)
!731 = !DILocation(line: 228, column: 39, scope: !726)
!732 = !DILocation(line: 228, column: 7, scope: !578)
!733 = !DILocation(line: 232, column: 7, scope: !734)
!734 = distinct !DILexicalBlock(scope: !726, file: !3, line: 229, column: 5)
!735 = !DILocation(line: 236, column: 10, scope: !736)
!736 = distinct !DILexicalBlock(scope: !578, file: !3, line: 236, column: 8)
!737 = !DILocation(line: 236, column: 8, scope: !578)
!738 = !DILocation(line: 237, column: 5, scope: !736)
!739 = !DILocation(line: 241, column: 4, scope: !578)
!740 = !DILocation(line: 241, column: 13, scope: !578)
!741 = !DILocation(line: 242, column: 1, scope: !578)
!742 = distinct !DISubprogram(name: "file_name_prepend", scope: !3, file: !3, line: 101, type: !743, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!743 = !DISubroutineType(types: !744)
!744 = !{null, !376, !16, !74}
!745 = !DILocalVariable(name: "p", arg: 1, scope: !742, file: !3, line: 101, type: !376)
!746 = !DILocation(line: 101, column: 38, scope: !742)
!747 = !DILocalVariable(name: "s", arg: 2, scope: !742, file: !3, line: 101, type: !16)
!748 = !DILocation(line: 101, column: 53, scope: !742)
!749 = !DILocalVariable(name: "s_len", arg: 3, scope: !742, file: !3, line: 101, type: !74)
!750 = !DILocation(line: 101, column: 63, scope: !742)
!751 = !DILocalVariable(name: "n_free", scope: !742, file: !3, line: 103, type: !74)
!752 = !DILocation(line: 103, column: 10, scope: !742)
!753 = !DILocation(line: 103, column: 19, scope: !742)
!754 = !DILocation(line: 103, column: 22, scope: !742)
!755 = !DILocation(line: 103, column: 30, scope: !742)
!756 = !DILocation(line: 103, column: 33, scope: !742)
!757 = !DILocation(line: 103, column: 28, scope: !742)
!758 = !DILocation(line: 104, column: 7, scope: !759)
!759 = distinct !DILexicalBlock(scope: !742, file: !3, line: 104, column: 7)
!760 = !DILocation(line: 104, column: 20, scope: !759)
!761 = !DILocation(line: 104, column: 18, scope: !759)
!762 = !DILocation(line: 104, column: 14, scope: !759)
!763 = !DILocation(line: 104, column: 7, scope: !742)
!764 = !DILocalVariable(name: "half", scope: !765, file: !3, line: 106, type: !74)
!765 = distinct !DILexicalBlock(scope: !759, file: !3, line: 105, column: 5)
!766 = !DILocation(line: 106, column: 14, scope: !765)
!767 = !DILocation(line: 106, column: 21, scope: !765)
!768 = !DILocation(line: 106, column: 24, scope: !765)
!769 = !DILocation(line: 106, column: 32, scope: !765)
!770 = !DILocation(line: 106, column: 38, scope: !765)
!771 = !DILocation(line: 106, column: 36, scope: !765)
!772 = !DILocalVariable(name: "q", scope: !765, file: !3, line: 111, type: !7)
!773 = !DILocation(line: 111, column: 13, scope: !765)
!774 = !DILocation(line: 111, column: 30, scope: !765)
!775 = !DILocation(line: 111, column: 17, scope: !765)
!776 = !DILocalVariable(name: "n_used", scope: !765, file: !3, line: 112, type: !74)
!777 = !DILocation(line: 112, column: 14, scope: !765)
!778 = !DILocation(line: 112, column: 23, scope: !765)
!779 = !DILocation(line: 112, column: 26, scope: !765)
!780 = !DILocation(line: 112, column: 36, scope: !765)
!781 = !DILocation(line: 112, column: 34, scope: !765)
!782 = !DILocation(line: 113, column: 18, scope: !765)
!783 = !DILocation(line: 113, column: 26, scope: !765)
!784 = !DILocation(line: 113, column: 24, scope: !765)
!785 = !DILocation(line: 113, column: 20, scope: !765)
!786 = !DILocation(line: 113, column: 33, scope: !765)
!787 = !DILocation(line: 113, column: 31, scope: !765)
!788 = !DILocation(line: 113, column: 7, scope: !765)
!789 = !DILocation(line: 113, column: 10, scope: !765)
!790 = !DILocation(line: 113, column: 16, scope: !765)
!791 = !DILocation(line: 114, column: 15, scope: !765)
!792 = !DILocation(line: 114, column: 18, scope: !765)
!793 = !DILocation(line: 114, column: 25, scope: !765)
!794 = !DILocation(line: 114, column: 28, scope: !765)
!795 = !DILocation(line: 114, column: 34, scope: !765)
!796 = !DILocation(line: 114, column: 32, scope: !765)
!797 = !DILocation(line: 114, column: 42, scope: !765)
!798 = !DILocation(line: 114, column: 7, scope: !765)
!799 = !DILocation(line: 115, column: 13, scope: !765)
!800 = !DILocation(line: 115, column: 16, scope: !765)
!801 = !DILocation(line: 115, column: 7, scope: !765)
!802 = !DILocation(line: 116, column: 16, scope: !765)
!803 = !DILocation(line: 116, column: 7, scope: !765)
!804 = !DILocation(line: 116, column: 10, scope: !765)
!805 = !DILocation(line: 116, column: 14, scope: !765)
!806 = !DILocation(line: 117, column: 24, scope: !765)
!807 = !DILocation(line: 117, column: 22, scope: !765)
!808 = !DILocation(line: 117, column: 7, scope: !765)
!809 = !DILocation(line: 117, column: 10, scope: !765)
!810 = !DILocation(line: 117, column: 18, scope: !765)
!811 = !DILocation(line: 118, column: 5, scope: !765)
!812 = !DILocation(line: 120, column: 19, scope: !742)
!813 = !DILocation(line: 120, column: 17, scope: !742)
!814 = !DILocation(line: 120, column: 3, scope: !742)
!815 = !DILocation(line: 120, column: 6, scope: !742)
!816 = !DILocation(line: 120, column: 12, scope: !742)
!817 = !DILocation(line: 121, column: 3, scope: !742)
!818 = !DILocation(line: 121, column: 6, scope: !742)
!819 = !DILocation(line: 121, column: 15, scope: !742)
!820 = !DILocation(line: 122, column: 11, scope: !742)
!821 = !DILocation(line: 122, column: 14, scope: !742)
!822 = !DILocation(line: 122, column: 20, scope: !742)
!823 = !DILocation(line: 122, column: 25, scope: !742)
!824 = !DILocation(line: 122, column: 28, scope: !742)
!825 = !DILocation(line: 122, column: 3, scope: !742)
!826 = !DILocation(line: 123, column: 1, scope: !742)
!827 = !DILocalVariable(name: "p", arg: 1, scope: !828, file: !3, line: 101, type: !831)
!828 = distinct !DISubprogram(name: "file_name_prepend", scope: !3, file: !3, line: 101, type: !829, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !837, retainedNodes: !4)
!829 = !DISubroutineType(types: !830)
!830 = !{null, !831, !16, !74}
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 34, size: 192, elements: !833)
!833 = !{!834, !835, !836}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !832, file: !3, line: 36, baseType: !7, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !832, file: !3, line: 37, baseType: !74, size: 64, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !832, file: !3, line: 38, baseType: !7, size: 64, offset: 128)
!837 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !838, nameTableKind: None)
!838 = !{!839}
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(name: "longopts", scope: !837, file: !3, line: 41, type: !841, isLocal: true, isDefinition: true)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !842, size: 1280, elements: !23)
!842 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !843)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !844)
!844 = !{!845, !846, !847, !848}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !843, file: !13, line: 52, baseType: !16, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !843, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !843, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !843, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!849 = !DILocalVariable(name: "s", arg: 2, scope: !828, file: !3, line: 101, type: !16)
!850 = !DILocalVariable(name: "s_len", arg: 3, scope: !828, file: !3, line: 101, type: !74)
!851 = !DILocalVariable(name: "n_free", scope: !828, file: !3, line: 103, type: !74)
!852 = distinct !DISubprogram(name: "nth_parent", scope: !3, file: !3, line: 127, type: !853, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!853 = !DISubroutineType(types: !854)
!854 = !{!7, !74}
!855 = !DILocalVariable(name: "n", arg: 1, scope: !852, file: !3, line: 127, type: !74)
!856 = !DILocation(line: 127, column: 20, scope: !852)
!857 = !DILocalVariable(name: "buf", scope: !852, file: !3, line: 129, type: !7)
!858 = !DILocation(line: 129, column: 9, scope: !852)
!859 = !DILocation(line: 129, column: 28, scope: !852)
!860 = !DILocation(line: 129, column: 15, scope: !852)
!861 = !DILocalVariable(name: "p", scope: !852, file: !3, line: 130, type: !7)
!862 = !DILocation(line: 130, column: 9, scope: !852)
!863 = !DILocation(line: 130, column: 13, scope: !852)
!864 = !DILocalVariable(name: "i", scope: !865, file: !3, line: 132, type: !74)
!865 = distinct !DILexicalBlock(scope: !852, file: !3, line: 132, column: 3)
!866 = !DILocation(line: 132, column: 15, scope: !865)
!867 = !DILocation(line: 132, column: 8, scope: !865)
!868 = !DILocation(line: 132, column: 22, scope: !869)
!869 = distinct !DILexicalBlock(scope: !865, file: !3, line: 132, column: 3)
!870 = !DILocation(line: 132, column: 26, scope: !869)
!871 = !DILocation(line: 132, column: 24, scope: !869)
!872 = !DILocation(line: 132, column: 3, scope: !865)
!873 = !DILocation(line: 134, column: 15, scope: !874)
!874 = distinct !DILexicalBlock(scope: !869, file: !3, line: 133, column: 5)
!875 = !DILocation(line: 134, column: 7, scope: !874)
!876 = !DILocation(line: 135, column: 9, scope: !874)
!877 = !DILocation(line: 136, column: 5, scope: !874)
!878 = !DILocation(line: 132, column: 30, scope: !869)
!879 = !DILocation(line: 132, column: 3, scope: !869)
!880 = distinct !{!880, !872, !881}
!881 = !DILocation(line: 136, column: 5, scope: !865)
!882 = !DILocation(line: 137, column: 3, scope: !852)
!883 = !DILocation(line: 137, column: 9, scope: !852)
!884 = !DILocation(line: 138, column: 10, scope: !852)
!885 = !DILocation(line: 138, column: 3, scope: !852)
!886 = distinct !DISubprogram(name: "readdir_ignoring_dot_and_dotdot", scope: !212, file: !212, line: 278, type: !887, scopeLine: 279, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!887 = !DISubroutineType(types: !888)
!888 = !{!641, !589}
!889 = !DILocalVariable(name: "dirp", arg: 1, scope: !886, file: !212, line: 278, type: !589)
!890 = !DILocation(line: 278, column: 39, scope: !886)
!891 = !DILocation(line: 280, column: 3, scope: !886)
!892 = !DILocalVariable(name: "dp", scope: !893, file: !212, line: 282, type: !641)
!893 = distinct !DILexicalBlock(scope: !886, file: !212, line: 281, column: 5)
!894 = !DILocation(line: 282, column: 28, scope: !893)
!895 = !DILocation(line: 282, column: 42, scope: !893)
!896 = !DILocation(line: 282, column: 33, scope: !893)
!897 = !DILocation(line: 283, column: 11, scope: !898)
!898 = distinct !DILexicalBlock(scope: !893, file: !212, line: 283, column: 11)
!899 = !DILocation(line: 283, column: 14, scope: !898)
!900 = !DILocation(line: 283, column: 22, scope: !898)
!901 = !DILocation(line: 283, column: 42, scope: !898)
!902 = !DILocation(line: 283, column: 46, scope: !898)
!903 = !DILocation(line: 283, column: 27, scope: !898)
!904 = !DILocation(line: 283, column: 11, scope: !893)
!905 = !DILocation(line: 284, column: 16, scope: !898)
!906 = !DILocation(line: 284, column: 9, scope: !898)
!907 = distinct !{!907, !891, !908}
!908 = !DILocation(line: 285, column: 5, scope: !886)
!909 = distinct !DISubprogram(name: "dot_or_dotdot", scope: !212, file: !212, line: 265, type: !910, scopeLine: 266, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!910 = !DISubroutineType(types: !911)
!911 = !{!38, !16}
!912 = !DILocalVariable(name: "file_name", arg: 1, scope: !909, file: !212, line: 265, type: !16)
!913 = !DILocation(line: 265, column: 28, scope: !909)
!914 = !DILocation(line: 267, column: 7, scope: !915)
!915 = distinct !DILexicalBlock(scope: !909, file: !212, line: 267, column: 7)
!916 = !DILocation(line: 267, column: 20, scope: !915)
!917 = !DILocation(line: 267, column: 7, scope: !909)
!918 = !DILocalVariable(name: "sep", scope: !919, file: !212, line: 269, type: !8)
!919 = distinct !DILexicalBlock(scope: !915, file: !212, line: 268, column: 5)
!920 = !DILocation(line: 269, column: 12, scope: !919)
!921 = !DILocation(line: 269, column: 18, scope: !919)
!922 = !DILocation(line: 269, column: 29, scope: !919)
!923 = !DILocation(line: 269, column: 42, scope: !919)
!924 = !DILocation(line: 269, column: 50, scope: !919)
!925 = !DILocation(line: 270, column: 17, scope: !919)
!926 = !DILocation(line: 270, column: 21, scope: !919)
!927 = !DILocation(line: 270, column: 24, scope: !919)
!928 = !DILocation(line: 270, column: 7, scope: !919)
!929 = !DILocation(line: 273, column: 5, scope: !915)
!930 = !DILocation(line: 274, column: 1, scope: !909)
!931 = !DILocalVariable(name: "file_name", arg: 1, scope: !932, file: !212, line: 265, type: !16)
!932 = distinct !DISubprogram(name: "dot_or_dotdot", scope: !212, file: !212, line: 265, type: !910, scopeLine: 266, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !933, retainedNodes: !4)
!933 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !934, nameTableKind: None)
!934 = !{!935}
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(name: "longopts", scope: !933, file: !3, line: 41, type: !937, isLocal: true, isDefinition: true)
!937 = !DICompositeType(tag: DW_TAG_array_type, baseType: !938, size: 1280, elements: !23)
!938 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !940)
!940 = !{!941, !942, !943, !944}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !939, file: !13, line: 52, baseType: !16, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !939, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !939, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !939, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!945 = distinct !DISubprogram(name: "close_stdout", scope: !37, file: !37, line: 117, type: !946, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !32, retainedNodes: !4)
!946 = !DISubroutineType(types: !947)
!947 = !{null}
!948 = !DILocation(line: 119, column: 21, scope: !949)
!949 = distinct !DILexicalBlock(scope: !945, file: !37, line: 119, column: 7)
!950 = !DILocation(line: 119, column: 7, scope: !949)
!951 = !DILocation(line: 119, column: 29, scope: !949)
!952 = !DILocation(line: 120, column: 7, scope: !949)
!953 = !DILocation(line: 120, column: 12, scope: !949)
!954 = !DILocation(line: 120, column: 25, scope: !949)
!955 = !DILocation(line: 120, column: 28, scope: !949)
!956 = !DILocation(line: 120, column: 34, scope: !949)
!957 = !DILocation(line: 119, column: 7, scope: !945)
!958 = !DILocalVariable(name: "write_error", scope: !959, file: !37, line: 122, type: !16)
!959 = distinct !DILexicalBlock(scope: !949, file: !37, line: 121, column: 5)
!960 = !DILocation(line: 122, column: 19, scope: !959)
!961 = !DILocation(line: 122, column: 33, scope: !959)
!962 = !DILocation(line: 123, column: 11, scope: !963)
!963 = distinct !DILexicalBlock(scope: !959, file: !37, line: 123, column: 11)
!964 = !DILocation(line: 123, column: 11, scope: !959)
!965 = !DILocation(line: 124, column: 19, scope: !963)
!966 = !DILocation(line: 124, column: 52, scope: !963)
!967 = !DILocation(line: 124, column: 36, scope: !963)
!968 = !DILocation(line: 125, column: 16, scope: !963)
!969 = !DILocation(line: 124, column: 9, scope: !963)
!970 = !DILocation(line: 127, column: 19, scope: !963)
!971 = !DILocation(line: 127, column: 32, scope: !963)
!972 = !DILocation(line: 127, column: 9, scope: !963)
!973 = !DILocation(line: 129, column: 14, scope: !959)
!974 = !DILocation(line: 129, column: 7, scope: !959)
!975 = !DILocation(line: 134, column: 42, scope: !976)
!976 = distinct !DILexicalBlock(scope: !945, file: !37, line: 134, column: 7)
!977 = !DILocation(line: 134, column: 28, scope: !976)
!978 = !DILocation(line: 134, column: 50, scope: !976)
!979 = !DILocation(line: 134, column: 7, scope: !945)
!980 = !DILocation(line: 135, column: 12, scope: !976)
!981 = !DILocation(line: 135, column: 5, scope: !976)
!982 = !DILocation(line: 136, column: 1, scope: !945)
!983 = distinct !DISubprogram(name: "set_program_name", scope: !51, file: !51, line: 39, type: !213, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !4)
!984 = !DILocalVariable(name: "argv0", arg: 1, scope: !983, file: !51, line: 39, type: !16)
!985 = !DILocation(line: 39, column: 31, scope: !983)
!986 = !DILocalVariable(name: "slash", scope: !983, file: !51, line: 46, type: !16)
!987 = !DILocation(line: 46, column: 15, scope: !983)
!988 = !DILocalVariable(name: "base", scope: !983, file: !51, line: 47, type: !16)
!989 = !DILocation(line: 47, column: 15, scope: !983)
!990 = !DILocation(line: 51, column: 7, scope: !991)
!991 = distinct !DILexicalBlock(scope: !983, file: !51, line: 51, column: 7)
!992 = !DILocation(line: 51, column: 13, scope: !991)
!993 = !DILocation(line: 51, column: 7, scope: !983)
!994 = !DILocation(line: 55, column: 14, scope: !995)
!995 = distinct !DILexicalBlock(scope: !991, file: !51, line: 52, column: 5)
!996 = !DILocation(line: 54, column: 7, scope: !995)
!997 = !DILocation(line: 56, column: 7, scope: !995)
!998 = !DILocation(line: 59, column: 20, scope: !983)
!999 = !DILocation(line: 59, column: 11, scope: !983)
!1000 = !DILocation(line: 59, column: 9, scope: !983)
!1001 = !DILocation(line: 60, column: 11, scope: !983)
!1002 = !DILocation(line: 60, column: 17, scope: !983)
!1003 = !DILocation(line: 60, column: 27, scope: !983)
!1004 = !DILocation(line: 60, column: 33, scope: !983)
!1005 = !DILocation(line: 60, column: 39, scope: !983)
!1006 = !DILocation(line: 60, column: 8, scope: !983)
!1007 = !DILocation(line: 61, column: 7, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !983, file: !51, line: 61, column: 7)
!1009 = !DILocation(line: 61, column: 14, scope: !1008)
!1010 = !DILocation(line: 61, column: 12, scope: !1008)
!1011 = !DILocation(line: 61, column: 20, scope: !1008)
!1012 = !DILocation(line: 61, column: 25, scope: !1008)
!1013 = !DILocation(line: 61, column: 37, scope: !1008)
!1014 = !DILocation(line: 61, column: 42, scope: !1008)
!1015 = !DILocation(line: 61, column: 28, scope: !1008)
!1016 = !DILocation(line: 61, column: 61, scope: !1008)
!1017 = !DILocation(line: 61, column: 7, scope: !983)
!1018 = !DILocation(line: 63, column: 15, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !1008, file: !51, line: 62, column: 5)
!1020 = !DILocation(line: 63, column: 13, scope: !1019)
!1021 = !DILocation(line: 64, column: 20, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1019, file: !51, line: 64, column: 11)
!1023 = !DILocation(line: 64, column: 11, scope: !1022)
!1024 = !DILocation(line: 64, column: 36, scope: !1022)
!1025 = !DILocation(line: 64, column: 11, scope: !1019)
!1026 = !DILocation(line: 66, column: 19, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !1022, file: !51, line: 65, column: 9)
!1028 = !DILocation(line: 66, column: 24, scope: !1027)
!1029 = !DILocation(line: 66, column: 17, scope: !1027)
!1030 = !DILocation(line: 70, column: 52, scope: !1027)
!1031 = !DILocation(line: 70, column: 41, scope: !1027)
!1032 = !DILocation(line: 72, column: 9, scope: !1027)
!1033 = !DILocation(line: 73, column: 5, scope: !1019)
!1034 = !DILocation(line: 84, column: 18, scope: !983)
!1035 = !DILocation(line: 84, column: 16, scope: !983)
!1036 = !DILocation(line: 90, column: 38, scope: !983)
!1037 = !DILocation(line: 90, column: 27, scope: !983)
!1038 = !DILocation(line: 92, column: 1, scope: !983)
!1039 = distinct !DISubprogram(name: "set_char_quoting", scope: !80, file: !80, line: 152, type: !1040, scopeLine: 153, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !54, retainedNodes: !4)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!19, !1042, !8, !19}
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!1043 = !DILocalVariable(name: "o", arg: 1, scope: !1039, file: !80, line: 152, type: !1042)
!1044 = !DILocation(line: 152, column: 43, scope: !1039)
!1045 = !DILocalVariable(name: "c", arg: 2, scope: !1039, file: !80, line: 152, type: !8)
!1046 = !DILocation(line: 152, column: 51, scope: !1039)
!1047 = !DILocalVariable(name: "i", arg: 3, scope: !1039, file: !80, line: 152, type: !19)
!1048 = !DILocation(line: 152, column: 58, scope: !1039)
!1049 = !DILocalVariable(name: "uc", scope: !1039, file: !80, line: 154, type: !148)
!1050 = !DILocation(line: 154, column: 17, scope: !1039)
!1051 = !DILocation(line: 154, column: 22, scope: !1039)
!1052 = !DILocalVariable(name: "p", scope: !1039, file: !80, line: 155, type: !1053)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!1054 = !DILocation(line: 155, column: 17, scope: !1039)
!1055 = !DILocation(line: 156, column: 6, scope: !1039)
!1056 = !DILocation(line: 156, column: 10, scope: !1039)
!1057 = !DILocation(line: 156, column: 41, scope: !1039)
!1058 = !DILocation(line: 156, column: 5, scope: !1039)
!1059 = !DILocation(line: 156, column: 59, scope: !1039)
!1060 = !DILocation(line: 156, column: 62, scope: !1039)
!1061 = !DILocation(line: 156, column: 57, scope: !1039)
!1062 = !DILocalVariable(name: "shift", scope: !1039, file: !80, line: 157, type: !19)
!1063 = !DILocation(line: 157, column: 7, scope: !1039)
!1064 = !DILocation(line: 157, column: 15, scope: !1039)
!1065 = !DILocation(line: 157, column: 18, scope: !1039)
!1066 = !DILocalVariable(name: "r", scope: !1039, file: !80, line: 158, type: !19)
!1067 = !DILocation(line: 158, column: 7, scope: !1039)
!1068 = !DILocation(line: 158, column: 13, scope: !1039)
!1069 = !DILocation(line: 158, column: 12, scope: !1039)
!1070 = !DILocation(line: 158, column: 18, scope: !1039)
!1071 = !DILocation(line: 158, column: 15, scope: !1039)
!1072 = !DILocation(line: 158, column: 25, scope: !1039)
!1073 = !DILocation(line: 159, column: 11, scope: !1039)
!1074 = !DILocation(line: 159, column: 13, scope: !1039)
!1075 = !DILocation(line: 159, column: 20, scope: !1039)
!1076 = !DILocation(line: 159, column: 18, scope: !1039)
!1077 = !DILocation(line: 159, column: 26, scope: !1039)
!1078 = !DILocation(line: 159, column: 23, scope: !1039)
!1079 = !DILocation(line: 159, column: 4, scope: !1039)
!1080 = !DILocation(line: 159, column: 6, scope: !1039)
!1081 = !DILocation(line: 160, column: 10, scope: !1039)
!1082 = !DILocation(line: 160, column: 3, scope: !1039)
!1083 = !DILocalVariable(name: "o", arg: 1, scope: !1084, file: !80, line: 152, type: !1087)
!1084 = distinct !DISubprogram(name: "set_char_quoting", scope: !80, file: !80, line: 152, type: !1085, scopeLine: 153, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1095, retainedNodes: !4)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!19, !1087, !8, !19}
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !80, line: 65, size: 448, elements: !1089)
!1089 = !{!1090, !1091, !1092, !1093, !1094}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1088, file: !80, line: 68, baseType: !57, size: 32)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1088, file: !80, line: 71, baseType: !19, size: 32, offset: 32)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1088, file: !80, line: 75, baseType: !98, size: 256, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1088, file: !80, line: 78, baseType: !16, size: 64, offset: 320)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1088, file: !80, line: 81, baseType: !16, size: 64, offset: 384)
!1095 = distinct !DICompileUnit(language: DW_LANG_C99, file: !55, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, retainedTypes: !72, globals: !1096, nameTableKind: None)
!1096 = !{!1097, !1099, !1101, !1103, !1105, !1107, !1114, !1116}
!1097 = !DIGlobalVariableExpression(var: !1098, expr: !DIExpression())
!1098 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1095, file: !80, line: 85, type: !81, isLocal: false, isDefinition: true)
!1099 = !DIGlobalVariableExpression(var: !1100, expr: !DIExpression())
!1100 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1095, file: !80, line: 101, type: !87, isLocal: false, isDefinition: true)
!1101 = !DIGlobalVariableExpression(var: !1102, expr: !DIExpression())
!1102 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1095, file: !80, line: 1052, type: !1088, isLocal: false, isDefinition: true)
!1103 = !DIGlobalVariableExpression(var: !1104, expr: !DIExpression())
!1104 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1095, file: !80, line: 116, type: !1088, isLocal: true, isDefinition: true)
!1105 = !DIGlobalVariableExpression(var: !1106, expr: !DIExpression())
!1106 = distinct !DIGlobalVariable(name: "slot0", scope: !1095, file: !80, line: 842, type: !105, isLocal: true, isDefinition: true)
!1107 = !DIGlobalVariableExpression(var: !1108, expr: !DIExpression())
!1108 = distinct !DIGlobalVariable(name: "slotvec", scope: !1095, file: !80, line: 845, type: !1109, isLocal: true, isDefinition: true)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !80, line: 834, size: 128, elements: !1111)
!1111 = !{!1112, !1113}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1110, file: !80, line: 836, baseType: !74, size: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1110, file: !80, line: 837, baseType: !7, size: 64, offset: 64)
!1114 = !DIGlobalVariableExpression(var: !1115, expr: !DIExpression())
!1115 = distinct !DIGlobalVariable(name: "nslots", scope: !1095, file: !80, line: 843, type: !19, isLocal: true, isDefinition: true)
!1116 = !DIGlobalVariableExpression(var: !1117, expr: !DIExpression())
!1117 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1095, file: !80, line: 844, type: !1110, isLocal: true, isDefinition: true)
!1118 = !DILocalVariable(name: "c", arg: 2, scope: !1084, file: !80, line: 152, type: !8)
!1119 = !DILocalVariable(name: "i", arg: 3, scope: !1084, file: !80, line: 152, type: !19)
!1120 = !DILocalVariable(name: "uc", scope: !1084, file: !80, line: 154, type: !148)
!1121 = !DILocalVariable(name: "p", scope: !1084, file: !80, line: 155, type: !1053)
!1122 = distinct !DISubprogram(name: "quotearg_n_style", scope: !80, file: !80, line: 955, type: !1123, scopeLine: 956, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !54, retainedNodes: !4)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!7, !19, !57, !16}
!1125 = !DILocalVariable(name: "n", arg: 1, scope: !1122, file: !80, line: 955, type: !19)
!1126 = !DILocation(line: 955, column: 23, scope: !1122)
!1127 = !DILocalVariable(name: "s", arg: 2, scope: !1122, file: !80, line: 955, type: !57)
!1128 = !DILocation(line: 955, column: 45, scope: !1122)
!1129 = !DILocalVariable(name: "arg", arg: 3, scope: !1122, file: !80, line: 955, type: !16)
!1130 = !DILocation(line: 955, column: 60, scope: !1122)
!1131 = !DILocalVariable(name: "o", scope: !1122, file: !80, line: 957, type: !1132)
!1132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!1133 = !DILocation(line: 957, column: 32, scope: !1122)
!1134 = !DILocation(line: 957, column: 64, scope: !1122)
!1135 = !DILocation(line: 957, column: 36, scope: !1122)
!1136 = !DILocation(line: 958, column: 30, scope: !1122)
!1137 = !DILocation(line: 958, column: 33, scope: !1122)
!1138 = !DILocation(line: 958, column: 10, scope: !1122)
!1139 = !DILocation(line: 958, column: 3, scope: !1122)
!1140 = distinct !DISubprogram(name: "quoting_options_from_style", scope: !80, file: !80, line: 193, type: !1141, scopeLine: 194, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !54, retainedNodes: !4)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!93, !57}
!1143 = !DILocalVariable(name: "style", arg: 1, scope: !1140, file: !80, line: 193, type: !57)
!1144 = !DILocation(line: 193, column: 48, scope: !1140)
!1145 = !DILocalVariable(name: "o", scope: !1140, file: !80, line: 195, type: !93)
!1146 = !DILocation(line: 195, column: 26, scope: !1140)
!1147 = !DILocation(line: 196, column: 7, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1140, file: !80, line: 196, column: 7)
!1149 = !DILocation(line: 196, column: 13, scope: !1148)
!1150 = !DILocation(line: 196, column: 7, scope: !1140)
!1151 = !DILocation(line: 197, column: 5, scope: !1148)
!1152 = !DILocation(line: 198, column: 13, scope: !1140)
!1153 = !DILocation(line: 198, column: 5, scope: !1140)
!1154 = !DILocation(line: 198, column: 11, scope: !1140)
!1155 = !DILocation(line: 199, column: 3, scope: !1140)
!1156 = distinct !DISubprogram(name: "quotearg_n_options", scope: !80, file: !80, line: 877, type: !1157, scopeLine: 879, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !54, retainedNodes: !4)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!7, !19, !16, !74, !1159}
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1160 = !DILocalVariable(name: "n", arg: 1, scope: !1156, file: !80, line: 877, type: !19)
!1161 = !DILocation(line: 877, column: 25, scope: !1156)
!1162 = !DILocalVariable(name: "arg", arg: 2, scope: !1156, file: !80, line: 877, type: !16)
!1163 = !DILocation(line: 877, column: 40, scope: !1156)
!1164 = !DILocalVariable(name: "argsize", arg: 3, scope: !1156, file: !80, line: 877, type: !74)
!1165 = !DILocation(line: 877, column: 52, scope: !1156)
!1166 = !DILocalVariable(name: "options", arg: 4, scope: !1156, file: !80, line: 878, type: !1159)
!1167 = !DILocation(line: 878, column: 51, scope: !1156)
!1168 = !DILocalVariable(name: "e", scope: !1156, file: !80, line: 880, type: !19)
!1169 = !DILocation(line: 880, column: 7, scope: !1156)
!1170 = !DILocation(line: 880, column: 11, scope: !1156)
!1171 = !DILocalVariable(name: "sv", scope: !1156, file: !80, line: 882, type: !110)
!1172 = !DILocation(line: 882, column: 19, scope: !1156)
!1173 = !DILocation(line: 882, column: 24, scope: !1156)
!1174 = !DILocation(line: 884, column: 7, scope: !1175)
!1175 = distinct !DILexicalBlock(scope: !1156, file: !80, line: 884, column: 7)
!1176 = !DILocation(line: 884, column: 9, scope: !1175)
!1177 = !DILocation(line: 884, column: 7, scope: !1156)
!1178 = !DILocation(line: 885, column: 5, scope: !1175)
!1179 = !DILocation(line: 887, column: 7, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1156, file: !80, line: 887, column: 7)
!1181 = !DILocation(line: 887, column: 17, scope: !1180)
!1182 = !DILocation(line: 887, column: 14, scope: !1180)
!1183 = !DILocation(line: 887, column: 7, scope: !1156)
!1184 = !DILocalVariable(name: "preallocated", scope: !1185, file: !80, line: 889, type: !38)
!1185 = distinct !DILexicalBlock(scope: !1180, file: !80, line: 888, column: 5)
!1186 = !DILocation(line: 889, column: 12, scope: !1185)
!1187 = !DILocation(line: 889, column: 28, scope: !1185)
!1188 = !DILocation(line: 889, column: 31, scope: !1185)
!1189 = !DILocalVariable(name: "nmax", scope: !1185, file: !80, line: 890, type: !19)
!1190 = !DILocation(line: 890, column: 11, scope: !1185)
!1191 = !DILocation(line: 892, column: 11, scope: !1192)
!1192 = distinct !DILexicalBlock(scope: !1185, file: !80, line: 892, column: 11)
!1193 = !DILocation(line: 892, column: 18, scope: !1192)
!1194 = !DILocation(line: 892, column: 16, scope: !1192)
!1195 = !DILocation(line: 892, column: 11, scope: !1185)
!1196 = !DILocation(line: 893, column: 9, scope: !1192)
!1197 = !DILocation(line: 895, column: 32, scope: !1185)
!1198 = !DILocation(line: 895, column: 54, scope: !1185)
!1199 = !DILocation(line: 895, column: 59, scope: !1185)
!1200 = !DILocation(line: 895, column: 61, scope: !1185)
!1201 = !DILocation(line: 895, column: 58, scope: !1185)
!1202 = !DILocation(line: 895, column: 66, scope: !1185)
!1203 = !DILocation(line: 895, column: 22, scope: !1185)
!1204 = !DILocation(line: 895, column: 20, scope: !1185)
!1205 = !DILocation(line: 895, column: 15, scope: !1185)
!1206 = !DILocation(line: 896, column: 11, scope: !1207)
!1207 = distinct !DILexicalBlock(scope: !1185, file: !80, line: 896, column: 11)
!1208 = !DILocation(line: 896, column: 11, scope: !1185)
!1209 = !DILocation(line: 897, column: 10, scope: !1207)
!1210 = !DILocation(line: 897, column: 15, scope: !1207)
!1211 = !DILocation(line: 897, column: 9, scope: !1207)
!1212 = !DILocation(line: 898, column: 15, scope: !1185)
!1213 = !DILocation(line: 898, column: 20, scope: !1185)
!1214 = !DILocation(line: 898, column: 18, scope: !1185)
!1215 = !DILocation(line: 898, column: 7, scope: !1185)
!1216 = !DILocation(line: 898, column: 32, scope: !1185)
!1217 = !DILocation(line: 898, column: 34, scope: !1185)
!1218 = !DILocation(line: 898, column: 40, scope: !1185)
!1219 = !DILocation(line: 898, column: 38, scope: !1185)
!1220 = !DILocation(line: 898, column: 31, scope: !1185)
!1221 = !DILocation(line: 898, column: 48, scope: !1185)
!1222 = !DILocation(line: 899, column: 16, scope: !1185)
!1223 = !DILocation(line: 899, column: 18, scope: !1185)
!1224 = !DILocation(line: 899, column: 14, scope: !1185)
!1225 = !DILocation(line: 900, column: 5, scope: !1185)
!1226 = !DILocalVariable(name: "size", scope: !1227, file: !80, line: 903, type: !74)
!1227 = distinct !DILexicalBlock(scope: !1156, file: !80, line: 902, column: 3)
!1228 = !DILocation(line: 903, column: 12, scope: !1227)
!1229 = !DILocation(line: 903, column: 19, scope: !1227)
!1230 = !DILocation(line: 903, column: 22, scope: !1227)
!1231 = !DILocation(line: 903, column: 25, scope: !1227)
!1232 = !DILocalVariable(name: "val", scope: !1227, file: !80, line: 904, type: !7)
!1233 = !DILocation(line: 904, column: 11, scope: !1227)
!1234 = !DILocation(line: 904, column: 17, scope: !1227)
!1235 = !DILocation(line: 904, column: 20, scope: !1227)
!1236 = !DILocation(line: 904, column: 23, scope: !1227)
!1237 = !DILocalVariable(name: "flags", scope: !1227, file: !80, line: 906, type: !19)
!1238 = !DILocation(line: 906, column: 9, scope: !1227)
!1239 = !DILocation(line: 906, column: 17, scope: !1227)
!1240 = !DILocation(line: 906, column: 26, scope: !1227)
!1241 = !DILocation(line: 906, column: 32, scope: !1227)
!1242 = !DILocalVariable(name: "qsize", scope: !1227, file: !80, line: 907, type: !74)
!1243 = !DILocation(line: 907, column: 12, scope: !1227)
!1244 = !DILocation(line: 907, column: 46, scope: !1227)
!1245 = !DILocation(line: 907, column: 51, scope: !1227)
!1246 = !DILocation(line: 907, column: 57, scope: !1227)
!1247 = !DILocation(line: 907, column: 62, scope: !1227)
!1248 = !DILocation(line: 908, column: 46, scope: !1227)
!1249 = !DILocation(line: 908, column: 55, scope: !1227)
!1250 = !DILocation(line: 908, column: 62, scope: !1227)
!1251 = !DILocation(line: 909, column: 46, scope: !1227)
!1252 = !DILocation(line: 909, column: 55, scope: !1227)
!1253 = !DILocation(line: 910, column: 46, scope: !1227)
!1254 = !DILocation(line: 910, column: 55, scope: !1227)
!1255 = !DILocation(line: 911, column: 46, scope: !1227)
!1256 = !DILocation(line: 911, column: 55, scope: !1227)
!1257 = !DILocation(line: 907, column: 20, scope: !1227)
!1258 = !DILocation(line: 913, column: 9, scope: !1259)
!1259 = distinct !DILexicalBlock(scope: !1227, file: !80, line: 913, column: 9)
!1260 = !DILocation(line: 913, column: 17, scope: !1259)
!1261 = !DILocation(line: 913, column: 14, scope: !1259)
!1262 = !DILocation(line: 913, column: 9, scope: !1227)
!1263 = !DILocation(line: 915, column: 29, scope: !1264)
!1264 = distinct !DILexicalBlock(scope: !1259, file: !80, line: 914, column: 7)
!1265 = !DILocation(line: 915, column: 35, scope: !1264)
!1266 = !DILocation(line: 915, column: 27, scope: !1264)
!1267 = !DILocation(line: 915, column: 9, scope: !1264)
!1268 = !DILocation(line: 915, column: 12, scope: !1264)
!1269 = !DILocation(line: 915, column: 15, scope: !1264)
!1270 = !DILocation(line: 915, column: 20, scope: !1264)
!1271 = !DILocation(line: 916, column: 13, scope: !1272)
!1272 = distinct !DILexicalBlock(scope: !1264, file: !80, line: 916, column: 13)
!1273 = !DILocation(line: 916, column: 17, scope: !1272)
!1274 = !DILocation(line: 916, column: 13, scope: !1264)
!1275 = !DILocation(line: 917, column: 17, scope: !1272)
!1276 = !DILocation(line: 917, column: 11, scope: !1272)
!1277 = !DILocation(line: 918, column: 39, scope: !1264)
!1278 = !DILocation(line: 918, column: 27, scope: !1264)
!1279 = !DILocation(line: 918, column: 25, scope: !1264)
!1280 = !DILocation(line: 918, column: 9, scope: !1264)
!1281 = !DILocation(line: 918, column: 12, scope: !1264)
!1282 = !DILocation(line: 918, column: 15, scope: !1264)
!1283 = !DILocation(line: 918, column: 19, scope: !1264)
!1284 = !DILocation(line: 919, column: 35, scope: !1264)
!1285 = !DILocation(line: 919, column: 40, scope: !1264)
!1286 = !DILocation(line: 919, column: 46, scope: !1264)
!1287 = !DILocation(line: 919, column: 51, scope: !1264)
!1288 = !DILocation(line: 919, column: 60, scope: !1264)
!1289 = !DILocation(line: 919, column: 69, scope: !1264)
!1290 = !DILocation(line: 920, column: 35, scope: !1264)
!1291 = !DILocation(line: 920, column: 42, scope: !1264)
!1292 = !DILocation(line: 920, column: 51, scope: !1264)
!1293 = !DILocation(line: 921, column: 35, scope: !1264)
!1294 = !DILocation(line: 921, column: 44, scope: !1264)
!1295 = !DILocation(line: 922, column: 35, scope: !1264)
!1296 = !DILocation(line: 922, column: 44, scope: !1264)
!1297 = !DILocation(line: 919, column: 9, scope: !1264)
!1298 = !DILocation(line: 923, column: 7, scope: !1264)
!1299 = !DILocation(line: 925, column: 13, scope: !1227)
!1300 = !DILocation(line: 925, column: 5, scope: !1227)
!1301 = !DILocation(line: 925, column: 11, scope: !1227)
!1302 = !DILocation(line: 926, column: 12, scope: !1227)
!1303 = !DILocation(line: 926, column: 5, scope: !1227)
!1304 = !DILocalVariable(name: "nmax", scope: !1305, file: !80, line: 890, type: !19)
!1305 = distinct !DILexicalBlock(scope: !1306, file: !80, line: 888, column: 5)
!1306 = distinct !DILexicalBlock(scope: !1307, file: !80, line: 887, column: 7)
!1307 = distinct !DISubprogram(name: "quotearg_n_options", scope: !80, file: !80, line: 877, type: !1308, scopeLine: 879, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1319, retainedNodes: !4)
!1308 = !DISubroutineType(types: !1309)
!1309 = !{!7, !19, !16, !74, !1310}
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64)
!1311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1312)
!1312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !80, line: 65, size: 448, elements: !1313)
!1313 = !{!1314, !1315, !1316, !1317, !1318}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1312, file: !80, line: 68, baseType: !57, size: 32)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1312, file: !80, line: 71, baseType: !19, size: 32, offset: 32)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1312, file: !80, line: 75, baseType: !98, size: 256, offset: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1312, file: !80, line: 78, baseType: !16, size: 64, offset: 320)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1312, file: !80, line: 81, baseType: !16, size: 64, offset: 384)
!1319 = distinct !DICompileUnit(language: DW_LANG_C99, file: !55, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, retainedTypes: !72, globals: !1320, nameTableKind: None)
!1320 = !{!1321, !1323, !1325, !1327, !1329, !1331, !1338, !1340}
!1321 = !DIGlobalVariableExpression(var: !1322, expr: !DIExpression())
!1322 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1319, file: !80, line: 85, type: !81, isLocal: false, isDefinition: true)
!1323 = !DIGlobalVariableExpression(var: !1324, expr: !DIExpression())
!1324 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1319, file: !80, line: 101, type: !87, isLocal: false, isDefinition: true)
!1325 = !DIGlobalVariableExpression(var: !1326, expr: !DIExpression())
!1326 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1319, file: !80, line: 1052, type: !1312, isLocal: false, isDefinition: true)
!1327 = !DIGlobalVariableExpression(var: !1328, expr: !DIExpression())
!1328 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1319, file: !80, line: 116, type: !1312, isLocal: true, isDefinition: true)
!1329 = !DIGlobalVariableExpression(var: !1330, expr: !DIExpression())
!1330 = distinct !DIGlobalVariable(name: "slot0", scope: !1319, file: !80, line: 842, type: !105, isLocal: true, isDefinition: true)
!1331 = !DIGlobalVariableExpression(var: !1332, expr: !DIExpression())
!1332 = distinct !DIGlobalVariable(name: "slotvec", scope: !1319, file: !80, line: 845, type: !1333, isLocal: true, isDefinition: true)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64)
!1334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !80, line: 834, size: 128, elements: !1335)
!1335 = !{!1336, !1337}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1334, file: !80, line: 836, baseType: !74, size: 64)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1334, file: !80, line: 837, baseType: !7, size: 64, offset: 64)
!1338 = !DIGlobalVariableExpression(var: !1339, expr: !DIExpression())
!1339 = distinct !DIGlobalVariable(name: "nslots", scope: !1319, file: !80, line: 843, type: !19, isLocal: true, isDefinition: true)
!1340 = !DIGlobalVariableExpression(var: !1341, expr: !DIExpression())
!1341 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1319, file: !80, line: 844, type: !1334, isLocal: true, isDefinition: true)
