; ModuleID = '<stdin>'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.file_name = type { i8*, i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.dev_ino, %struct.dev_ino, %struct.dev_ino, [3 x i64] }
%struct.dev_ino = type { i64, i64 }
%struct.__dirstream = type opaque
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external dso_local global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [23 x i8] c"Usage: %s [OPTION]...\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 41, type: !10, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !9, nameTableKind: None)
!3 = !DIFile(filename: "src/pwd.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!4 = !{}
!5 = !{!6, !7}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !{!0}
!10 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 1280, elements: !23)
!11 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !14)
!13 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "")
!14 = !{!15, !18, !20, !22}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !12, file: !13, line: 52, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !12, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !12, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !12, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!23 = !{!24}
!24 = !DISubrange(count: 5)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "Version", scope: !27, file: !28, line: 2, type: !16, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !29, nameTableKind: None)
!28 = !DIFile(filename: "src/version.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!29 = !{!25}
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !32, file: !37, line: 56, type: !38, isLocal: true, isDefinition: true)
!32 = distinct !DICompileUnit(language: DW_LANG_C99, file: !33, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !34, nameTableKind: None)
!33 = !DIFile(filename: "./lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!34 = !{!35, !30}
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "file_name", scope: !32, file: !37, line: 46, type: !16, isLocal: true, isDefinition: true)
!37 = !DIFile(filename: "lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!38 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "exit_failure", scope: !41, file: !44, line: 24, type: !45, isLocal: false, isDefinition: true)
!41 = distinct !DICompileUnit(language: DW_LANG_C99, file: !42, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !43, nameTableKind: None)
!42 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!43 = !{!39}
!44 = !DIFile(filename: "lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!45 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !19)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "program_name", scope: !48, file: !51, line: 33, type: !16, isLocal: false, isDefinition: true)
!48 = distinct !DICompileUnit(language: DW_LANG_C99, file: !49, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !50, nameTableKind: None)
!49 = !DIFile(filename: "./lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!50 = !{!46}
!51 = !DIFile(filename: "lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !54, file: !80, line: 116, type: !93, isLocal: true, isDefinition: true)
!54 = distinct !DICompileUnit(language: DW_LANG_C99, file: !55, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, retainedTypes: !72, globals: !77, nameTableKind: None)
!55 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!56 = !{!57}
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !58, line: 32, baseType: !59, size: 32, elements: !60)
!58 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!59 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!60 = !{!61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71}
!61 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!62 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!63 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!64 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!65 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!66 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!67 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!68 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!69 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!70 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!71 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!72 = !{!19, !73, !74}
!73 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !75, line: 46, baseType: !76)
!75 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.1/include/stddef.h", directory: "")
!76 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!77 = !{!78, !85, !91, !52, !103, !108, !115, !117}
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !54, file: !80, line: 85, type: !81, isLocal: false, isDefinition: true)
!80 = !DIFile(filename: "lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 704, elements: !83)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!83 = !{!84}
!84 = !DISubrange(count: 11)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !54, file: !80, line: 101, type: !87, isLocal: false, isDefinition: true)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 320, elements: !89)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!89 = !{!90}
!90 = !DISubrange(count: 10)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !54, file: !80, line: 1052, type: !93, isLocal: false, isDefinition: true)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !80, line: 65, size: 448, elements: !94)
!94 = !{!95, !96, !97, !101, !102}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !93, file: !80, line: 68, baseType: !57, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !93, file: !80, line: 71, baseType: !19, size: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !93, file: !80, line: 75, baseType: !98, size: 256, offset: 64)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 256, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 8)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !93, file: !80, line: 78, baseType: !16, size: 64, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !93, file: !80, line: 81, baseType: !16, size: 64, offset: 384)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "slot0", scope: !54, file: !80, line: 842, type: !105, isLocal: true, isDefinition: true)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 256)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "slotvec", scope: !54, file: !80, line: 845, type: !110, isLocal: true, isDefinition: true)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !80, line: 834, size: 128, elements: !112)
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !111, file: !80, line: 836, baseType: !74, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !111, file: !80, line: 837, baseType: !7, size: 64, offset: 64)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "nslots", scope: !54, file: !80, line: 843, type: !19, isLocal: true, isDefinition: true)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "slotvec0", scope: !54, file: !80, line: 844, type: !111, isLocal: true, isDefinition: true)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !121, file: !124, line: 26, type: !125, isLocal: false, isDefinition: true)
!121 = distinct !DICompileUnit(language: DW_LANG_C99, file: !122, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !123, nameTableKind: None)
!122 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!123 = !{!119}
!124 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 376, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 47)
!128 = distinct !DICompileUnit(language: DW_LANG_C99, file: !129, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!129 = !DIFile(filename: "./lib/root-dev-ino.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!130 = distinct !DICompileUnit(language: DW_LANG_C99, file: !131, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!131 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!132 = !{!6}
!133 = distinct !DICompileUnit(language: DW_LANG_C99, file: !134, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !135, nameTableKind: None)
!134 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!135 = !{!74, !7, !6}
!136 = distinct !DICompileUnit(language: DW_LANG_C99, file: !137, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!137 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!138 = distinct !DICompileUnit(language: DW_LANG_C99, file: !139, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!139 = !DIFile(filename: "./lib/xgetcwd.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!140 = distinct !DICompileUnit(language: DW_LANG_C99, file: !141, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !142, nameTableKind: None)
!141 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!142 = !{!74}
!143 = distinct !DICompileUnit(language: DW_LANG_C99, file: !144, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !145, nameTableKind: None)
!144 = !DIFile(filename: "./lib/c-strcasecmp.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!145 = !{!146}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!149 = distinct !DICompileUnit(language: DW_LANG_C99, file: !150, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!150 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!151 = distinct !DICompileUnit(language: DW_LANG_C99, file: !152, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!152 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!153 = distinct !DICompileUnit(language: DW_LANG_C99, file: !154, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!154 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!155 = distinct !DICompileUnit(language: DW_LANG_C99, file: !156, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!156 = !DIFile(filename: "./lib/setlocale_null.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!157 = distinct !DICompileUnit(language: DW_LANG_C99, file: !158, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!158 = !DIFile(filename: "./lib/fclose.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!159 = distinct !DICompileUnit(language: DW_LANG_C99, file: !160, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!160 = !DIFile(filename: "./lib/fflush.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!161 = distinct !DICompileUnit(language: DW_LANG_C99, file: !162, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!162 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!163 = distinct !DICompileUnit(language: DW_LANG_C99, file: !164, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!164 = !DIFile(filename: "./lib/c-ctype.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!165 = !{!"clang version 9.0.1-12 "}
!166 = !{i32 2, !"Dwarf Version", i32 4}
!167 = !{i32 2, !"Debug Info Version", i32 3}
!168 = !{i32 1, !"wchar_size", i32 4}
!169 = !{i32 1, !"ThinLTO", i32 0}
!170 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!171 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 51, type: !172, scopeLine: 52, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !19}
!174 = !DILocalVariable(name: "status", arg: 1, scope: !171, file: !3, line: 51, type: !19)
!175 = !DILocation(line: 51, column: 12, scope: !171)
!176 = !DILocation(line: 53, column: 7, scope: !177)
!177 = distinct !DILexicalBlock(scope: !171, file: !3, line: 53, column: 7)
!178 = !DILocation(line: 53, column: 14, scope: !177)
!179 = !DILocation(line: 53, column: 7, scope: !171)
!180 = !DILocation(line: 54, column: 5, scope: !177)
!181 = !DILocation(line: 54, column: 5, scope: !182)
!182 = distinct !DILexicalBlock(scope: !177, file: !3, line: 54, column: 5)
!183 = !DILocation(line: 57, column: 15, scope: !184)
!184 = distinct !DILexicalBlock(scope: !177, file: !3, line: 56, column: 5)
!185 = !DILocation(line: 57, column: 45, scope: !184)
!186 = !DILocation(line: 57, column: 7, scope: !184)
!187 = !DILocation(line: 58, column: 7, scope: !184)
!188 = !DILocation(line: 62, column: 7, scope: !184)
!189 = !DILocation(line: 66, column: 7, scope: !184)
!190 = !DILocation(line: 67, column: 7, scope: !184)
!191 = !DILocation(line: 68, column: 7, scope: !184)
!192 = !DILocation(line: 71, column: 15, scope: !184)
!193 = !DILocation(line: 71, column: 7, scope: !184)
!194 = !DILocation(line: 72, column: 7, scope: !184)
!195 = !DILocation(line: 74, column: 9, scope: !171)
!196 = !DILocation(line: 74, column: 3, scope: !171)
!197 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !198, file: !198, line: 634, type: !199, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!198 = !DIFile(filename: "src/system.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!199 = !DISubroutineType(types: !200)
!200 = !{null, !16}
!201 = !DILocalVariable(name: "program", arg: 1, scope: !197, file: !198, line: 634, type: !16)
!202 = !DILocation(line: 634, column: 34, scope: !197)
!203 = !DILocalVariable(name: "infomap", scope: !197, file: !198, line: 636, type: !204)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 896, elements: !210)
!205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !197, file: !198, line: 636, size: 128, elements: !207)
!207 = !{!208, !209}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !206, file: !198, line: 636, baseType: !16, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !206, file: !198, line: 636, baseType: !16, size: 64, offset: 64)
!210 = !{!211}
!211 = !DISubrange(count: 7)
!212 = !DILocation(line: 636, column: 67, scope: !197)
!213 = !DILocalVariable(name: "node", scope: !197, file: !198, line: 646, type: !16)
!214 = !DILocation(line: 646, column: 15, scope: !197)
!215 = !DILocation(line: 646, column: 22, scope: !197)
!216 = !DILocalVariable(name: "map_prog", scope: !197, file: !198, line: 647, type: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!218 = !DILocation(line: 647, column: 25, scope: !197)
!219 = !DILocation(line: 647, column: 36, scope: !197)
!220 = !DILocation(line: 649, column: 3, scope: !197)
!221 = !DILocation(line: 649, column: 10, scope: !197)
!222 = !DILocation(line: 649, column: 20, scope: !197)
!223 = !DILocation(line: 649, column: 28, scope: !197)
!224 = !DILocation(line: 649, column: 33, scope: !197)
!225 = !DILocation(line: 649, column: 31, scope: !197)
!226 = !DILocation(line: 0, scope: !197)
!227 = !DILocation(line: 650, column: 13, scope: !197)
!228 = distinct !{!228, !220, !227}
!229 = !DILocation(line: 652, column: 7, scope: !230)
!230 = distinct !DILexicalBlock(scope: !197, file: !198, line: 652, column: 7)
!231 = !DILocation(line: 652, column: 17, scope: !230)
!232 = !DILocation(line: 652, column: 7, scope: !197)
!233 = !DILocation(line: 653, column: 12, scope: !230)
!234 = !DILocation(line: 653, column: 22, scope: !230)
!235 = !DILocation(line: 653, column: 10, scope: !230)
!236 = !DILocation(line: 653, column: 5, scope: !230)
!237 = !DILocation(line: 655, column: 11, scope: !197)
!238 = !DILocation(line: 655, column: 3, scope: !197)
!239 = !DILocalVariable(name: "lc_messages", scope: !197, file: !198, line: 659, type: !16)
!240 = !DILocation(line: 659, column: 15, scope: !197)
!241 = !DILocation(line: 659, column: 29, scope: !197)
!242 = !DILocation(line: 660, column: 7, scope: !243)
!243 = distinct !DILexicalBlock(scope: !197, file: !198, line: 660, column: 7)
!244 = !DILocation(line: 660, column: 19, scope: !243)
!245 = !DILocation(line: 660, column: 22, scope: !243)
!246 = !DILocation(line: 660, column: 7, scope: !197)
!247 = !DILocation(line: 666, column: 7, scope: !248)
!248 = distinct !DILexicalBlock(scope: !243, file: !198, line: 661, column: 5)
!249 = !DILocation(line: 668, column: 5, scope: !248)
!250 = !DILocation(line: 669, column: 11, scope: !197)
!251 = !DILocation(line: 670, column: 24, scope: !197)
!252 = !DILocation(line: 669, column: 3, scope: !197)
!253 = !DILocation(line: 671, column: 11, scope: !197)
!254 = !DILocation(line: 672, column: 11, scope: !197)
!255 = !DILocation(line: 672, column: 17, scope: !197)
!256 = !DILocation(line: 672, column: 25, scope: !197)
!257 = !DILocation(line: 672, column: 22, scope: !197)
!258 = !DILocation(line: 671, column: 3, scope: !197)
!259 = !DILocation(line: 673, column: 1, scope: !197)
!260 = !DILocalVariable(name: "lc_messages", scope: !261, file: !198, line: 659, type: !16)
!261 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !198, file: !198, line: 634, type: !199, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !262, retainedNodes: !4)
!262 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !263, nameTableKind: None)
!263 = !{!264}
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "longopts", scope: !262, file: !3, line: 41, type: !266, isLocal: true, isDefinition: true)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 1280, elements: !23)
!267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !269)
!269 = !{!270, !271, !272, !273}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !268, file: !13, line: 52, baseType: !16, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !268, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !268, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !268, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!274 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 327, type: !275, scopeLine: 328, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!275 = !DISubroutineType(types: !276)
!276 = !{!19, !19, !277}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!278 = !DILocalVariable(name: "argc", arg: 1, scope: !274, file: !3, line: 327, type: !19)
!279 = !DILocation(line: 327, column: 11, scope: !274)
!280 = !DILocalVariable(name: "argv", arg: 2, scope: !274, file: !3, line: 327, type: !277)
!281 = !DILocation(line: 327, column: 24, scope: !274)
!282 = !DILocalVariable(name: "wd", scope: !274, file: !3, line: 329, type: !7)
!283 = !DILocation(line: 329, column: 9, scope: !274)
!284 = !DILocalVariable(name: "logical", scope: !274, file: !3, line: 333, type: !38)
!285 = !DILocation(line: 333, column: 8, scope: !274)
!286 = !DILocation(line: 333, column: 19, scope: !274)
!287 = !DILocation(line: 333, column: 46, scope: !274)
!288 = !DILocation(line: 336, column: 21, scope: !274)
!289 = !DILocation(line: 336, column: 3, scope: !274)
!290 = !DILocation(line: 337, column: 3, scope: !274)
!291 = !DILocation(line: 338, column: 3, scope: !274)
!292 = !DILocation(line: 339, column: 3, scope: !274)
!293 = !DILocation(line: 341, column: 3, scope: !274)
!294 = !DILocation(line: 343, column: 3, scope: !274)
!295 = !DILocalVariable(name: "c", scope: !296, file: !3, line: 345, type: !19)
!296 = distinct !DILexicalBlock(scope: !274, file: !3, line: 344, column: 5)
!297 = !DILocation(line: 345, column: 11, scope: !296)
!298 = !DILocation(line: 345, column: 28, scope: !296)
!299 = !DILocation(line: 345, column: 34, scope: !296)
!300 = !DILocation(line: 345, column: 15, scope: !296)
!301 = !DILocation(line: 346, column: 11, scope: !302)
!302 = distinct !DILexicalBlock(scope: !296, file: !3, line: 346, column: 11)
!303 = !DILocation(line: 346, column: 13, scope: !302)
!304 = !DILocation(line: 347, column: 9, scope: !302)
!305 = !DILocation(line: 348, column: 15, scope: !296)
!306 = !DILocation(line: 348, column: 7, scope: !296)
!307 = !DILocation(line: 351, column: 19, scope: !308)
!308 = distinct !DILexicalBlock(scope: !296, file: !3, line: 349, column: 9)
!309 = !DILocation(line: 352, column: 11, scope: !308)
!310 = !DILocation(line: 354, column: 19, scope: !308)
!311 = !DILocation(line: 355, column: 11, scope: !308)
!312 = !DILocation(line: 357, column: 9, scope: !308)
!313 = !DILocation(line: 359, column: 9, scope: !308)
!314 = !DILocation(line: 362, column: 11, scope: !308)
!315 = distinct !{!315, !294, !316}
!316 = !DILocation(line: 364, column: 5, scope: !274)
!317 = !DILocation(line: 366, column: 7, scope: !318)
!318 = distinct !DILexicalBlock(scope: !274, file: !3, line: 366, column: 7)
!319 = !DILocation(line: 366, column: 16, scope: !318)
!320 = !DILocation(line: 366, column: 14, scope: !318)
!321 = !DILocation(line: 366, column: 7, scope: !274)
!322 = !DILocation(line: 367, column: 18, scope: !318)
!323 = !DILocation(line: 367, column: 5, scope: !318)
!324 = !DILocation(line: 369, column: 7, scope: !325)
!325 = distinct !DILexicalBlock(scope: !274, file: !3, line: 369, column: 7)
!326 = !DILocation(line: 369, column: 7, scope: !274)
!327 = !DILocation(line: 371, column: 12, scope: !328)
!328 = distinct !DILexicalBlock(scope: !325, file: !3, line: 370, column: 5)
!329 = !DILocation(line: 371, column: 10, scope: !328)
!330 = !DILocation(line: 372, column: 11, scope: !331)
!331 = distinct !DILexicalBlock(scope: !328, file: !3, line: 372, column: 11)
!332 = !DILocation(line: 372, column: 11, scope: !328)
!333 = !DILocation(line: 374, column: 17, scope: !334)
!334 = distinct !DILexicalBlock(scope: !331, file: !3, line: 373, column: 9)
!335 = !DILocation(line: 374, column: 11, scope: !334)
!336 = !DILocation(line: 375, column: 11, scope: !334)
!337 = !DILocation(line: 377, column: 5, scope: !328)
!338 = !DILocation(line: 379, column: 8, scope: !274)
!339 = !DILocation(line: 379, column: 6, scope: !274)
!340 = !DILocation(line: 380, column: 7, scope: !341)
!341 = distinct !DILexicalBlock(scope: !274, file: !3, line: 380, column: 7)
!342 = !DILocation(line: 380, column: 10, scope: !341)
!343 = !DILocation(line: 380, column: 7, scope: !274)
!344 = !DILocation(line: 382, column: 13, scope: !345)
!345 = distinct !DILexicalBlock(scope: !341, file: !3, line: 381, column: 5)
!346 = !DILocation(line: 382, column: 7, scope: !345)
!347 = !DILocation(line: 383, column: 13, scope: !345)
!348 = !DILocation(line: 383, column: 7, scope: !345)
!349 = !DILocation(line: 384, column: 5, scope: !345)
!350 = !DILocalVariable(name: "file_name", scope: !351, file: !3, line: 387, type: !352)
!351 = distinct !DILexicalBlock(scope: !341, file: !3, line: 386, column: 5)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 34, size: 192, elements: !354)
!354 = !{!355, !356, !357}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !353, file: !3, line: 36, baseType: !7, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !353, file: !3, line: 37, baseType: !74, size: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !353, file: !3, line: 38, baseType: !7, size: 64, offset: 128)
!358 = !DILocation(line: 387, column: 25, scope: !351)
!359 = !DILocation(line: 387, column: 37, scope: !351)
!360 = !DILocation(line: 388, column: 22, scope: !351)
!361 = !DILocation(line: 388, column: 7, scope: !351)
!362 = !DILocation(line: 389, column: 13, scope: !351)
!363 = !DILocation(line: 389, column: 24, scope: !351)
!364 = !DILocation(line: 389, column: 7, scope: !351)
!365 = !DILocation(line: 390, column: 23, scope: !351)
!366 = !DILocation(line: 390, column: 7, scope: !351)
!367 = !DILocation(line: 393, column: 3, scope: !274)
!368 = !DILocation(line: 394, column: 1, scope: !274)
!369 = distinct !DISubprogram(name: "logical_getcwd", scope: !3, file: !3, line: 300, type: !370, scopeLine: 301, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!370 = !DISubroutineType(types: !371)
!371 = !{!7}
!372 = !DILocalVariable(name: "st1", scope: !369, file: !3, line: 302, type: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !374, line: 46, size: 1152, elements: !375)
!374 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!375 = !{!376, !379, !381, !383, !385, !387, !389, !390, !391, !394, !396, !398, !406, !407, !408}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !373, file: !374, line: 48, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !378, line: 145, baseType: !76)
!378 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!379 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !373, file: !374, line: 53, baseType: !380, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !378, line: 148, baseType: !76)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !373, file: !374, line: 61, baseType: !382, size: 64, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !378, line: 151, baseType: !76)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !373, file: !374, line: 62, baseType: !384, size: 32, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !378, line: 150, baseType: !59)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !373, file: !374, line: 64, baseType: !386, size: 32, offset: 224)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !378, line: 146, baseType: !59)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !373, file: !374, line: 65, baseType: !388, size: 32, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !378, line: 147, baseType: !59)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !373, file: !374, line: 67, baseType: !19, size: 32, offset: 288)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !373, file: !374, line: 69, baseType: !377, size: 64, offset: 320)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !373, file: !374, line: 74, baseType: !392, size: 64, offset: 384)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !378, line: 152, baseType: !393)
!393 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !373, file: !374, line: 78, baseType: !395, size: 64, offset: 448)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !378, line: 174, baseType: !393)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !373, file: !374, line: 80, baseType: !397, size: 64, offset: 512)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !378, line: 179, baseType: !393)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !373, file: !374, line: 91, baseType: !399, size: 128, offset: 576)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !400, line: 10, size: 128, elements: !401)
!400 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!401 = !{!402, !404}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !399, file: !400, line: 12, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !378, line: 160, baseType: !393)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !399, file: !400, line: 16, baseType: !405, size: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !378, line: 196, baseType: !393)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !373, file: !374, line: 92, baseType: !399, size: 128, offset: 704)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !373, file: !374, line: 93, baseType: !399, size: 128, offset: 832)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !373, file: !374, line: 106, baseType: !409, size: 192, offset: 960)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 192, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 3)
!412 = !DILocation(line: 302, column: 15, scope: !369)
!413 = !DILocalVariable(name: "st2", scope: !369, file: !3, line: 303, type: !373)
!414 = !DILocation(line: 303, column: 15, scope: !369)
!415 = !DILocalVariable(name: "wd", scope: !369, file: !3, line: 304, type: !7)
!416 = !DILocation(line: 304, column: 9, scope: !369)
!417 = !DILocation(line: 304, column: 14, scope: !369)
!418 = !DILocalVariable(name: "p", scope: !369, file: !3, line: 305, type: !7)
!419 = !DILocation(line: 305, column: 9, scope: !369)
!420 = !DILocation(line: 308, column: 8, scope: !421)
!421 = distinct !DILexicalBlock(scope: !369, file: !3, line: 308, column: 7)
!422 = !DILocation(line: 308, column: 11, scope: !421)
!423 = !DILocation(line: 308, column: 14, scope: !421)
!424 = !DILocation(line: 308, column: 20, scope: !421)
!425 = !DILocation(line: 308, column: 7, scope: !369)
!426 = !DILocation(line: 309, column: 5, scope: !421)
!427 = !DILocation(line: 310, column: 7, scope: !369)
!428 = !DILocation(line: 310, column: 5, scope: !369)
!429 = !DILocation(line: 311, column: 3, scope: !369)
!430 = !DILocation(line: 311, column: 23, scope: !369)
!431 = !DILocation(line: 311, column: 15, scope: !369)
!432 = !DILocation(line: 311, column: 13, scope: !369)
!433 = !DILocation(line: 313, column: 12, scope: !434)
!434 = distinct !DILexicalBlock(scope: !435, file: !3, line: 313, column: 11)
!435 = distinct !DILexicalBlock(scope: !369, file: !3, line: 312, column: 5)
!436 = !DILocation(line: 313, column: 17, scope: !434)
!437 = !DILocation(line: 313, column: 20, scope: !434)
!438 = !DILocation(line: 313, column: 25, scope: !434)
!439 = !DILocation(line: 314, column: 11, scope: !434)
!440 = !DILocation(line: 314, column: 15, scope: !434)
!441 = !DILocation(line: 314, column: 20, scope: !434)
!442 = !DILocation(line: 314, column: 27, scope: !434)
!443 = !DILocation(line: 314, column: 32, scope: !434)
!444 = !DILocation(line: 314, column: 37, scope: !434)
!445 = !DILocation(line: 314, column: 40, scope: !434)
!446 = !DILocation(line: 314, column: 45, scope: !434)
!447 = !DILocation(line: 313, column: 11, scope: !435)
!448 = !DILocation(line: 315, column: 9, scope: !434)
!449 = !DILocation(line: 316, column: 8, scope: !435)
!450 = distinct !{!450, !429, !451}
!451 = !DILocation(line: 317, column: 5, scope: !369)
!452 = !DILocation(line: 320, column: 13, scope: !453)
!453 = distinct !DILexicalBlock(scope: !369, file: !3, line: 320, column: 7)
!454 = !DILocation(line: 320, column: 7, scope: !453)
!455 = !DILocation(line: 320, column: 23, scope: !453)
!456 = !DILocation(line: 320, column: 31, scope: !453)
!457 = !DILocation(line: 320, column: 48, scope: !453)
!458 = !DILocation(line: 320, column: 56, scope: !453)
!459 = !DILocation(line: 320, column: 7, scope: !369)
!460 = !DILocation(line: 321, column: 12, scope: !453)
!461 = !DILocation(line: 321, column: 5, scope: !453)
!462 = !DILocation(line: 322, column: 3, scope: !369)
!463 = !DILocation(line: 323, column: 1, scope: !369)
!464 = distinct !DISubprogram(name: "file_name_init", scope: !3, file: !3, line: 85, type: !465, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!465 = !DISubroutineType(types: !466)
!466 = !{!352}
!467 = !DILocalVariable(name: "p", scope: !464, file: !3, line: 87, type: !352)
!468 = !DILocation(line: 87, column: 21, scope: !464)
!469 = !DILocation(line: 87, column: 25, scope: !464)
!470 = !DILocation(line: 91, column: 3, scope: !464)
!471 = !DILocation(line: 91, column: 6, scope: !464)
!472 = !DILocation(line: 91, column: 14, scope: !464)
!473 = !DILocation(line: 93, column: 21, scope: !464)
!474 = !DILocation(line: 93, column: 24, scope: !464)
!475 = !DILocation(line: 93, column: 12, scope: !464)
!476 = !DILocation(line: 93, column: 3, scope: !464)
!477 = !DILocation(line: 93, column: 6, scope: !464)
!478 = !DILocation(line: 93, column: 10, scope: !464)
!479 = !DILocation(line: 94, column: 14, scope: !464)
!480 = !DILocation(line: 94, column: 17, scope: !464)
!481 = !DILocation(line: 94, column: 24, scope: !464)
!482 = !DILocation(line: 94, column: 27, scope: !464)
!483 = !DILocation(line: 94, column: 35, scope: !464)
!484 = !DILocation(line: 94, column: 21, scope: !464)
!485 = !DILocation(line: 94, column: 3, scope: !464)
!486 = !DILocation(line: 94, column: 6, scope: !464)
!487 = !DILocation(line: 94, column: 12, scope: !464)
!488 = !DILocation(line: 95, column: 3, scope: !464)
!489 = !DILocation(line: 95, column: 6, scope: !464)
!490 = !DILocation(line: 95, column: 15, scope: !464)
!491 = !DILocation(line: 96, column: 10, scope: !464)
!492 = !DILocation(line: 96, column: 3, scope: !464)
!493 = distinct !DISubprogram(name: "robust_getcwd", scope: !3, file: !3, line: 268, type: !494, scopeLine: 269, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!494 = !DISubroutineType(types: !495)
!495 = !{null, !352}
!496 = !DILocalVariable(name: "file_name", arg: 1, scope: !493, file: !3, line: 268, type: !352)
!497 = !DILocation(line: 268, column: 34, scope: !493)
!498 = !DILocalVariable(name: "height", scope: !493, file: !3, line: 270, type: !74)
!499 = !DILocation(line: 270, column: 10, scope: !493)
!500 = !DILocalVariable(name: "dev_ino_buf", scope: !493, file: !3, line: 271, type: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !502, line: 7, size: 128, elements: !503)
!502 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!503 = !{!504, !507}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !501, file: !502, line: 9, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !506, line: 47, baseType: !380)
!506 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!507 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !501, file: !502, line: 10, baseType: !508, size: 64, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !506, line: 59, baseType: !377)
!509 = !DILocation(line: 271, column: 18, scope: !493)
!510 = !DILocalVariable(name: "root_dev_ino", scope: !493, file: !3, line: 272, type: !511)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!512 = !DILocation(line: 272, column: 19, scope: !493)
!513 = !DILocation(line: 272, column: 34, scope: !493)
!514 = !DILocalVariable(name: "dot_sb", scope: !493, file: !3, line: 273, type: !373)
!515 = !DILocation(line: 273, column: 15, scope: !493)
!516 = !DILocation(line: 275, column: 7, scope: !517)
!517 = distinct !DILexicalBlock(scope: !493, file: !3, line: 275, column: 7)
!518 = !DILocation(line: 275, column: 20, scope: !517)
!519 = !DILocation(line: 275, column: 7, scope: !493)
!520 = !DILocation(line: 276, column: 5, scope: !517)
!521 = !DILocation(line: 279, column: 7, scope: !522)
!522 = distinct !DILexicalBlock(scope: !493, file: !3, line: 279, column: 7)
!523 = !DILocation(line: 279, column: 27, scope: !522)
!524 = !DILocation(line: 279, column: 7, scope: !493)
!525 = !DILocation(line: 280, column: 5, scope: !522)
!526 = !DILocation(line: 282, column: 3, scope: !493)
!527 = !DILocation(line: 285, column: 11, scope: !528)
!528 = distinct !DILexicalBlock(scope: !529, file: !3, line: 285, column: 11)
!529 = distinct !DILexicalBlock(scope: !493, file: !3, line: 283, column: 5)
!530 = !DILocation(line: 285, column: 11, scope: !529)
!531 = !DILocation(line: 286, column: 9, scope: !528)
!532 = !DILocation(line: 288, column: 32, scope: !529)
!533 = !DILocation(line: 288, column: 49, scope: !529)
!534 = !DILocation(line: 288, column: 7, scope: !529)
!535 = distinct !{!535, !526, !536}
!536 = !DILocation(line: 289, column: 5, scope: !493)
!537 = !DILocation(line: 292, column: 7, scope: !538)
!538 = distinct !DILexicalBlock(scope: !493, file: !3, line: 292, column: 7)
!539 = !DILocation(line: 292, column: 18, scope: !538)
!540 = !DILocation(line: 292, column: 27, scope: !538)
!541 = !DILocation(line: 292, column: 7, scope: !493)
!542 = !DILocation(line: 293, column: 24, scope: !538)
!543 = !DILocation(line: 293, column: 5, scope: !538)
!544 = !DILocation(line: 294, column: 1, scope: !493)
!545 = distinct !DISubprogram(name: "file_name_free", scope: !3, file: !3, line: 78, type: !494, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!546 = !DILocalVariable(name: "p", arg: 1, scope: !545, file: !3, line: 78, type: !352)
!547 = !DILocation(line: 78, column: 35, scope: !545)
!548 = !DILocation(line: 80, column: 9, scope: !545)
!549 = !DILocation(line: 80, column: 12, scope: !545)
!550 = !DILocation(line: 80, column: 3, scope: !545)
!551 = !DILocation(line: 81, column: 9, scope: !545)
!552 = !DILocation(line: 81, column: 3, scope: !545)
!553 = !DILocation(line: 82, column: 1, scope: !545)
!554 = distinct !DISubprogram(name: "find_dir_entry", scope: !3, file: !3, line: 153, type: !555, scopeLine: 155, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!555 = !DISubroutineType(types: !556)
!556 = !{null, !557, !352, !74}
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!558 = !DILocalVariable(name: "dot_sb", arg: 1, scope: !554, file: !3, line: 153, type: !557)
!559 = !DILocation(line: 153, column: 30, scope: !554)
!560 = !DILocalVariable(name: "file_name", arg: 2, scope: !554, file: !3, line: 153, type: !352)
!561 = !DILocation(line: 153, column: 56, scope: !554)
!562 = !DILocalVariable(name: "parent_height", arg: 3, scope: !554, file: !3, line: 154, type: !74)
!563 = !DILocation(line: 154, column: 24, scope: !554)
!564 = !DILocalVariable(name: "dirp", scope: !554, file: !3, line: 156, type: !565)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !567, line: 127, baseType: !568)
!567 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !567, line: 127, flags: DIFlagFwdDecl)
!569 = !DILocation(line: 156, column: 8, scope: !554)
!570 = !DILocalVariable(name: "fd", scope: !554, file: !3, line: 157, type: !19)
!571 = !DILocation(line: 157, column: 7, scope: !554)
!572 = !DILocalVariable(name: "parent_sb", scope: !554, file: !3, line: 158, type: !373)
!573 = !DILocation(line: 158, column: 15, scope: !554)
!574 = !DILocalVariable(name: "use_lstat", scope: !554, file: !3, line: 159, type: !38)
!575 = !DILocation(line: 159, column: 8, scope: !554)
!576 = !DILocalVariable(name: "found", scope: !554, file: !3, line: 160, type: !38)
!577 = !DILocation(line: 160, column: 8, scope: !554)
!578 = !DILocation(line: 162, column: 10, scope: !554)
!579 = !DILocation(line: 162, column: 8, scope: !554)
!580 = !DILocation(line: 163, column: 7, scope: !581)
!581 = distinct !DILexicalBlock(scope: !554, file: !3, line: 163, column: 7)
!582 = !DILocation(line: 163, column: 12, scope: !581)
!583 = !DILocation(line: 163, column: 7, scope: !554)
!584 = !DILocation(line: 164, column: 5, scope: !581)
!585 = !DILocation(line: 167, column: 15, scope: !554)
!586 = !DILocation(line: 167, column: 8, scope: !554)
!587 = !DILocation(line: 167, column: 6, scope: !554)
!588 = !DILocation(line: 168, column: 13, scope: !589)
!589 = distinct !DILexicalBlock(scope: !554, file: !3, line: 168, column: 7)
!590 = !DILocation(line: 168, column: 10, scope: !589)
!591 = !DILocation(line: 168, column: 8, scope: !589)
!592 = !DILocation(line: 168, column: 26, scope: !589)
!593 = !DILocation(line: 168, column: 18, scope: !589)
!594 = !DILocation(line: 168, column: 32, scope: !589)
!595 = !DILocation(line: 168, column: 46, scope: !589)
!596 = !DILocation(line: 168, column: 7, scope: !554)
!597 = !DILocation(line: 169, column: 5, scope: !589)
!598 = !DILocation(line: 172, column: 13, scope: !599)
!599 = distinct !DILexicalBlock(scope: !554, file: !3, line: 172, column: 7)
!600 = !DILocation(line: 172, column: 10, scope: !599)
!601 = !DILocation(line: 172, column: 8, scope: !599)
!602 = !DILocation(line: 172, column: 25, scope: !599)
!603 = !DILocation(line: 172, column: 18, scope: !599)
!604 = !DILocation(line: 172, column: 43, scope: !599)
!605 = !DILocation(line: 172, column: 67, scope: !599)
!606 = !DILocation(line: 172, column: 7, scope: !554)
!607 = !DILocation(line: 173, column: 5, scope: !599)
!608 = !DILocation(line: 178, column: 26, scope: !554)
!609 = !DILocation(line: 178, column: 36, scope: !554)
!610 = !DILocation(line: 178, column: 44, scope: !554)
!611 = !DILocation(line: 178, column: 33, scope: !554)
!612 = !DILocation(line: 178, column: 13, scope: !554)
!613 = !DILocation(line: 180, column: 9, scope: !554)
!614 = !DILocation(line: 181, column: 3, scope: !554)
!615 = !DILocalVariable(name: "dp", scope: !616, file: !3, line: 183, type: !617)
!616 = distinct !DILexicalBlock(scope: !554, file: !3, line: 182, column: 5)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !620, line: 22, size: 2240, elements: !621)
!620 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!621 = !{!622, !623, !624, !625, !626}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !619, file: !620, line: 25, baseType: !380, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !619, file: !620, line: 26, baseType: !392, size: 64, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !619, file: !620, line: 31, baseType: !73, size: 16, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !619, file: !620, line: 32, baseType: !148, size: 8, offset: 144)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !619, file: !620, line: 33, baseType: !105, size: 2048, offset: 152)
!627 = !DILocation(line: 183, column: 28, scope: !616)
!628 = !DILocalVariable(name: "ent_sb", scope: !616, file: !3, line: 184, type: !373)
!629 = !DILocation(line: 184, column: 19, scope: !616)
!630 = !DILocalVariable(name: "ino", scope: !616, file: !3, line: 185, type: !505)
!631 = !DILocation(line: 185, column: 13, scope: !616)
!632 = !DILocation(line: 187, column: 7, scope: !616)
!633 = !DILocation(line: 187, column: 13, scope: !616)
!634 = !DILocation(line: 188, column: 50, scope: !635)
!635 = distinct !DILexicalBlock(scope: !616, file: !3, line: 188, column: 11)
!636 = !DILocation(line: 188, column: 17, scope: !635)
!637 = !DILocation(line: 188, column: 15, scope: !635)
!638 = !DILocation(line: 188, column: 57, scope: !635)
!639 = !DILocation(line: 188, column: 11, scope: !616)
!640 = !DILocation(line: 190, column: 15, scope: !641)
!641 = distinct !DILexicalBlock(scope: !642, file: !3, line: 190, column: 15)
!642 = distinct !DILexicalBlock(scope: !635, file: !3, line: 189, column: 9)
!643 = !DILocation(line: 190, column: 15, scope: !642)
!644 = !DILocalVariable(name: "e", scope: !645, file: !3, line: 193, type: !19)
!645 = distinct !DILexicalBlock(scope: !641, file: !3, line: 191, column: 13)
!646 = !DILocation(line: 193, column: 19, scope: !645)
!647 = !DILocation(line: 193, column: 23, scope: !645)
!648 = !DILocation(line: 194, column: 25, scope: !645)
!649 = !DILocation(line: 194, column: 15, scope: !645)
!650 = !DILocation(line: 195, column: 23, scope: !645)
!651 = !DILocation(line: 195, column: 15, scope: !645)
!652 = !DILocation(line: 195, column: 21, scope: !645)
!653 = !DILocation(line: 198, column: 20, scope: !645)
!654 = !DILocation(line: 199, column: 13, scope: !645)
!655 = !DILocation(line: 200, column: 11, scope: !642)
!656 = !DILocation(line: 203, column: 13, scope: !616)
!657 = !DILocation(line: 203, column: 11, scope: !616)
!658 = !DILocation(line: 205, column: 11, scope: !659)
!659 = distinct !DILexicalBlock(scope: !616, file: !3, line: 205, column: 11)
!660 = !DILocation(line: 205, column: 15, scope: !659)
!661 = !DILocation(line: 205, column: 38, scope: !659)
!662 = !DILocation(line: 205, column: 41, scope: !659)
!663 = !DILocation(line: 205, column: 11, scope: !616)
!664 = !DILocation(line: 207, column: 22, scope: !665)
!665 = distinct !DILexicalBlock(scope: !666, file: !3, line: 207, column: 15)
!666 = distinct !DILexicalBlock(scope: !659, file: !3, line: 206, column: 9)
!667 = !DILocation(line: 207, column: 26, scope: !665)
!668 = !DILocation(line: 207, column: 15, scope: !665)
!669 = !DILocation(line: 207, column: 43, scope: !665)
!670 = !DILocation(line: 207, column: 15, scope: !666)
!671 = !DILocation(line: 210, column: 15, scope: !672)
!672 = distinct !DILexicalBlock(scope: !665, file: !3, line: 208, column: 13)
!673 = distinct !{!673, !614, !674}
!674 = !DILocation(line: 226, column: 5, scope: !554)
!675 = !DILocation(line: 212, column: 24, scope: !666)
!676 = !DILocation(line: 212, column: 15, scope: !666)
!677 = !DILocation(line: 213, column: 9, scope: !666)
!678 = !DILocation(line: 215, column: 11, scope: !679)
!679 = distinct !DILexicalBlock(scope: !616, file: !3, line: 215, column: 11)
!680 = !DILocation(line: 215, column: 18, scope: !679)
!681 = !DILocation(line: 215, column: 26, scope: !679)
!682 = !DILocation(line: 215, column: 15, scope: !679)
!683 = !DILocation(line: 215, column: 11, scope: !616)
!684 = !DILocation(line: 216, column: 9, scope: !679)
!685 = !DILocation(line: 220, column: 14, scope: !686)
!686 = distinct !DILexicalBlock(scope: !616, file: !3, line: 220, column: 12)
!687 = !DILocation(line: 220, column: 24, scope: !686)
!688 = !DILocation(line: 220, column: 34, scope: !686)
!689 = !DILocation(line: 220, column: 44, scope: !686)
!690 = !DILocation(line: 220, column: 52, scope: !686)
!691 = !DILocation(line: 220, column: 41, scope: !686)
!692 = !DILocation(line: 220, column: 12, scope: !616)
!693 = !DILocation(line: 222, column: 30, scope: !694)
!694 = distinct !DILexicalBlock(scope: !686, file: !3, line: 221, column: 9)
!695 = !DILocation(line: 222, column: 41, scope: !694)
!696 = !DILocation(line: 222, column: 45, scope: !694)
!697 = !DILocation(line: 222, column: 53, scope: !694)
!698 = !DILocation(line: 222, column: 11, scope: !694)
!699 = !DILocation(line: 223, column: 17, scope: !694)
!700 = !DILocation(line: 224, column: 11, scope: !694)
!701 = !DILocation(line: 228, column: 7, scope: !702)
!702 = distinct !DILexicalBlock(scope: !554, file: !3, line: 228, column: 7)
!703 = !DILocation(line: 228, column: 12, scope: !702)
!704 = !DILocation(line: 228, column: 20, scope: !702)
!705 = !DILocation(line: 228, column: 33, scope: !702)
!706 = !DILocation(line: 228, column: 23, scope: !702)
!707 = !DILocation(line: 228, column: 39, scope: !702)
!708 = !DILocation(line: 228, column: 7, scope: !554)
!709 = !DILocation(line: 232, column: 7, scope: !710)
!710 = distinct !DILexicalBlock(scope: !702, file: !3, line: 229, column: 5)
!711 = !DILocation(line: 236, column: 10, scope: !712)
!712 = distinct !DILexicalBlock(scope: !554, file: !3, line: 236, column: 8)
!713 = !DILocation(line: 236, column: 8, scope: !554)
!714 = !DILocation(line: 237, column: 5, scope: !712)
!715 = !DILocation(line: 241, column: 4, scope: !554)
!716 = !DILocation(line: 241, column: 13, scope: !554)
!717 = !DILocation(line: 242, column: 1, scope: !554)
!718 = !DILocalVariable(name: "dot_sb", arg: 1, scope: !719, file: !3, line: 153, type: !722)
!719 = distinct !DISubprogram(name: "find_dir_entry", scope: !3, file: !3, line: 153, type: !720, scopeLine: 155, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !750, retainedNodes: !4)
!720 = !DISubroutineType(types: !721)
!721 = !{null, !722, !744, !74}
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !374, line: 46, size: 1152, elements: !724)
!724 = !{!725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !741, !742, !743}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !723, file: !374, line: 48, baseType: !377, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !723, file: !374, line: 53, baseType: !380, size: 64, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !723, file: !374, line: 61, baseType: !382, size: 64, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !723, file: !374, line: 62, baseType: !384, size: 32, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !723, file: !374, line: 64, baseType: !386, size: 32, offset: 224)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !723, file: !374, line: 65, baseType: !388, size: 32, offset: 256)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !723, file: !374, line: 67, baseType: !19, size: 32, offset: 288)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !723, file: !374, line: 69, baseType: !377, size: 64, offset: 320)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !723, file: !374, line: 74, baseType: !392, size: 64, offset: 384)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !723, file: !374, line: 78, baseType: !395, size: 64, offset: 448)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !723, file: !374, line: 80, baseType: !397, size: 64, offset: 512)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !723, file: !374, line: 91, baseType: !737, size: 128, offset: 576)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !400, line: 10, size: 128, elements: !738)
!738 = !{!739, !740}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !737, file: !400, line: 12, baseType: !403, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !737, file: !400, line: 16, baseType: !405, size: 64, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !723, file: !374, line: 92, baseType: !737, size: 128, offset: 704)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !723, file: !374, line: 93, baseType: !737, size: 128, offset: 832)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !723, file: !374, line: 106, baseType: !409, size: 192, offset: 960)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 34, size: 192, elements: !746)
!746 = !{!747, !748, !749}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !745, file: !3, line: 36, baseType: !7, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !745, file: !3, line: 37, baseType: !74, size: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !745, file: !3, line: 38, baseType: !7, size: 64, offset: 128)
!750 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !751, nameTableKind: None)
!751 = !{!752}
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(name: "longopts", scope: !750, file: !3, line: 41, type: !754, isLocal: true, isDefinition: true)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !755, size: 1280, elements: !23)
!755 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !757)
!757 = !{!758, !759, !760, !761}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !756, file: !13, line: 52, baseType: !16, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !756, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !756, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !756, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!762 = !DILocalVariable(name: "file_name", arg: 2, scope: !719, file: !3, line: 153, type: !744)
!763 = !DILocalVariable(name: "parent_height", arg: 3, scope: !719, file: !3, line: 154, type: !74)
!764 = !DILocalVariable(name: "dirp", scope: !719, file: !3, line: 156, type: !565)
!765 = !DILocalVariable(name: "fd", scope: !719, file: !3, line: 157, type: !19)
!766 = !DILocalVariable(name: "parent_sb", scope: !719, file: !3, line: 158, type: !723)
!767 = !DILocalVariable(name: "use_lstat", scope: !719, file: !3, line: 159, type: !38)
!768 = !DILocalVariable(name: "found", scope: !719, file: !3, line: 160, type: !38)
!769 = distinct !DISubprogram(name: "file_name_prepend", scope: !3, file: !3, line: 101, type: !770, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!770 = !DISubroutineType(types: !771)
!771 = !{null, !352, !16, !74}
!772 = !DILocalVariable(name: "p", arg: 1, scope: !769, file: !3, line: 101, type: !352)
!773 = !DILocation(line: 101, column: 38, scope: !769)
!774 = !DILocalVariable(name: "s", arg: 2, scope: !769, file: !3, line: 101, type: !16)
!775 = !DILocation(line: 101, column: 53, scope: !769)
!776 = !DILocalVariable(name: "s_len", arg: 3, scope: !769, file: !3, line: 101, type: !74)
!777 = !DILocation(line: 101, column: 63, scope: !769)
!778 = !DILocalVariable(name: "n_free", scope: !769, file: !3, line: 103, type: !74)
!779 = !DILocation(line: 103, column: 10, scope: !769)
!780 = !DILocation(line: 103, column: 19, scope: !769)
!781 = !DILocation(line: 103, column: 22, scope: !769)
!782 = !DILocation(line: 103, column: 30, scope: !769)
!783 = !DILocation(line: 103, column: 33, scope: !769)
!784 = !DILocation(line: 103, column: 28, scope: !769)
!785 = !DILocation(line: 104, column: 7, scope: !786)
!786 = distinct !DILexicalBlock(scope: !769, file: !3, line: 104, column: 7)
!787 = !DILocation(line: 104, column: 20, scope: !786)
!788 = !DILocation(line: 104, column: 18, scope: !786)
!789 = !DILocation(line: 104, column: 14, scope: !786)
!790 = !DILocation(line: 104, column: 7, scope: !769)
!791 = !DILocalVariable(name: "half", scope: !792, file: !3, line: 106, type: !74)
!792 = distinct !DILexicalBlock(scope: !786, file: !3, line: 105, column: 5)
!793 = !DILocation(line: 106, column: 14, scope: !792)
!794 = !DILocation(line: 106, column: 21, scope: !792)
!795 = !DILocation(line: 106, column: 24, scope: !792)
!796 = !DILocation(line: 106, column: 32, scope: !792)
!797 = !DILocation(line: 106, column: 38, scope: !792)
!798 = !DILocation(line: 106, column: 36, scope: !792)
!799 = !DILocalVariable(name: "q", scope: !792, file: !3, line: 111, type: !7)
!800 = !DILocation(line: 111, column: 13, scope: !792)
!801 = !DILocation(line: 111, column: 30, scope: !792)
!802 = !DILocation(line: 111, column: 17, scope: !792)
!803 = !DILocalVariable(name: "n_used", scope: !792, file: !3, line: 112, type: !74)
!804 = !DILocation(line: 112, column: 14, scope: !792)
!805 = !DILocation(line: 112, column: 23, scope: !792)
!806 = !DILocation(line: 112, column: 26, scope: !792)
!807 = !DILocation(line: 112, column: 36, scope: !792)
!808 = !DILocation(line: 112, column: 34, scope: !792)
!809 = !DILocation(line: 113, column: 18, scope: !792)
!810 = !DILocation(line: 113, column: 26, scope: !792)
!811 = !DILocation(line: 113, column: 24, scope: !792)
!812 = !DILocation(line: 113, column: 20, scope: !792)
!813 = !DILocation(line: 113, column: 33, scope: !792)
!814 = !DILocation(line: 113, column: 31, scope: !792)
!815 = !DILocation(line: 113, column: 7, scope: !792)
!816 = !DILocation(line: 113, column: 10, scope: !792)
!817 = !DILocation(line: 113, column: 16, scope: !792)
!818 = !DILocation(line: 114, column: 15, scope: !792)
!819 = !DILocation(line: 114, column: 18, scope: !792)
!820 = !DILocation(line: 114, column: 25, scope: !792)
!821 = !DILocation(line: 114, column: 28, scope: !792)
!822 = !DILocation(line: 114, column: 34, scope: !792)
!823 = !DILocation(line: 114, column: 32, scope: !792)
!824 = !DILocation(line: 114, column: 42, scope: !792)
!825 = !DILocation(line: 114, column: 7, scope: !792)
!826 = !DILocation(line: 115, column: 13, scope: !792)
!827 = !DILocation(line: 115, column: 16, scope: !792)
!828 = !DILocation(line: 115, column: 7, scope: !792)
!829 = !DILocation(line: 116, column: 16, scope: !792)
!830 = !DILocation(line: 116, column: 7, scope: !792)
!831 = !DILocation(line: 116, column: 10, scope: !792)
!832 = !DILocation(line: 116, column: 14, scope: !792)
!833 = !DILocation(line: 117, column: 24, scope: !792)
!834 = !DILocation(line: 117, column: 22, scope: !792)
!835 = !DILocation(line: 117, column: 7, scope: !792)
!836 = !DILocation(line: 117, column: 10, scope: !792)
!837 = !DILocation(line: 117, column: 18, scope: !792)
!838 = !DILocation(line: 118, column: 5, scope: !792)
!839 = !DILocation(line: 120, column: 19, scope: !769)
!840 = !DILocation(line: 120, column: 17, scope: !769)
!841 = !DILocation(line: 120, column: 3, scope: !769)
!842 = !DILocation(line: 120, column: 6, scope: !769)
!843 = !DILocation(line: 120, column: 12, scope: !769)
!844 = !DILocation(line: 121, column: 3, scope: !769)
!845 = !DILocation(line: 121, column: 6, scope: !769)
!846 = !DILocation(line: 121, column: 15, scope: !769)
!847 = !DILocation(line: 122, column: 11, scope: !769)
!848 = !DILocation(line: 122, column: 14, scope: !769)
!849 = !DILocation(line: 122, column: 20, scope: !769)
!850 = !DILocation(line: 122, column: 25, scope: !769)
!851 = !DILocation(line: 122, column: 28, scope: !769)
!852 = !DILocation(line: 122, column: 3, scope: !769)
!853 = !DILocation(line: 123, column: 1, scope: !769)
!854 = !DILocalVariable(name: "q", scope: !855, file: !3, line: 111, type: !7)
!855 = distinct !DILexicalBlock(scope: !856, file: !3, line: 105, column: 5)
!856 = distinct !DILexicalBlock(scope: !857, file: !3, line: 104, column: 7)
!857 = distinct !DISubprogram(name: "file_name_prepend", scope: !3, file: !3, line: 101, type: !858, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !866, retainedNodes: !4)
!858 = !DISubroutineType(types: !859)
!859 = !{null, !860, !16, !74}
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 34, size: 192, elements: !862)
!862 = !{!863, !864, !865}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !861, file: !3, line: 36, baseType: !7, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !861, file: !3, line: 37, baseType: !74, size: 64, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !861, file: !3, line: 38, baseType: !7, size: 64, offset: 128)
!866 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !867, nameTableKind: None)
!867 = !{!868}
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(name: "longopts", scope: !866, file: !3, line: 41, type: !870, isLocal: true, isDefinition: true)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !871, size: 1280, elements: !23)
!871 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !873)
!873 = !{!874, !875, !876, !877}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !872, file: !13, line: 52, baseType: !16, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !872, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !872, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !872, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!878 = !DILocalVariable(name: "n_used", scope: !855, file: !3, line: 112, type: !74)
!879 = distinct !DISubprogram(name: "nth_parent", scope: !3, file: !3, line: 127, type: !880, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!880 = !DISubroutineType(types: !881)
!881 = !{!7, !74}
!882 = !DILocalVariable(name: "n", arg: 1, scope: !879, file: !3, line: 127, type: !74)
!883 = !DILocation(line: 127, column: 20, scope: !879)
!884 = !DILocalVariable(name: "buf", scope: !879, file: !3, line: 129, type: !7)
!885 = !DILocation(line: 129, column: 9, scope: !879)
!886 = !DILocation(line: 129, column: 28, scope: !879)
!887 = !DILocation(line: 129, column: 15, scope: !879)
!888 = !DILocalVariable(name: "p", scope: !879, file: !3, line: 130, type: !7)
!889 = !DILocation(line: 130, column: 9, scope: !879)
!890 = !DILocation(line: 130, column: 13, scope: !879)
!891 = !DILocalVariable(name: "i", scope: !892, file: !3, line: 132, type: !74)
!892 = distinct !DILexicalBlock(scope: !879, file: !3, line: 132, column: 3)
!893 = !DILocation(line: 132, column: 15, scope: !892)
!894 = !DILocation(line: 132, column: 8, scope: !892)
!895 = !DILocation(line: 132, column: 22, scope: !896)
!896 = distinct !DILexicalBlock(scope: !892, file: !3, line: 132, column: 3)
!897 = !DILocation(line: 132, column: 26, scope: !896)
!898 = !DILocation(line: 132, column: 24, scope: !896)
!899 = !DILocation(line: 132, column: 3, scope: !892)
!900 = !DILocation(line: 134, column: 15, scope: !901)
!901 = distinct !DILexicalBlock(scope: !896, file: !3, line: 133, column: 5)
!902 = !DILocation(line: 134, column: 7, scope: !901)
!903 = !DILocation(line: 135, column: 9, scope: !901)
!904 = !DILocation(line: 136, column: 5, scope: !901)
!905 = !DILocation(line: 132, column: 30, scope: !896)
!906 = !DILocation(line: 132, column: 3, scope: !896)
!907 = distinct !{!907, !899, !908}
!908 = !DILocation(line: 136, column: 5, scope: !892)
!909 = !DILocation(line: 137, column: 3, scope: !879)
!910 = !DILocation(line: 137, column: 9, scope: !879)
!911 = !DILocation(line: 138, column: 10, scope: !879)
!912 = !DILocation(line: 138, column: 3, scope: !879)
!913 = !DILocalVariable(name: "n", arg: 1, scope: !914, file: !3, line: 127, type: !74)
!914 = distinct !DISubprogram(name: "nth_parent", scope: !3, file: !3, line: 127, type: !880, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !915, retainedNodes: !4)
!915 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !916, nameTableKind: None)
!916 = !{!917}
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(name: "longopts", scope: !915, file: !3, line: 41, type: !919, isLocal: true, isDefinition: true)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !920, size: 1280, elements: !23)
!920 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !921)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !922)
!922 = !{!923, !924, !925, !926}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !921, file: !13, line: 52, baseType: !16, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !921, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !921, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !921, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!927 = !DILocalVariable(name: "buf", scope: !914, file: !3, line: 129, type: !7)
!928 = !DILocalVariable(name: "p", scope: !914, file: !3, line: 130, type: !7)
!929 = !DILocalVariable(name: "i", scope: !930, file: !3, line: 132, type: !74)
!930 = distinct !DILexicalBlock(scope: !914, file: !3, line: 132, column: 3)
!931 = distinct !DISubprogram(name: "readdir_ignoring_dot_and_dotdot", scope: !198, file: !198, line: 278, type: !932, scopeLine: 279, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!932 = !DISubroutineType(types: !933)
!933 = !{!617, !565}
!934 = !DILocalVariable(name: "dirp", arg: 1, scope: !931, file: !198, line: 278, type: !565)
!935 = !DILocation(line: 278, column: 39, scope: !931)
!936 = !DILocation(line: 280, column: 3, scope: !931)
!937 = !DILocalVariable(name: "dp", scope: !938, file: !198, line: 282, type: !617)
!938 = distinct !DILexicalBlock(scope: !931, file: !198, line: 281, column: 5)
!939 = !DILocation(line: 282, column: 28, scope: !938)
!940 = !DILocation(line: 282, column: 42, scope: !938)
!941 = !DILocation(line: 282, column: 33, scope: !938)
!942 = !DILocation(line: 283, column: 11, scope: !943)
!943 = distinct !DILexicalBlock(scope: !938, file: !198, line: 283, column: 11)
!944 = !DILocation(line: 283, column: 14, scope: !943)
!945 = !DILocation(line: 283, column: 22, scope: !943)
!946 = !DILocation(line: 283, column: 42, scope: !943)
!947 = !DILocation(line: 283, column: 46, scope: !943)
!948 = !DILocation(line: 283, column: 27, scope: !943)
!949 = !DILocation(line: 283, column: 11, scope: !938)
!950 = !DILocation(line: 284, column: 16, scope: !943)
!951 = !DILocation(line: 284, column: 9, scope: !943)
!952 = distinct !{!952, !936, !953}
!953 = !DILocation(line: 285, column: 5, scope: !931)
!954 = !DILocalVariable(name: "dirp", arg: 1, scope: !955, file: !198, line: 278, type: !565)
!955 = distinct !DISubprogram(name: "readdir_ignoring_dot_and_dotdot", scope: !198, file: !198, line: 278, type: !956, scopeLine: 279, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !967, retainedNodes: !4)
!956 = !DISubroutineType(types: !957)
!957 = !{!958, !565}
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !960)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !620, line: 22, size: 2240, elements: !961)
!961 = !{!962, !963, !964, !965, !966}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !960, file: !620, line: 25, baseType: !380, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !960, file: !620, line: 26, baseType: !392, size: 64, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !960, file: !620, line: 31, baseType: !73, size: 16, offset: 128)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !960, file: !620, line: 32, baseType: !148, size: 8, offset: 144)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !960, file: !620, line: 33, baseType: !105, size: 2048, offset: 152)
!967 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !968, nameTableKind: None)
!968 = !{!969}
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(name: "longopts", scope: !967, file: !3, line: 41, type: !971, isLocal: true, isDefinition: true)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !972, size: 1280, elements: !23)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !974)
!974 = !{!975, !976, !977, !978}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !973, file: !13, line: 52, baseType: !16, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !973, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !973, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !973, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!979 = distinct !DISubprogram(name: "dot_or_dotdot", scope: !198, file: !198, line: 265, type: !980, scopeLine: 266, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!980 = !DISubroutineType(types: !981)
!981 = !{!38, !16}
!982 = !DILocalVariable(name: "file_name", arg: 1, scope: !979, file: !198, line: 265, type: !16)
!983 = !DILocation(line: 265, column: 28, scope: !979)
!984 = !DILocation(line: 267, column: 7, scope: !985)
!985 = distinct !DILexicalBlock(scope: !979, file: !198, line: 267, column: 7)
!986 = !DILocation(line: 267, column: 20, scope: !985)
!987 = !DILocation(line: 267, column: 7, scope: !979)
!988 = !DILocalVariable(name: "sep", scope: !989, file: !198, line: 269, type: !8)
!989 = distinct !DILexicalBlock(scope: !985, file: !198, line: 268, column: 5)
!990 = !DILocation(line: 269, column: 12, scope: !989)
!991 = !DILocation(line: 269, column: 18, scope: !989)
!992 = !DILocation(line: 269, column: 29, scope: !989)
!993 = !DILocation(line: 269, column: 42, scope: !989)
!994 = !DILocation(line: 269, column: 50, scope: !989)
!995 = !DILocation(line: 270, column: 17, scope: !989)
!996 = !DILocation(line: 270, column: 21, scope: !989)
!997 = !DILocation(line: 270, column: 24, scope: !989)
!998 = !DILocation(line: 270, column: 7, scope: !989)
!999 = !DILocation(line: 273, column: 5, scope: !985)
!1000 = !DILocation(line: 274, column: 1, scope: !979)
!1001 = !DILocalVariable(name: "file_name", arg: 1, scope: !1002, file: !198, line: 265, type: !16)
!1002 = distinct !DISubprogram(name: "dot_or_dotdot", scope: !198, file: !198, line: 265, type: !980, scopeLine: 266, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1003, retainedNodes: !4)
!1003 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !1004, nameTableKind: None)
!1004 = !{!1005}
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(name: "longopts", scope: !1003, file: !3, line: 41, type: !1007, isLocal: true, isDefinition: true)
!1007 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1008, size: 1280, elements: !23)
!1008 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1009)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !1010)
!1010 = !{!1011, !1012, !1013, !1014}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1009, file: !13, line: 52, baseType: !16, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !1009, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1009, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1009, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!1015 = distinct !DISubprogram(name: "close_stdout", scope: !37, file: !37, line: 117, type: !1016, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !32, retainedNodes: !4)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{null}
!1018 = !DILocation(line: 119, column: 21, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !1015, file: !37, line: 119, column: 7)
!1020 = !DILocation(line: 119, column: 7, scope: !1019)
!1021 = !DILocation(line: 119, column: 29, scope: !1019)
!1022 = !DILocation(line: 120, column: 7, scope: !1019)
!1023 = !DILocation(line: 120, column: 12, scope: !1019)
!1024 = !DILocation(line: 120, column: 25, scope: !1019)
!1025 = !DILocation(line: 120, column: 28, scope: !1019)
!1026 = !DILocation(line: 120, column: 34, scope: !1019)
!1027 = !DILocation(line: 119, column: 7, scope: !1015)
!1028 = !DILocalVariable(name: "write_error", scope: !1029, file: !37, line: 122, type: !16)
!1029 = distinct !DILexicalBlock(scope: !1019, file: !37, line: 121, column: 5)
!1030 = !DILocation(line: 122, column: 19, scope: !1029)
!1031 = !DILocation(line: 122, column: 33, scope: !1029)
!1032 = !DILocation(line: 123, column: 11, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !1029, file: !37, line: 123, column: 11)
!1034 = !DILocation(line: 123, column: 11, scope: !1029)
!1035 = !DILocation(line: 124, column: 19, scope: !1033)
!1036 = !DILocation(line: 124, column: 52, scope: !1033)
!1037 = !DILocation(line: 124, column: 36, scope: !1033)
!1038 = !DILocation(line: 125, column: 16, scope: !1033)
!1039 = !DILocation(line: 124, column: 9, scope: !1033)
!1040 = !DILocation(line: 127, column: 19, scope: !1033)
!1041 = !DILocation(line: 127, column: 32, scope: !1033)
!1042 = !DILocation(line: 127, column: 9, scope: !1033)
!1043 = !DILocation(line: 129, column: 14, scope: !1029)
!1044 = !DILocation(line: 129, column: 7, scope: !1029)
!1045 = !DILocation(line: 134, column: 42, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1015, file: !37, line: 134, column: 7)
!1047 = !DILocation(line: 134, column: 28, scope: !1046)
!1048 = !DILocation(line: 134, column: 50, scope: !1046)
!1049 = !DILocation(line: 134, column: 7, scope: !1015)
!1050 = !DILocation(line: 135, column: 12, scope: !1046)
!1051 = !DILocation(line: 135, column: 5, scope: !1046)
!1052 = !DILocation(line: 136, column: 1, scope: !1015)
!1053 = distinct !DISubprogram(name: "set_program_name", scope: !51, file: !51, line: 39, type: !199, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !4)
!1054 = !DILocalVariable(name: "argv0", arg: 1, scope: !1053, file: !51, line: 39, type: !16)
!1055 = !DILocation(line: 39, column: 31, scope: !1053)
!1056 = !DILocalVariable(name: "slash", scope: !1053, file: !51, line: 46, type: !16)
!1057 = !DILocation(line: 46, column: 15, scope: !1053)
!1058 = !DILocalVariable(name: "base", scope: !1053, file: !51, line: 47, type: !16)
!1059 = !DILocation(line: 47, column: 15, scope: !1053)
!1060 = !DILocation(line: 51, column: 7, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !1053, file: !51, line: 51, column: 7)
!1062 = !DILocation(line: 51, column: 13, scope: !1061)
!1063 = !DILocation(line: 51, column: 7, scope: !1053)
!1064 = !DILocation(line: 55, column: 14, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1061, file: !51, line: 52, column: 5)
!1066 = !DILocation(line: 54, column: 7, scope: !1065)
!1067 = !DILocation(line: 56, column: 7, scope: !1065)
!1068 = !DILocation(line: 59, column: 20, scope: !1053)
!1069 = !DILocation(line: 59, column: 11, scope: !1053)
!1070 = !DILocation(line: 59, column: 9, scope: !1053)
!1071 = !DILocation(line: 60, column: 11, scope: !1053)
!1072 = !DILocation(line: 60, column: 17, scope: !1053)
!1073 = !DILocation(line: 60, column: 27, scope: !1053)
!1074 = !DILocation(line: 60, column: 33, scope: !1053)
!1075 = !DILocation(line: 60, column: 39, scope: !1053)
!1076 = !DILocation(line: 60, column: 8, scope: !1053)
!1077 = !DILocation(line: 61, column: 7, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1053, file: !51, line: 61, column: 7)
!1079 = !DILocation(line: 61, column: 14, scope: !1078)
!1080 = !DILocation(line: 61, column: 12, scope: !1078)
!1081 = !DILocation(line: 61, column: 20, scope: !1078)
!1082 = !DILocation(line: 61, column: 25, scope: !1078)
!1083 = !DILocation(line: 61, column: 37, scope: !1078)
!1084 = !DILocation(line: 61, column: 42, scope: !1078)
!1085 = !DILocation(line: 61, column: 28, scope: !1078)
!1086 = !DILocation(line: 61, column: 61, scope: !1078)
!1087 = !DILocation(line: 61, column: 7, scope: !1053)
!1088 = !DILocation(line: 63, column: 15, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !1078, file: !51, line: 62, column: 5)
!1090 = !DILocation(line: 63, column: 13, scope: !1089)
!1091 = !DILocation(line: 64, column: 20, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !1089, file: !51, line: 64, column: 11)
!1093 = !DILocation(line: 64, column: 11, scope: !1092)
!1094 = !DILocation(line: 64, column: 36, scope: !1092)
!1095 = !DILocation(line: 64, column: 11, scope: !1089)
!1096 = !DILocation(line: 66, column: 19, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1092, file: !51, line: 65, column: 9)
!1098 = !DILocation(line: 66, column: 24, scope: !1097)
!1099 = !DILocation(line: 66, column: 17, scope: !1097)
!1100 = !DILocation(line: 70, column: 52, scope: !1097)
!1101 = !DILocation(line: 70, column: 41, scope: !1097)
!1102 = !DILocation(line: 72, column: 9, scope: !1097)
!1103 = !DILocation(line: 73, column: 5, scope: !1089)
!1104 = !DILocation(line: 84, column: 18, scope: !1053)
!1105 = !DILocation(line: 84, column: 16, scope: !1053)
!1106 = !DILocation(line: 90, column: 38, scope: !1053)
!1107 = !DILocation(line: 90, column: 27, scope: !1053)
!1108 = !DILocation(line: 92, column: 1, scope: !1053)
!1109 = !DILocalVariable(name: "argv0", arg: 1, scope: !1110, file: !51, line: 39, type: !16)
!1110 = distinct !DISubprogram(name: "set_program_name", scope: !51, file: !51, line: 39, type: !199, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1111, retainedNodes: !4)
!1111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !49, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !1112, nameTableKind: None)
!1112 = !{!1113}
!1113 = !DIGlobalVariableExpression(var: !1114, expr: !DIExpression())
!1114 = distinct !DIGlobalVariable(name: "program_name", scope: !1111, file: !51, line: 33, type: !16, isLocal: false, isDefinition: true)
!1115 = !DILocalVariable(name: "slash", scope: !1110, file: !51, line: 46, type: !16)
!1116 = !DILocalVariable(name: "base", scope: !1110, file: !51, line: 47, type: !16)
!1117 = distinct !DISubprogram(name: "set_char_quoting", scope: !80, file: !80, line: 152, type: !1118, scopeLine: 153, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !54, retainedNodes: !4)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!19, !1120, !8, !19}
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!1121 = !DILocalVariable(name: "o", arg: 1, scope: !1117, file: !80, line: 152, type: !1120)
!1122 = !DILocation(line: 152, column: 43, scope: !1117)
!1123 = !DILocalVariable(name: "c", arg: 2, scope: !1117, file: !80, line: 152, type: !8)
!1124 = !DILocation(line: 152, column: 51, scope: !1117)
!1125 = !DILocalVariable(name: "i", arg: 3, scope: !1117, file: !80, line: 152, type: !19)
!1126 = !DILocation(line: 152, column: 58, scope: !1117)
!1127 = !DILocalVariable(name: "uc", scope: !1117, file: !80, line: 154, type: !148)
!1128 = !DILocation(line: 154, column: 17, scope: !1117)
!1129 = !DILocation(line: 154, column: 22, scope: !1117)
!1130 = !DILocalVariable(name: "p", scope: !1117, file: !80, line: 155, type: !1131)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!1132 = !DILocation(line: 155, column: 17, scope: !1117)
!1133 = !DILocation(line: 156, column: 6, scope: !1117)
!1134 = !DILocation(line: 156, column: 10, scope: !1117)
!1135 = !DILocation(line: 156, column: 41, scope: !1117)
!1136 = !DILocation(line: 156, column: 5, scope: !1117)
!1137 = !DILocation(line: 156, column: 59, scope: !1117)
!1138 = !DILocation(line: 156, column: 62, scope: !1117)
!1139 = !DILocation(line: 156, column: 57, scope: !1117)
!1140 = !DILocalVariable(name: "shift", scope: !1117, file: !80, line: 157, type: !19)
!1141 = !DILocation(line: 157, column: 7, scope: !1117)
!1142 = !DILocation(line: 157, column: 15, scope: !1117)
!1143 = !DILocation(line: 157, column: 18, scope: !1117)
!1144 = !DILocalVariable(name: "r", scope: !1117, file: !80, line: 158, type: !19)
!1145 = !DILocation(line: 158, column: 7, scope: !1117)
!1146 = !DILocation(line: 158, column: 13, scope: !1117)
!1147 = !DILocation(line: 158, column: 12, scope: !1117)
!1148 = !DILocation(line: 158, column: 18, scope: !1117)
!1149 = !DILocation(line: 158, column: 15, scope: !1117)
!1150 = !DILocation(line: 158, column: 25, scope: !1117)
!1151 = !DILocation(line: 159, column: 11, scope: !1117)
!1152 = !DILocation(line: 159, column: 13, scope: !1117)
!1153 = !DILocation(line: 159, column: 20, scope: !1117)
!1154 = !DILocation(line: 159, column: 18, scope: !1117)
!1155 = !DILocation(line: 159, column: 26, scope: !1117)
!1156 = !DILocation(line: 159, column: 23, scope: !1117)
!1157 = !DILocation(line: 159, column: 4, scope: !1117)
!1158 = !DILocation(line: 159, column: 6, scope: !1117)
!1159 = !DILocation(line: 160, column: 10, scope: !1117)
!1160 = !DILocation(line: 160, column: 3, scope: !1117)
!1161 = !DILocalVariable(name: "o", arg: 1, scope: !1162, file: !80, line: 152, type: !1165)
!1162 = distinct !DISubprogram(name: "set_char_quoting", scope: !80, file: !80, line: 152, type: !1163, scopeLine: 153, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1173, retainedNodes: !4)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!19, !1165, !8, !19}
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !80, line: 65, size: 448, elements: !1167)
!1167 = !{!1168, !1169, !1170, !1171, !1172}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1166, file: !80, line: 68, baseType: !57, size: 32)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1166, file: !80, line: 71, baseType: !19, size: 32, offset: 32)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1166, file: !80, line: 75, baseType: !98, size: 256, offset: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1166, file: !80, line: 78, baseType: !16, size: 64, offset: 320)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1166, file: !80, line: 81, baseType: !16, size: 64, offset: 384)
!1173 = distinct !DICompileUnit(language: DW_LANG_C99, file: !55, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, retainedTypes: !72, globals: !1174, nameTableKind: None)
!1174 = !{!1175, !1177, !1179, !1181, !1183, !1185, !1192, !1194}
!1175 = !DIGlobalVariableExpression(var: !1176, expr: !DIExpression())
!1176 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1173, file: !80, line: 85, type: !81, isLocal: false, isDefinition: true)
!1177 = !DIGlobalVariableExpression(var: !1178, expr: !DIExpression())
!1178 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1173, file: !80, line: 101, type: !87, isLocal: false, isDefinition: true)
!1179 = !DIGlobalVariableExpression(var: !1180, expr: !DIExpression())
!1180 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1173, file: !80, line: 1052, type: !1166, isLocal: false, isDefinition: true)
!1181 = !DIGlobalVariableExpression(var: !1182, expr: !DIExpression())
!1182 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1173, file: !80, line: 116, type: !1166, isLocal: true, isDefinition: true)
!1183 = !DIGlobalVariableExpression(var: !1184, expr: !DIExpression())
!1184 = distinct !DIGlobalVariable(name: "slot0", scope: !1173, file: !80, line: 842, type: !105, isLocal: true, isDefinition: true)
!1185 = !DIGlobalVariableExpression(var: !1186, expr: !DIExpression())
!1186 = distinct !DIGlobalVariable(name: "slotvec", scope: !1173, file: !80, line: 845, type: !1187, isLocal: true, isDefinition: true)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !80, line: 834, size: 128, elements: !1189)
!1189 = !{!1190, !1191}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1188, file: !80, line: 836, baseType: !74, size: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1188, file: !80, line: 837, baseType: !7, size: 64, offset: 64)
!1192 = !DIGlobalVariableExpression(var: !1193, expr: !DIExpression())
!1193 = distinct !DIGlobalVariable(name: "nslots", scope: !1173, file: !80, line: 843, type: !19, isLocal: true, isDefinition: true)
!1194 = !DIGlobalVariableExpression(var: !1195, expr: !DIExpression())
!1195 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1173, file: !80, line: 844, type: !1188, isLocal: true, isDefinition: true)
!1196 = !DILocalVariable(name: "c", arg: 2, scope: !1162, file: !80, line: 152, type: !8)
!1197 = !DILocalVariable(name: "i", arg: 3, scope: !1162, file: !80, line: 152, type: !19)
!1198 = !DILocalVariable(name: "uc", scope: !1162, file: !80, line: 154, type: !148)
!1199 = !DILocalVariable(name: "p", scope: !1162, file: !80, line: 155, type: !1131)
!1200 = distinct !DISubprogram(name: "quotearg_n_style", scope: !80, file: !80, line: 955, type: !1201, scopeLine: 956, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !54, retainedNodes: !4)
!1201 = !DISubroutineType(types: !1202)
!1202 = !{!7, !19, !57, !16}
!1203 = !DILocalVariable(name: "n", arg: 1, scope: !1200, file: !80, line: 955, type: !19)
!1204 = !DILocation(line: 955, column: 23, scope: !1200)
!1205 = !DILocalVariable(name: "s", arg: 2, scope: !1200, file: !80, line: 955, type: !57)
!1206 = !DILocation(line: 955, column: 45, scope: !1200)
!1207 = !DILocalVariable(name: "arg", arg: 3, scope: !1200, file: !80, line: 955, type: !16)
!1208 = !DILocation(line: 955, column: 60, scope: !1200)
!1209 = !DILocalVariable(name: "o", scope: !1200, file: !80, line: 957, type: !1210)
!1210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!1211 = !DILocation(line: 957, column: 32, scope: !1200)
!1212 = !DILocation(line: 957, column: 64, scope: !1200)
!1213 = !DILocation(line: 957, column: 36, scope: !1200)
!1214 = !DILocation(line: 958, column: 30, scope: !1200)
!1215 = !DILocation(line: 958, column: 33, scope: !1200)
!1216 = !DILocation(line: 958, column: 10, scope: !1200)
!1217 = !DILocation(line: 958, column: 3, scope: !1200)
!1218 = !DILocalVariable(name: "n", arg: 1, scope: !1219, file: !80, line: 955, type: !19)
!1219 = distinct !DISubprogram(name: "quotearg_n_style", scope: !80, file: !80, line: 955, type: !1201, scopeLine: 956, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1220, retainedNodes: !4)
!1220 = distinct !DICompileUnit(language: DW_LANG_C99, file: !55, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, retainedTypes: !72, globals: !1221, nameTableKind: None)
!1221 = !{!1222, !1224, !1226, !1235, !1237, !1239, !1246, !1248}
!1222 = !DIGlobalVariableExpression(var: !1223, expr: !DIExpression())
!1223 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !1220, file: !80, line: 85, type: !81, isLocal: false, isDefinition: true)
!1224 = !DIGlobalVariableExpression(var: !1225, expr: !DIExpression())
!1225 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !1220, file: !80, line: 101, type: !87, isLocal: false, isDefinition: true)
!1226 = !DIGlobalVariableExpression(var: !1227, expr: !DIExpression())
!1227 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !1220, file: !80, line: 1052, type: !1228, isLocal: false, isDefinition: true)
!1228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !80, line: 65, size: 448, elements: !1229)
!1229 = !{!1230, !1231, !1232, !1233, !1234}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1228, file: !80, line: 68, baseType: !57, size: 32)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1228, file: !80, line: 71, baseType: !19, size: 32, offset: 32)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !1228, file: !80, line: 75, baseType: !98, size: 256, offset: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !1228, file: !80, line: 78, baseType: !16, size: 64, offset: 320)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !1228, file: !80, line: 81, baseType: !16, size: 64, offset: 384)
!1235 = !DIGlobalVariableExpression(var: !1236, expr: !DIExpression())
!1236 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !1220, file: !80, line: 116, type: !1228, isLocal: true, isDefinition: true)
!1237 = !DIGlobalVariableExpression(var: !1238, expr: !DIExpression())
!1238 = distinct !DIGlobalVariable(name: "slot0", scope: !1220, file: !80, line: 842, type: !105, isLocal: true, isDefinition: true)
!1239 = !DIGlobalVariableExpression(var: !1240, expr: !DIExpression())
!1240 = distinct !DIGlobalVariable(name: "slotvec", scope: !1220, file: !80, line: 845, type: !1241, isLocal: true, isDefinition: true)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !80, line: 834, size: 128, elements: !1243)
!1243 = !{!1244, !1245}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1242, file: !80, line: 836, baseType: !74, size: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1242, file: !80, line: 837, baseType: !7, size: 64, offset: 64)
!1246 = !DIGlobalVariableExpression(var: !1247, expr: !DIExpression())
!1247 = distinct !DIGlobalVariable(name: "nslots", scope: !1220, file: !80, line: 843, type: !19, isLocal: true, isDefinition: true)
!1248 = !DIGlobalVariableExpression(var: !1249, expr: !DIExpression())
!1249 = distinct !DIGlobalVariable(name: "slotvec0", scope: !1220, file: !80, line: 844, type: !1242, isLocal: true, isDefinition: true)
!1250 = !DILocalVariable(name: "s", arg: 2, scope: !1219, file: !80, line: 955, type: !57)
!1251 = !DILocalVariable(name: "arg", arg: 3, scope: !1219, file: !80, line: 955, type: !16)
!1252 = !DILocalVariable(name: "o", scope: !1219, file: !80, line: 957, type: !1253)
!1253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1228)
!1254 = distinct !DISubprogram(name: "quoting_options_from_style", scope: !80, file: !80, line: 193, type: !1255, scopeLine: 194, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !54, retainedNodes: !4)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!93, !57}
!1257 = !DILocalVariable(name: "style", arg: 1, scope: !1254, file: !80, line: 193, type: !57)
!1258 = !DILocation(line: 193, column: 48, scope: !1254)
!1259 = !DILocalVariable(name: "o", scope: !1254, file: !80, line: 195, type: !93)
!1260 = !DILocation(line: 195, column: 26, scope: !1254)
!1261 = !DILocation(line: 196, column: 7, scope: !1262)
!1262 = distinct !DILexicalBlock(scope: !1254, file: !80, line: 196, column: 7)
!1263 = !DILocation(line: 196, column: 13, scope: !1262)
!1264 = !DILocation(line: 196, column: 7, scope: !1254)
!1265 = !DILocation(line: 197, column: 5, scope: !1262)
!1266 = !DILocation(line: 198, column: 13, scope: !1254)
!1267 = !DILocation(line: 198, column: 5, scope: !1254)
!1268 = !DILocation(line: 198, column: 11, scope: !1254)
!1269 = !DILocation(line: 199, column: 3, scope: !1254)
!1270 = !DILocalVariable(name: "style", arg: 1, scope: !1271, file: !80, line: 193, type: !57)
!1271 = distinct !DISubprogram(name: "quoting_options_from_style", scope: !80, file: !80, line: 193, type: !1272, scopeLine: 194, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1281, retainedNodes: !4)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{!1274, !57}
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !80, line: 65, size: 448, elements: !1275)
!1275 = !{!1276, !1277, !1278, !1279, !1280}
