; ModuleID = '<stdin>'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.file_name = type { i8*, i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.dev_ino, %struct.dev_ino, %struct.dev_ino, [3 x i64] }
%struct.dev_ino = type { i64, i64 }
%struct.__dirstream = type opaque
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external dso_local global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [23 x i8] c"Usage: %s [OPTION]...\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 41, type: !10, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !9, nameTableKind: None)
!3 = !DIFile(filename: "src/pwd.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!4 = !{}
!5 = !{!6, !7}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !{!0}
!10 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 1280, elements: !23)
!11 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !14)
!13 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "")
!14 = !{!15, !18, !20, !22}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !12, file: !13, line: 52, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !12, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !12, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !12, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!23 = !{!24}
!24 = !DISubrange(count: 5)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "Version", scope: !27, file: !28, line: 2, type: !16, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !29, nameTableKind: None)
!28 = !DIFile(filename: "src/version.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!29 = !{!25}
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !32, file: !37, line: 56, type: !38, isLocal: true, isDefinition: true)
!32 = distinct !DICompileUnit(language: DW_LANG_C99, file: !33, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !34, nameTableKind: None)
!33 = !DIFile(filename: "./lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!34 = !{!35, !30}
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "file_name", scope: !32, file: !37, line: 46, type: !16, isLocal: true, isDefinition: true)
!37 = !DIFile(filename: "lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!38 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "exit_failure", scope: !41, file: !44, line: 24, type: !45, isLocal: false, isDefinition: true)
!41 = distinct !DICompileUnit(language: DW_LANG_C99, file: !42, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !43, nameTableKind: None)
!42 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!43 = !{!39}
!44 = !DIFile(filename: "lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!45 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !19)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "program_name", scope: !48, file: !51, line: 33, type: !16, isLocal: false, isDefinition: true)
!48 = distinct !DICompileUnit(language: DW_LANG_C99, file: !49, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !50, nameTableKind: None)
!49 = !DIFile(filename: "./lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!50 = !{!46}
!51 = !DIFile(filename: "lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !54, file: !80, line: 116, type: !93, isLocal: true, isDefinition: true)
!54 = distinct !DICompileUnit(language: DW_LANG_C99, file: !55, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, retainedTypes: !72, globals: !77, nameTableKind: None)
!55 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!56 = !{!57}
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !58, line: 32, baseType: !59, size: 32, elements: !60)
!58 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!59 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!60 = !{!61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71}
!61 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!62 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!63 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!64 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!65 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!66 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!67 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!68 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!69 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!70 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!71 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!72 = !{!19, !73, !74}
!73 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !75, line: 46, baseType: !76)
!75 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.1/include/stddef.h", directory: "")
!76 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!77 = !{!78, !85, !91, !52, !103, !108, !115, !117}
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !54, file: !80, line: 85, type: !81, isLocal: false, isDefinition: true)
!80 = !DIFile(filename: "lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 704, elements: !83)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!83 = !{!84}
!84 = !DISubrange(count: 11)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !54, file: !80, line: 101, type: !87, isLocal: false, isDefinition: true)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 320, elements: !89)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!89 = !{!90}
!90 = !DISubrange(count: 10)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !54, file: !80, line: 1052, type: !93, isLocal: false, isDefinition: true)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !80, line: 65, size: 448, elements: !94)
!94 = !{!95, !96, !97, !101, !102}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !93, file: !80, line: 68, baseType: !57, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !93, file: !80, line: 71, baseType: !19, size: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !93, file: !80, line: 75, baseType: !98, size: 256, offset: 64)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 256, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 8)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !93, file: !80, line: 78, baseType: !16, size: 64, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !93, file: !80, line: 81, baseType: !16, size: 64, offset: 384)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "slot0", scope: !54, file: !80, line: 842, type: !105, isLocal: true, isDefinition: true)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 256)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "slotvec", scope: !54, file: !80, line: 845, type: !110, isLocal: true, isDefinition: true)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !80, line: 834, size: 128, elements: !112)
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !111, file: !80, line: 836, baseType: !74, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !111, file: !80, line: 837, baseType: !7, size: 64, offset: 64)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "nslots", scope: !54, file: !80, line: 843, type: !19, isLocal: true, isDefinition: true)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "slotvec0", scope: !54, file: !80, line: 844, type: !111, isLocal: true, isDefinition: true)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !121, file: !124, line: 26, type: !125, isLocal: false, isDefinition: true)
!121 = distinct !DICompileUnit(language: DW_LANG_C99, file: !122, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !123, nameTableKind: None)
!122 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!123 = !{!119}
!124 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 376, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 47)
!128 = distinct !DICompileUnit(language: DW_LANG_C99, file: !129, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!129 = !DIFile(filename: "./lib/root-dev-ino.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!130 = distinct !DICompileUnit(language: DW_LANG_C99, file: !131, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!131 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!132 = !{!6}
!133 = distinct !DICompileUnit(language: DW_LANG_C99, file: !134, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !135, nameTableKind: None)
!134 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!135 = !{!74, !7, !6}
!136 = distinct !DICompileUnit(language: DW_LANG_C99, file: !137, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!137 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!138 = distinct !DICompileUnit(language: DW_LANG_C99, file: !139, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!139 = !DIFile(filename: "./lib/xgetcwd.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!140 = distinct !DICompileUnit(language: DW_LANG_C99, file: !141, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !142, nameTableKind: None)
!141 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!142 = !{!74}
!143 = distinct !DICompileUnit(language: DW_LANG_C99, file: !144, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !145, nameTableKind: None)
!144 = !DIFile(filename: "./lib/c-strcasecmp.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!145 = !{!146}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!149 = distinct !DICompileUnit(language: DW_LANG_C99, file: !150, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!150 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!151 = distinct !DICompileUnit(language: DW_LANG_C99, file: !152, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!152 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!153 = distinct !DICompileUnit(language: DW_LANG_C99, file: !154, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!154 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!155 = distinct !DICompileUnit(language: DW_LANG_C99, file: !156, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!156 = !DIFile(filename: "./lib/setlocale_null.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!157 = distinct !DICompileUnit(language: DW_LANG_C99, file: !158, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!158 = !DIFile(filename: "./lib/fclose.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!159 = distinct !DICompileUnit(language: DW_LANG_C99, file: !160, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!160 = !DIFile(filename: "./lib/fflush.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!161 = distinct !DICompileUnit(language: DW_LANG_C99, file: !162, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!162 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!163 = distinct !DICompileUnit(language: DW_LANG_C99, file: !164, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!164 = !DIFile(filename: "./lib/c-ctype.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!165 = !{!"clang version 9.0.1-12 "}
!166 = !{i32 2, !"Dwarf Version", i32 4}
!167 = !{i32 2, !"Debug Info Version", i32 3}
!168 = !{i32 1, !"wchar_size", i32 4}
!169 = !{i32 1, !"ThinLTO", i32 0}
!170 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!171 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 51, type: !172, scopeLine: 52, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !19}
!174 = !DILocalVariable(name: "status", arg: 1, scope: !171, file: !3, line: 51, type: !19)
!175 = !DILocation(line: 51, column: 12, scope: !171)
!176 = !DILocation(line: 53, column: 7, scope: !177)
!177 = distinct !DILexicalBlock(scope: !171, file: !3, line: 53, column: 7)
!178 = !DILocation(line: 53, column: 14, scope: !177)
!179 = !DILocation(line: 53, column: 7, scope: !171)
!180 = !DILocation(line: 54, column: 5, scope: !177)
!181 = !DILocation(line: 54, column: 5, scope: !182)
!182 = distinct !DILexicalBlock(scope: !177, file: !3, line: 54, column: 5)
!183 = !DILocation(line: 57, column: 15, scope: !184)
!184 = distinct !DILexicalBlock(scope: !177, file: !3, line: 56, column: 5)
!185 = !DILocation(line: 57, column: 45, scope: !184)
!186 = !DILocation(line: 57, column: 7, scope: !184)
!187 = !DILocation(line: 58, column: 7, scope: !184)
!188 = !DILocation(line: 62, column: 7, scope: !184)
!189 = !DILocation(line: 66, column: 7, scope: !184)
!190 = !DILocation(line: 67, column: 7, scope: !184)
!191 = !DILocation(line: 68, column: 7, scope: !184)
!192 = !DILocation(line: 71, column: 15, scope: !184)
!193 = !DILocation(line: 71, column: 7, scope: !184)
!194 = !DILocation(line: 72, column: 7, scope: !184)
!195 = !DILocation(line: 74, column: 9, scope: !171)
!196 = !DILocation(line: 74, column: 3, scope: !171)
!197 = !DILocalVariable(name: "status", arg: 1, scope: !198, file: !3, line: 51, type: !19)
!198 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 51, type: !172, scopeLine: 52, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !199, retainedNodes: !4)
!199 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !200, nameTableKind: None)
!200 = !{!201}
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "longopts", scope: !199, file: !3, line: 41, type: !203, isLocal: true, isDefinition: true)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 1280, elements: !23)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !206)
!206 = !{!207, !208, !209, !210}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !205, file: !13, line: 52, baseType: !16, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !205, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !205, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !205, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!211 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !212, file: !212, line: 634, type: !213, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!212 = !DIFile(filename: "src/system.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!213 = !DISubroutineType(types: !214)
!214 = !{null, !16}
!215 = !DILocalVariable(name: "program", arg: 1, scope: !211, file: !212, line: 634, type: !16)
!216 = !DILocation(line: 634, column: 34, scope: !211)
!217 = !DILocalVariable(name: "infomap", scope: !211, file: !212, line: 636, type: !218)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 896, elements: !224)
!219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !211, file: !212, line: 636, size: 128, elements: !221)
!221 = !{!222, !223}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !220, file: !212, line: 636, baseType: !16, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !220, file: !212, line: 636, baseType: !16, size: 64, offset: 64)
!224 = !{!225}
!225 = !DISubrange(count: 7)
!226 = !DILocation(line: 636, column: 67, scope: !211)
!227 = !DILocalVariable(name: "node", scope: !211, file: !212, line: 646, type: !16)
!228 = !DILocation(line: 646, column: 15, scope: !211)
!229 = !DILocation(line: 646, column: 22, scope: !211)
!230 = !DILocalVariable(name: "map_prog", scope: !211, file: !212, line: 647, type: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!232 = !DILocation(line: 647, column: 25, scope: !211)
!233 = !DILocation(line: 647, column: 36, scope: !211)
!234 = !DILocation(line: 649, column: 3, scope: !211)
!235 = !DILocation(line: 649, column: 10, scope: !211)
!236 = !DILocation(line: 649, column: 20, scope: !211)
!237 = !DILocation(line: 649, column: 28, scope: !211)
!238 = !DILocation(line: 649, column: 33, scope: !211)
!239 = !DILocation(line: 649, column: 31, scope: !211)
!240 = !DILocation(line: 0, scope: !211)
!241 = !DILocation(line: 650, column: 13, scope: !211)
!242 = distinct !{!242, !234, !241}
!243 = !DILocation(line: 652, column: 7, scope: !244)
!244 = distinct !DILexicalBlock(scope: !211, file: !212, line: 652, column: 7)
!245 = !DILocation(line: 652, column: 17, scope: !244)
!246 = !DILocation(line: 652, column: 7, scope: !211)
!247 = !DILocation(line: 653, column: 12, scope: !244)
!248 = !DILocation(line: 653, column: 22, scope: !244)
!249 = !DILocation(line: 653, column: 10, scope: !244)
!250 = !DILocation(line: 653, column: 5, scope: !244)
!251 = !DILocation(line: 655, column: 11, scope: !211)
!252 = !DILocation(line: 655, column: 3, scope: !211)
!253 = !DILocalVariable(name: "lc_messages", scope: !211, file: !212, line: 659, type: !16)
!254 = !DILocation(line: 659, column: 15, scope: !211)
!255 = !DILocation(line: 659, column: 29, scope: !211)
!256 = !DILocation(line: 660, column: 7, scope: !257)
!257 = distinct !DILexicalBlock(scope: !211, file: !212, line: 660, column: 7)
!258 = !DILocation(line: 660, column: 19, scope: !257)
!259 = !DILocation(line: 660, column: 22, scope: !257)
!260 = !DILocation(line: 660, column: 7, scope: !211)
!261 = !DILocation(line: 666, column: 7, scope: !262)
!262 = distinct !DILexicalBlock(scope: !257, file: !212, line: 661, column: 5)
!263 = !DILocation(line: 668, column: 5, scope: !262)
!264 = !DILocation(line: 669, column: 11, scope: !211)
!265 = !DILocation(line: 670, column: 24, scope: !211)
!266 = !DILocation(line: 669, column: 3, scope: !211)
!267 = !DILocation(line: 671, column: 11, scope: !211)
!268 = !DILocation(line: 672, column: 11, scope: !211)
!269 = !DILocation(line: 672, column: 17, scope: !211)
!270 = !DILocation(line: 672, column: 25, scope: !211)
!271 = !DILocation(line: 672, column: 22, scope: !211)
!272 = !DILocation(line: 671, column: 3, scope: !211)
!273 = !DILocation(line: 673, column: 1, scope: !211)
!274 = !DILocalVariable(name: "lc_messages", scope: !275, file: !212, line: 659, type: !16)
!275 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !212, file: !212, line: 634, type: !213, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !276, retainedNodes: !4)
!276 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !277, nameTableKind: None)
!277 = !{!278}
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "longopts", scope: !276, file: !3, line: 41, type: !280, isLocal: true, isDefinition: true)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 1280, elements: !23)
!281 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !283)
!283 = !{!284, !285, !286, !287}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !282, file: !13, line: 52, baseType: !16, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !282, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !282, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !282, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!288 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 327, type: !289, scopeLine: 328, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!289 = !DISubroutineType(types: !290)
!290 = !{!19, !19, !291}
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!292 = !DILocalVariable(name: "argc", arg: 1, scope: !288, file: !3, line: 327, type: !19)
!293 = !DILocation(line: 327, column: 11, scope: !288)
!294 = !DILocalVariable(name: "argv", arg: 2, scope: !288, file: !3, line: 327, type: !291)
!295 = !DILocation(line: 327, column: 24, scope: !288)
!296 = !DILocalVariable(name: "wd", scope: !288, file: !3, line: 329, type: !7)
!297 = !DILocation(line: 329, column: 9, scope: !288)
!298 = !DILocalVariable(name: "logical", scope: !288, file: !3, line: 333, type: !38)
!299 = !DILocation(line: 333, column: 8, scope: !288)
!300 = !DILocation(line: 333, column: 19, scope: !288)
!301 = !DILocation(line: 333, column: 46, scope: !288)
!302 = !DILocation(line: 336, column: 21, scope: !288)
!303 = !DILocation(line: 336, column: 3, scope: !288)
!304 = !DILocation(line: 337, column: 3, scope: !288)
!305 = !DILocation(line: 338, column: 3, scope: !288)
!306 = !DILocation(line: 339, column: 3, scope: !288)
!307 = !DILocation(line: 341, column: 3, scope: !288)
!308 = !DILocation(line: 343, column: 3, scope: !288)
!309 = !DILocalVariable(name: "c", scope: !310, file: !3, line: 345, type: !19)
!310 = distinct !DILexicalBlock(scope: !288, file: !3, line: 344, column: 5)
!311 = !DILocation(line: 345, column: 11, scope: !310)
!312 = !DILocation(line: 345, column: 28, scope: !310)
!313 = !DILocation(line: 345, column: 34, scope: !310)
!314 = !DILocation(line: 345, column: 15, scope: !310)
!315 = !DILocation(line: 346, column: 11, scope: !316)
!316 = distinct !DILexicalBlock(scope: !310, file: !3, line: 346, column: 11)
!317 = !DILocation(line: 346, column: 13, scope: !316)
!318 = !DILocation(line: 347, column: 9, scope: !316)
!319 = !DILocation(line: 348, column: 15, scope: !310)
!320 = !DILocation(line: 348, column: 7, scope: !310)
!321 = !DILocation(line: 351, column: 19, scope: !322)
!322 = distinct !DILexicalBlock(scope: !310, file: !3, line: 349, column: 9)
!323 = !DILocation(line: 352, column: 11, scope: !322)
!324 = !DILocation(line: 354, column: 19, scope: !322)
!325 = !DILocation(line: 355, column: 11, scope: !322)
!326 = !DILocation(line: 357, column: 9, scope: !322)
!327 = !DILocation(line: 359, column: 9, scope: !322)
!328 = !DILocation(line: 362, column: 11, scope: !322)
!329 = distinct !{!329, !308, !330}
!330 = !DILocation(line: 364, column: 5, scope: !288)
!331 = !DILocation(line: 366, column: 7, scope: !332)
!332 = distinct !DILexicalBlock(scope: !288, file: !3, line: 366, column: 7)
!333 = !DILocation(line: 366, column: 16, scope: !332)
!334 = !DILocation(line: 366, column: 14, scope: !332)
!335 = !DILocation(line: 366, column: 7, scope: !288)
!336 = !DILocation(line: 367, column: 18, scope: !332)
!337 = !DILocation(line: 367, column: 5, scope: !332)
!338 = !DILocation(line: 369, column: 7, scope: !339)
!339 = distinct !DILexicalBlock(scope: !288, file: !3, line: 369, column: 7)
!340 = !DILocation(line: 369, column: 7, scope: !288)
!341 = !DILocation(line: 371, column: 12, scope: !342)
!342 = distinct !DILexicalBlock(scope: !339, file: !3, line: 370, column: 5)
!343 = !DILocation(line: 371, column: 10, scope: !342)
!344 = !DILocation(line: 372, column: 11, scope: !345)
!345 = distinct !DILexicalBlock(scope: !342, file: !3, line: 372, column: 11)
!346 = !DILocation(line: 372, column: 11, scope: !342)
!347 = !DILocation(line: 374, column: 17, scope: !348)
!348 = distinct !DILexicalBlock(scope: !345, file: !3, line: 373, column: 9)
!349 = !DILocation(line: 374, column: 11, scope: !348)
!350 = !DILocation(line: 375, column: 11, scope: !348)
!351 = !DILocation(line: 377, column: 5, scope: !342)
!352 = !DILocation(line: 379, column: 8, scope: !288)
!353 = !DILocation(line: 379, column: 6, scope: !288)
!354 = !DILocation(line: 380, column: 7, scope: !355)
!355 = distinct !DILexicalBlock(scope: !288, file: !3, line: 380, column: 7)
!356 = !DILocation(line: 380, column: 10, scope: !355)
!357 = !DILocation(line: 380, column: 7, scope: !288)
!358 = !DILocation(line: 382, column: 13, scope: !359)
!359 = distinct !DILexicalBlock(scope: !355, file: !3, line: 381, column: 5)
!360 = !DILocation(line: 382, column: 7, scope: !359)
!361 = !DILocation(line: 383, column: 13, scope: !359)
!362 = !DILocation(line: 383, column: 7, scope: !359)
!363 = !DILocation(line: 384, column: 5, scope: !359)
!364 = !DILocalVariable(name: "file_name", scope: !365, file: !3, line: 387, type: !366)
!365 = distinct !DILexicalBlock(scope: !355, file: !3, line: 386, column: 5)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 34, size: 192, elements: !368)
!368 = !{!369, !370, !371}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !367, file: !3, line: 36, baseType: !7, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !367, file: !3, line: 37, baseType: !74, size: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !367, file: !3, line: 38, baseType: !7, size: 64, offset: 128)
!372 = !DILocation(line: 387, column: 25, scope: !365)
!373 = !DILocation(line: 387, column: 37, scope: !365)
!374 = !DILocation(line: 388, column: 22, scope: !365)
!375 = !DILocation(line: 388, column: 7, scope: !365)
!376 = !DILocation(line: 389, column: 13, scope: !365)
!377 = !DILocation(line: 389, column: 24, scope: !365)
!378 = !DILocation(line: 389, column: 7, scope: !365)
!379 = !DILocation(line: 390, column: 23, scope: !365)
!380 = !DILocation(line: 390, column: 7, scope: !365)
!381 = !DILocation(line: 393, column: 3, scope: !288)
!382 = !DILocation(line: 394, column: 1, scope: !288)
!383 = !DILocalVariable(name: "argc", arg: 1, scope: !384, file: !3, line: 327, type: !19)
!384 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 327, type: !289, scopeLine: 328, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !385, retainedNodes: !4)
!385 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !386, nameTableKind: None)
!386 = !{!387}
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "longopts", scope: !385, file: !3, line: 41, type: !389, isLocal: true, isDefinition: true)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 1280, elements: !23)
!390 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !392)
!392 = !{!393, !394, !395, !396}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !391, file: !13, line: 52, baseType: !16, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !391, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !391, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !391, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!397 = !DILocalVariable(name: "argv", arg: 2, scope: !384, file: !3, line: 327, type: !291)
!398 = !DILocalVariable(name: "wd", scope: !384, file: !3, line: 329, type: !7)
!399 = !DILocalVariable(name: "logical", scope: !384, file: !3, line: 333, type: !38)
!400 = distinct !DISubprogram(name: "logical_getcwd", scope: !3, file: !3, line: 300, type: !401, scopeLine: 301, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!401 = !DISubroutineType(types: !402)
!402 = !{!7}
!403 = !DILocalVariable(name: "st1", scope: !400, file: !3, line: 302, type: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !405, line: 46, size: 1152, elements: !406)
!405 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!406 = !{!407, !410, !412, !414, !416, !418, !420, !421, !422, !425, !427, !429, !437, !438, !439}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !404, file: !405, line: 48, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !409, line: 145, baseType: !76)
!409 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!410 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !404, file: !405, line: 53, baseType: !411, size: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !409, line: 148, baseType: !76)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !404, file: !405, line: 61, baseType: !413, size: 64, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !409, line: 151, baseType: !76)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !404, file: !405, line: 62, baseType: !415, size: 32, offset: 192)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !409, line: 150, baseType: !59)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !404, file: !405, line: 64, baseType: !417, size: 32, offset: 224)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !409, line: 146, baseType: !59)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !404, file: !405, line: 65, baseType: !419, size: 32, offset: 256)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !409, line: 147, baseType: !59)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !404, file: !405, line: 67, baseType: !19, size: 32, offset: 288)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !404, file: !405, line: 69, baseType: !408, size: 64, offset: 320)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !404, file: !405, line: 74, baseType: !423, size: 64, offset: 384)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !409, line: 152, baseType: !424)
!424 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !404, file: !405, line: 78, baseType: !426, size: 64, offset: 448)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !409, line: 174, baseType: !424)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !404, file: !405, line: 80, baseType: !428, size: 64, offset: 512)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !409, line: 179, baseType: !424)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !404, file: !405, line: 91, baseType: !430, size: 128, offset: 576)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !431, line: 10, size: 128, elements: !432)
!431 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!432 = !{!433, !435}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !430, file: !431, line: 12, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !409, line: 160, baseType: !424)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !430, file: !431, line: 16, baseType: !436, size: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !409, line: 196, baseType: !424)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !404, file: !405, line: 92, baseType: !430, size: 128, offset: 704)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !404, file: !405, line: 93, baseType: !430, size: 128, offset: 832)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !404, file: !405, line: 106, baseType: !440, size: 192, offset: 960)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 192, elements: !441)
!441 = !{!442}
!442 = !DISubrange(count: 3)
!443 = !DILocation(line: 302, column: 15, scope: !400)
!444 = !DILocalVariable(name: "st2", scope: !400, file: !3, line: 303, type: !404)
!445 = !DILocation(line: 303, column: 15, scope: !400)
!446 = !DILocalVariable(name: "wd", scope: !400, file: !3, line: 304, type: !7)
!447 = !DILocation(line: 304, column: 9, scope: !400)
!448 = !DILocation(line: 304, column: 14, scope: !400)
!449 = !DILocalVariable(name: "p", scope: !400, file: !3, line: 305, type: !7)
!450 = !DILocation(line: 305, column: 9, scope: !400)
!451 = !DILocation(line: 308, column: 8, scope: !452)
!452 = distinct !DILexicalBlock(scope: !400, file: !3, line: 308, column: 7)
!453 = !DILocation(line: 308, column: 11, scope: !452)
!454 = !DILocation(line: 308, column: 14, scope: !452)
!455 = !DILocation(line: 308, column: 20, scope: !452)
!456 = !DILocation(line: 308, column: 7, scope: !400)
!457 = !DILocation(line: 309, column: 5, scope: !452)
!458 = !DILocation(line: 310, column: 7, scope: !400)
!459 = !DILocation(line: 310, column: 5, scope: !400)
!460 = !DILocation(line: 311, column: 3, scope: !400)
!461 = !DILocation(line: 311, column: 23, scope: !400)
!462 = !DILocation(line: 311, column: 15, scope: !400)
!463 = !DILocation(line: 311, column: 13, scope: !400)
!464 = !DILocation(line: 313, column: 12, scope: !465)
!465 = distinct !DILexicalBlock(scope: !466, file: !3, line: 313, column: 11)
!466 = distinct !DILexicalBlock(scope: !400, file: !3, line: 312, column: 5)
!467 = !DILocation(line: 313, column: 17, scope: !465)
!468 = !DILocation(line: 313, column: 20, scope: !465)
!469 = !DILocation(line: 313, column: 25, scope: !465)
!470 = !DILocation(line: 314, column: 11, scope: !465)
!471 = !DILocation(line: 314, column: 15, scope: !465)
!472 = !DILocation(line: 314, column: 20, scope: !465)
!473 = !DILocation(line: 314, column: 27, scope: !465)
!474 = !DILocation(line: 314, column: 32, scope: !465)
!475 = !DILocation(line: 314, column: 37, scope: !465)
!476 = !DILocation(line: 314, column: 40, scope: !465)
!477 = !DILocation(line: 314, column: 45, scope: !465)
!478 = !DILocation(line: 313, column: 11, scope: !466)
!479 = !DILocation(line: 315, column: 9, scope: !465)
!480 = !DILocation(line: 316, column: 8, scope: !466)
!481 = distinct !{!481, !460, !482}
!482 = !DILocation(line: 317, column: 5, scope: !400)
!483 = !DILocation(line: 320, column: 13, scope: !484)
!484 = distinct !DILexicalBlock(scope: !400, file: !3, line: 320, column: 7)
!485 = !DILocation(line: 320, column: 7, scope: !484)
!486 = !DILocation(line: 320, column: 23, scope: !484)
!487 = !DILocation(line: 320, column: 31, scope: !484)
!488 = !DILocation(line: 320, column: 48, scope: !484)
!489 = !DILocation(line: 320, column: 56, scope: !484)
!490 = !DILocation(line: 320, column: 7, scope: !400)
!491 = !DILocation(line: 321, column: 12, scope: !484)
!492 = !DILocation(line: 321, column: 5, scope: !484)
!493 = !DILocation(line: 322, column: 3, scope: !400)
!494 = !DILocation(line: 323, column: 1, scope: !400)
!495 = !DILocalVariable(name: "st1", scope: !496, file: !3, line: 302, type: !509)
!496 = distinct !DISubprogram(name: "logical_getcwd", scope: !3, file: !3, line: 300, type: !401, scopeLine: 301, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !497, retainedNodes: !4)
!497 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !498, nameTableKind: None)
!498 = !{!499}
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "longopts", scope: !497, file: !3, line: 41, type: !501, isLocal: true, isDefinition: true)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !502, size: 1280, elements: !23)
!502 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !504)
!504 = !{!505, !506, !507, !508}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !503, file: !13, line: 52, baseType: !16, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !503, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !503, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !503, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !405, line: 46, size: 1152, elements: !510)
!510 = !{!511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !527, !528, !529}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !509, file: !405, line: 48, baseType: !408, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !509, file: !405, line: 53, baseType: !411, size: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !509, file: !405, line: 61, baseType: !413, size: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !509, file: !405, line: 62, baseType: !415, size: 32, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !509, file: !405, line: 64, baseType: !417, size: 32, offset: 224)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !509, file: !405, line: 65, baseType: !419, size: 32, offset: 256)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !509, file: !405, line: 67, baseType: !19, size: 32, offset: 288)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !509, file: !405, line: 69, baseType: !408, size: 64, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !509, file: !405, line: 74, baseType: !423, size: 64, offset: 384)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !509, file: !405, line: 78, baseType: !426, size: 64, offset: 448)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !509, file: !405, line: 80, baseType: !428, size: 64, offset: 512)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !509, file: !405, line: 91, baseType: !523, size: 128, offset: 576)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !431, line: 10, size: 128, elements: !524)
!524 = !{!525, !526}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !523, file: !431, line: 12, baseType: !434, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !523, file: !431, line: 16, baseType: !436, size: 64, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !509, file: !405, line: 92, baseType: !523, size: 128, offset: 704)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !509, file: !405, line: 93, baseType: !523, size: 128, offset: 832)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !509, file: !405, line: 106, baseType: !440, size: 192, offset: 960)
!530 = !DILocalVariable(name: "st2", scope: !496, file: !3, line: 303, type: !509)
!531 = !DILocalVariable(name: "wd", scope: !496, file: !3, line: 304, type: !7)
!532 = !DILocalVariable(name: "p", scope: !496, file: !3, line: 305, type: !7)
!533 = distinct !DISubprogram(name: "file_name_init", scope: !3, file: !3, line: 85, type: !534, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!534 = !DISubroutineType(types: !535)
!535 = !{!366}
!536 = !DILocalVariable(name: "p", scope: !533, file: !3, line: 87, type: !366)
!537 = !DILocation(line: 87, column: 21, scope: !533)
!538 = !DILocation(line: 87, column: 25, scope: !533)
!539 = !DILocation(line: 91, column: 3, scope: !533)
!540 = !DILocation(line: 91, column: 6, scope: !533)
!541 = !DILocation(line: 91, column: 14, scope: !533)
!542 = !DILocation(line: 93, column: 21, scope: !533)
!543 = !DILocation(line: 93, column: 24, scope: !533)
!544 = !DILocation(line: 93, column: 12, scope: !533)
!545 = !DILocation(line: 93, column: 3, scope: !533)
!546 = !DILocation(line: 93, column: 6, scope: !533)
!547 = !DILocation(line: 93, column: 10, scope: !533)
!548 = !DILocation(line: 94, column: 14, scope: !533)
!549 = !DILocation(line: 94, column: 17, scope: !533)
!550 = !DILocation(line: 94, column: 24, scope: !533)
!551 = !DILocation(line: 94, column: 27, scope: !533)
!552 = !DILocation(line: 94, column: 35, scope: !533)
!553 = !DILocation(line: 94, column: 21, scope: !533)
!554 = !DILocation(line: 94, column: 3, scope: !533)
!555 = !DILocation(line: 94, column: 6, scope: !533)
!556 = !DILocation(line: 94, column: 12, scope: !533)
!557 = !DILocation(line: 95, column: 3, scope: !533)
!558 = !DILocation(line: 95, column: 6, scope: !533)
!559 = !DILocation(line: 95, column: 15, scope: !533)
!560 = !DILocation(line: 96, column: 10, scope: !533)
!561 = !DILocation(line: 96, column: 3, scope: !533)
!562 = !DILocalVariable(name: "p", scope: !563, file: !3, line: 87, type: !566)
!563 = distinct !DISubprogram(name: "file_name_init", scope: !3, file: !3, line: 85, type: !564, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !572, retainedNodes: !4)
!564 = !DISubroutineType(types: !565)
!565 = !{!566}
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 34, size: 192, elements: !568)
!568 = !{!569, !570, !571}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !567, file: !3, line: 36, baseType: !7, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !567, file: !3, line: 37, baseType: !74, size: 64, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !567, file: !3, line: 38, baseType: !7, size: 64, offset: 128)
!572 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !573, nameTableKind: None)
!573 = !{!574}
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "longopts", scope: !572, file: !3, line: 41, type: !576, isLocal: true, isDefinition: true)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !577, size: 1280, elements: !23)
!577 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !579)
!579 = !{!580, !581, !582, !583}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !578, file: !13, line: 52, baseType: !16, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !578, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !578, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !578, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!584 = distinct !DISubprogram(name: "robust_getcwd", scope: !3, file: !3, line: 268, type: !585, scopeLine: 269, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!585 = !DISubroutineType(types: !586)
!586 = !{null, !366}
!587 = !DILocalVariable(name: "file_name", arg: 1, scope: !584, file: !3, line: 268, type: !366)
!588 = !DILocation(line: 268, column: 34, scope: !584)
!589 = !DILocalVariable(name: "height", scope: !584, file: !3, line: 270, type: !74)
!590 = !DILocation(line: 270, column: 10, scope: !584)
!591 = !DILocalVariable(name: "dev_ino_buf", scope: !584, file: !3, line: 271, type: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !593, line: 7, size: 128, elements: !594)
!593 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!594 = !{!595, !598}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !592, file: !593, line: 9, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !597, line: 47, baseType: !411)
!597 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!598 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !592, file: !593, line: 10, baseType: !599, size: 64, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !597, line: 59, baseType: !408)
!600 = !DILocation(line: 271, column: 18, scope: !584)
!601 = !DILocalVariable(name: "root_dev_ino", scope: !584, file: !3, line: 272, type: !602)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!603 = !DILocation(line: 272, column: 19, scope: !584)
!604 = !DILocation(line: 272, column: 34, scope: !584)
!605 = !DILocalVariable(name: "dot_sb", scope: !584, file: !3, line: 273, type: !404)
!606 = !DILocation(line: 273, column: 15, scope: !584)
!607 = !DILocation(line: 275, column: 7, scope: !608)
!608 = distinct !DILexicalBlock(scope: !584, file: !3, line: 275, column: 7)
!609 = !DILocation(line: 275, column: 20, scope: !608)
!610 = !DILocation(line: 275, column: 7, scope: !584)
!611 = !DILocation(line: 276, column: 5, scope: !608)
!612 = !DILocation(line: 279, column: 7, scope: !613)
!613 = distinct !DILexicalBlock(scope: !584, file: !3, line: 279, column: 7)
!614 = !DILocation(line: 279, column: 27, scope: !613)
!615 = !DILocation(line: 279, column: 7, scope: !584)
!616 = !DILocation(line: 280, column: 5, scope: !613)
!617 = !DILocation(line: 282, column: 3, scope: !584)
!618 = !DILocation(line: 285, column: 11, scope: !619)
!619 = distinct !DILexicalBlock(scope: !620, file: !3, line: 285, column: 11)
!620 = distinct !DILexicalBlock(scope: !584, file: !3, line: 283, column: 5)
!621 = !DILocation(line: 285, column: 11, scope: !620)
!622 = !DILocation(line: 286, column: 9, scope: !619)
!623 = !DILocation(line: 288, column: 32, scope: !620)
!624 = !DILocation(line: 288, column: 49, scope: !620)
!625 = !DILocation(line: 288, column: 7, scope: !620)
!626 = distinct !{!626, !617, !627}
!627 = !DILocation(line: 289, column: 5, scope: !584)
!628 = !DILocation(line: 292, column: 7, scope: !629)
!629 = distinct !DILexicalBlock(scope: !584, file: !3, line: 292, column: 7)
!630 = !DILocation(line: 292, column: 18, scope: !629)
!631 = !DILocation(line: 292, column: 27, scope: !629)
!632 = !DILocation(line: 292, column: 7, scope: !584)
!633 = !DILocation(line: 293, column: 24, scope: !629)
!634 = !DILocation(line: 293, column: 5, scope: !629)
!635 = !DILocation(line: 294, column: 1, scope: !584)
!636 = distinct !DISubprogram(name: "file_name_free", scope: !3, file: !3, line: 78, type: !585, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!637 = !DILocalVariable(name: "p", arg: 1, scope: !636, file: !3, line: 78, type: !366)
!638 = !DILocation(line: 78, column: 35, scope: !636)
!639 = !DILocation(line: 80, column: 9, scope: !636)
!640 = !DILocation(line: 80, column: 12, scope: !636)
!641 = !DILocation(line: 80, column: 3, scope: !636)
!642 = !DILocation(line: 81, column: 9, scope: !636)
!643 = !DILocation(line: 81, column: 3, scope: !636)
!644 = !DILocation(line: 82, column: 1, scope: !636)
!645 = !DILocalVariable(name: "p", arg: 1, scope: !646, file: !3, line: 78, type: !649)
!646 = distinct !DISubprogram(name: "file_name_free", scope: !3, file: !3, line: 78, type: !647, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !655, retainedNodes: !4)
!647 = !DISubroutineType(types: !648)
!648 = !{null, !649}
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 34, size: 192, elements: !651)
!651 = !{!652, !653, !654}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !650, file: !3, line: 36, baseType: !7, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !650, file: !3, line: 37, baseType: !74, size: 64, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !650, file: !3, line: 38, baseType: !7, size: 64, offset: 128)
!655 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !656, nameTableKind: None)
!656 = !{!657}
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "longopts", scope: !655, file: !3, line: 41, type: !659, isLocal: true, isDefinition: true)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !660, size: 1280, elements: !23)
!660 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !662)
!662 = !{!663, !664, !665, !666}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !661, file: !13, line: 52, baseType: !16, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !661, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !661, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !661, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!667 = distinct !DISubprogram(name: "find_dir_entry", scope: !3, file: !3, line: 153, type: !668, scopeLine: 155, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!668 = !DISubroutineType(types: !669)
!669 = !{null, !670, !366, !74}
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!671 = !DILocalVariable(name: "dot_sb", arg: 1, scope: !667, file: !3, line: 153, type: !670)
!672 = !DILocation(line: 153, column: 30, scope: !667)
!673 = !DILocalVariable(name: "file_name", arg: 2, scope: !667, file: !3, line: 153, type: !366)
!674 = !DILocation(line: 153, column: 56, scope: !667)
!675 = !DILocalVariable(name: "parent_height", arg: 3, scope: !667, file: !3, line: 154, type: !74)
!676 = !DILocation(line: 154, column: 24, scope: !667)
!677 = !DILocalVariable(name: "dirp", scope: !667, file: !3, line: 156, type: !678)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !680, line: 127, baseType: !681)
!680 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!681 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !680, line: 127, flags: DIFlagFwdDecl)
!682 = !DILocation(line: 156, column: 8, scope: !667)
!683 = !DILocalVariable(name: "fd", scope: !667, file: !3, line: 157, type: !19)
!684 = !DILocation(line: 157, column: 7, scope: !667)
!685 = !DILocalVariable(name: "parent_sb", scope: !667, file: !3, line: 158, type: !404)
!686 = !DILocation(line: 158, column: 15, scope: !667)
!687 = !DILocalVariable(name: "use_lstat", scope: !667, file: !3, line: 159, type: !38)
!688 = !DILocation(line: 159, column: 8, scope: !667)
!689 = !DILocalVariable(name: "found", scope: !667, file: !3, line: 160, type: !38)
!690 = !DILocation(line: 160, column: 8, scope: !667)
!691 = !DILocation(line: 162, column: 10, scope: !667)
!692 = !DILocation(line: 162, column: 8, scope: !667)
!693 = !DILocation(line: 163, column: 7, scope: !694)
!694 = distinct !DILexicalBlock(scope: !667, file: !3, line: 163, column: 7)
!695 = !DILocation(line: 163, column: 12, scope: !694)
!696 = !DILocation(line: 163, column: 7, scope: !667)
!697 = !DILocation(line: 164, column: 5, scope: !694)
!698 = !DILocation(line: 167, column: 15, scope: !667)
!699 = !DILocation(line: 167, column: 8, scope: !667)
!700 = !DILocation(line: 167, column: 6, scope: !667)
!701 = !DILocation(line: 168, column: 13, scope: !702)
!702 = distinct !DILexicalBlock(scope: !667, file: !3, line: 168, column: 7)
!703 = !DILocation(line: 168, column: 10, scope: !702)
!704 = !DILocation(line: 168, column: 8, scope: !702)
!705 = !DILocation(line: 168, column: 26, scope: !702)
!706 = !DILocation(line: 168, column: 18, scope: !702)
!707 = !DILocation(line: 168, column: 32, scope: !702)
!708 = !DILocation(line: 168, column: 46, scope: !702)
!709 = !DILocation(line: 168, column: 7, scope: !667)
!710 = !DILocation(line: 169, column: 5, scope: !702)
!711 = !DILocation(line: 172, column: 13, scope: !712)
!712 = distinct !DILexicalBlock(scope: !667, file: !3, line: 172, column: 7)
!713 = !DILocation(line: 172, column: 10, scope: !712)
!714 = !DILocation(line: 172, column: 8, scope: !712)
!715 = !DILocation(line: 172, column: 25, scope: !712)
!716 = !DILocation(line: 172, column: 18, scope: !712)
!717 = !DILocation(line: 172, column: 43, scope: !712)
!718 = !DILocation(line: 172, column: 67, scope: !712)
!719 = !DILocation(line: 172, column: 7, scope: !667)
!720 = !DILocation(line: 173, column: 5, scope: !712)
!721 = !DILocation(line: 178, column: 26, scope: !667)
!722 = !DILocation(line: 178, column: 36, scope: !667)
!723 = !DILocation(line: 178, column: 44, scope: !667)
!724 = !DILocation(line: 178, column: 33, scope: !667)
!725 = !DILocation(line: 178, column: 13, scope: !667)
!726 = !DILocation(line: 180, column: 9, scope: !667)
!727 = !DILocation(line: 181, column: 3, scope: !667)
!728 = !DILocalVariable(name: "dp", scope: !729, file: !3, line: 183, type: !730)
!729 = distinct !DILexicalBlock(scope: !667, file: !3, line: 182, column: 5)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !733, line: 22, size: 2240, elements: !734)
!733 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!734 = !{!735, !736, !737, !738, !739}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !732, file: !733, line: 25, baseType: !411, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !732, file: !733, line: 26, baseType: !423, size: 64, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !732, file: !733, line: 31, baseType: !73, size: 16, offset: 128)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !732, file: !733, line: 32, baseType: !148, size: 8, offset: 144)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !732, file: !733, line: 33, baseType: !105, size: 2048, offset: 152)
!740 = !DILocation(line: 183, column: 28, scope: !729)
!741 = !DILocalVariable(name: "ent_sb", scope: !729, file: !3, line: 184, type: !404)
!742 = !DILocation(line: 184, column: 19, scope: !729)
!743 = !DILocalVariable(name: "ino", scope: !729, file: !3, line: 185, type: !596)
!744 = !DILocation(line: 185, column: 13, scope: !729)
!745 = !DILocation(line: 187, column: 7, scope: !729)
!746 = !DILocation(line: 187, column: 13, scope: !729)
!747 = !DILocation(line: 188, column: 50, scope: !748)
!748 = distinct !DILexicalBlock(scope: !729, file: !3, line: 188, column: 11)
!749 = !DILocation(line: 188, column: 17, scope: !748)
!750 = !DILocation(line: 188, column: 15, scope: !748)
!751 = !DILocation(line: 188, column: 57, scope: !748)
!752 = !DILocation(line: 188, column: 11, scope: !729)
!753 = !DILocation(line: 190, column: 15, scope: !754)
!754 = distinct !DILexicalBlock(scope: !755, file: !3, line: 190, column: 15)
!755 = distinct !DILexicalBlock(scope: !748, file: !3, line: 189, column: 9)
!756 = !DILocation(line: 190, column: 15, scope: !755)
!757 = !DILocalVariable(name: "e", scope: !758, file: !3, line: 193, type: !19)
!758 = distinct !DILexicalBlock(scope: !754, file: !3, line: 191, column: 13)
!759 = !DILocation(line: 193, column: 19, scope: !758)
!760 = !DILocation(line: 193, column: 23, scope: !758)
!761 = !DILocation(line: 194, column: 25, scope: !758)
!762 = !DILocation(line: 194, column: 15, scope: !758)
!763 = !DILocation(line: 195, column: 23, scope: !758)
!764 = !DILocation(line: 195, column: 15, scope: !758)
!765 = !DILocation(line: 195, column: 21, scope: !758)
!766 = !DILocation(line: 198, column: 20, scope: !758)
!767 = !DILocation(line: 199, column: 13, scope: !758)
!768 = !DILocation(line: 200, column: 11, scope: !755)
!769 = !DILocation(line: 203, column: 13, scope: !729)
!770 = !DILocation(line: 203, column: 11, scope: !729)
!771 = !DILocation(line: 205, column: 11, scope: !772)
!772 = distinct !DILexicalBlock(scope: !729, file: !3, line: 205, column: 11)
!773 = !DILocation(line: 205, column: 15, scope: !772)
!774 = !DILocation(line: 205, column: 38, scope: !772)
!775 = !DILocation(line: 205, column: 41, scope: !772)
!776 = !DILocation(line: 205, column: 11, scope: !729)
!777 = !DILocation(line: 207, column: 22, scope: !778)
!778 = distinct !DILexicalBlock(scope: !779, file: !3, line: 207, column: 15)
!779 = distinct !DILexicalBlock(scope: !772, file: !3, line: 206, column: 9)
!780 = !DILocation(line: 207, column: 26, scope: !778)
!781 = !DILocation(line: 207, column: 15, scope: !778)
!782 = !DILocation(line: 207, column: 43, scope: !778)
!783 = !DILocation(line: 207, column: 15, scope: !779)
!784 = !DILocation(line: 210, column: 15, scope: !785)
!785 = distinct !DILexicalBlock(scope: !778, file: !3, line: 208, column: 13)
!786 = distinct !{!786, !727, !787}
!787 = !DILocation(line: 226, column: 5, scope: !667)
!788 = !DILocation(line: 212, column: 24, scope: !779)
!789 = !DILocation(line: 212, column: 15, scope: !779)
!790 = !DILocation(line: 213, column: 9, scope: !779)
!791 = !DILocation(line: 215, column: 11, scope: !792)
!792 = distinct !DILexicalBlock(scope: !729, file: !3, line: 215, column: 11)
!793 = !DILocation(line: 215, column: 18, scope: !792)
!794 = !DILocation(line: 215, column: 26, scope: !792)
!795 = !DILocation(line: 215, column: 15, scope: !792)
!796 = !DILocation(line: 215, column: 11, scope: !729)
!797 = !DILocation(line: 216, column: 9, scope: !792)
!798 = !DILocation(line: 220, column: 14, scope: !799)
!799 = distinct !DILexicalBlock(scope: !729, file: !3, line: 220, column: 12)
!800 = !DILocation(line: 220, column: 24, scope: !799)
!801 = !DILocation(line: 220, column: 34, scope: !799)
!802 = !DILocation(line: 220, column: 44, scope: !799)
!803 = !DILocation(line: 220, column: 52, scope: !799)
!804 = !DILocation(line: 220, column: 41, scope: !799)
!805 = !DILocation(line: 220, column: 12, scope: !729)
!806 = !DILocation(line: 222, column: 30, scope: !807)
!807 = distinct !DILexicalBlock(scope: !799, file: !3, line: 221, column: 9)
!808 = !DILocation(line: 222, column: 41, scope: !807)
!809 = !DILocation(line: 222, column: 45, scope: !807)
!810 = !DILocation(line: 222, column: 53, scope: !807)
!811 = !DILocation(line: 222, column: 11, scope: !807)
!812 = !DILocation(line: 223, column: 17, scope: !807)
!813 = !DILocation(line: 224, column: 11, scope: !807)
!814 = !DILocation(line: 228, column: 7, scope: !815)
!815 = distinct !DILexicalBlock(scope: !667, file: !3, line: 228, column: 7)
!816 = !DILocation(line: 228, column: 12, scope: !815)
!817 = !DILocation(line: 228, column: 20, scope: !815)
!818 = !DILocation(line: 228, column: 33, scope: !815)
!819 = !DILocation(line: 228, column: 23, scope: !815)
!820 = !DILocation(line: 228, column: 39, scope: !815)
!821 = !DILocation(line: 228, column: 7, scope: !667)
!822 = !DILocation(line: 232, column: 7, scope: !823)
!823 = distinct !DILexicalBlock(scope: !815, file: !3, line: 229, column: 5)
!824 = !DILocation(line: 236, column: 10, scope: !825)
!825 = distinct !DILexicalBlock(scope: !667, file: !3, line: 236, column: 8)
!826 = !DILocation(line: 236, column: 8, scope: !667)
!827 = !DILocation(line: 237, column: 5, scope: !825)
!828 = !DILocation(line: 241, column: 4, scope: !667)
!829 = !DILocation(line: 241, column: 13, scope: !667)
!830 = !DILocation(line: 242, column: 1, scope: !667)
!831 = !DILocalVariable(name: "dot_sb", arg: 1, scope: !832, file: !3, line: 153, type: !835)
!832 = distinct !DISubprogram(name: "find_dir_entry", scope: !3, file: !3, line: 153, type: !833, scopeLine: 155, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !863, retainedNodes: !4)
!833 = !DISubroutineType(types: !834)
!834 = !{null, !835, !857, !74}
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !405, line: 46, size: 1152, elements: !837)
!837 = !{!838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !854, !855, !856}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !836, file: !405, line: 48, baseType: !408, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !836, file: !405, line: 53, baseType: !411, size: 64, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !836, file: !405, line: 61, baseType: !413, size: 64, offset: 128)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !836, file: !405, line: 62, baseType: !415, size: 32, offset: 192)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !836, file: !405, line: 64, baseType: !417, size: 32, offset: 224)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !836, file: !405, line: 65, baseType: !419, size: 32, offset: 256)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !836, file: !405, line: 67, baseType: !19, size: 32, offset: 288)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !836, file: !405, line: 69, baseType: !408, size: 64, offset: 320)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !836, file: !405, line: 74, baseType: !423, size: 64, offset: 384)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !836, file: !405, line: 78, baseType: !426, size: 64, offset: 448)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !836, file: !405, line: 80, baseType: !428, size: 64, offset: 512)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !836, file: !405, line: 91, baseType: !850, size: 128, offset: 576)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !431, line: 10, size: 128, elements: !851)
!851 = !{!852, !853}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !850, file: !431, line: 12, baseType: !434, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !850, file: !431, line: 16, baseType: !436, size: 64, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !836, file: !405, line: 92, baseType: !850, size: 128, offset: 704)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !836, file: !405, line: 93, baseType: !850, size: 128, offset: 832)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !836, file: !405, line: 106, baseType: !440, size: 192, offset: 960)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 34, size: 192, elements: !859)
!859 = !{!860, !861, !862}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !858, file: !3, line: 36, baseType: !7, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !858, file: !3, line: 37, baseType: !74, size: 64, offset: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !858, file: !3, line: 38, baseType: !7, size: 64, offset: 128)
!863 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !864, nameTableKind: None)
!864 = !{!865}
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(name: "longopts", scope: !863, file: !3, line: 41, type: !867, isLocal: true, isDefinition: true)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !868, size: 1280, elements: !23)
!868 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !869)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !870)
!870 = !{!871, !872, !873, !874}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !869, file: !13, line: 52, baseType: !16, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !869, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !869, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !869, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!875 = !DILocalVariable(name: "file_name", arg: 2, scope: !832, file: !3, line: 153, type: !857)
!876 = !DILocalVariable(name: "parent_height", arg: 3, scope: !832, file: !3, line: 154, type: !74)
!877 = !DILocalVariable(name: "dirp", scope: !832, file: !3, line: 156, type: !678)
!878 = !DILocalVariable(name: "fd", scope: !832, file: !3, line: 157, type: !19)
!879 = !DILocalVariable(name: "parent_sb", scope: !832, file: !3, line: 158, type: !836)
!880 = !DILocalVariable(name: "use_lstat", scope: !832, file: !3, line: 159, type: !38)
!881 = !DILocalVariable(name: "found", scope: !832, file: !3, line: 160, type: !38)
!882 = distinct !DISubprogram(name: "file_name_prepend", scope: !3, file: !3, line: 101, type: !883, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!883 = !DISubroutineType(types: !884)
!884 = !{null, !366, !16, !74}
!885 = !DILocalVariable(name: "p", arg: 1, scope: !882, file: !3, line: 101, type: !366)
!886 = !DILocation(line: 101, column: 38, scope: !882)
!887 = !DILocalVariable(name: "s", arg: 2, scope: !882, file: !3, line: 101, type: !16)
!888 = !DILocation(line: 101, column: 53, scope: !882)
!889 = !DILocalVariable(name: "s_len", arg: 3, scope: !882, file: !3, line: 101, type: !74)
!890 = !DILocation(line: 101, column: 63, scope: !882)
!891 = !DILocalVariable(name: "n_free", scope: !882, file: !3, line: 103, type: !74)
!892 = !DILocation(line: 103, column: 10, scope: !882)
!893 = !DILocation(line: 103, column: 19, scope: !882)
!894 = !DILocation(line: 103, column: 22, scope: !882)
!895 = !DILocation(line: 103, column: 30, scope: !882)
!896 = !DILocation(line: 103, column: 33, scope: !882)
!897 = !DILocation(line: 103, column: 28, scope: !882)
!898 = !DILocation(line: 104, column: 7, scope: !899)
!899 = distinct !DILexicalBlock(scope: !882, file: !3, line: 104, column: 7)
!900 = !DILocation(line: 104, column: 20, scope: !899)
!901 = !DILocation(line: 104, column: 18, scope: !899)
!902 = !DILocation(line: 104, column: 14, scope: !899)
!903 = !DILocation(line: 104, column: 7, scope: !882)
!904 = !DILocalVariable(name: "half", scope: !905, file: !3, line: 106, type: !74)
!905 = distinct !DILexicalBlock(scope: !899, file: !3, line: 105, column: 5)
!906 = !DILocation(line: 106, column: 14, scope: !905)
!907 = !DILocation(line: 106, column: 21, scope: !905)
!908 = !DILocation(line: 106, column: 24, scope: !905)
!909 = !DILocation(line: 106, column: 32, scope: !905)
!910 = !DILocation(line: 106, column: 38, scope: !905)
!911 = !DILocation(line: 106, column: 36, scope: !905)
!912 = !DILocalVariable(name: "q", scope: !905, file: !3, line: 111, type: !7)
!913 = !DILocation(line: 111, column: 13, scope: !905)
!914 = !DILocation(line: 111, column: 30, scope: !905)
!915 = !DILocation(line: 111, column: 17, scope: !905)
!916 = !DILocalVariable(name: "n_used", scope: !905, file: !3, line: 112, type: !74)
!917 = !DILocation(line: 112, column: 14, scope: !905)
!918 = !DILocation(line: 112, column: 23, scope: !905)
!919 = !DILocation(line: 112, column: 26, scope: !905)
!920 = !DILocation(line: 112, column: 36, scope: !905)
!921 = !DILocation(line: 112, column: 34, scope: !905)
!922 = !DILocation(line: 113, column: 18, scope: !905)
!923 = !DILocation(line: 113, column: 26, scope: !905)
!924 = !DILocation(line: 113, column: 24, scope: !905)
!925 = !DILocation(line: 113, column: 20, scope: !905)
!926 = !DILocation(line: 113, column: 33, scope: !905)
!927 = !DILocation(line: 113, column: 31, scope: !905)
!928 = !DILocation(line: 113, column: 7, scope: !905)
!929 = !DILocation(line: 113, column: 10, scope: !905)
!930 = !DILocation(line: 113, column: 16, scope: !905)
!931 = !DILocation(line: 114, column: 15, scope: !905)
!932 = !DILocation(line: 114, column: 18, scope: !905)
!933 = !DILocation(line: 114, column: 25, scope: !905)
!934 = !DILocation(line: 114, column: 28, scope: !905)
!935 = !DILocation(line: 114, column: 34, scope: !905)
!936 = !DILocation(line: 114, column: 32, scope: !905)
!937 = !DILocation(line: 114, column: 42, scope: !905)
!938 = !DILocation(line: 114, column: 7, scope: !905)
!939 = !DILocation(line: 115, column: 13, scope: !905)
!940 = !DILocation(line: 115, column: 16, scope: !905)
!941 = !DILocation(line: 115, column: 7, scope: !905)
!942 = !DILocation(line: 116, column: 16, scope: !905)
!943 = !DILocation(line: 116, column: 7, scope: !905)
!944 = !DILocation(line: 116, column: 10, scope: !905)
!945 = !DILocation(line: 116, column: 14, scope: !905)
!946 = !DILocation(line: 117, column: 24, scope: !905)
!947 = !DILocation(line: 117, column: 22, scope: !905)
!948 = !DILocation(line: 117, column: 7, scope: !905)
!949 = !DILocation(line: 117, column: 10, scope: !905)
!950 = !DILocation(line: 117, column: 18, scope: !905)
!951 = !DILocation(line: 118, column: 5, scope: !905)
!952 = !DILocation(line: 120, column: 19, scope: !882)
!953 = !DILocation(line: 120, column: 17, scope: !882)
!954 = !DILocation(line: 120, column: 3, scope: !882)
!955 = !DILocation(line: 120, column: 6, scope: !882)
!956 = !DILocation(line: 120, column: 12, scope: !882)
!957 = !DILocation(line: 121, column: 3, scope: !882)
!958 = !DILocation(line: 121, column: 6, scope: !882)
!959 = !DILocation(line: 121, column: 15, scope: !882)
!960 = !DILocation(line: 122, column: 11, scope: !882)
!961 = !DILocation(line: 122, column: 14, scope: !882)
!962 = !DILocation(line: 122, column: 20, scope: !882)
!963 = !DILocation(line: 122, column: 25, scope: !882)
!964 = !DILocation(line: 122, column: 28, scope: !882)
!965 = !DILocation(line: 122, column: 3, scope: !882)
!966 = !DILocation(line: 123, column: 1, scope: !882)
!967 = !DILocalVariable(name: "p", arg: 1, scope: !968, file: !3, line: 101, type: !971)
!968 = distinct !DISubprogram(name: "file_name_prepend", scope: !3, file: !3, line: 101, type: !969, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !977, retainedNodes: !4)
!969 = !DISubroutineType(types: !970)
!970 = !{null, !971, !16, !74}
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 34, size: 192, elements: !973)
!973 = !{!974, !975, !976}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !972, file: !3, line: 36, baseType: !7, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !972, file: !3, line: 37, baseType: !74, size: 64, offset: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !972, file: !3, line: 38, baseType: !7, size: 64, offset: 128)
!977 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !978, nameTableKind: None)
!978 = !{!979}
!979 = !DIGlobalVariableExpression(var: !980, expr: !DIExpression())
!980 = distinct !DIGlobalVariable(name: "longopts", scope: !977, file: !3, line: 41, type: !981, isLocal: true, isDefinition: true)
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !982, size: 1280, elements: !23)
!982 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !984)
!984 = !{!985, !986, !987, !988}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !983, file: !13, line: 52, baseType: !16, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !983, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !983, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !983, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!989 = !DILocalVariable(name: "s", arg: 2, scope: !968, file: !3, line: 101, type: !16)
!990 = !DILocalVariable(name: "s_len", arg: 3, scope: !968, file: !3, line: 101, type: !74)
!991 = !DILocalVariable(name: "n_free", scope: !968, file: !3, line: 103, type: !74)
!992 = !DILocalVariable(name: "q", scope: !993, file: !3, line: 111, type: !7)
!993 = distinct !DILexicalBlock(scope: !994, file: !3, line: 105, column: 5)
!994 = distinct !DILexicalBlock(scope: !995, file: !3, line: 104, column: 7)
!995 = distinct !DISubprogram(name: "file_name_prepend", scope: !3, file: !3, line: 101, type: !996, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1004, retainedNodes: !4)
!996 = !DISubroutineType(types: !997)
!997 = !{null, !998, !16, !74}
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 34, size: 192, elements: !1000)
!1000 = !{!1001, !1002, !1003}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !999, file: !3, line: 36, baseType: !7, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !999, file: !3, line: 37, baseType: !74, size: 64, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !999, file: !3, line: 38, baseType: !7, size: 64, offset: 128)
!1004 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !1005, nameTableKind: None)
!1005 = !{!1006}
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(name: "longopts", scope: !1004, file: !3, line: 41, type: !1008, isLocal: true, isDefinition: true)
!1008 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1009, size: 1280, elements: !23)
!1009 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1010)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !1011)
!1011 = !{!1012, !1013, !1014, !1015}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1010, file: !13, line: 52, baseType: !16, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !1010, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1010, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1010, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!1016 = !DILocalVariable(name: "n_used", scope: !993, file: !3, line: 112, type: !74)
!1017 = distinct !DISubprogram(name: "nth_parent", scope: !3, file: !3, line: 127, type: !1018, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!7, !74}
!1020 = !DILocalVariable(name: "n", arg: 1, scope: !1017, file: !3, line: 127, type: !74)
!1021 = !DILocation(line: 127, column: 20, scope: !1017)
!1022 = !DILocalVariable(name: "buf", scope: !1017, file: !3, line: 129, type: !7)
!1023 = !DILocation(line: 129, column: 9, scope: !1017)
!1024 = !DILocation(line: 129, column: 28, scope: !1017)
!1025 = !DILocation(line: 129, column: 15, scope: !1017)
!1026 = !DILocalVariable(name: "p", scope: !1017, file: !3, line: 130, type: !7)
!1027 = !DILocation(line: 130, column: 9, scope: !1017)
!1028 = !DILocation(line: 130, column: 13, scope: !1017)
!1029 = !DILocalVariable(name: "i", scope: !1030, file: !3, line: 132, type: !74)
!1030 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 132, column: 3)
!1031 = !DILocation(line: 132, column: 15, scope: !1030)
!1032 = !DILocation(line: 132, column: 8, scope: !1030)
!1033 = !DILocation(line: 132, column: 22, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !1030, file: !3, line: 132, column: 3)
!1035 = !DILocation(line: 132, column: 26, scope: !1034)
!1036 = !DILocation(line: 132, column: 24, scope: !1034)
!1037 = !DILocation(line: 132, column: 3, scope: !1030)
!1038 = !DILocation(line: 134, column: 15, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !1034, file: !3, line: 133, column: 5)
!1040 = !DILocation(line: 134, column: 7, scope: !1039)
!1041 = !DILocation(line: 135, column: 9, scope: !1039)
!1042 = !DILocation(line: 136, column: 5, scope: !1039)
!1043 = !DILocation(line: 132, column: 30, scope: !1034)
!1044 = !DILocation(line: 132, column: 3, scope: !1034)
!1045 = distinct !{!1045, !1037, !1046}
!1046 = !DILocation(line: 136, column: 5, scope: !1030)
!1047 = !DILocation(line: 137, column: 3, scope: !1017)
!1048 = !DILocation(line: 137, column: 9, scope: !1017)
!1049 = !DILocation(line: 138, column: 10, scope: !1017)
!1050 = !DILocation(line: 138, column: 3, scope: !1017)
!1051 = !DILocalVariable(name: "n", arg: 1, scope: !1052, file: !3, line: 127, type: !74)
!1052 = distinct !DISubprogram(name: "nth_parent", scope: !3, file: !3, line: 127, type: !1018, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1053, retainedNodes: !4)
!1053 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !1054, nameTableKind: None)
!1054 = !{!1055}
!1055 = !DIGlobalVariableExpression(var: !1056, expr: !DIExpression())
!1056 = distinct !DIGlobalVariable(name: "longopts", scope: !1053, file: !3, line: 41, type: !1057, isLocal: true, isDefinition: true)
!1057 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1058, size: 1280, elements: !23)
!1058 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1059)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !1060)
!1060 = !{!1061, !1062, !1063, !1064}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1059, file: !13, line: 52, baseType: !16, size: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !1059, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1059, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1059, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!1065 = !DILocalVariable(name: "buf", scope: !1052, file: !3, line: 129, type: !7)
!1066 = !DILocalVariable(name: "p", scope: !1052, file: !3, line: 130, type: !7)
!1067 = !DILocalVariable(name: "i", scope: !1068, file: !3, line: 132, type: !74)
!1068 = distinct !DILexicalBlock(scope: !1052, file: !3, line: 132, column: 3)
!1069 = distinct !DISubprogram(name: "readdir_ignoring_dot_and_dotdot", scope: !212, file: !212, line: 278, type: !1070, scopeLine: 279, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!730, !678}
!1072 = !DILocalVariable(name: "dirp", arg: 1, scope: !1069, file: !212, line: 278, type: !678)
!1073 = !DILocation(line: 278, column: 39, scope: !1069)
!1074 = !DILocation(line: 280, column: 3, scope: !1069)
!1075 = !DILocalVariable(name: "dp", scope: !1076, file: !212, line: 282, type: !730)
!1076 = distinct !DILexicalBlock(scope: !1069, file: !212, line: 281, column: 5)
!1077 = !DILocation(line: 282, column: 28, scope: !1076)
!1078 = !DILocation(line: 282, column: 42, scope: !1076)
!1079 = !DILocation(line: 282, column: 33, scope: !1076)
!1080 = !DILocation(line: 283, column: 11, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !1076, file: !212, line: 283, column: 11)
!1082 = !DILocation(line: 283, column: 14, scope: !1081)
!1083 = !DILocation(line: 283, column: 22, scope: !1081)
!1084 = !DILocation(line: 283, column: 42, scope: !1081)
!1085 = !DILocation(line: 283, column: 46, scope: !1081)
!1086 = !DILocation(line: 283, column: 27, scope: !1081)
!1087 = !DILocation(line: 283, column: 11, scope: !1076)
!1088 = !DILocation(line: 284, column: 16, scope: !1081)
!1089 = !DILocation(line: 284, column: 9, scope: !1081)
!1090 = distinct !{!1090, !1074, !1091}
!1091 = !DILocation(line: 285, column: 5, scope: !1069)
!1092 = !DILocalVariable(name: "dirp", arg: 1, scope: !1093, file: !212, line: 278, type: !678)
!1093 = distinct !DISubprogram(name: "readdir_ignoring_dot_and_dotdot", scope: !212, file: !212, line: 278, type: !1094, scopeLine: 279, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1105, retainedNodes: !4)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!1096, !678}
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1098)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !733, line: 22, size: 2240, elements: !1099)
!1099 = !{!1100, !1101, !1102, !1103, !1104}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !1098, file: !733, line: 25, baseType: !411, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !1098, file: !733, line: 26, baseType: !423, size: 64, offset: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !1098, file: !733, line: 31, baseType: !73, size: 16, offset: 128)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !1098, file: !733, line: 32, baseType: !148, size: 8, offset: 144)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !1098, file: !733, line: 33, baseType: !105, size: 2048, offset: 152)
!1105 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !1106, nameTableKind: None)
!1106 = !{!1107}
!1107 = !DIGlobalVariableExpression(var: !1108, expr: !DIExpression())
!1108 = distinct !DIGlobalVariable(name: "longopts", scope: !1105, file: !3, line: 41, type: !1109, isLocal: true, isDefinition: true)
!1109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1110, size: 1280, elements: !23)
!1110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1111)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !1112)
!1112 = !{!1113, !1114, !1115, !1116}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1111, file: !13, line: 52, baseType: !16, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !1111, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1111, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1111, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!1117 = distinct !DISubprogram(name: "dot_or_dotdot", scope: !212, file: !212, line: 265, type: !1118, scopeLine: 266, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!38, !16}
!1120 = !DILocalVariable(name: "file_name", arg: 1, scope: !1117, file: !212, line: 265, type: !16)
!1121 = !DILocation(line: 265, column: 28, scope: !1117)
!1122 = !DILocation(line: 267, column: 7, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !1117, file: !212, line: 267, column: 7)
!1124 = !DILocation(line: 267, column: 20, scope: !1123)
!1125 = !DILocation(line: 267, column: 7, scope: !1117)
!1126 = !DILocalVariable(name: "sep", scope: !1127, file: !212, line: 269, type: !8)
!1127 = distinct !DILexicalBlock(scope: !1123, file: !212, line: 268, column: 5)
!1128 = !DILocation(line: 269, column: 12, scope: !1127)
!1129 = !DILocation(line: 269, column: 18, scope: !1127)
!1130 = !DILocation(line: 269, column: 29, scope: !1127)
!1131 = !DILocation(line: 269, column: 42, scope: !1127)
!1132 = !DILocation(line: 269, column: 50, scope: !1127)
!1133 = !DILocation(line: 270, column: 17, scope: !1127)
!1134 = !DILocation(line: 270, column: 21, scope: !1127)
!1135 = !DILocation(line: 270, column: 24, scope: !1127)
!1136 = !DILocation(line: 270, column: 7, scope: !1127)
!1137 = !DILocation(line: 273, column: 5, scope: !1123)
!1138 = !DILocation(line: 274, column: 1, scope: !1117)
!1139 = !DILocalVariable(name: "file_name", arg: 1, scope: !1140, file: !212, line: 265, type: !16)
!1140 = distinct !DISubprogram(name: "dot_or_dotdot", scope: !212, file: !212, line: 265, type: !1118, scopeLine: 266, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1141, retainedNodes: !4)
!1141 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !1142, nameTableKind: None)
!1142 = !{!1143}
!1143 = !DIGlobalVariableExpression(var: !1144, expr: !DIExpression())
!1144 = distinct !DIGlobalVariable(name: "longopts", scope: !1141, file: !3, line: 41, type: !1145, isLocal: true, isDefinition: true)
!1145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1146, size: 1280, elements: !23)
!1146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1147)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !1148)
!1148 = !{!1149, !1150, !1151, !1152}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1147, file: !13, line: 52, baseType: !16, size: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !1147, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1147, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1147, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!1153 = distinct !DISubprogram(name: "close_stdout", scope: !37, file: !37, line: 117, type: !1154, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !32, retainedNodes: !4)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{null}
!1156 = !DILocation(line: 119, column: 21, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1153, file: !37, line: 119, column: 7)
!1158 = !DILocation(line: 119, column: 7, scope: !1157)
!1159 = !DILocation(line: 119, column: 29, scope: !1157)
!1160 = !DILocation(line: 120, column: 7, scope: !1157)
!1161 = !DILocation(line: 120, column: 12, scope: !1157)
!1162 = !DILocation(line: 120, column: 25, scope: !1157)
!1163 = !DILocation(line: 120, column: 28, scope: !1157)
!1164 = !DILocation(line: 120, column: 34, scope: !1157)
!1165 = !DILocation(line: 119, column: 7, scope: !1153)
!1166 = !DILocalVariable(name: "write_error", scope: !1167, file: !37, line: 122, type: !16)
!1167 = distinct !DILexicalBlock(scope: !1157, file: !37, line: 121, column: 5)
!1168 = !DILocation(line: 122, column: 19, scope: !1167)
!1169 = !DILocation(line: 122, column: 33, scope: !1167)
!1170 = !DILocation(line: 123, column: 11, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !1167, file: !37, line: 123, column: 11)
!1172 = !DILocation(line: 123, column: 11, scope: !1167)
!1173 = !DILocation(line: 124, column: 19, scope: !1171)
!1174 = !DILocation(line: 124, column: 52, scope: !1171)
!1175 = !DILocation(line: 124, column: 36, scope: !1171)
!1176 = !DILocation(line: 125, column: 16, scope: !1171)
!1177 = !DILocation(line: 124, column: 9, scope: !1171)
!1178 = !DILocation(line: 127, column: 19, scope: !1171)
!1179 = !DILocation(line: 127, column: 32, scope: !1171)
!1180 = !DILocation(line: 127, column: 9, scope: !1171)
!1181 = !DILocation(line: 129, column: 14, scope: !1167)
!1182 = !DILocation(line: 129, column: 7, scope: !1167)
!1183 = !DILocation(line: 134, column: 42, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !1153, file: !37, line: 134, column: 7)
!1185 = !DILocation(line: 134, column: 28, scope: !1184)
!1186 = !DILocation(line: 134, column: 50, scope: !1184)
!1187 = !DILocation(line: 134, column: 7, scope: !1153)
!1188 = !DILocation(line: 135, column: 12, scope: !1184)
!1189 = !DILocation(line: 135, column: 5, scope: !1184)
!1190 = !DILocation(line: 136, column: 1, scope: !1153)
!1191 = distinct !DISubprogram(name: "set_program_name", scope: !51, file: !51, line: 39, type: !213, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !4)
!1192 = !DILocalVariable(name: "argv0", arg: 1, scope: !1191, file: !51, line: 39, type: !16)
!1193 = !DILocation(line: 39, column: 31, scope: !1191)
!1194 = !DILocalVariable(name: "slash", scope: !1191, file: !51, line: 46, type: !16)
!1195 = !DILocation(line: 46, column: 15, scope: !1191)
!1196 = !DILocalVariable(name: "base", scope: !1191, file: !51, line: 47, type: !16)
!1197 = !DILocation(line: 47, column: 15, scope: !1191)
!1198 = !DILocation(line: 51, column: 7, scope: !1199)
!1199 = distinct !DILexicalBlock(scope: !1191, file: !51, line: 51, column: 7)
!1200 = !DILocation(line: 51, column: 13, scope: !1199)
!1201 = !DILocation(line: 51, column: 7, scope: !1191)
!1202 = !DILocation(line: 55, column: 14, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1199, file: !51, line: 52, column: 5)
!1204 = !DILocation(line: 54, column: 7, scope: !1203)
!1205 = !DILocation(line: 56, column: 7, scope: !1203)
!1206 = !DILocation(line: 59, column: 20, scope: !1191)
!1207 = !DILocation(line: 59, column: 11, scope: !1191)
!1208 = !DILocation(line: 59, column: 9, scope: !1191)
!1209 = !DILocation(line: 60, column: 11, scope: !1191)
!1210 = !DILocation(line: 60, column: 17, scope: !1191)
!1211 = !DILocation(line: 60, column: 27, scope: !1191)
!1212 = !DILocation(line: 60, column: 33, scope: !1191)
!1213 = !DILocation(line: 60, column: 39, scope: !1191)
!1214 = !DILocation(line: 60, column: 8, scope: !1191)
!1215 = !DILocation(line: 61, column: 7, scope: !1216)
!1216 = distinct !DILexicalBlock(scope: !1191, file: !51, line: 61, column: 7)
!1217 = !DILocation(line: 61, column: 14, scope: !1216)
!1218 = !DILocation(line: 61, column: 12, scope: !1216)
!1219 = !DILocation(line: 61, column: 20, scope: !1216)
!1220 = !DILocation(line: 61, column: 25, scope: !1216)
!1221 = !DILocation(line: 61, column: 37, scope: !1216)
!1222 = !DILocation(line: 61, column: 42, scope: !1216)
!1223 = !DILocation(line: 61, column: 28, scope: !1216)
!1224 = !DILocation(line: 61, column: 61, scope: !1216)
!1225 = !DILocation(line: 61, column: 7, scope: !1191)
!1226 = !DILocation(line: 63, column: 15, scope: !1227)
!1227 = distinct !DILexicalBlock(scope: !1216, file: !51, line: 62, column: 5)
!1228 = !DILocation(line: 63, column: 13, scope: !1227)
!1229 = !DILocation(line: 64, column: 20, scope: !1230)
!1230 = distinct !DILexicalBlock(scope: !1227, file: !51, line: 64, column: 11)
!1231 = !DILocation(line: 64, column: 11, scope: !1230)
!1232 = !DILocation(line: 64, column: 36, scope: !1230)
!1233 = !DILocation(line: 64, column: 11, scope: !1227)
!1234 = !DILocation(line: 66, column: 19, scope: !1235)
!1235 = distinct !DILexicalBlock(scope: !1230, file: !51, line: 65, column: 9)
!1236 = !DILocation(line: 66, column: 24, scope: !1235)
!1237 = !DILocation(line: 66, column: 17, scope: !1235)
!1238 = !DILocation(line: 70, column: 52, scope: !1235)
!1239 = !DILocation(line: 70, column: 41, scope: !1235)
!1240 = !DILocation(line: 72, column: 9, scope: !1235)
!1241 = !DILocation(line: 73, column: 5, scope: !1227)
!1242 = !DILocation(line: 84, column: 18, scope: !1191)
!1243 = !DILocation(line: 84, column: 16, scope: !1191)
