; ModuleID = '<stdin>'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.file_name = type { i8*, i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.dev_ino, %struct.dev_ino, %struct.dev_ino, [3 x i64] }
%struct.dev_ino = type { i64, i64 }
%struct.__dirstream = type opaque
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external dso_local global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [23 x i8] c"Usage: %s [OPTION]...\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 41, type: !10, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !9, nameTableKind: None)
!3 = !DIFile(filename: "src/pwd.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!4 = !{}
!5 = !{!6, !7}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !{!0}
!10 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 1280, elements: !23)
!11 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !14)
!13 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "")
!14 = !{!15, !18, !20, !22}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !12, file: !13, line: 52, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !12, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !12, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !12, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!23 = !{!24}
!24 = !DISubrange(count: 5)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "Version", scope: !27, file: !28, line: 2, type: !16, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !29, nameTableKind: None)
!28 = !DIFile(filename: "src/version.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!29 = !{!25}
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !32, file: !37, line: 56, type: !38, isLocal: true, isDefinition: true)
!32 = distinct !DICompileUnit(language: DW_LANG_C99, file: !33, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !34, nameTableKind: None)
!33 = !DIFile(filename: "./lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!34 = !{!35, !30}
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "file_name", scope: !32, file: !37, line: 46, type: !16, isLocal: true, isDefinition: true)
!37 = !DIFile(filename: "lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!38 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "exit_failure", scope: !41, file: !44, line: 24, type: !45, isLocal: false, isDefinition: true)
!41 = distinct !DICompileUnit(language: DW_LANG_C99, file: !42, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !43, nameTableKind: None)
!42 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!43 = !{!39}
!44 = !DIFile(filename: "lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!45 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !19)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "program_name", scope: !48, file: !51, line: 33, type: !16, isLocal: false, isDefinition: true)
!48 = distinct !DICompileUnit(language: DW_LANG_C99, file: !49, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !50, nameTableKind: None)
!49 = !DIFile(filename: "./lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!50 = !{!46}
!51 = !DIFile(filename: "lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !54, file: !80, line: 116, type: !93, isLocal: true, isDefinition: true)
!54 = distinct !DICompileUnit(language: DW_LANG_C99, file: !55, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, retainedTypes: !72, globals: !77, nameTableKind: None)
!55 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!56 = !{!57}
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !58, line: 32, baseType: !59, size: 32, elements: !60)
!58 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!59 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!60 = !{!61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71}
!61 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!62 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!63 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!64 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!65 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!66 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!67 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!68 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!69 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!70 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!71 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!72 = !{!19, !73, !74}
!73 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !75, line: 46, baseType: !76)
!75 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.1/include/stddef.h", directory: "")
!76 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!77 = !{!78, !85, !91, !52, !103, !108, !115, !117}
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !54, file: !80, line: 85, type: !81, isLocal: false, isDefinition: true)
!80 = !DIFile(filename: "lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 704, elements: !83)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!83 = !{!84}
!84 = !DISubrange(count: 11)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !54, file: !80, line: 101, type: !87, isLocal: false, isDefinition: true)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 320, elements: !89)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!89 = !{!90}
!90 = !DISubrange(count: 10)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !54, file: !80, line: 1052, type: !93, isLocal: false, isDefinition: true)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !80, line: 65, size: 448, elements: !94)
!94 = !{!95, !96, !97, !101, !102}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !93, file: !80, line: 68, baseType: !57, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !93, file: !80, line: 71, baseType: !19, size: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !93, file: !80, line: 75, baseType: !98, size: 256, offset: 64)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 256, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 8)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !93, file: !80, line: 78, baseType: !16, size: 64, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !93, file: !80, line: 81, baseType: !16, size: 64, offset: 384)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "slot0", scope: !54, file: !80, line: 842, type: !105, isLocal: true, isDefinition: true)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 256)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "slotvec", scope: !54, file: !80, line: 845, type: !110, isLocal: true, isDefinition: true)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !80, line: 834, size: 128, elements: !112)
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !111, file: !80, line: 836, baseType: !74, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !111, file: !80, line: 837, baseType: !7, size: 64, offset: 64)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "nslots", scope: !54, file: !80, line: 843, type: !19, isLocal: true, isDefinition: true)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "slotvec0", scope: !54, file: !80, line: 844, type: !111, isLocal: true, isDefinition: true)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !121, file: !124, line: 26, type: !125, isLocal: false, isDefinition: true)
!121 = distinct !DICompileUnit(language: DW_LANG_C99, file: !122, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !123, nameTableKind: None)
!122 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!123 = !{!119}
!124 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 376, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 47)
!128 = distinct !DICompileUnit(language: DW_LANG_C99, file: !129, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!129 = !DIFile(filename: "./lib/root-dev-ino.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!130 = distinct !DICompileUnit(language: DW_LANG_C99, file: !131, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!131 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!132 = !{!6}
!133 = distinct !DICompileUnit(language: DW_LANG_C99, file: !134, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !135, nameTableKind: None)
!134 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!135 = !{!74, !7, !6}
!136 = distinct !DICompileUnit(language: DW_LANG_C99, file: !137, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!137 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!138 = distinct !DICompileUnit(language: DW_LANG_C99, file: !139, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!139 = !DIFile(filename: "./lib/xgetcwd.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!140 = distinct !DICompileUnit(language: DW_LANG_C99, file: !141, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !142, nameTableKind: None)
!141 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!142 = !{!74}
!143 = distinct !DICompileUnit(language: DW_LANG_C99, file: !144, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !145, nameTableKind: None)
!144 = !DIFile(filename: "./lib/c-strcasecmp.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!145 = !{!146}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!149 = distinct !DICompileUnit(language: DW_LANG_C99, file: !150, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!150 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!151 = distinct !DICompileUnit(language: DW_LANG_C99, file: !152, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!152 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!153 = distinct !DICompileUnit(language: DW_LANG_C99, file: !154, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!154 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!155 = distinct !DICompileUnit(language: DW_LANG_C99, file: !156, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!156 = !DIFile(filename: "./lib/setlocale_null.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!157 = distinct !DICompileUnit(language: DW_LANG_C99, file: !158, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!158 = !DIFile(filename: "./lib/fclose.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!159 = distinct !DICompileUnit(language: DW_LANG_C99, file: !160, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!160 = !DIFile(filename: "./lib/fflush.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!161 = distinct !DICompileUnit(language: DW_LANG_C99, file: !162, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!162 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!163 = distinct !DICompileUnit(language: DW_LANG_C99, file: !164, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!164 = !DIFile(filename: "./lib/c-ctype.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!165 = !{!"clang version 9.0.1-12 "}
!166 = !{i32 2, !"Dwarf Version", i32 4}
!167 = !{i32 2, !"Debug Info Version", i32 3}
!168 = !{i32 1, !"wchar_size", i32 4}
!169 = !{i32 1, !"ThinLTO", i32 0}
!170 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!171 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 51, type: !172, scopeLine: 52, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !19}
!174 = !DILocalVariable(name: "status", arg: 1, scope: !171, file: !3, line: 51, type: !19)
!175 = !DILocation(line: 51, column: 12, scope: !171)
!176 = !DILocation(line: 53, column: 7, scope: !177)
!177 = distinct !DILexicalBlock(scope: !171, file: !3, line: 53, column: 7)
!178 = !DILocation(line: 53, column: 14, scope: !177)
!179 = !DILocation(line: 53, column: 7, scope: !171)
!180 = !DILocation(line: 54, column: 5, scope: !177)
!181 = !DILocation(line: 54, column: 5, scope: !182)
!182 = distinct !DILexicalBlock(scope: !177, file: !3, line: 54, column: 5)
!183 = !DILocation(line: 57, column: 15, scope: !184)
!184 = distinct !DILexicalBlock(scope: !177, file: !3, line: 56, column: 5)
!185 = !DILocation(line: 57, column: 45, scope: !184)
!186 = !DILocation(line: 57, column: 7, scope: !184)
!187 = !DILocation(line: 58, column: 7, scope: !184)
!188 = !DILocation(line: 62, column: 7, scope: !184)
!189 = !DILocation(line: 66, column: 7, scope: !184)
!190 = !DILocation(line: 67, column: 7, scope: !184)
!191 = !DILocation(line: 68, column: 7, scope: !184)
!192 = !DILocation(line: 71, column: 15, scope: !184)
!193 = !DILocation(line: 71, column: 7, scope: !184)
!194 = !DILocation(line: 72, column: 7, scope: !184)
!195 = !DILocation(line: 74, column: 9, scope: !171)
!196 = !DILocation(line: 74, column: 3, scope: !171)
!197 = !DILocalVariable(name: "status", arg: 1, scope: !198, file: !3, line: 51, type: !19)
!198 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 51, type: !172, scopeLine: 52, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !199, retainedNodes: !4)
!199 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !200, nameTableKind: None)
!200 = !{!201}
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "longopts", scope: !199, file: !3, line: 41, type: !203, isLocal: true, isDefinition: true)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 1280, elements: !23)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !206)
!206 = !{!207, !208, !209, !210}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !205, file: !13, line: 52, baseType: !16, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !205, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !205, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !205, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!211 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !212, file: !212, line: 634, type: !213, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!212 = !DIFile(filename: "src/system.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!213 = !DISubroutineType(types: !214)
!214 = !{null, !16}
!215 = !DILocalVariable(name: "program", arg: 1, scope: !211, file: !212, line: 634, type: !16)
!216 = !DILocation(line: 634, column: 34, scope: !211)
!217 = !DILocalVariable(name: "infomap", scope: !211, file: !212, line: 636, type: !218)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 896, elements: !224)
!219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !211, file: !212, line: 636, size: 128, elements: !221)
!221 = !{!222, !223}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !220, file: !212, line: 636, baseType: !16, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !220, file: !212, line: 636, baseType: !16, size: 64, offset: 64)
!224 = !{!225}
!225 = !DISubrange(count: 7)
!226 = !DILocation(line: 636, column: 67, scope: !211)
!227 = !DILocalVariable(name: "node", scope: !211, file: !212, line: 646, type: !16)
!228 = !DILocation(line: 646, column: 15, scope: !211)
!229 = !DILocation(line: 646, column: 22, scope: !211)
!230 = !DILocalVariable(name: "map_prog", scope: !211, file: !212, line: 647, type: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!232 = !DILocation(line: 647, column: 25, scope: !211)
!233 = !DILocation(line: 647, column: 36, scope: !211)
!234 = !DILocation(line: 649, column: 3, scope: !211)
!235 = !DILocation(line: 649, column: 10, scope: !211)
!236 = !DILocation(line: 649, column: 20, scope: !211)
!237 = !DILocation(line: 649, column: 28, scope: !211)
!238 = !DILocation(line: 649, column: 33, scope: !211)
!239 = !DILocation(line: 649, column: 31, scope: !211)
!240 = !DILocation(line: 0, scope: !211)
!241 = !DILocation(line: 650, column: 13, scope: !211)
!242 = distinct !{!242, !234, !241}
!243 = !DILocation(line: 652, column: 7, scope: !244)
!244 = distinct !DILexicalBlock(scope: !211, file: !212, line: 652, column: 7)
!245 = !DILocation(line: 652, column: 17, scope: !244)
!246 = !DILocation(line: 652, column: 7, scope: !211)
!247 = !DILocation(line: 653, column: 12, scope: !244)
!248 = !DILocation(line: 653, column: 22, scope: !244)
!249 = !DILocation(line: 653, column: 10, scope: !244)
!250 = !DILocation(line: 653, column: 5, scope: !244)
!251 = !DILocation(line: 655, column: 11, scope: !211)
!252 = !DILocation(line: 655, column: 3, scope: !211)
!253 = !DILocalVariable(name: "lc_messages", scope: !211, file: !212, line: 659, type: !16)
!254 = !DILocation(line: 659, column: 15, scope: !211)
!255 = !DILocation(line: 659, column: 29, scope: !211)
!256 = !DILocation(line: 660, column: 7, scope: !257)
!257 = distinct !DILexicalBlock(scope: !211, file: !212, line: 660, column: 7)
!258 = !DILocation(line: 660, column: 19, scope: !257)
!259 = !DILocation(line: 660, column: 22, scope: !257)
!260 = !DILocation(line: 660, column: 7, scope: !211)
!261 = !DILocation(line: 666, column: 7, scope: !262)
!262 = distinct !DILexicalBlock(scope: !257, file: !212, line: 661, column: 5)
!263 = !DILocation(line: 668, column: 5, scope: !262)
!264 = !DILocation(line: 669, column: 11, scope: !211)
!265 = !DILocation(line: 670, column: 24, scope: !211)
!266 = !DILocation(line: 669, column: 3, scope: !211)
!267 = !DILocation(line: 671, column: 11, scope: !211)
!268 = !DILocation(line: 672, column: 11, scope: !211)
!269 = !DILocation(line: 672, column: 17, scope: !211)
!270 = !DILocation(line: 672, column: 25, scope: !211)
!271 = !DILocation(line: 672, column: 22, scope: !211)
!272 = !DILocation(line: 671, column: 3, scope: !211)
!273 = !DILocation(line: 673, column: 1, scope: !211)
!274 = !DILocalVariable(name: "program", arg: 1, scope: !275, file: !212, line: 634, type: !16)
!275 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !212, file: !212, line: 634, type: !213, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !276, retainedNodes: !4)
!276 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !277, nameTableKind: None)
!277 = !{!278}
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "longopts", scope: !276, file: !3, line: 41, type: !280, isLocal: true, isDefinition: true)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 1280, elements: !23)
!281 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !282)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !283)
!283 = !{!284, !285, !286, !287}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !282, file: !13, line: 52, baseType: !16, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !282, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !282, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !282, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!288 = !DILocalVariable(name: "infomap", scope: !275, file: !212, line: 636, type: !289)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 896, elements: !224)
!290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !275, file: !212, line: 636, size: 128, elements: !292)
!292 = !{!293, !294}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !291, file: !212, line: 636, baseType: !16, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !291, file: !212, line: 636, baseType: !16, size: 64, offset: 64)
!295 = !DILocalVariable(name: "node", scope: !275, file: !212, line: 646, type: !16)
!296 = !DILocalVariable(name: "map_prog", scope: !275, file: !212, line: 647, type: !297)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!298 = !DILocalVariable(name: "lc_messages", scope: !299, file: !212, line: 659, type: !16)
!299 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !212, file: !212, line: 634, type: !213, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !300, retainedNodes: !4)
!300 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !301, nameTableKind: None)
!301 = !{!302}
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "longopts", scope: !300, file: !3, line: 41, type: !304, isLocal: true, isDefinition: true)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 1280, elements: !23)
!305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !307)
!307 = !{!308, !309, !310, !311}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !306, file: !13, line: 52, baseType: !16, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !306, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !306, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !306, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!312 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 327, type: !313, scopeLine: 328, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!313 = !DISubroutineType(types: !314)
!314 = !{!19, !19, !315}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!316 = !DILocalVariable(name: "argc", arg: 1, scope: !312, file: !3, line: 327, type: !19)
!317 = !DILocation(line: 327, column: 11, scope: !312)
!318 = !DILocalVariable(name: "argv", arg: 2, scope: !312, file: !3, line: 327, type: !315)
!319 = !DILocation(line: 327, column: 24, scope: !312)
!320 = !DILocalVariable(name: "wd", scope: !312, file: !3, line: 329, type: !7)
!321 = !DILocation(line: 329, column: 9, scope: !312)
!322 = !DILocalVariable(name: "logical", scope: !312, file: !3, line: 333, type: !38)
!323 = !DILocation(line: 333, column: 8, scope: !312)
!324 = !DILocation(line: 333, column: 19, scope: !312)
!325 = !DILocation(line: 333, column: 46, scope: !312)
!326 = !DILocation(line: 336, column: 21, scope: !312)
!327 = !DILocation(line: 336, column: 3, scope: !312)
!328 = !DILocation(line: 337, column: 3, scope: !312)
!329 = !DILocation(line: 338, column: 3, scope: !312)
!330 = !DILocation(line: 339, column: 3, scope: !312)
!331 = !DILocation(line: 341, column: 3, scope: !312)
!332 = !DILocation(line: 343, column: 3, scope: !312)
!333 = !DILocalVariable(name: "c", scope: !334, file: !3, line: 345, type: !19)
!334 = distinct !DILexicalBlock(scope: !312, file: !3, line: 344, column: 5)
!335 = !DILocation(line: 345, column: 11, scope: !334)
!336 = !DILocation(line: 345, column: 28, scope: !334)
!337 = !DILocation(line: 345, column: 34, scope: !334)
!338 = !DILocation(line: 345, column: 15, scope: !334)
!339 = !DILocation(line: 346, column: 11, scope: !340)
!340 = distinct !DILexicalBlock(scope: !334, file: !3, line: 346, column: 11)
!341 = !DILocation(line: 346, column: 13, scope: !340)
!342 = !DILocation(line: 347, column: 9, scope: !340)
!343 = !DILocation(line: 348, column: 15, scope: !334)
!344 = !DILocation(line: 348, column: 7, scope: !334)
!345 = !DILocation(line: 351, column: 19, scope: !346)
!346 = distinct !DILexicalBlock(scope: !334, file: !3, line: 349, column: 9)
!347 = !DILocation(line: 352, column: 11, scope: !346)
!348 = !DILocation(line: 354, column: 19, scope: !346)
!349 = !DILocation(line: 355, column: 11, scope: !346)
!350 = !DILocation(line: 357, column: 9, scope: !346)
!351 = !DILocation(line: 359, column: 9, scope: !346)
!352 = !DILocation(line: 362, column: 11, scope: !346)
!353 = distinct !{!353, !332, !354}
!354 = !DILocation(line: 364, column: 5, scope: !312)
!355 = !DILocation(line: 366, column: 7, scope: !356)
!356 = distinct !DILexicalBlock(scope: !312, file: !3, line: 366, column: 7)
!357 = !DILocation(line: 366, column: 16, scope: !356)
!358 = !DILocation(line: 366, column: 14, scope: !356)
!359 = !DILocation(line: 366, column: 7, scope: !312)
!360 = !DILocation(line: 367, column: 18, scope: !356)
!361 = !DILocation(line: 367, column: 5, scope: !356)
!362 = !DILocation(line: 369, column: 7, scope: !363)
!363 = distinct !DILexicalBlock(scope: !312, file: !3, line: 369, column: 7)
!364 = !DILocation(line: 369, column: 7, scope: !312)
!365 = !DILocation(line: 371, column: 12, scope: !366)
!366 = distinct !DILexicalBlock(scope: !363, file: !3, line: 370, column: 5)
!367 = !DILocation(line: 371, column: 10, scope: !366)
!368 = !DILocation(line: 372, column: 11, scope: !369)
!369 = distinct !DILexicalBlock(scope: !366, file: !3, line: 372, column: 11)
!370 = !DILocation(line: 372, column: 11, scope: !366)
!371 = !DILocation(line: 374, column: 17, scope: !372)
!372 = distinct !DILexicalBlock(scope: !369, file: !3, line: 373, column: 9)
!373 = !DILocation(line: 374, column: 11, scope: !372)
!374 = !DILocation(line: 375, column: 11, scope: !372)
!375 = !DILocation(line: 377, column: 5, scope: !366)
!376 = !DILocation(line: 379, column: 8, scope: !312)
!377 = !DILocation(line: 379, column: 6, scope: !312)
!378 = !DILocation(line: 380, column: 7, scope: !379)
!379 = distinct !DILexicalBlock(scope: !312, file: !3, line: 380, column: 7)
!380 = !DILocation(line: 380, column: 10, scope: !379)
!381 = !DILocation(line: 380, column: 7, scope: !312)
!382 = !DILocation(line: 382, column: 13, scope: !383)
!383 = distinct !DILexicalBlock(scope: !379, file: !3, line: 381, column: 5)
!384 = !DILocation(line: 382, column: 7, scope: !383)
!385 = !DILocation(line: 383, column: 13, scope: !383)
!386 = !DILocation(line: 383, column: 7, scope: !383)
!387 = !DILocation(line: 384, column: 5, scope: !383)
!388 = !DILocalVariable(name: "file_name", scope: !389, file: !3, line: 387, type: !390)
!389 = distinct !DILexicalBlock(scope: !379, file: !3, line: 386, column: 5)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 34, size: 192, elements: !392)
!392 = !{!393, !394, !395}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !391, file: !3, line: 36, baseType: !7, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !391, file: !3, line: 37, baseType: !74, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !391, file: !3, line: 38, baseType: !7, size: 64, offset: 128)
!396 = !DILocation(line: 387, column: 25, scope: !389)
!397 = !DILocation(line: 387, column: 37, scope: !389)
!398 = !DILocation(line: 388, column: 22, scope: !389)
!399 = !DILocation(line: 388, column: 7, scope: !389)
!400 = !DILocation(line: 389, column: 13, scope: !389)
!401 = !DILocation(line: 389, column: 24, scope: !389)
!402 = !DILocation(line: 389, column: 7, scope: !389)
!403 = !DILocation(line: 390, column: 23, scope: !389)
!404 = !DILocation(line: 390, column: 7, scope: !389)
!405 = !DILocation(line: 393, column: 3, scope: !312)
!406 = !DILocation(line: 394, column: 1, scope: !312)
!407 = !DILocalVariable(name: "argc", arg: 1, scope: !408, file: !3, line: 327, type: !19)
!408 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 327, type: !313, scopeLine: 328, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !409, retainedNodes: !4)
!409 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !410, nameTableKind: None)
!410 = !{!411}
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "longopts", scope: !409, file: !3, line: 41, type: !413, isLocal: true, isDefinition: true)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 1280, elements: !23)
!414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !416)
!416 = !{!417, !418, !419, !420}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !415, file: !13, line: 52, baseType: !16, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !415, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !415, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !415, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!421 = !DILocalVariable(name: "argv", arg: 2, scope: !408, file: !3, line: 327, type: !315)
!422 = !DILocalVariable(name: "wd", scope: !408, file: !3, line: 329, type: !7)
!423 = !DILocalVariable(name: "logical", scope: !408, file: !3, line: 333, type: !38)
!424 = distinct !DISubprogram(name: "logical_getcwd", scope: !3, file: !3, line: 300, type: !425, scopeLine: 301, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!425 = !DISubroutineType(types: !426)
!426 = !{!7}
!427 = !DILocalVariable(name: "st1", scope: !424, file: !3, line: 302, type: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !429, line: 46, size: 1152, elements: !430)
!429 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!430 = !{!431, !434, !436, !438, !440, !442, !444, !445, !446, !449, !451, !453, !461, !462, !463}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !428, file: !429, line: 48, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !433, line: 145, baseType: !76)
!433 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!434 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !428, file: !429, line: 53, baseType: !435, size: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !433, line: 148, baseType: !76)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !428, file: !429, line: 61, baseType: !437, size: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !433, line: 151, baseType: !76)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !428, file: !429, line: 62, baseType: !439, size: 32, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !433, line: 150, baseType: !59)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !428, file: !429, line: 64, baseType: !441, size: 32, offset: 224)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !433, line: 146, baseType: !59)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !428, file: !429, line: 65, baseType: !443, size: 32, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !433, line: 147, baseType: !59)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !428, file: !429, line: 67, baseType: !19, size: 32, offset: 288)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !428, file: !429, line: 69, baseType: !432, size: 64, offset: 320)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !428, file: !429, line: 74, baseType: !447, size: 64, offset: 384)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !433, line: 152, baseType: !448)
!448 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !428, file: !429, line: 78, baseType: !450, size: 64, offset: 448)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !433, line: 174, baseType: !448)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !428, file: !429, line: 80, baseType: !452, size: 64, offset: 512)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !433, line: 179, baseType: !448)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !428, file: !429, line: 91, baseType: !454, size: 128, offset: 576)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !455, line: 10, size: 128, elements: !456)
!455 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!456 = !{!457, !459}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !454, file: !455, line: 12, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !433, line: 160, baseType: !448)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !454, file: !455, line: 16, baseType: !460, size: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !433, line: 196, baseType: !448)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !428, file: !429, line: 92, baseType: !454, size: 128, offset: 704)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !428, file: !429, line: 93, baseType: !454, size: 128, offset: 832)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !428, file: !429, line: 106, baseType: !464, size: 192, offset: 960)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 192, elements: !465)
!465 = !{!466}
!466 = !DISubrange(count: 3)
!467 = !DILocation(line: 302, column: 15, scope: !424)
!468 = !DILocalVariable(name: "st2", scope: !424, file: !3, line: 303, type: !428)
!469 = !DILocation(line: 303, column: 15, scope: !424)
!470 = !DILocalVariable(name: "wd", scope: !424, file: !3, line: 304, type: !7)
!471 = !DILocation(line: 304, column: 9, scope: !424)
!472 = !DILocation(line: 304, column: 14, scope: !424)
!473 = !DILocalVariable(name: "p", scope: !424, file: !3, line: 305, type: !7)
!474 = !DILocation(line: 305, column: 9, scope: !424)
!475 = !DILocation(line: 308, column: 8, scope: !476)
!476 = distinct !DILexicalBlock(scope: !424, file: !3, line: 308, column: 7)
!477 = !DILocation(line: 308, column: 11, scope: !476)
!478 = !DILocation(line: 308, column: 14, scope: !476)
!479 = !DILocation(line: 308, column: 20, scope: !476)
!480 = !DILocation(line: 308, column: 7, scope: !424)
!481 = !DILocation(line: 309, column: 5, scope: !476)
!482 = !DILocation(line: 310, column: 7, scope: !424)
!483 = !DILocation(line: 310, column: 5, scope: !424)
!484 = !DILocation(line: 311, column: 3, scope: !424)
!485 = !DILocation(line: 311, column: 23, scope: !424)
!486 = !DILocation(line: 311, column: 15, scope: !424)
!487 = !DILocation(line: 311, column: 13, scope: !424)
!488 = !DILocation(line: 313, column: 12, scope: !489)
!489 = distinct !DILexicalBlock(scope: !490, file: !3, line: 313, column: 11)
!490 = distinct !DILexicalBlock(scope: !424, file: !3, line: 312, column: 5)
!491 = !DILocation(line: 313, column: 17, scope: !489)
!492 = !DILocation(line: 313, column: 20, scope: !489)
!493 = !DILocation(line: 313, column: 25, scope: !489)
!494 = !DILocation(line: 314, column: 11, scope: !489)
!495 = !DILocation(line: 314, column: 15, scope: !489)
!496 = !DILocation(line: 314, column: 20, scope: !489)
!497 = !DILocation(line: 314, column: 27, scope: !489)
!498 = !DILocation(line: 314, column: 32, scope: !489)
!499 = !DILocation(line: 314, column: 37, scope: !489)
!500 = !DILocation(line: 314, column: 40, scope: !489)
!501 = !DILocation(line: 314, column: 45, scope: !489)
!502 = !DILocation(line: 313, column: 11, scope: !490)
!503 = !DILocation(line: 315, column: 9, scope: !489)
!504 = !DILocation(line: 316, column: 8, scope: !490)
!505 = distinct !{!505, !484, !506}
!506 = !DILocation(line: 317, column: 5, scope: !424)
!507 = !DILocation(line: 320, column: 13, scope: !508)
!508 = distinct !DILexicalBlock(scope: !424, file: !3, line: 320, column: 7)
!509 = !DILocation(line: 320, column: 7, scope: !508)
!510 = !DILocation(line: 320, column: 23, scope: !508)
!511 = !DILocation(line: 320, column: 31, scope: !508)
!512 = !DILocation(line: 320, column: 48, scope: !508)
!513 = !DILocation(line: 320, column: 56, scope: !508)
!514 = !DILocation(line: 320, column: 7, scope: !424)
!515 = !DILocation(line: 321, column: 12, scope: !508)
!516 = !DILocation(line: 321, column: 5, scope: !508)
!517 = !DILocation(line: 322, column: 3, scope: !424)
!518 = !DILocation(line: 323, column: 1, scope: !424)
!519 = !DILocalVariable(name: "st1", scope: !520, file: !3, line: 302, type: !533)
!520 = distinct !DISubprogram(name: "logical_getcwd", scope: !3, file: !3, line: 300, type: !425, scopeLine: 301, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !521, retainedNodes: !4)
!521 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !522, nameTableKind: None)
!522 = !{!523}
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "longopts", scope: !521, file: !3, line: 41, type: !525, isLocal: true, isDefinition: true)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !526, size: 1280, elements: !23)
!526 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !528)
!528 = !{!529, !530, !531, !532}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !527, file: !13, line: 52, baseType: !16, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !527, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !527, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !527, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !429, line: 46, size: 1152, elements: !534)
!534 = !{!535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !551, !552, !553}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !533, file: !429, line: 48, baseType: !432, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !533, file: !429, line: 53, baseType: !435, size: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !533, file: !429, line: 61, baseType: !437, size: 64, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !533, file: !429, line: 62, baseType: !439, size: 32, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !533, file: !429, line: 64, baseType: !441, size: 32, offset: 224)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !533, file: !429, line: 65, baseType: !443, size: 32, offset: 256)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !533, file: !429, line: 67, baseType: !19, size: 32, offset: 288)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !533, file: !429, line: 69, baseType: !432, size: 64, offset: 320)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !533, file: !429, line: 74, baseType: !447, size: 64, offset: 384)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !533, file: !429, line: 78, baseType: !450, size: 64, offset: 448)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !533, file: !429, line: 80, baseType: !452, size: 64, offset: 512)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !533, file: !429, line: 91, baseType: !547, size: 128, offset: 576)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !455, line: 10, size: 128, elements: !548)
!548 = !{!549, !550}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !547, file: !455, line: 12, baseType: !458, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !547, file: !455, line: 16, baseType: !460, size: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !533, file: !429, line: 92, baseType: !547, size: 128, offset: 704)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !533, file: !429, line: 93, baseType: !547, size: 128, offset: 832)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !533, file: !429, line: 106, baseType: !464, size: 192, offset: 960)
!554 = !DILocalVariable(name: "st2", scope: !520, file: !3, line: 303, type: !533)
!555 = !DILocalVariable(name: "wd", scope: !520, file: !3, line: 304, type: !7)
!556 = !DILocalVariable(name: "p", scope: !520, file: !3, line: 305, type: !7)
!557 = distinct !DISubprogram(name: "file_name_init", scope: !3, file: !3, line: 85, type: !558, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!558 = !DISubroutineType(types: !559)
!559 = !{!390}
!560 = !DILocalVariable(name: "p", scope: !557, file: !3, line: 87, type: !390)
!561 = !DILocation(line: 87, column: 21, scope: !557)
!562 = !DILocation(line: 87, column: 25, scope: !557)
!563 = !DILocation(line: 91, column: 3, scope: !557)
!564 = !DILocation(line: 91, column: 6, scope: !557)
!565 = !DILocation(line: 91, column: 14, scope: !557)
!566 = !DILocation(line: 93, column: 21, scope: !557)
!567 = !DILocation(line: 93, column: 24, scope: !557)
!568 = !DILocation(line: 93, column: 12, scope: !557)
!569 = !DILocation(line: 93, column: 3, scope: !557)
!570 = !DILocation(line: 93, column: 6, scope: !557)
!571 = !DILocation(line: 93, column: 10, scope: !557)
!572 = !DILocation(line: 94, column: 14, scope: !557)
!573 = !DILocation(line: 94, column: 17, scope: !557)
!574 = !DILocation(line: 94, column: 24, scope: !557)
!575 = !DILocation(line: 94, column: 27, scope: !557)
!576 = !DILocation(line: 94, column: 35, scope: !557)
!577 = !DILocation(line: 94, column: 21, scope: !557)
!578 = !DILocation(line: 94, column: 3, scope: !557)
!579 = !DILocation(line: 94, column: 6, scope: !557)
!580 = !DILocation(line: 94, column: 12, scope: !557)
!581 = !DILocation(line: 95, column: 3, scope: !557)
!582 = !DILocation(line: 95, column: 6, scope: !557)
!583 = !DILocation(line: 95, column: 15, scope: !557)
!584 = !DILocation(line: 96, column: 10, scope: !557)
!585 = !DILocation(line: 96, column: 3, scope: !557)
!586 = !DILocalVariable(name: "p", scope: !587, file: !3, line: 87, type: !590)
!587 = distinct !DISubprogram(name: "file_name_init", scope: !3, file: !3, line: 85, type: !588, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !596, retainedNodes: !4)
!588 = !DISubroutineType(types: !589)
!589 = !{!590}
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 34, size: 192, elements: !592)
!592 = !{!593, !594, !595}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !591, file: !3, line: 36, baseType: !7, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !591, file: !3, line: 37, baseType: !74, size: 64, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !591, file: !3, line: 38, baseType: !7, size: 64, offset: 128)
!596 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !597, nameTableKind: None)
!597 = !{!598}
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "longopts", scope: !596, file: !3, line: 41, type: !600, isLocal: true, isDefinition: true)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 1280, elements: !23)
!601 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !603)
!603 = !{!604, !605, !606, !607}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !602, file: !13, line: 52, baseType: !16, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !602, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !602, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !602, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!608 = distinct !DISubprogram(name: "robust_getcwd", scope: !3, file: !3, line: 268, type: !609, scopeLine: 269, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!609 = !DISubroutineType(types: !610)
!610 = !{null, !390}
!611 = !DILocalVariable(name: "file_name", arg: 1, scope: !608, file: !3, line: 268, type: !390)
!612 = !DILocation(line: 268, column: 34, scope: !608)
!613 = !DILocalVariable(name: "height", scope: !608, file: !3, line: 270, type: !74)
!614 = !DILocation(line: 270, column: 10, scope: !608)
!615 = !DILocalVariable(name: "dev_ino_buf", scope: !608, file: !3, line: 271, type: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !617, line: 7, size: 128, elements: !618)
!617 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!618 = !{!619, !622}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !616, file: !617, line: 9, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !621, line: 47, baseType: !435)
!621 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!622 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !616, file: !617, line: 10, baseType: !623, size: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !621, line: 59, baseType: !432)
!624 = !DILocation(line: 271, column: 18, scope: !608)
!625 = !DILocalVariable(name: "root_dev_ino", scope: !608, file: !3, line: 272, type: !626)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!627 = !DILocation(line: 272, column: 19, scope: !608)
!628 = !DILocation(line: 272, column: 34, scope: !608)
!629 = !DILocalVariable(name: "dot_sb", scope: !608, file: !3, line: 273, type: !428)
!630 = !DILocation(line: 273, column: 15, scope: !608)
!631 = !DILocation(line: 275, column: 7, scope: !632)
!632 = distinct !DILexicalBlock(scope: !608, file: !3, line: 275, column: 7)
!633 = !DILocation(line: 275, column: 20, scope: !632)
!634 = !DILocation(line: 275, column: 7, scope: !608)
!635 = !DILocation(line: 276, column: 5, scope: !632)
!636 = !DILocation(line: 279, column: 7, scope: !637)
!637 = distinct !DILexicalBlock(scope: !608, file: !3, line: 279, column: 7)
!638 = !DILocation(line: 279, column: 27, scope: !637)
!639 = !DILocation(line: 279, column: 7, scope: !608)
!640 = !DILocation(line: 280, column: 5, scope: !637)
!641 = !DILocation(line: 282, column: 3, scope: !608)
!642 = !DILocation(line: 285, column: 11, scope: !643)
!643 = distinct !DILexicalBlock(scope: !644, file: !3, line: 285, column: 11)
!644 = distinct !DILexicalBlock(scope: !608, file: !3, line: 283, column: 5)
!645 = !DILocation(line: 285, column: 11, scope: !644)
!646 = !DILocation(line: 286, column: 9, scope: !643)
!647 = !DILocation(line: 288, column: 32, scope: !644)
!648 = !DILocation(line: 288, column: 49, scope: !644)
!649 = !DILocation(line: 288, column: 7, scope: !644)
!650 = distinct !{!650, !641, !651}
!651 = !DILocation(line: 289, column: 5, scope: !608)
!652 = !DILocation(line: 292, column: 7, scope: !653)
!653 = distinct !DILexicalBlock(scope: !608, file: !3, line: 292, column: 7)
!654 = !DILocation(line: 292, column: 18, scope: !653)
!655 = !DILocation(line: 292, column: 27, scope: !653)
!656 = !DILocation(line: 292, column: 7, scope: !608)
!657 = !DILocation(line: 293, column: 24, scope: !653)
!658 = !DILocation(line: 293, column: 5, scope: !653)
!659 = !DILocation(line: 294, column: 1, scope: !608)
!660 = !DILocalVariable(name: "file_name", arg: 1, scope: !661, file: !3, line: 268, type: !664)
!661 = distinct !DISubprogram(name: "robust_getcwd", scope: !3, file: !3, line: 268, type: !662, scopeLine: 269, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !670, retainedNodes: !4)
!662 = !DISubroutineType(types: !663)
!663 = !{null, !664}
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 34, size: 192, elements: !666)
!666 = !{!667, !668, !669}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !665, file: !3, line: 36, baseType: !7, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !665, file: !3, line: 37, baseType: !74, size: 64, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !665, file: !3, line: 38, baseType: !7, size: 64, offset: 128)
!670 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !671, nameTableKind: None)
!671 = !{!672}
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "longopts", scope: !670, file: !3, line: 41, type: !674, isLocal: true, isDefinition: true)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !675, size: 1280, elements: !23)
!675 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !677)
!677 = !{!678, !679, !680, !681}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !676, file: !13, line: 52, baseType: !16, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !676, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !676, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !676, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!682 = !DILocalVariable(name: "height", scope: !661, file: !3, line: 270, type: !74)
!683 = !DILocalVariable(name: "dev_ino_buf", scope: !661, file: !3, line: 271, type: !684)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !617, line: 7, size: 128, elements: !685)
!685 = !{!686, !687}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !684, file: !617, line: 9, baseType: !620, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !684, file: !617, line: 10, baseType: !623, size: 64, offset: 64)
!688 = !DILocalVariable(name: "root_dev_ino", scope: !661, file: !3, line: 272, type: !689)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!690 = !DILocalVariable(name: "dot_sb", scope: !661, file: !3, line: 273, type: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !429, line: 46, size: 1152, elements: !692)
!692 = !{!693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !709, !710, !711}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !691, file: !429, line: 48, baseType: !432, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !691, file: !429, line: 53, baseType: !435, size: 64, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !691, file: !429, line: 61, baseType: !437, size: 64, offset: 128)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !691, file: !429, line: 62, baseType: !439, size: 32, offset: 192)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !691, file: !429, line: 64, baseType: !441, size: 32, offset: 224)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !691, file: !429, line: 65, baseType: !443, size: 32, offset: 256)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !691, file: !429, line: 67, baseType: !19, size: 32, offset: 288)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !691, file: !429, line: 69, baseType: !432, size: 64, offset: 320)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !691, file: !429, line: 74, baseType: !447, size: 64, offset: 384)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !691, file: !429, line: 78, baseType: !450, size: 64, offset: 448)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !691, file: !429, line: 80, baseType: !452, size: 64, offset: 512)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !691, file: !429, line: 91, baseType: !705, size: 128, offset: 576)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !455, line: 10, size: 128, elements: !706)
!706 = !{!707, !708}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !705, file: !455, line: 12, baseType: !458, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !705, file: !455, line: 16, baseType: !460, size: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !691, file: !429, line: 92, baseType: !705, size: 128, offset: 704)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !691, file: !429, line: 93, baseType: !705, size: 128, offset: 832)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !691, file: !429, line: 106, baseType: !464, size: 192, offset: 960)
!712 = distinct !DISubprogram(name: "file_name_free", scope: !3, file: !3, line: 78, type: !609, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!713 = !DILocalVariable(name: "p", arg: 1, scope: !712, file: !3, line: 78, type: !390)
!714 = !DILocation(line: 78, column: 35, scope: !712)
!715 = !DILocation(line: 80, column: 9, scope: !712)
!716 = !DILocation(line: 80, column: 12, scope: !712)
!717 = !DILocation(line: 80, column: 3, scope: !712)
!718 = !DILocation(line: 81, column: 9, scope: !712)
!719 = !DILocation(line: 81, column: 3, scope: !712)
!720 = !DILocation(line: 82, column: 1, scope: !712)
!721 = !DILocalVariable(name: "p", arg: 1, scope: !722, file: !3, line: 78, type: !725)
!722 = distinct !DISubprogram(name: "file_name_free", scope: !3, file: !3, line: 78, type: !723, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !731, retainedNodes: !4)
!723 = !DISubroutineType(types: !724)
!724 = !{null, !725}
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 34, size: 192, elements: !727)
!727 = !{!728, !729, !730}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !726, file: !3, line: 36, baseType: !7, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !726, file: !3, line: 37, baseType: !74, size: 64, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !726, file: !3, line: 38, baseType: !7, size: 64, offset: 128)
!731 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !732, nameTableKind: None)
!732 = !{!733}
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(name: "longopts", scope: !731, file: !3, line: 41, type: !735, isLocal: true, isDefinition: true)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !736, size: 1280, elements: !23)
!736 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !738)
!738 = !{!739, !740, !741, !742}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !737, file: !13, line: 52, baseType: !16, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !737, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !737, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !737, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!743 = distinct !DISubprogram(name: "find_dir_entry", scope: !3, file: !3, line: 153, type: !744, scopeLine: 155, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!744 = !DISubroutineType(types: !745)
!745 = !{null, !746, !390, !74}
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!747 = !DILocalVariable(name: "dot_sb", arg: 1, scope: !743, file: !3, line: 153, type: !746)
!748 = !DILocation(line: 153, column: 30, scope: !743)
!749 = !DILocalVariable(name: "file_name", arg: 2, scope: !743, file: !3, line: 153, type: !390)
!750 = !DILocation(line: 153, column: 56, scope: !743)
!751 = !DILocalVariable(name: "parent_height", arg: 3, scope: !743, file: !3, line: 154, type: !74)
!752 = !DILocation(line: 154, column: 24, scope: !743)
!753 = !DILocalVariable(name: "dirp", scope: !743, file: !3, line: 156, type: !754)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !756, line: 127, baseType: !757)
!756 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !756, line: 127, flags: DIFlagFwdDecl)
!758 = !DILocation(line: 156, column: 8, scope: !743)
!759 = !DILocalVariable(name: "fd", scope: !743, file: !3, line: 157, type: !19)
!760 = !DILocation(line: 157, column: 7, scope: !743)
!761 = !DILocalVariable(name: "parent_sb", scope: !743, file: !3, line: 158, type: !428)
!762 = !DILocation(line: 158, column: 15, scope: !743)
!763 = !DILocalVariable(name: "use_lstat", scope: !743, file: !3, line: 159, type: !38)
!764 = !DILocation(line: 159, column: 8, scope: !743)
!765 = !DILocalVariable(name: "found", scope: !743, file: !3, line: 160, type: !38)
!766 = !DILocation(line: 160, column: 8, scope: !743)
!767 = !DILocation(line: 162, column: 10, scope: !743)
!768 = !DILocation(line: 162, column: 8, scope: !743)
!769 = !DILocation(line: 163, column: 7, scope: !770)
!770 = distinct !DILexicalBlock(scope: !743, file: !3, line: 163, column: 7)
!771 = !DILocation(line: 163, column: 12, scope: !770)
!772 = !DILocation(line: 163, column: 7, scope: !743)
!773 = !DILocation(line: 164, column: 5, scope: !770)
!774 = !DILocation(line: 167, column: 15, scope: !743)
!775 = !DILocation(line: 167, column: 8, scope: !743)
!776 = !DILocation(line: 167, column: 6, scope: !743)
!777 = !DILocation(line: 168, column: 13, scope: !778)
!778 = distinct !DILexicalBlock(scope: !743, file: !3, line: 168, column: 7)
!779 = !DILocation(line: 168, column: 10, scope: !778)
!780 = !DILocation(line: 168, column: 8, scope: !778)
!781 = !DILocation(line: 168, column: 26, scope: !778)
!782 = !DILocation(line: 168, column: 18, scope: !778)
!783 = !DILocation(line: 168, column: 32, scope: !778)
!784 = !DILocation(line: 168, column: 46, scope: !778)
!785 = !DILocation(line: 168, column: 7, scope: !743)
!786 = !DILocation(line: 169, column: 5, scope: !778)
!787 = !DILocation(line: 172, column: 13, scope: !788)
!788 = distinct !DILexicalBlock(scope: !743, file: !3, line: 172, column: 7)
!789 = !DILocation(line: 172, column: 10, scope: !788)
!790 = !DILocation(line: 172, column: 8, scope: !788)
!791 = !DILocation(line: 172, column: 25, scope: !788)
!792 = !DILocation(line: 172, column: 18, scope: !788)
!793 = !DILocation(line: 172, column: 43, scope: !788)
!794 = !DILocation(line: 172, column: 67, scope: !788)
!795 = !DILocation(line: 172, column: 7, scope: !743)
!796 = !DILocation(line: 173, column: 5, scope: !788)
!797 = !DILocation(line: 178, column: 26, scope: !743)
!798 = !DILocation(line: 178, column: 36, scope: !743)
!799 = !DILocation(line: 178, column: 44, scope: !743)
!800 = !DILocation(line: 178, column: 33, scope: !743)
!801 = !DILocation(line: 178, column: 13, scope: !743)
!802 = !DILocation(line: 180, column: 9, scope: !743)
!803 = !DILocation(line: 181, column: 3, scope: !743)
!804 = !DILocalVariable(name: "dp", scope: !805, file: !3, line: 183, type: !806)
!805 = distinct !DILexicalBlock(scope: !743, file: !3, line: 182, column: 5)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !809, line: 22, size: 2240, elements: !810)
!809 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!810 = !{!811, !812, !813, !814, !815}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !808, file: !809, line: 25, baseType: !435, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !808, file: !809, line: 26, baseType: !447, size: 64, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !808, file: !809, line: 31, baseType: !73, size: 16, offset: 128)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !808, file: !809, line: 32, baseType: !148, size: 8, offset: 144)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !808, file: !809, line: 33, baseType: !105, size: 2048, offset: 152)
!816 = !DILocation(line: 183, column: 28, scope: !805)
!817 = !DILocalVariable(name: "ent_sb", scope: !805, file: !3, line: 184, type: !428)
!818 = !DILocation(line: 184, column: 19, scope: !805)
!819 = !DILocalVariable(name: "ino", scope: !805, file: !3, line: 185, type: !620)
!820 = !DILocation(line: 185, column: 13, scope: !805)
!821 = !DILocation(line: 187, column: 7, scope: !805)
!822 = !DILocation(line: 187, column: 13, scope: !805)
!823 = !DILocation(line: 188, column: 50, scope: !824)
!824 = distinct !DILexicalBlock(scope: !805, file: !3, line: 188, column: 11)
!825 = !DILocation(line: 188, column: 17, scope: !824)
!826 = !DILocation(line: 188, column: 15, scope: !824)
!827 = !DILocation(line: 188, column: 57, scope: !824)
!828 = !DILocation(line: 188, column: 11, scope: !805)
!829 = !DILocation(line: 190, column: 15, scope: !830)
!830 = distinct !DILexicalBlock(scope: !831, file: !3, line: 190, column: 15)
!831 = distinct !DILexicalBlock(scope: !824, file: !3, line: 189, column: 9)
!832 = !DILocation(line: 190, column: 15, scope: !831)
!833 = !DILocalVariable(name: "e", scope: !834, file: !3, line: 193, type: !19)
!834 = distinct !DILexicalBlock(scope: !830, file: !3, line: 191, column: 13)
!835 = !DILocation(line: 193, column: 19, scope: !834)
!836 = !DILocation(line: 193, column: 23, scope: !834)
!837 = !DILocation(line: 194, column: 25, scope: !834)
!838 = !DILocation(line: 194, column: 15, scope: !834)
!839 = !DILocation(line: 195, column: 23, scope: !834)
!840 = !DILocation(line: 195, column: 15, scope: !834)
!841 = !DILocation(line: 195, column: 21, scope: !834)
!842 = !DILocation(line: 198, column: 20, scope: !834)
!843 = !DILocation(line: 199, column: 13, scope: !834)
!844 = !DILocation(line: 200, column: 11, scope: !831)
!845 = !DILocation(line: 203, column: 13, scope: !805)
!846 = !DILocation(line: 203, column: 11, scope: !805)
!847 = !DILocation(line: 205, column: 11, scope: !848)
!848 = distinct !DILexicalBlock(scope: !805, file: !3, line: 205, column: 11)
!849 = !DILocation(line: 205, column: 15, scope: !848)
!850 = !DILocation(line: 205, column: 38, scope: !848)
!851 = !DILocation(line: 205, column: 41, scope: !848)
!852 = !DILocation(line: 205, column: 11, scope: !805)
!853 = !DILocation(line: 207, column: 22, scope: !854)
!854 = distinct !DILexicalBlock(scope: !855, file: !3, line: 207, column: 15)
!855 = distinct !DILexicalBlock(scope: !848, file: !3, line: 206, column: 9)
!856 = !DILocation(line: 207, column: 26, scope: !854)
!857 = !DILocation(line: 207, column: 15, scope: !854)
!858 = !DILocation(line: 207, column: 43, scope: !854)
!859 = !DILocation(line: 207, column: 15, scope: !855)
!860 = !DILocation(line: 210, column: 15, scope: !861)
!861 = distinct !DILexicalBlock(scope: !854, file: !3, line: 208, column: 13)
!862 = distinct !{!862, !803, !863}
!863 = !DILocation(line: 226, column: 5, scope: !743)
!864 = !DILocation(line: 212, column: 24, scope: !855)
!865 = !DILocation(line: 212, column: 15, scope: !855)
!866 = !DILocation(line: 213, column: 9, scope: !855)
!867 = !DILocation(line: 215, column: 11, scope: !868)
!868 = distinct !DILexicalBlock(scope: !805, file: !3, line: 215, column: 11)
!869 = !DILocation(line: 215, column: 18, scope: !868)
!870 = !DILocation(line: 215, column: 26, scope: !868)
!871 = !DILocation(line: 215, column: 15, scope: !868)
!872 = !DILocation(line: 215, column: 11, scope: !805)
!873 = !DILocation(line: 216, column: 9, scope: !868)
!874 = !DILocation(line: 220, column: 14, scope: !875)
!875 = distinct !DILexicalBlock(scope: !805, file: !3, line: 220, column: 12)
!876 = !DILocation(line: 220, column: 24, scope: !875)
!877 = !DILocation(line: 220, column: 34, scope: !875)
!878 = !DILocation(line: 220, column: 44, scope: !875)
!879 = !DILocation(line: 220, column: 52, scope: !875)
!880 = !DILocation(line: 220, column: 41, scope: !875)
!881 = !DILocation(line: 220, column: 12, scope: !805)
!882 = !DILocation(line: 222, column: 30, scope: !883)
!883 = distinct !DILexicalBlock(scope: !875, file: !3, line: 221, column: 9)
!884 = !DILocation(line: 222, column: 41, scope: !883)
!885 = !DILocation(line: 222, column: 45, scope: !883)
!886 = !DILocation(line: 222, column: 53, scope: !883)
!887 = !DILocation(line: 222, column: 11, scope: !883)
!888 = !DILocation(line: 223, column: 17, scope: !883)
!889 = !DILocation(line: 224, column: 11, scope: !883)
!890 = !DILocation(line: 228, column: 7, scope: !891)
!891 = distinct !DILexicalBlock(scope: !743, file: !3, line: 228, column: 7)
!892 = !DILocation(line: 228, column: 12, scope: !891)
!893 = !DILocation(line: 228, column: 20, scope: !891)
!894 = !DILocation(line: 228, column: 33, scope: !891)
!895 = !DILocation(line: 228, column: 23, scope: !891)
!896 = !DILocation(line: 228, column: 39, scope: !891)
!897 = !DILocation(line: 228, column: 7, scope: !743)
!898 = !DILocation(line: 232, column: 7, scope: !899)
!899 = distinct !DILexicalBlock(scope: !891, file: !3, line: 229, column: 5)
!900 = !DILocation(line: 236, column: 10, scope: !901)
!901 = distinct !DILexicalBlock(scope: !743, file: !3, line: 236, column: 8)
!902 = !DILocation(line: 236, column: 8, scope: !743)
!903 = !DILocation(line: 237, column: 5, scope: !901)
!904 = !DILocation(line: 241, column: 4, scope: !743)
!905 = !DILocation(line: 241, column: 13, scope: !743)
!906 = !DILocation(line: 242, column: 1, scope: !743)
!907 = !DILocalVariable(name: "dot_sb", arg: 1, scope: !908, file: !3, line: 153, type: !911)
!908 = distinct !DISubprogram(name: "find_dir_entry", scope: !3, file: !3, line: 153, type: !909, scopeLine: 155, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !939, retainedNodes: !4)
!909 = !DISubroutineType(types: !910)
!910 = !{null, !911, !933, !74}
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !429, line: 46, size: 1152, elements: !913)
!913 = !{!914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !930, !931, !932}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !912, file: !429, line: 48, baseType: !432, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !912, file: !429, line: 53, baseType: !435, size: 64, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !912, file: !429, line: 61, baseType: !437, size: 64, offset: 128)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !912, file: !429, line: 62, baseType: !439, size: 32, offset: 192)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !912, file: !429, line: 64, baseType: !441, size: 32, offset: 224)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !912, file: !429, line: 65, baseType: !443, size: 32, offset: 256)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !912, file: !429, line: 67, baseType: !19, size: 32, offset: 288)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !912, file: !429, line: 69, baseType: !432, size: 64, offset: 320)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !912, file: !429, line: 74, baseType: !447, size: 64, offset: 384)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !912, file: !429, line: 78, baseType: !450, size: 64, offset: 448)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !912, file: !429, line: 80, baseType: !452, size: 64, offset: 512)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !912, file: !429, line: 91, baseType: !926, size: 128, offset: 576)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !455, line: 10, size: 128, elements: !927)
!927 = !{!928, !929}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !926, file: !455, line: 12, baseType: !458, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !926, file: !455, line: 16, baseType: !460, size: 64, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !912, file: !429, line: 92, baseType: !926, size: 128, offset: 704)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !912, file: !429, line: 93, baseType: !926, size: 128, offset: 832)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !912, file: !429, line: 106, baseType: !464, size: 192, offset: 960)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 34, size: 192, elements: !935)
!935 = !{!936, !937, !938}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !934, file: !3, line: 36, baseType: !7, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !934, file: !3, line: 37, baseType: !74, size: 64, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !934, file: !3, line: 38, baseType: !7, size: 64, offset: 128)
!939 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !940, nameTableKind: None)
!940 = !{!941}
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(name: "longopts", scope: !939, file: !3, line: 41, type: !943, isLocal: true, isDefinition: true)
!943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !944, size: 1280, elements: !23)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !946)
!946 = !{!947, !948, !949, !950}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !945, file: !13, line: 52, baseType: !16, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !945, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !945, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !945, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!951 = !DILocalVariable(name: "file_name", arg: 2, scope: !908, file: !3, line: 153, type: !933)
!952 = !DILocalVariable(name: "parent_height", arg: 3, scope: !908, file: !3, line: 154, type: !74)
!953 = !DILocalVariable(name: "dirp", scope: !908, file: !3, line: 156, type: !754)
!954 = !DILocalVariable(name: "fd", scope: !908, file: !3, line: 157, type: !19)
!955 = !DILocalVariable(name: "parent_sb", scope: !908, file: !3, line: 158, type: !912)
!956 = !DILocalVariable(name: "use_lstat", scope: !908, file: !3, line: 159, type: !38)
!957 = !DILocalVariable(name: "found", scope: !908, file: !3, line: 160, type: !38)
!958 = distinct !DISubprogram(name: "file_name_prepend", scope: !3, file: !3, line: 101, type: !959, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!959 = !DISubroutineType(types: !960)
!960 = !{null, !390, !16, !74}
!961 = !DILocalVariable(name: "p", arg: 1, scope: !958, file: !3, line: 101, type: !390)
!962 = !DILocation(line: 101, column: 38, scope: !958)
!963 = !DILocalVariable(name: "s", arg: 2, scope: !958, file: !3, line: 101, type: !16)
!964 = !DILocation(line: 101, column: 53, scope: !958)
!965 = !DILocalVariable(name: "s_len", arg: 3, scope: !958, file: !3, line: 101, type: !74)
!966 = !DILocation(line: 101, column: 63, scope: !958)
!967 = !DILocalVariable(name: "n_free", scope: !958, file: !3, line: 103, type: !74)
!968 = !DILocation(line: 103, column: 10, scope: !958)
!969 = !DILocation(line: 103, column: 19, scope: !958)
!970 = !DILocation(line: 103, column: 22, scope: !958)
!971 = !DILocation(line: 103, column: 30, scope: !958)
!972 = !DILocation(line: 103, column: 33, scope: !958)
!973 = !DILocation(line: 103, column: 28, scope: !958)
!974 = !DILocation(line: 104, column: 7, scope: !975)
!975 = distinct !DILexicalBlock(scope: !958, file: !3, line: 104, column: 7)
!976 = !DILocation(line: 104, column: 20, scope: !975)
!977 = !DILocation(line: 104, column: 18, scope: !975)
!978 = !DILocation(line: 104, column: 14, scope: !975)
!979 = !DILocation(line: 104, column: 7, scope: !958)
!980 = !DILocalVariable(name: "half", scope: !981, file: !3, line: 106, type: !74)
!981 = distinct !DILexicalBlock(scope: !975, file: !3, line: 105, column: 5)
!982 = !DILocation(line: 106, column: 14, scope: !981)
!983 = !DILocation(line: 106, column: 21, scope: !981)
!984 = !DILocation(line: 106, column: 24, scope: !981)
!985 = !DILocation(line: 106, column: 32, scope: !981)
!986 = !DILocation(line: 106, column: 38, scope: !981)
!987 = !DILocation(line: 106, column: 36, scope: !981)
!988 = !DILocalVariable(name: "q", scope: !981, file: !3, line: 111, type: !7)
!989 = !DILocation(line: 111, column: 13, scope: !981)
!990 = !DILocation(line: 111, column: 30, scope: !981)
!991 = !DILocation(line: 111, column: 17, scope: !981)
!992 = !DILocalVariable(name: "n_used", scope: !981, file: !3, line: 112, type: !74)
!993 = !DILocation(line: 112, column: 14, scope: !981)
!994 = !DILocation(line: 112, column: 23, scope: !981)
!995 = !DILocation(line: 112, column: 26, scope: !981)
!996 = !DILocation(line: 112, column: 36, scope: !981)
!997 = !DILocation(line: 112, column: 34, scope: !981)
!998 = !DILocation(line: 113, column: 18, scope: !981)
!999 = !DILocation(line: 113, column: 26, scope: !981)
!1000 = !DILocation(line: 113, column: 24, scope: !981)
!1001 = !DILocation(line: 113, column: 20, scope: !981)
!1002 = !DILocation(line: 113, column: 33, scope: !981)
!1003 = !DILocation(line: 113, column: 31, scope: !981)
!1004 = !DILocation(line: 113, column: 7, scope: !981)
!1005 = !DILocation(line: 113, column: 10, scope: !981)
!1006 = !DILocation(line: 113, column: 16, scope: !981)
!1007 = !DILocation(line: 114, column: 15, scope: !981)
!1008 = !DILocation(line: 114, column: 18, scope: !981)
!1009 = !DILocation(line: 114, column: 25, scope: !981)
!1010 = !DILocation(line: 114, column: 28, scope: !981)
!1011 = !DILocation(line: 114, column: 34, scope: !981)
!1012 = !DILocation(line: 114, column: 32, scope: !981)
!1013 = !DILocation(line: 114, column: 42, scope: !981)
!1014 = !DILocation(line: 114, column: 7, scope: !981)
!1015 = !DILocation(line: 115, column: 13, scope: !981)
!1016 = !DILocation(line: 115, column: 16, scope: !981)
!1017 = !DILocation(line: 115, column: 7, scope: !981)
!1018 = !DILocation(line: 116, column: 16, scope: !981)
!1019 = !DILocation(line: 116, column: 7, scope: !981)
!1020 = !DILocation(line: 116, column: 10, scope: !981)
!1021 = !DILocation(line: 116, column: 14, scope: !981)
!1022 = !DILocation(line: 117, column: 24, scope: !981)
!1023 = !DILocation(line: 117, column: 22, scope: !981)
!1024 = !DILocation(line: 117, column: 7, scope: !981)
!1025 = !DILocation(line: 117, column: 10, scope: !981)
!1026 = !DILocation(line: 117, column: 18, scope: !981)
!1027 = !DILocation(line: 118, column: 5, scope: !981)
!1028 = !DILocation(line: 120, column: 19, scope: !958)
!1029 = !DILocation(line: 120, column: 17, scope: !958)
!1030 = !DILocation(line: 120, column: 3, scope: !958)
!1031 = !DILocation(line: 120, column: 6, scope: !958)
!1032 = !DILocation(line: 120, column: 12, scope: !958)
!1033 = !DILocation(line: 121, column: 3, scope: !958)
!1034 = !DILocation(line: 121, column: 6, scope: !958)
!1035 = !DILocation(line: 121, column: 15, scope: !958)
!1036 = !DILocation(line: 122, column: 11, scope: !958)
!1037 = !DILocation(line: 122, column: 14, scope: !958)
!1038 = !DILocation(line: 122, column: 20, scope: !958)
!1039 = !DILocation(line: 122, column: 25, scope: !958)
!1040 = !DILocation(line: 122, column: 28, scope: !958)
!1041 = !DILocation(line: 122, column: 3, scope: !958)
!1042 = !DILocation(line: 123, column: 1, scope: !958)
!1043 = !DILocalVariable(name: "p", arg: 1, scope: !1044, file: !3, line: 101, type: !1047)
!1044 = distinct !DISubprogram(name: "file_name_prepend", scope: !3, file: !3, line: 101, type: !1045, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1053, retainedNodes: !4)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{null, !1047, !16, !74}
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 34, size: 192, elements: !1049)
!1049 = !{!1050, !1051, !1052}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1048, file: !3, line: 36, baseType: !7, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !1048, file: !3, line: 37, baseType: !74, size: 64, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1048, file: !3, line: 38, baseType: !7, size: 64, offset: 128)
!1053 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !1054, nameTableKind: None)
!1054 = !{!1055}
!1055 = !DIGlobalVariableExpression(var: !1056, expr: !DIExpression())
!1056 = distinct !DIGlobalVariable(name: "longopts", scope: !1053, file: !3, line: 41, type: !1057, isLocal: true, isDefinition: true)
!1057 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1058, size: 1280, elements: !23)
!1058 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1059)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !1060)
!1060 = !{!1061, !1062, !1063, !1064}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1059, file: !13, line: 52, baseType: !16, size: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !1059, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1059, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1059, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!1065 = !DILocalVariable(name: "s", arg: 2, scope: !1044, file: !3, line: 101, type: !16)
!1066 = !DILocalVariable(name: "s_len", arg: 3, scope: !1044, file: !3, line: 101, type: !74)
!1067 = !DILocalVariable(name: "n_free", scope: !1044, file: !3, line: 103, type: !74)
!1068 = !DILocalVariable(name: "q", scope: !1069, file: !3, line: 111, type: !7)
!1069 = distinct !DILexicalBlock(scope: !1070, file: !3, line: 105, column: 5)
!1070 = distinct !DILexicalBlock(scope: !1071, file: !3, line: 104, column: 7)
!1071 = distinct !DISubprogram(name: "file_name_prepend", scope: !3, file: !3, line: 101, type: !1072, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1080, retainedNodes: !4)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{null, !1074, !16, !74}
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 34, size: 192, elements: !1076)
!1076 = !{!1077, !1078, !1079}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1075, file: !3, line: 36, baseType: !7, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !1075, file: !3, line: 37, baseType: !74, size: 64, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1075, file: !3, line: 38, baseType: !7, size: 64, offset: 128)
!1080 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !1081, nameTableKind: None)
!1081 = !{!1082}
!1082 = !DIGlobalVariableExpression(var: !1083, expr: !DIExpression())
!1083 = distinct !DIGlobalVariable(name: "longopts", scope: !1080, file: !3, line: 41, type: !1084, isLocal: true, isDefinition: true)
!1084 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1085, size: 1280, elements: !23)
!1085 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1086)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !1087)
!1087 = !{!1088, !1089, !1090, !1091}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1086, file: !13, line: 52, baseType: !16, size: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !1086, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1086, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1086, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!1092 = !DILocalVariable(name: "n_used", scope: !1069, file: !3, line: 112, type: !74)
!1093 = distinct !DISubprogram(name: "nth_parent", scope: !3, file: !3, line: 127, type: !1094, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!7, !74}
!1096 = !DILocalVariable(name: "n", arg: 1, scope: !1093, file: !3, line: 127, type: !74)
!1097 = !DILocation(line: 127, column: 20, scope: !1093)
!1098 = !DILocalVariable(name: "buf", scope: !1093, file: !3, line: 129, type: !7)
!1099 = !DILocation(line: 129, column: 9, scope: !1093)
!1100 = !DILocation(line: 129, column: 28, scope: !1093)
!1101 = !DILocation(line: 129, column: 15, scope: !1093)
!1102 = !DILocalVariable(name: "p", scope: !1093, file: !3, line: 130, type: !7)
!1103 = !DILocation(line: 130, column: 9, scope: !1093)
!1104 = !DILocation(line: 130, column: 13, scope: !1093)
!1105 = !DILocalVariable(name: "i", scope: !1106, file: !3, line: 132, type: !74)
!1106 = distinct !DILexicalBlock(scope: !1093, file: !3, line: 132, column: 3)
!1107 = !DILocation(line: 132, column: 15, scope: !1106)
!1108 = !DILocation(line: 132, column: 8, scope: !1106)
!1109 = !DILocation(line: 132, column: 22, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1106, file: !3, line: 132, column: 3)
!1111 = !DILocation(line: 132, column: 26, scope: !1110)
!1112 = !DILocation(line: 132, column: 24, scope: !1110)
!1113 = !DILocation(line: 132, column: 3, scope: !1106)
!1114 = !DILocation(line: 134, column: 15, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1110, file: !3, line: 133, column: 5)
!1116 = !DILocation(line: 134, column: 7, scope: !1115)
!1117 = !DILocation(line: 135, column: 9, scope: !1115)
!1118 = !DILocation(line: 136, column: 5, scope: !1115)
!1119 = !DILocation(line: 132, column: 30, scope: !1110)
!1120 = !DILocation(line: 132, column: 3, scope: !1110)
!1121 = distinct !{!1121, !1113, !1122}
!1122 = !DILocation(line: 136, column: 5, scope: !1106)
!1123 = !DILocation(line: 137, column: 3, scope: !1093)
!1124 = !DILocation(line: 137, column: 9, scope: !1093)
!1125 = !DILocation(line: 138, column: 10, scope: !1093)
!1126 = !DILocation(line: 138, column: 3, scope: !1093)
!1127 = !DILocalVariable(name: "n", arg: 1, scope: !1128, file: !3, line: 127, type: !74)
!1128 = distinct !DISubprogram(name: "nth_parent", scope: !3, file: !3, line: 127, type: !1094, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1129, retainedNodes: !4)
!1129 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !1130, nameTableKind: None)
!1130 = !{!1131}
!1131 = !DIGlobalVariableExpression(var: !1132, expr: !DIExpression())
!1132 = distinct !DIGlobalVariable(name: "longopts", scope: !1129, file: !3, line: 41, type: !1133, isLocal: true, isDefinition: true)
!1133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1134, size: 1280, elements: !23)
!1134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1135)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !1136)
!1136 = !{!1137, !1138, !1139, !1140}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1135, file: !13, line: 52, baseType: !16, size: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !1135, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1135, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1135, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!1141 = !DILocalVariable(name: "buf", scope: !1128, file: !3, line: 129, type: !7)
!1142 = !DILocalVariable(name: "p", scope: !1128, file: !3, line: 130, type: !7)
!1143 = !DILocalVariable(name: "i", scope: !1144, file: !3, line: 132, type: !74)
!1144 = distinct !DILexicalBlock(scope: !1128, file: !3, line: 132, column: 3)
!1145 = distinct !DISubprogram(name: "readdir_ignoring_dot_and_dotdot", scope: !212, file: !212, line: 278, type: !1146, scopeLine: 279, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!806, !754}
!1148 = !DILocalVariable(name: "dirp", arg: 1, scope: !1145, file: !212, line: 278, type: !754)
!1149 = !DILocation(line: 278, column: 39, scope: !1145)
!1150 = !DILocation(line: 280, column: 3, scope: !1145)
!1151 = !DILocalVariable(name: "dp", scope: !1152, file: !212, line: 282, type: !806)
!1152 = distinct !DILexicalBlock(scope: !1145, file: !212, line: 281, column: 5)
!1153 = !DILocation(line: 282, column: 28, scope: !1152)
!1154 = !DILocation(line: 282, column: 42, scope: !1152)
!1155 = !DILocation(line: 282, column: 33, scope: !1152)
!1156 = !DILocation(line: 283, column: 11, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1152, file: !212, line: 283, column: 11)
!1158 = !DILocation(line: 283, column: 14, scope: !1157)
!1159 = !DILocation(line: 283, column: 22, scope: !1157)
!1160 = !DILocation(line: 283, column: 42, scope: !1157)
!1161 = !DILocation(line: 283, column: 46, scope: !1157)
!1162 = !DILocation(line: 283, column: 27, scope: !1157)
!1163 = !DILocation(line: 283, column: 11, scope: !1152)
!1164 = !DILocation(line: 284, column: 16, scope: !1157)
!1165 = !DILocation(line: 284, column: 9, scope: !1157)
!1166 = distinct !{!1166, !1150, !1167}
!1167 = !DILocation(line: 285, column: 5, scope: !1145)
!1168 = !DILocalVariable(name: "dirp", arg: 1, scope: !1169, file: !212, line: 278, type: !754)
!1169 = distinct !DISubprogram(name: "readdir_ignoring_dot_and_dotdot", scope: !212, file: !212, line: 278, type: !1170, scopeLine: 279, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1181, retainedNodes: !4)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!1172, !754}
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1174)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !809, line: 22, size: 2240, elements: !1175)
!1175 = !{!1176, !1177, !1178, !1179, !1180}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !1174, file: !809, line: 25, baseType: !435, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !1174, file: !809, line: 26, baseType: !447, size: 64, offset: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !1174, file: !809, line: 31, baseType: !73, size: 16, offset: 128)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !1174, file: !809, line: 32, baseType: !148, size: 8, offset: 144)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !1174, file: !809, line: 33, baseType: !105, size: 2048, offset: 152)
!1181 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !1182, nameTableKind: None)
!1182 = !{!1183}
!1183 = !DIGlobalVariableExpression(var: !1184, expr: !DIExpression())
!1184 = distinct !DIGlobalVariable(name: "longopts", scope: !1181, file: !3, line: 41, type: !1185, isLocal: true, isDefinition: true)
!1185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1186, size: 1280, elements: !23)
!1186 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1187)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !1188)
!1188 = !{!1189, !1190, !1191, !1192}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1187, file: !13, line: 52, baseType: !16, size: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !1187, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1187, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1187, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!1193 = distinct !DISubprogram(name: "dot_or_dotdot", scope: !212, file: !212, line: 265, type: !1194, scopeLine: 266, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{!38, !16}
!1196 = !DILocalVariable(name: "file_name", arg: 1, scope: !1193, file: !212, line: 265, type: !16)
!1197 = !DILocation(line: 265, column: 28, scope: !1193)
!1198 = !DILocation(line: 267, column: 7, scope: !1199)
