; ModuleID = '<stdin>'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.file_name = type { i8*, i64, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.dev_ino, %struct.dev_ino, %struct.dev_ino, [3 x i64] }
%struct.dev_ino = type { i64, i64 }
%struct.__dirstream = type opaque
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external dso_local global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [23 x i8] c"Usage: %s [OPTION]...\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "longopts", scope: !2, file: !3, line: 41, type: !10, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !9, nameTableKind: None)
!3 = !DIFile(filename: "src/pwd.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!4 = !{}
!5 = !{!6, !7}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !{!0}
!10 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 1280, elements: !23)
!11 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !14)
!13 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "")
!14 = !{!15, !18, !20, !22}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !12, file: !13, line: 52, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !12, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !12, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !12, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!23 = !{!24}
!24 = !DISubrange(count: 5)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "Version", scope: !27, file: !28, line: 2, type: !16, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !29, nameTableKind: None)
!28 = !DIFile(filename: "src/version.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!29 = !{!25}
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !32, file: !37, line: 56, type: !38, isLocal: true, isDefinition: true)
!32 = distinct !DICompileUnit(language: DW_LANG_C99, file: !33, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !34, nameTableKind: None)
!33 = !DIFile(filename: "./lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!34 = !{!35, !30}
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "file_name", scope: !32, file: !37, line: 46, type: !16, isLocal: true, isDefinition: true)
!37 = !DIFile(filename: "lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!38 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "exit_failure", scope: !41, file: !44, line: 24, type: !45, isLocal: false, isDefinition: true)
!41 = distinct !DICompileUnit(language: DW_LANG_C99, file: !42, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !43, nameTableKind: None)
!42 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!43 = !{!39}
!44 = !DIFile(filename: "lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!45 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !19)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "program_name", scope: !48, file: !51, line: 33, type: !16, isLocal: false, isDefinition: true)
!48 = distinct !DICompileUnit(language: DW_LANG_C99, file: !49, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !50, nameTableKind: None)
!49 = !DIFile(filename: "./lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!50 = !{!46}
!51 = !DIFile(filename: "lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !54, file: !80, line: 116, type: !93, isLocal: true, isDefinition: true)
!54 = distinct !DICompileUnit(language: DW_LANG_C99, file: !55, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, retainedTypes: !72, globals: !77, nameTableKind: None)
!55 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!56 = !{!57}
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !58, line: 32, baseType: !59, size: 32, elements: !60)
!58 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!59 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!60 = !{!61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71}
!61 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!62 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!63 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!64 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!65 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!66 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!67 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!68 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!69 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!70 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!71 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!72 = !{!19, !73, !74}
!73 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !75, line: 46, baseType: !76)
!75 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.1/include/stddef.h", directory: "")
!76 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!77 = !{!78, !85, !91, !52, !103, !108, !115, !117}
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !54, file: !80, line: 85, type: !81, isLocal: false, isDefinition: true)
!80 = !DIFile(filename: "lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 704, elements: !83)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!83 = !{!84}
!84 = !DISubrange(count: 11)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !54, file: !80, line: 101, type: !87, isLocal: false, isDefinition: true)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 320, elements: !89)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!89 = !{!90}
!90 = !DISubrange(count: 10)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !54, file: !80, line: 1052, type: !93, isLocal: false, isDefinition: true)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !80, line: 65, size: 448, elements: !94)
!94 = !{!95, !96, !97, !101, !102}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !93, file: !80, line: 68, baseType: !57, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !93, file: !80, line: 71, baseType: !19, size: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !93, file: !80, line: 75, baseType: !98, size: 256, offset: 64)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 256, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 8)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !93, file: !80, line: 78, baseType: !16, size: 64, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !93, file: !80, line: 81, baseType: !16, size: 64, offset: 384)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "slot0", scope: !54, file: !80, line: 842, type: !105, isLocal: true, isDefinition: true)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 256)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "slotvec", scope: !54, file: !80, line: 845, type: !110, isLocal: true, isDefinition: true)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !80, line: 834, size: 128, elements: !112)
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !111, file: !80, line: 836, baseType: !74, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !111, file: !80, line: 837, baseType: !7, size: 64, offset: 64)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "nslots", scope: !54, file: !80, line: 843, type: !19, isLocal: true, isDefinition: true)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "slotvec0", scope: !54, file: !80, line: 844, type: !111, isLocal: true, isDefinition: true)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !121, file: !124, line: 26, type: !125, isLocal: false, isDefinition: true)
!121 = distinct !DICompileUnit(language: DW_LANG_C99, file: !122, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !123, nameTableKind: None)
!122 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!123 = !{!119}
!124 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 376, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 47)
!128 = distinct !DICompileUnit(language: DW_LANG_C99, file: !129, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!129 = !DIFile(filename: "./lib/root-dev-ino.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!130 = distinct !DICompileUnit(language: DW_LANG_C99, file: !131, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!131 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!132 = !{!6}
!133 = distinct !DICompileUnit(language: DW_LANG_C99, file: !134, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !135, nameTableKind: None)
!134 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!135 = !{!74, !7, !6}
!136 = distinct !DICompileUnit(language: DW_LANG_C99, file: !137, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!137 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!138 = distinct !DICompileUnit(language: DW_LANG_C99, file: !139, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!139 = !DIFile(filename: "./lib/xgetcwd.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!140 = distinct !DICompileUnit(language: DW_LANG_C99, file: !141, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !142, nameTableKind: None)
!141 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!142 = !{!74}
!143 = distinct !DICompileUnit(language: DW_LANG_C99, file: !144, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !145, nameTableKind: None)
!144 = !DIFile(filename: "./lib/c-strcasecmp.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!145 = !{!146}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!149 = distinct !DICompileUnit(language: DW_LANG_C99, file: !150, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!150 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!151 = distinct !DICompileUnit(language: DW_LANG_C99, file: !152, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!152 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!153 = distinct !DICompileUnit(language: DW_LANG_C99, file: !154, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!154 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!155 = distinct !DICompileUnit(language: DW_LANG_C99, file: !156, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!156 = !DIFile(filename: "./lib/setlocale_null.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!157 = distinct !DICompileUnit(language: DW_LANG_C99, file: !158, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!158 = !DIFile(filename: "./lib/fclose.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!159 = distinct !DICompileUnit(language: DW_LANG_C99, file: !160, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!160 = !DIFile(filename: "./lib/fflush.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!161 = distinct !DICompileUnit(language: DW_LANG_C99, file: !162, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !132, nameTableKind: None)
!162 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!163 = distinct !DICompileUnit(language: DW_LANG_C99, file: !164, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!164 = !DIFile(filename: "./lib/c-ctype.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!165 = !{!"clang version 9.0.1-12 "}
!166 = !{i32 2, !"Dwarf Version", i32 4}
!167 = !{i32 2, !"Debug Info Version", i32 3}
!168 = !{i32 1, !"wchar_size", i32 4}
!169 = !{i32 1, !"ThinLTO", i32 0}
!170 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!171 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 51, type: !172, scopeLine: 52, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !19}
!174 = !DILocalVariable(name: "status", arg: 1, scope: !171, file: !3, line: 51, type: !19)
!175 = !DILocation(line: 51, column: 12, scope: !171)
!176 = !DILocation(line: 53, column: 7, scope: !177)
!177 = distinct !DILexicalBlock(scope: !171, file: !3, line: 53, column: 7)
!178 = !DILocation(line: 53, column: 14, scope: !177)
!179 = !DILocation(line: 53, column: 7, scope: !171)
!180 = !DILocation(line: 54, column: 5, scope: !177)
!181 = !DILocation(line: 54, column: 5, scope: !182)
!182 = distinct !DILexicalBlock(scope: !177, file: !3, line: 54, column: 5)
!183 = !DILocation(line: 57, column: 15, scope: !184)
!184 = distinct !DILexicalBlock(scope: !177, file: !3, line: 56, column: 5)
!185 = !DILocation(line: 57, column: 45, scope: !184)
!186 = !DILocation(line: 57, column: 7, scope: !184)
!187 = !DILocation(line: 58, column: 7, scope: !184)
!188 = !DILocation(line: 62, column: 7, scope: !184)
!189 = !DILocation(line: 66, column: 7, scope: !184)
!190 = !DILocation(line: 67, column: 7, scope: !184)
!191 = !DILocation(line: 68, column: 7, scope: !184)
!192 = !DILocation(line: 71, column: 15, scope: !184)
!193 = !DILocation(line: 71, column: 7, scope: !184)
!194 = !DILocation(line: 72, column: 7, scope: !184)
!195 = !DILocation(line: 74, column: 9, scope: !171)
!196 = !DILocation(line: 74, column: 3, scope: !171)
!197 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !198, file: !198, line: 634, type: !199, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!198 = !DIFile(filename: "src/system.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!199 = !DISubroutineType(types: !200)
!200 = !{null, !16}
!201 = !DILocalVariable(name: "program", arg: 1, scope: !197, file: !198, line: 634, type: !16)
!202 = !DILocation(line: 634, column: 34, scope: !197)
!203 = !DILocalVariable(name: "infomap", scope: !197, file: !198, line: 636, type: !204)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 896, elements: !210)
!205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !197, file: !198, line: 636, size: 128, elements: !207)
!207 = !{!208, !209}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !206, file: !198, line: 636, baseType: !16, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !206, file: !198, line: 636, baseType: !16, size: 64, offset: 64)
!210 = !{!211}
!211 = !DISubrange(count: 7)
!212 = !DILocation(line: 636, column: 67, scope: !197)
!213 = !DILocalVariable(name: "node", scope: !197, file: !198, line: 646, type: !16)
!214 = !DILocation(line: 646, column: 15, scope: !197)
!215 = !DILocation(line: 646, column: 22, scope: !197)
!216 = !DILocalVariable(name: "map_prog", scope: !197, file: !198, line: 647, type: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!218 = !DILocation(line: 647, column: 25, scope: !197)
!219 = !DILocation(line: 647, column: 36, scope: !197)
!220 = !DILocation(line: 649, column: 3, scope: !197)
!221 = !DILocation(line: 649, column: 10, scope: !197)
!222 = !DILocation(line: 649, column: 20, scope: !197)
!223 = !DILocation(line: 649, column: 28, scope: !197)
!224 = !DILocation(line: 649, column: 33, scope: !197)
!225 = !DILocation(line: 649, column: 31, scope: !197)
!226 = !DILocation(line: 0, scope: !197)
!227 = !DILocation(line: 650, column: 13, scope: !197)
!228 = distinct !{!228, !220, !227}
!229 = !DILocation(line: 652, column: 7, scope: !230)
!230 = distinct !DILexicalBlock(scope: !197, file: !198, line: 652, column: 7)
!231 = !DILocation(line: 652, column: 17, scope: !230)
!232 = !DILocation(line: 652, column: 7, scope: !197)
!233 = !DILocation(line: 653, column: 12, scope: !230)
!234 = !DILocation(line: 653, column: 22, scope: !230)
!235 = !DILocation(line: 653, column: 10, scope: !230)
!236 = !DILocation(line: 653, column: 5, scope: !230)
!237 = !DILocation(line: 655, column: 11, scope: !197)
!238 = !DILocation(line: 655, column: 3, scope: !197)
!239 = !DILocalVariable(name: "lc_messages", scope: !197, file: !198, line: 659, type: !16)
!240 = !DILocation(line: 659, column: 15, scope: !197)
!241 = !DILocation(line: 659, column: 29, scope: !197)
!242 = !DILocation(line: 660, column: 7, scope: !243)
!243 = distinct !DILexicalBlock(scope: !197, file: !198, line: 660, column: 7)
!244 = !DILocation(line: 660, column: 19, scope: !243)
!245 = !DILocation(line: 660, column: 22, scope: !243)
!246 = !DILocation(line: 660, column: 7, scope: !197)
!247 = !DILocation(line: 666, column: 7, scope: !248)
!248 = distinct !DILexicalBlock(scope: !243, file: !198, line: 661, column: 5)
!249 = !DILocation(line: 668, column: 5, scope: !248)
!250 = !DILocation(line: 669, column: 11, scope: !197)
!251 = !DILocation(line: 670, column: 24, scope: !197)
!252 = !DILocation(line: 669, column: 3, scope: !197)
!253 = !DILocation(line: 671, column: 11, scope: !197)
!254 = !DILocation(line: 672, column: 11, scope: !197)
!255 = !DILocation(line: 672, column: 17, scope: !197)
!256 = !DILocation(line: 672, column: 25, scope: !197)
!257 = !DILocation(line: 672, column: 22, scope: !197)
!258 = !DILocation(line: 671, column: 3, scope: !197)
!259 = !DILocation(line: 673, column: 1, scope: !197)
!260 = !DILocalVariable(name: "program", arg: 1, scope: !261, file: !198, line: 634, type: !16)
!261 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !198, file: !198, line: 634, type: !199, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !262, retainedNodes: !4)
!262 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !263, nameTableKind: None)
!263 = !{!264}
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "longopts", scope: !262, file: !3, line: 41, type: !266, isLocal: true, isDefinition: true)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 1280, elements: !23)
!267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !269)
!269 = !{!270, !271, !272, !273}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !268, file: !13, line: 52, baseType: !16, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !268, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !268, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !268, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!274 = !DILocalVariable(name: "infomap", scope: !261, file: !198, line: 636, type: !275)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 896, elements: !210)
!276 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !261, file: !198, line: 636, size: 128, elements: !278)
!278 = !{!279, !280}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !277, file: !198, line: 636, baseType: !16, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !277, file: !198, line: 636, baseType: !16, size: 64, offset: 64)
!281 = !DILocalVariable(name: "node", scope: !261, file: !198, line: 646, type: !16)
!282 = !DILocalVariable(name: "map_prog", scope: !261, file: !198, line: 647, type: !283)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!284 = !DILocalVariable(name: "lc_messages", scope: !285, file: !198, line: 659, type: !16)
!285 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !198, file: !198, line: 634, type: !199, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !286, retainedNodes: !4)
!286 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !287, nameTableKind: None)
!287 = !{!288}
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "longopts", scope: !286, file: !3, line: 41, type: !290, isLocal: true, isDefinition: true)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 1280, elements: !23)
!291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !293)
!293 = !{!294, !295, !296, !297}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !292, file: !13, line: 52, baseType: !16, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !292, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !292, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !292, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!298 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 327, type: !299, scopeLine: 328, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!299 = !DISubroutineType(types: !300)
!300 = !{!19, !19, !301}
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!302 = !DILocalVariable(name: "argc", arg: 1, scope: !298, file: !3, line: 327, type: !19)
!303 = !DILocation(line: 327, column: 11, scope: !298)
!304 = !DILocalVariable(name: "argv", arg: 2, scope: !298, file: !3, line: 327, type: !301)
!305 = !DILocation(line: 327, column: 24, scope: !298)
!306 = !DILocalVariable(name: "wd", scope: !298, file: !3, line: 329, type: !7)
!307 = !DILocation(line: 329, column: 9, scope: !298)
!308 = !DILocalVariable(name: "logical", scope: !298, file: !3, line: 333, type: !38)
!309 = !DILocation(line: 333, column: 8, scope: !298)
!310 = !DILocation(line: 333, column: 19, scope: !298)
!311 = !DILocation(line: 333, column: 46, scope: !298)
!312 = !DILocation(line: 336, column: 21, scope: !298)
!313 = !DILocation(line: 336, column: 3, scope: !298)
!314 = !DILocation(line: 337, column: 3, scope: !298)
!315 = !DILocation(line: 338, column: 3, scope: !298)
!316 = !DILocation(line: 339, column: 3, scope: !298)
!317 = !DILocation(line: 341, column: 3, scope: !298)
!318 = !DILocation(line: 343, column: 3, scope: !298)
!319 = !DILocalVariable(name: "c", scope: !320, file: !3, line: 345, type: !19)
!320 = distinct !DILexicalBlock(scope: !298, file: !3, line: 344, column: 5)
!321 = !DILocation(line: 345, column: 11, scope: !320)
!322 = !DILocation(line: 345, column: 28, scope: !320)
!323 = !DILocation(line: 345, column: 34, scope: !320)
!324 = !DILocation(line: 345, column: 15, scope: !320)
!325 = !DILocation(line: 346, column: 11, scope: !326)
!326 = distinct !DILexicalBlock(scope: !320, file: !3, line: 346, column: 11)
!327 = !DILocation(line: 346, column: 13, scope: !326)
!328 = !DILocation(line: 347, column: 9, scope: !326)
!329 = !DILocation(line: 348, column: 15, scope: !320)
!330 = !DILocation(line: 348, column: 7, scope: !320)
!331 = !DILocation(line: 351, column: 19, scope: !332)
!332 = distinct !DILexicalBlock(scope: !320, file: !3, line: 349, column: 9)
!333 = !DILocation(line: 352, column: 11, scope: !332)
!334 = !DILocation(line: 354, column: 19, scope: !332)
!335 = !DILocation(line: 355, column: 11, scope: !332)
!336 = !DILocation(line: 357, column: 9, scope: !332)
!337 = !DILocation(line: 359, column: 9, scope: !332)
!338 = !DILocation(line: 362, column: 11, scope: !332)
!339 = distinct !{!339, !318, !340}
!340 = !DILocation(line: 364, column: 5, scope: !298)
!341 = !DILocation(line: 366, column: 7, scope: !342)
!342 = distinct !DILexicalBlock(scope: !298, file: !3, line: 366, column: 7)
!343 = !DILocation(line: 366, column: 16, scope: !342)
!344 = !DILocation(line: 366, column: 14, scope: !342)
!345 = !DILocation(line: 366, column: 7, scope: !298)
!346 = !DILocation(line: 367, column: 18, scope: !342)
!347 = !DILocation(line: 367, column: 5, scope: !342)
!348 = !DILocation(line: 369, column: 7, scope: !349)
!349 = distinct !DILexicalBlock(scope: !298, file: !3, line: 369, column: 7)
!350 = !DILocation(line: 369, column: 7, scope: !298)
!351 = !DILocation(line: 371, column: 12, scope: !352)
!352 = distinct !DILexicalBlock(scope: !349, file: !3, line: 370, column: 5)
!353 = !DILocation(line: 371, column: 10, scope: !352)
!354 = !DILocation(line: 372, column: 11, scope: !355)
!355 = distinct !DILexicalBlock(scope: !352, file: !3, line: 372, column: 11)
!356 = !DILocation(line: 372, column: 11, scope: !352)
!357 = !DILocation(line: 374, column: 17, scope: !358)
!358 = distinct !DILexicalBlock(scope: !355, file: !3, line: 373, column: 9)
!359 = !DILocation(line: 374, column: 11, scope: !358)
!360 = !DILocation(line: 375, column: 11, scope: !358)
!361 = !DILocation(line: 377, column: 5, scope: !352)
!362 = !DILocation(line: 379, column: 8, scope: !298)
!363 = !DILocation(line: 379, column: 6, scope: !298)
!364 = !DILocation(line: 380, column: 7, scope: !365)
!365 = distinct !DILexicalBlock(scope: !298, file: !3, line: 380, column: 7)
!366 = !DILocation(line: 380, column: 10, scope: !365)
!367 = !DILocation(line: 380, column: 7, scope: !298)
!368 = !DILocation(line: 382, column: 13, scope: !369)
!369 = distinct !DILexicalBlock(scope: !365, file: !3, line: 381, column: 5)
!370 = !DILocation(line: 382, column: 7, scope: !369)
!371 = !DILocation(line: 383, column: 13, scope: !369)
!372 = !DILocation(line: 383, column: 7, scope: !369)
!373 = !DILocation(line: 384, column: 5, scope: !369)
!374 = !DILocalVariable(name: "file_name", scope: !375, file: !3, line: 387, type: !376)
!375 = distinct !DILexicalBlock(scope: !365, file: !3, line: 386, column: 5)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 34, size: 192, elements: !378)
!378 = !{!379, !380, !381}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !377, file: !3, line: 36, baseType: !7, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !377, file: !3, line: 37, baseType: !74, size: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !377, file: !3, line: 38, baseType: !7, size: 64, offset: 128)
!382 = !DILocation(line: 387, column: 25, scope: !375)
!383 = !DILocation(line: 387, column: 37, scope: !375)
!384 = !DILocation(line: 388, column: 22, scope: !375)
!385 = !DILocation(line: 388, column: 7, scope: !375)
!386 = !DILocation(line: 389, column: 13, scope: !375)
!387 = !DILocation(line: 389, column: 24, scope: !375)
!388 = !DILocation(line: 389, column: 7, scope: !375)
!389 = !DILocation(line: 390, column: 23, scope: !375)
!390 = !DILocation(line: 390, column: 7, scope: !375)
!391 = !DILocation(line: 393, column: 3, scope: !298)
!392 = !DILocation(line: 394, column: 1, scope: !298)
!393 = !DILocalVariable(name: "argc", arg: 1, scope: !394, file: !3, line: 327, type: !19)
!394 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 327, type: !299, scopeLine: 328, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !395, retainedNodes: !4)
!395 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !396, nameTableKind: None)
!396 = !{!397}
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "longopts", scope: !395, file: !3, line: 41, type: !399, isLocal: true, isDefinition: true)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 1280, elements: !23)
!400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !402)
!402 = !{!403, !404, !405, !406}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !401, file: !13, line: 52, baseType: !16, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !401, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !401, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !401, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!407 = !DILocalVariable(name: "argv", arg: 2, scope: !394, file: !3, line: 327, type: !301)
!408 = !DILocalVariable(name: "wd", scope: !394, file: !3, line: 329, type: !7)
!409 = !DILocalVariable(name: "logical", scope: !394, file: !3, line: 333, type: !38)
!410 = distinct !DISubprogram(name: "logical_getcwd", scope: !3, file: !3, line: 300, type: !411, scopeLine: 301, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!411 = !DISubroutineType(types: !412)
!412 = !{!7}
!413 = !DILocalVariable(name: "st1", scope: !410, file: !3, line: 302, type: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !415, line: 46, size: 1152, elements: !416)
!415 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!416 = !{!417, !420, !422, !424, !426, !428, !430, !431, !432, !435, !437, !439, !447, !448, !449}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !414, file: !415, line: 48, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !419, line: 145, baseType: !76)
!419 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!420 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !414, file: !415, line: 53, baseType: !421, size: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !419, line: 148, baseType: !76)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !414, file: !415, line: 61, baseType: !423, size: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !419, line: 151, baseType: !76)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !414, file: !415, line: 62, baseType: !425, size: 32, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !419, line: 150, baseType: !59)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !414, file: !415, line: 64, baseType: !427, size: 32, offset: 224)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !419, line: 146, baseType: !59)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !414, file: !415, line: 65, baseType: !429, size: 32, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !419, line: 147, baseType: !59)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !414, file: !415, line: 67, baseType: !19, size: 32, offset: 288)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !414, file: !415, line: 69, baseType: !418, size: 64, offset: 320)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !414, file: !415, line: 74, baseType: !433, size: 64, offset: 384)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !419, line: 152, baseType: !434)
!434 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !414, file: !415, line: 78, baseType: !436, size: 64, offset: 448)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !419, line: 174, baseType: !434)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !414, file: !415, line: 80, baseType: !438, size: 64, offset: 512)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !419, line: 179, baseType: !434)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !414, file: !415, line: 91, baseType: !440, size: 128, offset: 576)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !441, line: 10, size: 128, elements: !442)
!441 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!442 = !{!443, !445}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !440, file: !441, line: 12, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !419, line: 160, baseType: !434)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !440, file: !441, line: 16, baseType: !446, size: 64, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !419, line: 196, baseType: !434)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !414, file: !415, line: 92, baseType: !440, size: 128, offset: 704)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !414, file: !415, line: 93, baseType: !440, size: 128, offset: 832)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !414, file: !415, line: 106, baseType: !450, size: 192, offset: 960)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 192, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 3)
!453 = !DILocation(line: 302, column: 15, scope: !410)
!454 = !DILocalVariable(name: "st2", scope: !410, file: !3, line: 303, type: !414)
!455 = !DILocation(line: 303, column: 15, scope: !410)
!456 = !DILocalVariable(name: "wd", scope: !410, file: !3, line: 304, type: !7)
!457 = !DILocation(line: 304, column: 9, scope: !410)
!458 = !DILocation(line: 304, column: 14, scope: !410)
!459 = !DILocalVariable(name: "p", scope: !410, file: !3, line: 305, type: !7)
!460 = !DILocation(line: 305, column: 9, scope: !410)
!461 = !DILocation(line: 308, column: 8, scope: !462)
!462 = distinct !DILexicalBlock(scope: !410, file: !3, line: 308, column: 7)
!463 = !DILocation(line: 308, column: 11, scope: !462)
!464 = !DILocation(line: 308, column: 14, scope: !462)
!465 = !DILocation(line: 308, column: 20, scope: !462)
!466 = !DILocation(line: 308, column: 7, scope: !410)
!467 = !DILocation(line: 309, column: 5, scope: !462)
!468 = !DILocation(line: 310, column: 7, scope: !410)
!469 = !DILocation(line: 310, column: 5, scope: !410)
!470 = !DILocation(line: 311, column: 3, scope: !410)
!471 = !DILocation(line: 311, column: 23, scope: !410)
!472 = !DILocation(line: 311, column: 15, scope: !410)
!473 = !DILocation(line: 311, column: 13, scope: !410)
!474 = !DILocation(line: 313, column: 12, scope: !475)
!475 = distinct !DILexicalBlock(scope: !476, file: !3, line: 313, column: 11)
!476 = distinct !DILexicalBlock(scope: !410, file: !3, line: 312, column: 5)
!477 = !DILocation(line: 313, column: 17, scope: !475)
!478 = !DILocation(line: 313, column: 20, scope: !475)
!479 = !DILocation(line: 313, column: 25, scope: !475)
!480 = !DILocation(line: 314, column: 11, scope: !475)
!481 = !DILocation(line: 314, column: 15, scope: !475)
!482 = !DILocation(line: 314, column: 20, scope: !475)
!483 = !DILocation(line: 314, column: 27, scope: !475)
!484 = !DILocation(line: 314, column: 32, scope: !475)
!485 = !DILocation(line: 314, column: 37, scope: !475)
!486 = !DILocation(line: 314, column: 40, scope: !475)
!487 = !DILocation(line: 314, column: 45, scope: !475)
!488 = !DILocation(line: 313, column: 11, scope: !476)
!489 = !DILocation(line: 315, column: 9, scope: !475)
!490 = !DILocation(line: 316, column: 8, scope: !476)
!491 = distinct !{!491, !470, !492}
!492 = !DILocation(line: 317, column: 5, scope: !410)
!493 = !DILocation(line: 320, column: 13, scope: !494)
!494 = distinct !DILexicalBlock(scope: !410, file: !3, line: 320, column: 7)
!495 = !DILocation(line: 320, column: 7, scope: !494)
!496 = !DILocation(line: 320, column: 23, scope: !494)
!497 = !DILocation(line: 320, column: 31, scope: !494)
!498 = !DILocation(line: 320, column: 48, scope: !494)
!499 = !DILocation(line: 320, column: 56, scope: !494)
!500 = !DILocation(line: 320, column: 7, scope: !410)
!501 = !DILocation(line: 321, column: 12, scope: !494)
!502 = !DILocation(line: 321, column: 5, scope: !494)
!503 = !DILocation(line: 322, column: 3, scope: !410)
!504 = !DILocation(line: 323, column: 1, scope: !410)
!505 = distinct !DISubprogram(name: "file_name_init", scope: !3, file: !3, line: 85, type: !506, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!506 = !DISubroutineType(types: !507)
!507 = !{!376}
!508 = !DILocalVariable(name: "p", scope: !505, file: !3, line: 87, type: !376)
!509 = !DILocation(line: 87, column: 21, scope: !505)
!510 = !DILocation(line: 87, column: 25, scope: !505)
!511 = !DILocation(line: 91, column: 3, scope: !505)
!512 = !DILocation(line: 91, column: 6, scope: !505)
!513 = !DILocation(line: 91, column: 14, scope: !505)
!514 = !DILocation(line: 93, column: 21, scope: !505)
!515 = !DILocation(line: 93, column: 24, scope: !505)
!516 = !DILocation(line: 93, column: 12, scope: !505)
!517 = !DILocation(line: 93, column: 3, scope: !505)
!518 = !DILocation(line: 93, column: 6, scope: !505)
!519 = !DILocation(line: 93, column: 10, scope: !505)
!520 = !DILocation(line: 94, column: 14, scope: !505)
!521 = !DILocation(line: 94, column: 17, scope: !505)
!522 = !DILocation(line: 94, column: 24, scope: !505)
!523 = !DILocation(line: 94, column: 27, scope: !505)
!524 = !DILocation(line: 94, column: 35, scope: !505)
!525 = !DILocation(line: 94, column: 21, scope: !505)
!526 = !DILocation(line: 94, column: 3, scope: !505)
!527 = !DILocation(line: 94, column: 6, scope: !505)
!528 = !DILocation(line: 94, column: 12, scope: !505)
!529 = !DILocation(line: 95, column: 3, scope: !505)
!530 = !DILocation(line: 95, column: 6, scope: !505)
!531 = !DILocation(line: 95, column: 15, scope: !505)
!532 = !DILocation(line: 96, column: 10, scope: !505)
!533 = !DILocation(line: 96, column: 3, scope: !505)
!534 = !DILocalVariable(name: "p", scope: !535, file: !3, line: 87, type: !538)
!535 = distinct !DISubprogram(name: "file_name_init", scope: !3, file: !3, line: 85, type: !536, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !544, retainedNodes: !4)
!536 = !DISubroutineType(types: !537)
!537 = !{!538}
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 34, size: 192, elements: !540)
!540 = !{!541, !542, !543}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !539, file: !3, line: 36, baseType: !7, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !539, file: !3, line: 37, baseType: !74, size: 64, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !539, file: !3, line: 38, baseType: !7, size: 64, offset: 128)
!544 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !545, nameTableKind: None)
!545 = !{!546}
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "longopts", scope: !544, file: !3, line: 41, type: !548, isLocal: true, isDefinition: true)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !549, size: 1280, elements: !23)
!549 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !551)
!551 = !{!552, !553, !554, !555}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !550, file: !13, line: 52, baseType: !16, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !550, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !550, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !550, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!556 = distinct !DISubprogram(name: "robust_getcwd", scope: !3, file: !3, line: 268, type: !557, scopeLine: 269, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!557 = !DISubroutineType(types: !558)
!558 = !{null, !376}
!559 = !DILocalVariable(name: "file_name", arg: 1, scope: !556, file: !3, line: 268, type: !376)
!560 = !DILocation(line: 268, column: 34, scope: !556)
!561 = !DILocalVariable(name: "height", scope: !556, file: !3, line: 270, type: !74)
!562 = !DILocation(line: 270, column: 10, scope: !556)
!563 = !DILocalVariable(name: "dev_ino_buf", scope: !556, file: !3, line: 271, type: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !565, line: 7, size: 128, elements: !566)
!565 = !DIFile(filename: "./lib/dev-ino.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!566 = !{!567, !570}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !564, file: !565, line: 9, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !569, line: 47, baseType: !421)
!569 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!570 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !564, file: !565, line: 10, baseType: !571, size: 64, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !569, line: 59, baseType: !418)
!572 = !DILocation(line: 271, column: 18, scope: !556)
!573 = !DILocalVariable(name: "root_dev_ino", scope: !556, file: !3, line: 272, type: !574)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!575 = !DILocation(line: 272, column: 19, scope: !556)
!576 = !DILocation(line: 272, column: 34, scope: !556)
!577 = !DILocalVariable(name: "dot_sb", scope: !556, file: !3, line: 273, type: !414)
!578 = !DILocation(line: 273, column: 15, scope: !556)
!579 = !DILocation(line: 275, column: 7, scope: !580)
!580 = distinct !DILexicalBlock(scope: !556, file: !3, line: 275, column: 7)
!581 = !DILocation(line: 275, column: 20, scope: !580)
!582 = !DILocation(line: 275, column: 7, scope: !556)
!583 = !DILocation(line: 276, column: 5, scope: !580)
!584 = !DILocation(line: 279, column: 7, scope: !585)
!585 = distinct !DILexicalBlock(scope: !556, file: !3, line: 279, column: 7)
!586 = !DILocation(line: 279, column: 27, scope: !585)
!587 = !DILocation(line: 279, column: 7, scope: !556)
!588 = !DILocation(line: 280, column: 5, scope: !585)
!589 = !DILocation(line: 282, column: 3, scope: !556)
!590 = !DILocation(line: 285, column: 11, scope: !591)
!591 = distinct !DILexicalBlock(scope: !592, file: !3, line: 285, column: 11)
!592 = distinct !DILexicalBlock(scope: !556, file: !3, line: 283, column: 5)
!593 = !DILocation(line: 285, column: 11, scope: !592)
!594 = !DILocation(line: 286, column: 9, scope: !591)
!595 = !DILocation(line: 288, column: 32, scope: !592)
!596 = !DILocation(line: 288, column: 49, scope: !592)
!597 = !DILocation(line: 288, column: 7, scope: !592)
!598 = distinct !{!598, !589, !599}
!599 = !DILocation(line: 289, column: 5, scope: !556)
!600 = !DILocation(line: 292, column: 7, scope: !601)
!601 = distinct !DILexicalBlock(scope: !556, file: !3, line: 292, column: 7)
!602 = !DILocation(line: 292, column: 18, scope: !601)
!603 = !DILocation(line: 292, column: 27, scope: !601)
!604 = !DILocation(line: 292, column: 7, scope: !556)
!605 = !DILocation(line: 293, column: 24, scope: !601)
!606 = !DILocation(line: 293, column: 5, scope: !601)
!607 = !DILocation(line: 294, column: 1, scope: !556)
!608 = !DILocalVariable(name: "file_name", arg: 1, scope: !609, file: !3, line: 268, type: !612)
!609 = distinct !DISubprogram(name: "robust_getcwd", scope: !3, file: !3, line: 268, type: !610, scopeLine: 269, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !618, retainedNodes: !4)
!610 = !DISubroutineType(types: !611)
!611 = !{null, !612}
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 34, size: 192, elements: !614)
!614 = !{!615, !616, !617}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !613, file: !3, line: 36, baseType: !7, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !613, file: !3, line: 37, baseType: !74, size: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !613, file: !3, line: 38, baseType: !7, size: 64, offset: 128)
!618 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !619, nameTableKind: None)
!619 = !{!620}
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "longopts", scope: !618, file: !3, line: 41, type: !622, isLocal: true, isDefinition: true)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !623, size: 1280, elements: !23)
!623 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !625)
!625 = !{!626, !627, !628, !629}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !624, file: !13, line: 52, baseType: !16, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !624, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !624, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !624, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!630 = !DILocalVariable(name: "height", scope: !609, file: !3, line: 270, type: !74)
!631 = !DILocalVariable(name: "dev_ino_buf", scope: !609, file: !3, line: 271, type: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dev_ino", file: !565, line: 7, size: 128, elements: !633)
!633 = !{!634, !635}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !632, file: !565, line: 9, baseType: !568, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !632, file: !565, line: 10, baseType: !571, size: 64, offset: 64)
!636 = !DILocalVariable(name: "root_dev_ino", scope: !609, file: !3, line: 272, type: !637)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!638 = !DILocalVariable(name: "dot_sb", scope: !609, file: !3, line: 273, type: !639)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !415, line: 46, size: 1152, elements: !640)
!640 = !{!641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !657, !658, !659}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !639, file: !415, line: 48, baseType: !418, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !639, file: !415, line: 53, baseType: !421, size: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !639, file: !415, line: 61, baseType: !423, size: 64, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !639, file: !415, line: 62, baseType: !425, size: 32, offset: 192)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !639, file: !415, line: 64, baseType: !427, size: 32, offset: 224)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !639, file: !415, line: 65, baseType: !429, size: 32, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !639, file: !415, line: 67, baseType: !19, size: 32, offset: 288)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !639, file: !415, line: 69, baseType: !418, size: 64, offset: 320)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !639, file: !415, line: 74, baseType: !433, size: 64, offset: 384)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !639, file: !415, line: 78, baseType: !436, size: 64, offset: 448)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !639, file: !415, line: 80, baseType: !438, size: 64, offset: 512)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !639, file: !415, line: 91, baseType: !653, size: 128, offset: 576)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !441, line: 10, size: 128, elements: !654)
!654 = !{!655, !656}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !653, file: !441, line: 12, baseType: !444, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !653, file: !441, line: 16, baseType: !446, size: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !639, file: !415, line: 92, baseType: !653, size: 128, offset: 704)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !639, file: !415, line: 93, baseType: !653, size: 128, offset: 832)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !639, file: !415, line: 106, baseType: !450, size: 192, offset: 960)
!660 = distinct !DISubprogram(name: "file_name_free", scope: !3, file: !3, line: 78, type: !557, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!661 = !DILocalVariable(name: "p", arg: 1, scope: !660, file: !3, line: 78, type: !376)
!662 = !DILocation(line: 78, column: 35, scope: !660)
!663 = !DILocation(line: 80, column: 9, scope: !660)
!664 = !DILocation(line: 80, column: 12, scope: !660)
!665 = !DILocation(line: 80, column: 3, scope: !660)
!666 = !DILocation(line: 81, column: 9, scope: !660)
!667 = !DILocation(line: 81, column: 3, scope: !660)
!668 = !DILocation(line: 82, column: 1, scope: !660)
!669 = distinct !DISubprogram(name: "find_dir_entry", scope: !3, file: !3, line: 153, type: !670, scopeLine: 155, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!670 = !DISubroutineType(types: !671)
!671 = !{null, !672, !376, !74}
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!673 = !DILocalVariable(name: "dot_sb", arg: 1, scope: !669, file: !3, line: 153, type: !672)
!674 = !DILocation(line: 153, column: 30, scope: !669)
!675 = !DILocalVariable(name: "file_name", arg: 2, scope: !669, file: !3, line: 153, type: !376)
!676 = !DILocation(line: 153, column: 56, scope: !669)
!677 = !DILocalVariable(name: "parent_height", arg: 3, scope: !669, file: !3, line: 154, type: !74)
!678 = !DILocation(line: 154, column: 24, scope: !669)
!679 = !DILocalVariable(name: "dirp", scope: !669, file: !3, line: 156, type: !680)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !682, line: 127, baseType: !683)
!682 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!683 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !682, line: 127, flags: DIFlagFwdDecl)
!684 = !DILocation(line: 156, column: 8, scope: !669)
!685 = !DILocalVariable(name: "fd", scope: !669, file: !3, line: 157, type: !19)
!686 = !DILocation(line: 157, column: 7, scope: !669)
!687 = !DILocalVariable(name: "parent_sb", scope: !669, file: !3, line: 158, type: !414)
!688 = !DILocation(line: 158, column: 15, scope: !669)
!689 = !DILocalVariable(name: "use_lstat", scope: !669, file: !3, line: 159, type: !38)
!690 = !DILocation(line: 159, column: 8, scope: !669)
!691 = !DILocalVariable(name: "found", scope: !669, file: !3, line: 160, type: !38)
!692 = !DILocation(line: 160, column: 8, scope: !669)
!693 = !DILocation(line: 162, column: 10, scope: !669)
!694 = !DILocation(line: 162, column: 8, scope: !669)
!695 = !DILocation(line: 163, column: 7, scope: !696)
!696 = distinct !DILexicalBlock(scope: !669, file: !3, line: 163, column: 7)
!697 = !DILocation(line: 163, column: 12, scope: !696)
!698 = !DILocation(line: 163, column: 7, scope: !669)
!699 = !DILocation(line: 164, column: 5, scope: !696)
!700 = !DILocation(line: 167, column: 15, scope: !669)
!701 = !DILocation(line: 167, column: 8, scope: !669)
!702 = !DILocation(line: 167, column: 6, scope: !669)
!703 = !DILocation(line: 168, column: 13, scope: !704)
!704 = distinct !DILexicalBlock(scope: !669, file: !3, line: 168, column: 7)
!705 = !DILocation(line: 168, column: 10, scope: !704)
!706 = !DILocation(line: 168, column: 8, scope: !704)
!707 = !DILocation(line: 168, column: 26, scope: !704)
!708 = !DILocation(line: 168, column: 18, scope: !704)
!709 = !DILocation(line: 168, column: 32, scope: !704)
!710 = !DILocation(line: 168, column: 46, scope: !704)
!711 = !DILocation(line: 168, column: 7, scope: !669)
!712 = !DILocation(line: 169, column: 5, scope: !704)
!713 = !DILocation(line: 172, column: 13, scope: !714)
!714 = distinct !DILexicalBlock(scope: !669, file: !3, line: 172, column: 7)
!715 = !DILocation(line: 172, column: 10, scope: !714)
!716 = !DILocation(line: 172, column: 8, scope: !714)
!717 = !DILocation(line: 172, column: 25, scope: !714)
!718 = !DILocation(line: 172, column: 18, scope: !714)
!719 = !DILocation(line: 172, column: 43, scope: !714)
!720 = !DILocation(line: 172, column: 67, scope: !714)
!721 = !DILocation(line: 172, column: 7, scope: !669)
!722 = !DILocation(line: 173, column: 5, scope: !714)
!723 = !DILocation(line: 178, column: 26, scope: !669)
!724 = !DILocation(line: 178, column: 36, scope: !669)
!725 = !DILocation(line: 178, column: 44, scope: !669)
!726 = !DILocation(line: 178, column: 33, scope: !669)
!727 = !DILocation(line: 178, column: 13, scope: !669)
!728 = !DILocation(line: 180, column: 9, scope: !669)
!729 = !DILocation(line: 181, column: 3, scope: !669)
!730 = !DILocalVariable(name: "dp", scope: !731, file: !3, line: 183, type: !732)
!731 = distinct !DILexicalBlock(scope: !669, file: !3, line: 182, column: 5)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !735, line: 22, size: 2240, elements: !736)
!735 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!736 = !{!737, !738, !739, !740, !741}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !734, file: !735, line: 25, baseType: !421, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !734, file: !735, line: 26, baseType: !433, size: 64, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !734, file: !735, line: 31, baseType: !73, size: 16, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !734, file: !735, line: 32, baseType: !148, size: 8, offset: 144)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !734, file: !735, line: 33, baseType: !105, size: 2048, offset: 152)
!742 = !DILocation(line: 183, column: 28, scope: !731)
!743 = !DILocalVariable(name: "ent_sb", scope: !731, file: !3, line: 184, type: !414)
!744 = !DILocation(line: 184, column: 19, scope: !731)
!745 = !DILocalVariable(name: "ino", scope: !731, file: !3, line: 185, type: !568)
!746 = !DILocation(line: 185, column: 13, scope: !731)
!747 = !DILocation(line: 187, column: 7, scope: !731)
!748 = !DILocation(line: 187, column: 13, scope: !731)
!749 = !DILocation(line: 188, column: 50, scope: !750)
!750 = distinct !DILexicalBlock(scope: !731, file: !3, line: 188, column: 11)
!751 = !DILocation(line: 188, column: 17, scope: !750)
!752 = !DILocation(line: 188, column: 15, scope: !750)
!753 = !DILocation(line: 188, column: 57, scope: !750)
!754 = !DILocation(line: 188, column: 11, scope: !731)
!755 = !DILocation(line: 190, column: 15, scope: !756)
!756 = distinct !DILexicalBlock(scope: !757, file: !3, line: 190, column: 15)
!757 = distinct !DILexicalBlock(scope: !750, file: !3, line: 189, column: 9)
!758 = !DILocation(line: 190, column: 15, scope: !757)
!759 = !DILocalVariable(name: "e", scope: !760, file: !3, line: 193, type: !19)
!760 = distinct !DILexicalBlock(scope: !756, file: !3, line: 191, column: 13)
!761 = !DILocation(line: 193, column: 19, scope: !760)
!762 = !DILocation(line: 193, column: 23, scope: !760)
!763 = !DILocation(line: 194, column: 25, scope: !760)
!764 = !DILocation(line: 194, column: 15, scope: !760)
!765 = !DILocation(line: 195, column: 23, scope: !760)
!766 = !DILocation(line: 195, column: 15, scope: !760)
!767 = !DILocation(line: 195, column: 21, scope: !760)
!768 = !DILocation(line: 198, column: 20, scope: !760)
!769 = !DILocation(line: 199, column: 13, scope: !760)
!770 = !DILocation(line: 200, column: 11, scope: !757)
!771 = !DILocation(line: 203, column: 13, scope: !731)
!772 = !DILocation(line: 203, column: 11, scope: !731)
!773 = !DILocation(line: 205, column: 11, scope: !774)
!774 = distinct !DILexicalBlock(scope: !731, file: !3, line: 205, column: 11)
!775 = !DILocation(line: 205, column: 15, scope: !774)
!776 = !DILocation(line: 205, column: 38, scope: !774)
!777 = !DILocation(line: 205, column: 41, scope: !774)
!778 = !DILocation(line: 205, column: 11, scope: !731)
!779 = !DILocation(line: 207, column: 22, scope: !780)
!780 = distinct !DILexicalBlock(scope: !781, file: !3, line: 207, column: 15)
!781 = distinct !DILexicalBlock(scope: !774, file: !3, line: 206, column: 9)
!782 = !DILocation(line: 207, column: 26, scope: !780)
!783 = !DILocation(line: 207, column: 15, scope: !780)
!784 = !DILocation(line: 207, column: 43, scope: !780)
!785 = !DILocation(line: 207, column: 15, scope: !781)
!786 = !DILocation(line: 210, column: 15, scope: !787)
!787 = distinct !DILexicalBlock(scope: !780, file: !3, line: 208, column: 13)
!788 = distinct !{!788, !729, !789}
!789 = !DILocation(line: 226, column: 5, scope: !669)
!790 = !DILocation(line: 212, column: 24, scope: !781)
!791 = !DILocation(line: 212, column: 15, scope: !781)
!792 = !DILocation(line: 213, column: 9, scope: !781)
!793 = !DILocation(line: 215, column: 11, scope: !794)
!794 = distinct !DILexicalBlock(scope: !731, file: !3, line: 215, column: 11)
!795 = !DILocation(line: 215, column: 18, scope: !794)
!796 = !DILocation(line: 215, column: 26, scope: !794)
!797 = !DILocation(line: 215, column: 15, scope: !794)
!798 = !DILocation(line: 215, column: 11, scope: !731)
!799 = !DILocation(line: 216, column: 9, scope: !794)
!800 = !DILocation(line: 220, column: 14, scope: !801)
!801 = distinct !DILexicalBlock(scope: !731, file: !3, line: 220, column: 12)
!802 = !DILocation(line: 220, column: 24, scope: !801)
!803 = !DILocation(line: 220, column: 34, scope: !801)
!804 = !DILocation(line: 220, column: 44, scope: !801)
!805 = !DILocation(line: 220, column: 52, scope: !801)
!806 = !DILocation(line: 220, column: 41, scope: !801)
!807 = !DILocation(line: 220, column: 12, scope: !731)
!808 = !DILocation(line: 222, column: 30, scope: !809)
!809 = distinct !DILexicalBlock(scope: !801, file: !3, line: 221, column: 9)
!810 = !DILocation(line: 222, column: 41, scope: !809)
!811 = !DILocation(line: 222, column: 45, scope: !809)
!812 = !DILocation(line: 222, column: 53, scope: !809)
!813 = !DILocation(line: 222, column: 11, scope: !809)
!814 = !DILocation(line: 223, column: 17, scope: !809)
!815 = !DILocation(line: 224, column: 11, scope: !809)
!816 = !DILocation(line: 228, column: 7, scope: !817)
!817 = distinct !DILexicalBlock(scope: !669, file: !3, line: 228, column: 7)
!818 = !DILocation(line: 228, column: 12, scope: !817)
!819 = !DILocation(line: 228, column: 20, scope: !817)
!820 = !DILocation(line: 228, column: 33, scope: !817)
!821 = !DILocation(line: 228, column: 23, scope: !817)
!822 = !DILocation(line: 228, column: 39, scope: !817)
!823 = !DILocation(line: 228, column: 7, scope: !669)
!824 = !DILocation(line: 232, column: 7, scope: !825)
!825 = distinct !DILexicalBlock(scope: !817, file: !3, line: 229, column: 5)
!826 = !DILocation(line: 236, column: 10, scope: !827)
!827 = distinct !DILexicalBlock(scope: !669, file: !3, line: 236, column: 8)
!828 = !DILocation(line: 236, column: 8, scope: !669)
!829 = !DILocation(line: 237, column: 5, scope: !827)
!830 = !DILocation(line: 241, column: 4, scope: !669)
!831 = !DILocation(line: 241, column: 13, scope: !669)
!832 = !DILocation(line: 242, column: 1, scope: !669)
!833 = !DILocalVariable(name: "dot_sb", arg: 1, scope: !834, file: !3, line: 153, type: !837)
!834 = distinct !DISubprogram(name: "find_dir_entry", scope: !3, file: !3, line: 153, type: !835, scopeLine: 155, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !865, retainedNodes: !4)
!835 = !DISubroutineType(types: !836)
!836 = !{null, !837, !859, !74}
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !415, line: 46, size: 1152, elements: !839)
!839 = !{!840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !856, !857, !858}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !838, file: !415, line: 48, baseType: !418, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !838, file: !415, line: 53, baseType: !421, size: 64, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !838, file: !415, line: 61, baseType: !423, size: 64, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !838, file: !415, line: 62, baseType: !425, size: 32, offset: 192)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !838, file: !415, line: 64, baseType: !427, size: 32, offset: 224)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !838, file: !415, line: 65, baseType: !429, size: 32, offset: 256)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !838, file: !415, line: 67, baseType: !19, size: 32, offset: 288)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !838, file: !415, line: 69, baseType: !418, size: 64, offset: 320)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !838, file: !415, line: 74, baseType: !433, size: 64, offset: 384)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !838, file: !415, line: 78, baseType: !436, size: 64, offset: 448)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !838, file: !415, line: 80, baseType: !438, size: 64, offset: 512)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !838, file: !415, line: 91, baseType: !852, size: 128, offset: 576)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !441, line: 10, size: 128, elements: !853)
!853 = !{!854, !855}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !852, file: !441, line: 12, baseType: !444, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !852, file: !441, line: 16, baseType: !446, size: 64, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !838, file: !415, line: 92, baseType: !852, size: 128, offset: 704)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !838, file: !415, line: 93, baseType: !852, size: 128, offset: 832)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !838, file: !415, line: 106, baseType: !450, size: 192, offset: 960)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 34, size: 192, elements: !861)
!861 = !{!862, !863, !864}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !860, file: !3, line: 36, baseType: !7, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !860, file: !3, line: 37, baseType: !74, size: 64, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !860, file: !3, line: 38, baseType: !7, size: 64, offset: 128)
!865 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !866, nameTableKind: None)
!866 = !{!867}
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(name: "longopts", scope: !865, file: !3, line: 41, type: !869, isLocal: true, isDefinition: true)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !870, size: 1280, elements: !23)
!870 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !872)
!872 = !{!873, !874, !875, !876}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !871, file: !13, line: 52, baseType: !16, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !871, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !871, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !871, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!877 = !DILocalVariable(name: "file_name", arg: 2, scope: !834, file: !3, line: 153, type: !859)
!878 = !DILocalVariable(name: "parent_height", arg: 3, scope: !834, file: !3, line: 154, type: !74)
!879 = !DILocalVariable(name: "dirp", scope: !834, file: !3, line: 156, type: !680)
!880 = !DILocalVariable(name: "fd", scope: !834, file: !3, line: 157, type: !19)
!881 = !DILocalVariable(name: "parent_sb", scope: !834, file: !3, line: 158, type: !838)
!882 = !DILocalVariable(name: "use_lstat", scope: !834, file: !3, line: 159, type: !38)
!883 = !DILocalVariable(name: "found", scope: !834, file: !3, line: 160, type: !38)
!884 = distinct !DISubprogram(name: "file_name_prepend", scope: !3, file: !3, line: 101, type: !885, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!885 = !DISubroutineType(types: !886)
!886 = !{null, !376, !16, !74}
!887 = !DILocalVariable(name: "p", arg: 1, scope: !884, file: !3, line: 101, type: !376)
!888 = !DILocation(line: 101, column: 38, scope: !884)
!889 = !DILocalVariable(name: "s", arg: 2, scope: !884, file: !3, line: 101, type: !16)
!890 = !DILocation(line: 101, column: 53, scope: !884)
!891 = !DILocalVariable(name: "s_len", arg: 3, scope: !884, file: !3, line: 101, type: !74)
!892 = !DILocation(line: 101, column: 63, scope: !884)
!893 = !DILocalVariable(name: "n_free", scope: !884, file: !3, line: 103, type: !74)
!894 = !DILocation(line: 103, column: 10, scope: !884)
!895 = !DILocation(line: 103, column: 19, scope: !884)
!896 = !DILocation(line: 103, column: 22, scope: !884)
!897 = !DILocation(line: 103, column: 30, scope: !884)
!898 = !DILocation(line: 103, column: 33, scope: !884)
!899 = !DILocation(line: 103, column: 28, scope: !884)
!900 = !DILocation(line: 104, column: 7, scope: !901)
!901 = distinct !DILexicalBlock(scope: !884, file: !3, line: 104, column: 7)
!902 = !DILocation(line: 104, column: 20, scope: !901)
!903 = !DILocation(line: 104, column: 18, scope: !901)
!904 = !DILocation(line: 104, column: 14, scope: !901)
!905 = !DILocation(line: 104, column: 7, scope: !884)
!906 = !DILocalVariable(name: "half", scope: !907, file: !3, line: 106, type: !74)
!907 = distinct !DILexicalBlock(scope: !901, file: !3, line: 105, column: 5)
!908 = !DILocation(line: 106, column: 14, scope: !907)
!909 = !DILocation(line: 106, column: 21, scope: !907)
!910 = !DILocation(line: 106, column: 24, scope: !907)
!911 = !DILocation(line: 106, column: 32, scope: !907)
!912 = !DILocation(line: 106, column: 38, scope: !907)
!913 = !DILocation(line: 106, column: 36, scope: !907)
!914 = !DILocalVariable(name: "q", scope: !907, file: !3, line: 111, type: !7)
!915 = !DILocation(line: 111, column: 13, scope: !907)
!916 = !DILocation(line: 111, column: 30, scope: !907)
!917 = !DILocation(line: 111, column: 17, scope: !907)
!918 = !DILocalVariable(name: "n_used", scope: !907, file: !3, line: 112, type: !74)
!919 = !DILocation(line: 112, column: 14, scope: !907)
!920 = !DILocation(line: 112, column: 23, scope: !907)
!921 = !DILocation(line: 112, column: 26, scope: !907)
!922 = !DILocation(line: 112, column: 36, scope: !907)
!923 = !DILocation(line: 112, column: 34, scope: !907)
!924 = !DILocation(line: 113, column: 18, scope: !907)
!925 = !DILocation(line: 113, column: 26, scope: !907)
!926 = !DILocation(line: 113, column: 24, scope: !907)
!927 = !DILocation(line: 113, column: 20, scope: !907)
!928 = !DILocation(line: 113, column: 33, scope: !907)
!929 = !DILocation(line: 113, column: 31, scope: !907)
!930 = !DILocation(line: 113, column: 7, scope: !907)
!931 = !DILocation(line: 113, column: 10, scope: !907)
!932 = !DILocation(line: 113, column: 16, scope: !907)
!933 = !DILocation(line: 114, column: 15, scope: !907)
!934 = !DILocation(line: 114, column: 18, scope: !907)
!935 = !DILocation(line: 114, column: 25, scope: !907)
!936 = !DILocation(line: 114, column: 28, scope: !907)
!937 = !DILocation(line: 114, column: 34, scope: !907)
!938 = !DILocation(line: 114, column: 32, scope: !907)
!939 = !DILocation(line: 114, column: 42, scope: !907)
!940 = !DILocation(line: 114, column: 7, scope: !907)
!941 = !DILocation(line: 115, column: 13, scope: !907)
!942 = !DILocation(line: 115, column: 16, scope: !907)
!943 = !DILocation(line: 115, column: 7, scope: !907)
!944 = !DILocation(line: 116, column: 16, scope: !907)
!945 = !DILocation(line: 116, column: 7, scope: !907)
!946 = !DILocation(line: 116, column: 10, scope: !907)
!947 = !DILocation(line: 116, column: 14, scope: !907)
!948 = !DILocation(line: 117, column: 24, scope: !907)
!949 = !DILocation(line: 117, column: 22, scope: !907)
!950 = !DILocation(line: 117, column: 7, scope: !907)
!951 = !DILocation(line: 117, column: 10, scope: !907)
!952 = !DILocation(line: 117, column: 18, scope: !907)
!953 = !DILocation(line: 118, column: 5, scope: !907)
!954 = !DILocation(line: 120, column: 19, scope: !884)
!955 = !DILocation(line: 120, column: 17, scope: !884)
!956 = !DILocation(line: 120, column: 3, scope: !884)
!957 = !DILocation(line: 120, column: 6, scope: !884)
!958 = !DILocation(line: 120, column: 12, scope: !884)
!959 = !DILocation(line: 121, column: 3, scope: !884)
!960 = !DILocation(line: 121, column: 6, scope: !884)
!961 = !DILocation(line: 121, column: 15, scope: !884)
!962 = !DILocation(line: 122, column: 11, scope: !884)
!963 = !DILocation(line: 122, column: 14, scope: !884)
!964 = !DILocation(line: 122, column: 20, scope: !884)
!965 = !DILocation(line: 122, column: 25, scope: !884)
!966 = !DILocation(line: 122, column: 28, scope: !884)
!967 = !DILocation(line: 122, column: 3, scope: !884)
!968 = !DILocation(line: 123, column: 1, scope: !884)
!969 = !DILocalVariable(name: "p", arg: 1, scope: !970, file: !3, line: 101, type: !973)
!970 = distinct !DISubprogram(name: "file_name_prepend", scope: !3, file: !3, line: 101, type: !971, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !979, retainedNodes: !4)
!971 = !DISubroutineType(types: !972)
!972 = !{null, !973, !16, !74}
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 34, size: 192, elements: !975)
!975 = !{!976, !977, !978}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !974, file: !3, line: 36, baseType: !7, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !974, file: !3, line: 37, baseType: !74, size: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !974, file: !3, line: 38, baseType: !7, size: 64, offset: 128)
!979 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !980, nameTableKind: None)
!980 = !{!981}
!981 = !DIGlobalVariableExpression(var: !982, expr: !DIExpression())
!982 = distinct !DIGlobalVariable(name: "longopts", scope: !979, file: !3, line: 41, type: !983, isLocal: true, isDefinition: true)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !984, size: 1280, elements: !23)
!984 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !985)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !986)
!986 = !{!987, !988, !989, !990}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !985, file: !13, line: 52, baseType: !16, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !985, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !985, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !985, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!991 = !DILocalVariable(name: "s", arg: 2, scope: !970, file: !3, line: 101, type: !16)
!992 = !DILocalVariable(name: "s_len", arg: 3, scope: !970, file: !3, line: 101, type: !74)
!993 = !DILocalVariable(name: "n_free", scope: !970, file: !3, line: 103, type: !74)
!994 = !DILocalVariable(name: "q", scope: !995, file: !3, line: 111, type: !7)
!995 = distinct !DILexicalBlock(scope: !996, file: !3, line: 105, column: 5)
!996 = distinct !DILexicalBlock(scope: !997, file: !3, line: 104, column: 7)
!997 = distinct !DISubprogram(name: "file_name_prepend", scope: !3, file: !3, line: 101, type: !998, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1006, retainedNodes: !4)
!998 = !DISubroutineType(types: !999)
!999 = !{null, !1000, !16, !74}
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_name", file: !3, line: 34, size: 192, elements: !1002)
!1002 = !{!1003, !1004, !1005}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1001, file: !3, line: 36, baseType: !7, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "n_alloc", scope: !1001, file: !3, line: 37, baseType: !74, size: 64, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1001, file: !3, line: 38, baseType: !7, size: 64, offset: 128)
!1006 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !1007, nameTableKind: None)
!1007 = !{!1008}
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(name: "longopts", scope: !1006, file: !3, line: 41, type: !1010, isLocal: true, isDefinition: true)
!1010 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1011, size: 1280, elements: !23)
!1011 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1012)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !1013)
!1013 = !{!1014, !1015, !1016, !1017}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1012, file: !13, line: 52, baseType: !16, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !1012, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1012, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1012, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!1018 = !DILocalVariable(name: "n_used", scope: !995, file: !3, line: 112, type: !74)
!1019 = distinct !DISubprogram(name: "nth_parent", scope: !3, file: !3, line: 127, type: !1020, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!7, !74}
!1022 = !DILocalVariable(name: "n", arg: 1, scope: !1019, file: !3, line: 127, type: !74)
!1023 = !DILocation(line: 127, column: 20, scope: !1019)
!1024 = !DILocalVariable(name: "buf", scope: !1019, file: !3, line: 129, type: !7)
!1025 = !DILocation(line: 129, column: 9, scope: !1019)
!1026 = !DILocation(line: 129, column: 28, scope: !1019)
!1027 = !DILocation(line: 129, column: 15, scope: !1019)
!1028 = !DILocalVariable(name: "p", scope: !1019, file: !3, line: 130, type: !7)
!1029 = !DILocation(line: 130, column: 9, scope: !1019)
!1030 = !DILocation(line: 130, column: 13, scope: !1019)
!1031 = !DILocalVariable(name: "i", scope: !1032, file: !3, line: 132, type: !74)
!1032 = distinct !DILexicalBlock(scope: !1019, file: !3, line: 132, column: 3)
!1033 = !DILocation(line: 132, column: 15, scope: !1032)
!1034 = !DILocation(line: 132, column: 8, scope: !1032)
!1035 = !DILocation(line: 132, column: 22, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 132, column: 3)
!1037 = !DILocation(line: 132, column: 26, scope: !1036)
!1038 = !DILocation(line: 132, column: 24, scope: !1036)
!1039 = !DILocation(line: 132, column: 3, scope: !1032)
!1040 = !DILocation(line: 134, column: 15, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1036, file: !3, line: 133, column: 5)
!1042 = !DILocation(line: 134, column: 7, scope: !1041)
!1043 = !DILocation(line: 135, column: 9, scope: !1041)
!1044 = !DILocation(line: 136, column: 5, scope: !1041)
!1045 = !DILocation(line: 132, column: 30, scope: !1036)
!1046 = !DILocation(line: 132, column: 3, scope: !1036)
!1047 = distinct !{!1047, !1039, !1048}
!1048 = !DILocation(line: 136, column: 5, scope: !1032)
!1049 = !DILocation(line: 137, column: 3, scope: !1019)
!1050 = !DILocation(line: 137, column: 9, scope: !1019)
!1051 = !DILocation(line: 138, column: 10, scope: !1019)
!1052 = !DILocation(line: 138, column: 3, scope: !1019)
!1053 = distinct !DISubprogram(name: "readdir_ignoring_dot_and_dotdot", scope: !198, file: !198, line: 278, type: !1054, scopeLine: 279, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!732, !680}
!1056 = !DILocalVariable(name: "dirp", arg: 1, scope: !1053, file: !198, line: 278, type: !680)
!1057 = !DILocation(line: 278, column: 39, scope: !1053)
!1058 = !DILocation(line: 280, column: 3, scope: !1053)
!1059 = !DILocalVariable(name: "dp", scope: !1060, file: !198, line: 282, type: !732)
!1060 = distinct !DILexicalBlock(scope: !1053, file: !198, line: 281, column: 5)
!1061 = !DILocation(line: 282, column: 28, scope: !1060)
!1062 = !DILocation(line: 282, column: 42, scope: !1060)
!1063 = !DILocation(line: 282, column: 33, scope: !1060)
!1064 = !DILocation(line: 283, column: 11, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1060, file: !198, line: 283, column: 11)
!1066 = !DILocation(line: 283, column: 14, scope: !1065)
!1067 = !DILocation(line: 283, column: 22, scope: !1065)
!1068 = !DILocation(line: 283, column: 42, scope: !1065)
!1069 = !DILocation(line: 283, column: 46, scope: !1065)
!1070 = !DILocation(line: 283, column: 27, scope: !1065)
!1071 = !DILocation(line: 283, column: 11, scope: !1060)
!1072 = !DILocation(line: 284, column: 16, scope: !1065)
!1073 = !DILocation(line: 284, column: 9, scope: !1065)
!1074 = distinct !{!1074, !1058, !1075}
!1075 = !DILocation(line: 285, column: 5, scope: !1053)
!1076 = !DILocalVariable(name: "dirp", arg: 1, scope: !1077, file: !198, line: 278, type: !680)
!1077 = distinct !DISubprogram(name: "readdir_ignoring_dot_and_dotdot", scope: !198, file: !198, line: 278, type: !1078, scopeLine: 279, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1089, retainedNodes: !4)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!1080, !680}
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1082)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !735, line: 22, size: 2240, elements: !1083)
!1083 = !{!1084, !1085, !1086, !1087, !1088}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !1082, file: !735, line: 25, baseType: !421, size: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !1082, file: !735, line: 26, baseType: !433, size: 64, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !1082, file: !735, line: 31, baseType: !73, size: 16, offset: 128)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !1082, file: !735, line: 32, baseType: !148, size: 8, offset: 144)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !1082, file: !735, line: 33, baseType: !105, size: 2048, offset: 152)
!1089 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !1090, nameTableKind: None)
!1090 = !{!1091}
!1091 = !DIGlobalVariableExpression(var: !1092, expr: !DIExpression())
!1092 = distinct !DIGlobalVariable(name: "longopts", scope: !1089, file: !3, line: 41, type: !1093, isLocal: true, isDefinition: true)
!1093 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1094, size: 1280, elements: !23)
!1094 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1095)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !1096)
!1096 = !{!1097, !1098, !1099, !1100}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1095, file: !13, line: 52, baseType: !16, size: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !1095, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1095, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1095, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!1101 = distinct !DISubprogram(name: "dot_or_dotdot", scope: !198, file: !198, line: 265, type: !1102, scopeLine: 266, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!38, !16}
!1104 = !DILocalVariable(name: "file_name", arg: 1, scope: !1101, file: !198, line: 265, type: !16)
!1105 = !DILocation(line: 265, column: 28, scope: !1101)
!1106 = !DILocation(line: 267, column: 7, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1101, file: !198, line: 267, column: 7)
!1108 = !DILocation(line: 267, column: 20, scope: !1107)
!1109 = !DILocation(line: 267, column: 7, scope: !1101)
!1110 = !DILocalVariable(name: "sep", scope: !1111, file: !198, line: 269, type: !8)
!1111 = distinct !DILexicalBlock(scope: !1107, file: !198, line: 268, column: 5)
!1112 = !DILocation(line: 269, column: 12, scope: !1111)
!1113 = !DILocation(line: 269, column: 18, scope: !1111)
!1114 = !DILocation(line: 269, column: 29, scope: !1111)
!1115 = !DILocation(line: 269, column: 42, scope: !1111)
!1116 = !DILocation(line: 269, column: 50, scope: !1111)
!1117 = !DILocation(line: 270, column: 17, scope: !1111)
!1118 = !DILocation(line: 270, column: 21, scope: !1111)
!1119 = !DILocation(line: 270, column: 24, scope: !1111)
!1120 = !DILocation(line: 270, column: 7, scope: !1111)
!1121 = !DILocation(line: 273, column: 5, scope: !1107)
!1122 = !DILocation(line: 274, column: 1, scope: !1101)
!1123 = !DILocalVariable(name: "file_name", arg: 1, scope: !1124, file: !198, line: 265, type: !16)
!1124 = distinct !DISubprogram(name: "dot_or_dotdot", scope: !198, file: !198, line: 265, type: !1102, scopeLine: 266, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1125, retainedNodes: !4)
!1125 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !1126, nameTableKind: None)
!1126 = !{!1127}
!1127 = !DIGlobalVariableExpression(var: !1128, expr: !DIExpression())
!1128 = distinct !DIGlobalVariable(name: "longopts", scope: !1125, file: !3, line: 41, type: !1129, isLocal: true, isDefinition: true)
!1129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1130, size: 1280, elements: !23)
!1130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1131)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !13, line: 50, size: 256, elements: !1132)
!1132 = !{!1133, !1134, !1135, !1136}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1131, file: !13, line: 52, baseType: !16, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !1131, file: !13, line: 55, baseType: !19, size: 32, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1131, file: !13, line: 56, baseType: !21, size: 64, offset: 128)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1131, file: !13, line: 57, baseType: !19, size: 32, offset: 192)
!1137 = distinct !DISubprogram(name: "close_stdout", scope: !37, file: !37, line: 117, type: !1138, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !32, retainedNodes: !4)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{null}
!1140 = !DILocation(line: 119, column: 21, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1137, file: !37, line: 119, column: 7)
!1142 = !DILocation(line: 119, column: 7, scope: !1141)
!1143 = !DILocation(line: 119, column: 29, scope: !1141)
!1144 = !DILocation(line: 120, column: 7, scope: !1141)
!1145 = !DILocation(line: 120, column: 12, scope: !1141)
!1146 = !DILocation(line: 120, column: 25, scope: !1141)
!1147 = !DILocation(line: 120, column: 28, scope: !1141)
!1148 = !DILocation(line: 120, column: 34, scope: !1141)
!1149 = !DILocation(line: 119, column: 7, scope: !1137)
!1150 = !DILocalVariable(name: "write_error", scope: !1151, file: !37, line: 122, type: !16)
!1151 = distinct !DILexicalBlock(scope: !1141, file: !37, line: 121, column: 5)
!1152 = !DILocation(line: 122, column: 19, scope: !1151)
!1153 = !DILocation(line: 122, column: 33, scope: !1151)
!1154 = !DILocation(line: 123, column: 11, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1151, file: !37, line: 123, column: 11)
!1156 = !DILocation(line: 123, column: 11, scope: !1151)
!1157 = !DILocation(line: 124, column: 19, scope: !1155)
!1158 = !DILocation(line: 124, column: 52, scope: !1155)
!1159 = !DILocation(line: 124, column: 36, scope: !1155)
!1160 = !DILocation(line: 125, column: 16, scope: !1155)
!1161 = !DILocation(line: 124, column: 9, scope: !1155)
!1162 = !DILocation(line: 127, column: 19, scope: !1155)
!1163 = !DILocation(line: 127, column: 32, scope: !1155)
!1164 = !DILocation(line: 127, column: 9, scope: !1155)
!1165 = !DILocation(line: 129, column: 14, scope: !1151)
!1166 = !DILocation(line: 129, column: 7, scope: !1151)
!1167 = !DILocation(line: 134, column: 42, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1137, file: !37, line: 134, column: 7)
!1169 = !DILocation(line: 134, column: 28, scope: !1168)
!1170 = !DILocation(line: 134, column: 50, scope: !1168)
!1171 = !DILocation(line: 134, column: 7, scope: !1137)
!1172 = !DILocation(line: 135, column: 12, scope: !1168)
!1173 = !DILocation(line: 135, column: 5, scope: !1168)
!1174 = !DILocation(line: 136, column: 1, scope: !1137)
!1175 = distinct !DISubprogram(name: "set_program_name", scope: !51, file: !51, line: 39, type: !199, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !4)
!1176 = !DILocalVariable(name: "argv0", arg: 1, scope: !1175, file: !51, line: 39, type: !16)
!1177 = !DILocation(line: 39, column: 31, scope: !1175)
!1178 = !DILocalVariable(name: "slash", scope: !1175, file: !51, line: 46, type: !16)
!1179 = !DILocation(line: 46, column: 15, scope: !1175)
!1180 = !DILocalVariable(name: "base", scope: !1175, file: !51, line: 47, type: !16)
!1181 = !DILocation(line: 47, column: 15, scope: !1175)
!1182 = !DILocation(line: 51, column: 7, scope: !1183)
!1183 = distinct !DILexicalBlock(scope: !1175, file: !51, line: 51, column: 7)
!1184 = !DILocation(line: 51, column: 13, scope: !1183)
!1185 = !DILocation(line: 51, column: 7, scope: !1175)
!1186 = !DILocation(line: 55, column: 14, scope: !1187)
!1187 = distinct !DILexicalBlock(scope: !1183, file: !51, line: 52, column: 5)
!1188 = !DILocation(line: 54, column: 7, scope: !1187)
!1189 = !DILocation(line: 56, column: 7, scope: !1187)
!1190 = !DILocation(line: 59, column: 20, scope: !1175)
!1191 = !DILocation(line: 59, column: 11, scope: !1175)
!1192 = !DILocation(line: 59, column: 9, scope: !1175)
!1193 = !DILocation(line: 60, column: 11, scope: !1175)
!1194 = !DILocation(line: 60, column: 17, scope: !1175)
!1195 = !DILocation(line: 60, column: 27, scope: !1175)
!1196 = !DILocation(line: 60, column: 33, scope: !1175)
!1197 = !DILocation(line: 60, column: 39, scope: !1175)
!1198 = !DILocation(line: 60, column: 8, scope: !1175)
!1199 = !DILocation(line: 61, column: 7, scope: !1200)
!1200 = distinct !DILexicalBlock(scope: !1175, file: !51, line: 61, column: 7)
!1201 = !DILocation(line: 61, column: 14, scope: !1200)
!1202 = !DILocation(line: 61, column: 12, scope: !1200)
!1203 = !DILocation(line: 61, column: 20, scope: !1200)
!1204 = !DILocation(line: 61, column: 25, scope: !1200)
!1205 = !DILocation(line: 61, column: 37, scope: !1200)
!1206 = !DILocation(line: 61, column: 42, scope: !1200)
!1207 = !DILocation(line: 61, column: 28, scope: !1200)
!1208 = !DILocation(line: 61, column: 61, scope: !1200)
!1209 = !DILocation(line: 61, column: 7, scope: !1175)
!1210 = !DILocation(line: 63, column: 15, scope: !1211)
!1211 = distinct !DILexicalBlock(scope: !1200, file: !51, line: 62, column: 5)
!1212 = !DILocation(line: 63, column: 13, scope: !1211)
!1213 = !DILocation(line: 64, column: 20, scope: !1214)
!1214 = distinct !DILexicalBlock(scope: !1211, file: !51, line: 64, column: 11)
!1215 = !DILocation(line: 64, column: 11, scope: !1214)
!1216 = !DILocation(line: 64, column: 36, scope: !1214)
!1217 = !DILocation(line: 64, column: 11, scope: !1211)
!1218 = !DILocation(line: 66, column: 19, scope: !1219)
!1219 = distinct !DILexicalBlock(scope: !1214, file: !51, line: 65, column: 9)
!1220 = !DILocation(line: 66, column: 24, scope: !1219)
!1221 = !DILocation(line: 66, column: 17, scope: !1219)
!1222 = !DILocation(line: 70, column: 52, scope: !1219)
!1223 = !DILocation(line: 70, column: 41, scope: !1219)
!1224 = !DILocation(line: 72, column: 9, scope: !1219)
!1225 = !DILocation(line: 73, column: 5, scope: !1211)
!1226 = !DILocation(line: 84, column: 18, scope: !1175)
!1227 = !DILocation(line: 84, column: 16, scope: !1175)
!1228 = !DILocation(line: 90, column: 38, scope: !1175)
!1229 = !DILocation(line: 90, column: 27, scope: !1175)
!1230 = !DILocation(line: 92, column: 1, scope: !1175)
!1231 = !DILocalVariable(name: "argv0", arg: 1, scope: !1232, file: !51, line: 39, type: !16)
!1232 = distinct !DISubprogram(name: "set_program_name", scope: !51, file: !51, line: 39, type: !199, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1233, retainedNodes: !4)
!1233 = distinct !DICompileUnit(language: DW_LANG_C99, file: !49, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !1234, nameTableKind: None)
!1234 = !{!1235}
!1235 = !DIGlobalVariableExpression(var: !1236, expr: !DIExpression())
!1236 = distinct !DIGlobalVariable(name: "program_name", scope: !1233, file: !51, line: 33, type: !16, isLocal: false, isDefinition: true)
!1237 = !DILocalVariable(name: "slash", scope: !1232, file: !51, line: 46, type: !16)
!1238 = !DILocalVariable(name: "base", scope: !1232, file: !51, line: 47, type: !16)
!1239 = distinct !DISubprogram(name: "set_char_quoting", scope: !80, file: !80, line: 152, type: !1240, scopeLine: 153, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !54, retainedNodes: !4)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{!19, !1242, !8, !19}
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!1243 = !DILocalVariable(name: "o", arg: 1, scope: !1239, file: !80, line: 152, type: !1242)
!1244 = !DILocation(line: 152, column: 43, scope: !1239)
!1245 = !DILocalVariable(name: "c", arg: 2, scope: !1239, file: !80, line: 152, type: !8)
!1246 = !DILocation(line: 152, column: 51, scope: !1239)
!1247 = !DILocalVariable(name: "i", arg: 3, scope: !1239, file: !80, line: 152, type: !19)
!1248 = !DILocation(line: 152, column: 58, scope: !1239)
!1249 = !DILocalVariable(name: "uc", scope: !1239, file: !80, line: 154, type: !148)
