; ModuleID = '<stdin>'
source_filename = "ld-temp.o"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.infomap = type { i8*, i8* }
%struct.option = type { i8*, i32, i32*, i32 }
%struct.quoting_options = type { i32, i32, [8 x i32], i8*, i8* }
%struct.slotvec = type { i64, i8* }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.group = type { i8*, i8*, i32, i8** }
%struct.__mbstate_t = type { i32, %union.anon }
%union.anon = type { i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stderr = external dso_local global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [39 x i8] c"Try '%s --help' for more information.\0A\00", align 1
@.str.1 = private unnamed_addr constant [33 x i8] c"Usage: %s [OPTION]... [USER]...\0A\00", align 1
@.str.2 = private unnamed_addr constant [105 x i8] c"Print user and group information for each specified USER,\0Aor (when USER omitted) for the current user.\0A\0A\00", align 1
@stdout = external dso_local global %struct._IO_FILE*, align 8

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !9, nameTableKind: None)
!3 = !DIFile(filename: "src/id.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!4 = !{}
!5 = !{!6, !8}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!9 = !{!10, !17, !19, !23, !0, !25, !28, !30, !32, !34, !36, !38, !40, !42, !44, !46, !56}
!10 = !DIGlobalVariableExpression(var: !11, expr: !DIExpression())
!11 = distinct !DIGlobalVariable(name: "ruid", scope: !2, file: !3, line: 64, type: !12, isLocal: true, isDefinition: true)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !13, line: 79, baseType: !14)
!13 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !15, line: 146, baseType: !16)
!15 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!16 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "euid", scope: !2, file: !3, line: 64, type: !12, isLocal: true, isDefinition: true)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "rgid", scope: !2, file: !3, line: 65, type: !21, isLocal: true, isDefinition: true)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !13, line: 64, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !15, line: 147, baseType: !16)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "egid", scope: !2, file: !3, line: 65, type: !21, isLocal: true, isDefinition: true)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "just_context", scope: !2, file: !3, line: 45, type: !27, isLocal: true, isDefinition: true)
!27 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "just_group", scope: !2, file: !3, line: 51, type: !27, isLocal: true, isDefinition: true)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "use_name", scope: !2, file: !3, line: 61, type: !27, isLocal: true, isDefinition: true)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(name: "use_real", scope: !2, file: !3, line: 53, type: !27, isLocal: true, isDefinition: true)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "just_user", scope: !2, file: !3, line: 55, type: !27, isLocal: true, isDefinition: true)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "opt_zero", scope: !2, file: !3, line: 47, type: !27, isLocal: true, isDefinition: true)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "just_group_list", scope: !2, file: !3, line: 49, type: !27, isLocal: true, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "context", scope: !2, file: !3, line: 69, type: !6, isLocal: true, isDefinition: true)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "multiple_users", scope: !2, file: !3, line: 59, type: !27, isLocal: true, isDefinition: true)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "ok", scope: !2, file: !3, line: 57, type: !27, isLocal: true, isDefinition: true)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "buf", scope: !48, file: !3, line: 327, type: !53, isLocal: true, isDefinition: true)
!48 = distinct !DISubprogram(name: "uidtostr_ptr", scope: !3, file: !3, line: 325, type: !49, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!49 = !DISubroutineType(types: !50)
!50 = !{!6, !51}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 168, elements: !54)
!54 = !{!55}
!55 = !DISubrange(count: 21)
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(name: "buf", scope: !58, file: !3, line: 316, type: !53, isLocal: true, isDefinition: true)
!58 = distinct !DISubprogram(name: "gidtostr_ptr", scope: !3, file: !3, line: 314, type: !59, scopeLine: 315, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!59 = !DISubroutineType(types: !60)
!60 = !{!6, !61}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 2560, elements: !76)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !66, line: 50, size: 256, elements: !67)
!66 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/getopt_ext.h", directory: "")
!67 = !{!68, !71, !73, !75}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !65, file: !66, line: 52, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !65, file: !66, line: 55, baseType: !72, size: 32, offset: 64)
!72 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !65, file: !66, line: 56, baseType: !74, size: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !65, file: !66, line: 57, baseType: !72, size: 32, offset: 192)
!76 = !{!77}
!77 = !DISubrange(count: 10)
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "buf", scope: !80, file: !81, line: 96, type: !53, isLocal: true, isDefinition: true)
!80 = distinct !DISubprogram(name: "gidtostr_ptr", scope: !81, file: !81, line: 94, type: !59, scopeLine: 95, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !82, retainedNodes: !4)
!81 = !DIFile(filename: "src/group-list.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!82 = distinct !DICompileUnit(language: DW_LANG_C99, file: !81, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !83, globals: !85, nameTableKind: None)
!83 = !{!8, !84}
!84 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!85 = !{!78}
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "Version", scope: !88, file: !89, line: 2, type: !69, isLocal: false, isDefinition: true)
!88 = distinct !DICompileUnit(language: DW_LANG_C99, file: !89, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !90, nameTableKind: None)
!89 = !DIFile(filename: "src/version.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!90 = !{!86}
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "ignore_EPIPE", scope: !93, file: !98, line: 56, type: !27, isLocal: true, isDefinition: true)
!93 = distinct !DICompileUnit(language: DW_LANG_C99, file: !94, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !95, nameTableKind: None)
!94 = !DIFile(filename: "./lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!95 = !{!96, !91}
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(name: "file_name", scope: !93, file: !98, line: 46, type: !69, isLocal: true, isDefinition: true)
!98 = !DIFile(filename: "lib/closeout.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "exit_failure", scope: !101, file: !104, line: 24, type: !105, isLocal: false, isDefinition: true)
!101 = distinct !DICompileUnit(language: DW_LANG_C99, file: !102, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !103, nameTableKind: None)
!102 = !DIFile(filename: "./lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!103 = !{!99}
!104 = !DIFile(filename: "lib/exitfail.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!105 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !72)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "program_name", scope: !108, file: !112, line: 33, type: !69, isLocal: false, isDefinition: true)
!108 = distinct !DICompileUnit(language: DW_LANG_C99, file: !109, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !110, globals: !111, nameTableKind: None)
!109 = !DIFile(filename: "./lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!110 = !{!8, !6}
!111 = !{!106}
!112 = !DIFile(filename: "lib/progname.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "default_quoting_options", scope: !115, file: !139, line: 116, type: !150, isLocal: true, isDefinition: true)
!115 = distinct !DICompileUnit(language: DW_LANG_C99, file: !116, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !117, retainedTypes: !132, globals: !136, nameTableKind: None)
!116 = !DIFile(filename: "./lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!117 = !{!118}
!118 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "quoting_style", file: !119, line: 32, baseType: !16, size: 32, elements: !120)
!119 = !DIFile(filename: "./lib/quotearg.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131}
!121 = !DIEnumerator(name: "literal_quoting_style", value: 0, isUnsigned: true)
!122 = !DIEnumerator(name: "shell_quoting_style", value: 1, isUnsigned: true)
!123 = !DIEnumerator(name: "shell_always_quoting_style", value: 2, isUnsigned: true)
!124 = !DIEnumerator(name: "shell_escape_quoting_style", value: 3, isUnsigned: true)
!125 = !DIEnumerator(name: "shell_escape_always_quoting_style", value: 4, isUnsigned: true)
!126 = !DIEnumerator(name: "c_quoting_style", value: 5, isUnsigned: true)
!127 = !DIEnumerator(name: "c_maybe_quoting_style", value: 6, isUnsigned: true)
!128 = !DIEnumerator(name: "escape_quoting_style", value: 7, isUnsigned: true)
!129 = !DIEnumerator(name: "locale_quoting_style", value: 8, isUnsigned: true)
!130 = !DIEnumerator(name: "clocale_quoting_style", value: 9, isUnsigned: true)
!131 = !DIEnumerator(name: "custom_quoting_style", value: 10, isUnsigned: true)
!132 = !{!72, !133, !134}
!133 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !135, line: 46, baseType: !84)
!135 = !DIFile(filename: "/usr/lib/llvm-9/lib/clang/9.0.1/include/stddef.h", directory: "")
!136 = !{!137, !144, !148, !113, !160, !165, !172, !174}
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "quoting_style_args", scope: !115, file: !139, line: 85, type: !140, isLocal: false, isDefinition: true)
!139 = !DIFile(filename: "lib/quotearg.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 704, elements: !142)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!142 = !{!143}
!143 = !DISubrange(count: 11)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "quoting_style_vals", scope: !115, file: !139, line: 101, type: !146, isLocal: false, isDefinition: true)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 320, elements: !76)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "quote_quoting_options", scope: !115, file: !139, line: 1052, type: !150, isLocal: false, isDefinition: true)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "quoting_options", file: !139, line: 65, size: 448, elements: !151)
!151 = !{!152, !153, !154, !158, !159}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !150, file: !139, line: 68, baseType: !118, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !150, file: !139, line: 71, baseType: !72, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "quote_these_too", scope: !150, file: !139, line: 75, baseType: !155, size: 256, offset: 64)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 256, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 8)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "left_quote", scope: !150, file: !139, line: 78, baseType: !69, size: 64, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "right_quote", scope: !150, file: !139, line: 81, baseType: !69, size: 64, offset: 384)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "slot0", scope: !115, file: !139, line: 842, type: !162, isLocal: true, isDefinition: true)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 2048, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 256)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "slotvec", scope: !115, file: !139, line: 845, type: !167, isLocal: true, isDefinition: true)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slotvec", file: !139, line: 834, size: 128, elements: !169)
!169 = !{!170, !171}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !168, file: !139, line: 836, baseType: !134, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !168, file: !139, line: 837, baseType: !6, size: 64, offset: 64)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "nslots", scope: !115, file: !139, line: 843, type: !72, isLocal: true, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "slotvec0", scope: !115, file: !139, line: 844, type: !168, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "E_bad_spec", scope: !178, file: !179, line: 108, type: !69, isLocal: true, isDefinition: true)
!178 = distinct !DISubprogram(name: "parse_with_separator", scope: !179, file: !179, line: 102, type: !180, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !185, retainedNodes: !4)
!179 = !DIFile(filename: "lib/userspec.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!180 = !DISubroutineType(types: !181)
!181 = !{!69, !69, !69, !182, !183, !184, !184}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!185 = distinct !DICompileUnit(language: DW_LANG_C99, file: !186, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !187, globals: !188, nameTableKind: None)
!186 = !DIFile(filename: "./lib/userspec.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!187 = !{!8, !12, !21}
!188 = !{!189, !191, !176}
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "E_invalid_user", scope: !178, file: !179, line: 106, type: !69, isLocal: true, isDefinition: true)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "E_invalid_group", scope: !178, file: !179, line: 107, type: !69, isLocal: true, isDefinition: true)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "version_etc_copyright", scope: !195, file: !198, line: 26, type: !199, isLocal: false, isDefinition: true)
!195 = distinct !DICompileUnit(language: DW_LANG_C99, file: !196, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !197, nameTableKind: None)
!196 = !DIFile(filename: "./lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!197 = !{!193}
!198 = !DIFile(filename: "lib/version-etc-fsf.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 376, elements: !200)
!200 = !{!201}
!201 = !DISubrange(count: 47)
!202 = distinct !DICompileUnit(language: DW_LANG_C99, file: !203, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !204, nameTableKind: None)
!203 = !DIFile(filename: "./lib/umaxtostr.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!204 = !{!205}
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !206, line: 102, baseType: !207)
!206 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !15, line: 73, baseType: !84)
!208 = distinct !DICompileUnit(language: DW_LANG_C99, file: !209, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!209 = !DIFile(filename: "./lib/se-selinux.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!210 = distinct !DICompileUnit(language: DW_LANG_C99, file: !211, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !212, nameTableKind: None)
!211 = !DIFile(filename: "./lib/version-etc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!212 = !{!8}
!213 = distinct !DICompileUnit(language: DW_LANG_C99, file: !214, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !215, nameTableKind: None)
!214 = !DIFile(filename: "./lib/xmalloc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!215 = !{!134, !6, !8}
!216 = distinct !DICompileUnit(language: DW_LANG_C99, file: !217, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!217 = !DIFile(filename: "./lib/xalloc-die.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!218 = distinct !DICompileUnit(language: DW_LANG_C99, file: !219, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!219 = !DIFile(filename: "./lib/xgetgroups.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!220 = distinct !DICompileUnit(language: DW_LANG_C99, file: !221, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !222, retainedTypes: !231, nameTableKind: None)
!221 = !DIFile(filename: "./lib/xstrtoul.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!222 = !{!223}
!223 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "strtol_error", file: !224, line: 25, baseType: !16, size: 32, elements: !225)
!224 = !DIFile(filename: "./lib/xstrtol.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!225 = !{!226, !227, !228, !229, !230}
!226 = !DIEnumerator(name: "LONGINT_OK", value: 0, isUnsigned: true)
!227 = !DIEnumerator(name: "LONGINT_OVERFLOW", value: 1, isUnsigned: true)
!228 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR", value: 2, isUnsigned: true)
!229 = !DIEnumerator(name: "LONGINT_INVALID_SUFFIX_CHAR_WITH_OVERFLOW", value: 3, isUnsigned: true)
!230 = !DIEnumerator(name: "LONGINT_INVALID", value: 4, isUnsigned: true)
!231 = !{!72, !133}
!232 = distinct !DICompileUnit(language: DW_LANG_C99, file: !233, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !234, nameTableKind: None)
!233 = !DIFile(filename: "./lib/mbrtowc.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!234 = !{!134}
!235 = distinct !DICompileUnit(language: DW_LANG_C99, file: !236, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !237, nameTableKind: None)
!236 = !DIFile(filename: "./lib/c-strcasecmp.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!237 = !{!238}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !240)
!240 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!241 = distinct !DICompileUnit(language: DW_LANG_C99, file: !242, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!242 = !DIFile(filename: "./lib/close-stream.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!243 = distinct !DICompileUnit(language: DW_LANG_C99, file: !244, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!244 = !DIFile(filename: "./lib/hard-locale.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!245 = distinct !DICompileUnit(language: DW_LANG_C99, file: !246, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !212, nameTableKind: None)
!246 = !DIFile(filename: "./lib/localcharset.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!247 = distinct !DICompileUnit(language: DW_LANG_C99, file: !248, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !249, nameTableKind: None)
!248 = !DIFile(filename: "./lib/mgetgroups.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!249 = !{!8, !21, !134}
!250 = distinct !DICompileUnit(language: DW_LANG_C99, file: !251, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !212, nameTableKind: None)
!251 = !DIFile(filename: "./lib/setlocale_null.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!252 = distinct !DICompileUnit(language: DW_LANG_C99, file: !253, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!253 = !DIFile(filename: "./lib/fclose.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!254 = distinct !DICompileUnit(language: DW_LANG_C99, file: !255, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !212, nameTableKind: None)
!255 = !DIFile(filename: "./lib/fflush.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!256 = distinct !DICompileUnit(language: DW_LANG_C99, file: !257, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !212, nameTableKind: None)
!257 = !DIFile(filename: "./lib/fseeko.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!258 = distinct !DICompileUnit(language: DW_LANG_C99, file: !259, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, nameTableKind: None)
!259 = !DIFile(filename: "./lib/c-ctype.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!260 = distinct !DICompileUnit(language: DW_LANG_C99, file: !261, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !262, nameTableKind: None)
!261 = !DIFile(filename: "./lib/getugroups.c", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!262 = !{!21, !8}
!263 = !{!"clang version 9.0.1-12 "}
!264 = !{i32 2, !"Dwarf Version", i32 4}
!265 = !{i32 2, !"Debug Info Version", i32 3}
!266 = !{i32 1, !"wchar_size", i32 4}
!267 = !{i32 1, !"ThinLTO", i32 0}
!268 = !{i32 1, !"EnableSplitLTOUnit", i32 0}
!269 = distinct !DISubprogram(name: "usage", scope: !3, file: !3, line: 90, type: !270, scopeLine: 91, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!270 = !DISubroutineType(types: !271)
!271 = !{null, !72}
!272 = !DILocalVariable(name: "status", arg: 1, scope: !269, file: !3, line: 90, type: !72)
!273 = !DILocation(line: 90, column: 12, scope: !269)
!274 = !DILocation(line: 92, column: 7, scope: !275)
!275 = distinct !DILexicalBlock(scope: !269, file: !3, line: 92, column: 7)
!276 = !DILocation(line: 92, column: 14, scope: !275)
!277 = !DILocation(line: 92, column: 7, scope: !269)
!278 = !DILocation(line: 93, column: 5, scope: !275)
!279 = !DILocation(line: 93, column: 5, scope: !280)
!280 = distinct !DILexicalBlock(scope: !275, file: !3, line: 93, column: 5)
!281 = !DILocation(line: 96, column: 15, scope: !282)
!282 = distinct !DILexicalBlock(scope: !275, file: !3, line: 95, column: 5)
!283 = !DILocation(line: 96, column: 55, scope: !282)
!284 = !DILocation(line: 96, column: 7, scope: !282)
!285 = !DILocation(line: 97, column: 7, scope: !282)
!286 = !DILocation(line: 102, column: 7, scope: !282)
!287 = !DILocation(line: 113, column: 7, scope: !282)
!288 = !DILocation(line: 114, column: 7, scope: !282)
!289 = !DILocation(line: 115, column: 7, scope: !282)
!290 = !DILocation(line: 119, column: 7, scope: !282)
!291 = !DILocation(line: 121, column: 9, scope: !269)
!292 = !DILocation(line: 121, column: 3, scope: !269)
!293 = distinct !DISubprogram(name: "emit_ancillary_info", scope: !294, file: !294, line: 634, type: !295, scopeLine: 635, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!294 = !DIFile(filename: "src/system.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!295 = !DISubroutineType(types: !296)
!296 = !{null, !69}
!297 = !DILocalVariable(name: "program", arg: 1, scope: !293, file: !294, line: 634, type: !69)
!298 = !DILocation(line: 634, column: 34, scope: !293)
!299 = !DILocalVariable(name: "infomap", scope: !293, file: !294, line: 636, type: !300)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 896, elements: !306)
!301 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !302)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "infomap", scope: !293, file: !294, line: 636, size: 128, elements: !303)
!303 = !{!304, !305}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "program", scope: !302, file: !294, line: 636, baseType: !69, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !302, file: !294, line: 636, baseType: !69, size: 64, offset: 64)
!306 = !{!307}
!307 = !DISubrange(count: 7)
!308 = !DILocation(line: 636, column: 67, scope: !293)
!309 = !DILocalVariable(name: "node", scope: !293, file: !294, line: 646, type: !69)
!310 = !DILocation(line: 646, column: 15, scope: !293)
!311 = !DILocation(line: 646, column: 22, scope: !293)
!312 = !DILocalVariable(name: "map_prog", scope: !293, file: !294, line: 647, type: !313)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!314 = !DILocation(line: 647, column: 25, scope: !293)
!315 = !DILocation(line: 647, column: 36, scope: !293)
!316 = !DILocation(line: 649, column: 3, scope: !293)
!317 = !DILocation(line: 649, column: 10, scope: !293)
!318 = !DILocation(line: 649, column: 20, scope: !293)
!319 = !DILocation(line: 649, column: 28, scope: !293)
!320 = !DILocation(line: 649, column: 33, scope: !293)
!321 = !DILocation(line: 649, column: 31, scope: !293)
!322 = !DILocation(line: 0, scope: !293)
!323 = !DILocation(line: 650, column: 13, scope: !293)
!324 = distinct !{!324, !316, !323}
!325 = !DILocation(line: 652, column: 7, scope: !326)
!326 = distinct !DILexicalBlock(scope: !293, file: !294, line: 652, column: 7)
!327 = !DILocation(line: 652, column: 17, scope: !326)
!328 = !DILocation(line: 652, column: 7, scope: !293)
!329 = !DILocation(line: 653, column: 12, scope: !326)
!330 = !DILocation(line: 653, column: 22, scope: !326)
!331 = !DILocation(line: 653, column: 10, scope: !326)
!332 = !DILocation(line: 653, column: 5, scope: !326)
!333 = !DILocation(line: 655, column: 11, scope: !293)
!334 = !DILocation(line: 655, column: 3, scope: !293)
!335 = !DILocalVariable(name: "lc_messages", scope: !293, file: !294, line: 659, type: !69)
!336 = !DILocation(line: 659, column: 15, scope: !293)
!337 = !DILocation(line: 659, column: 29, scope: !293)
!338 = !DILocation(line: 660, column: 7, scope: !339)
!339 = distinct !DILexicalBlock(scope: !293, file: !294, line: 660, column: 7)
!340 = !DILocation(line: 660, column: 19, scope: !339)
!341 = !DILocation(line: 660, column: 22, scope: !339)
!342 = !DILocation(line: 660, column: 7, scope: !293)
!343 = !DILocation(line: 666, column: 7, scope: !344)
!344 = distinct !DILexicalBlock(scope: !339, file: !294, line: 661, column: 5)
!345 = !DILocation(line: 668, column: 5, scope: !344)
!346 = !DILocation(line: 669, column: 11, scope: !293)
!347 = !DILocation(line: 670, column: 24, scope: !293)
!348 = !DILocation(line: 669, column: 3, scope: !293)
!349 = !DILocation(line: 671, column: 11, scope: !293)
!350 = !DILocation(line: 672, column: 11, scope: !293)
!351 = !DILocation(line: 672, column: 17, scope: !293)
!352 = !DILocation(line: 672, column: 25, scope: !293)
!353 = !DILocation(line: 672, column: 22, scope: !293)
!354 = !DILocation(line: 671, column: 3, scope: !293)
!355 = !DILocation(line: 673, column: 1, scope: !293)
!356 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 125, type: !357, scopeLine: 126, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!357 = !DISubroutineType(types: !358)
!358 = !{!72, !72, !184}
!359 = !DILocalVariable(name: "argc", arg: 1, scope: !356, file: !3, line: 125, type: !72)
!360 = !DILocation(line: 125, column: 11, scope: !356)
!361 = !DILocalVariable(name: "argv", arg: 2, scope: !356, file: !3, line: 125, type: !184)
!362 = !DILocation(line: 125, column: 24, scope: !356)
!363 = !DILocalVariable(name: "optc", scope: !356, file: !3, line: 127, type: !72)
!364 = !DILocation(line: 127, column: 7, scope: !356)
!365 = !DILocalVariable(name: "selinux_enabled", scope: !356, file: !3, line: 128, type: !72)
!366 = !DILocation(line: 128, column: 7, scope: !356)
!367 = !DILocalVariable(name: "smack_enabled", scope: !356, file: !3, line: 129, type: !27)
!368 = !DILocation(line: 129, column: 8, scope: !356)
!369 = !DILocation(line: 129, column: 24, scope: !356)
!370 = !DILocalVariable(name: "pw_name", scope: !356, file: !3, line: 130, type: !6)
!371 = !DILocation(line: 130, column: 9, scope: !356)
!372 = !DILocation(line: 133, column: 21, scope: !356)
!373 = !DILocation(line: 133, column: 3, scope: !356)
!374 = !DILocation(line: 134, column: 3, scope: !356)
!375 = !DILocation(line: 135, column: 3, scope: !356)
!376 = !DILocation(line: 136, column: 3, scope: !356)
!377 = !DILocation(line: 138, column: 3, scope: !356)
!378 = !DILocation(line: 140, column: 3, scope: !356)
!379 = !DILocation(line: 140, column: 31, scope: !356)
!380 = !DILocation(line: 140, column: 37, scope: !356)
!381 = !DILocation(line: 140, column: 18, scope: !356)
!382 = !DILocation(line: 140, column: 16, scope: !356)
!383 = !DILocation(line: 140, column: 72, scope: !356)
!384 = !DILocation(line: 142, column: 15, scope: !385)
!385 = distinct !DILexicalBlock(scope: !356, file: !3, line: 141, column: 5)
!386 = !DILocation(line: 142, column: 7, scope: !385)
!387 = !DILocation(line: 146, column: 11, scope: !388)
!388 = distinct !DILexicalBlock(scope: !385, file: !3, line: 143, column: 9)
!389 = !DILocation(line: 156, column: 16, scope: !390)
!390 = distinct !DILexicalBlock(scope: !388, file: !3, line: 156, column: 15)
!391 = !DILocation(line: 156, column: 15, scope: !388)
!392 = !DILocation(line: 157, column: 13, scope: !390)
!393 = !DILocation(line: 160, column: 24, scope: !388)
!394 = !DILocation(line: 161, column: 11, scope: !388)
!395 = !DILocation(line: 164, column: 22, scope: !388)
!396 = !DILocation(line: 165, column: 11, scope: !388)
!397 = !DILocation(line: 167, column: 20, scope: !388)
!398 = !DILocation(line: 168, column: 11, scope: !388)
!399 = !DILocation(line: 170, column: 20, scope: !388)
!400 = !DILocation(line: 171, column: 11, scope: !388)
!401 = !DILocation(line: 173, column: 21, scope: !388)
!402 = !DILocation(line: 174, column: 11, scope: !388)
!403 = !DILocation(line: 176, column: 20, scope: !388)
!404 = !DILocation(line: 177, column: 11, scope: !388)
!405 = !DILocation(line: 179, column: 27, scope: !388)
!406 = !DILocation(line: 180, column: 11, scope: !388)
!407 = !DILocation(line: 181, column: 9, scope: !388)
!408 = !DILocation(line: 182, column: 9, scope: !388)
!409 = !DILocation(line: 184, column: 11, scope: !388)
!410 = distinct !{!410, !378, !411}
!411 = !DILocation(line: 186, column: 5, scope: !356)
!412 = !DILocalVariable(name: "n_ids", scope: !356, file: !3, line: 188, type: !134)
!413 = !DILocation(line: 188, column: 10, scope: !356)
!414 = !DILocation(line: 188, column: 18, scope: !356)
!415 = !DILocation(line: 188, column: 25, scope: !356)
!416 = !DILocation(line: 188, column: 23, scope: !356)
!417 = !DILocation(line: 190, column: 7, scope: !418)
!418 = distinct !DILexicalBlock(scope: !356, file: !3, line: 190, column: 7)
!419 = !DILocation(line: 190, column: 13, scope: !418)
!420 = !DILocation(line: 190, column: 16, scope: !418)
!421 = !DILocation(line: 190, column: 7, scope: !356)
!422 = !DILocation(line: 191, column: 5, scope: !418)
!423 = !DILocation(line: 194, column: 7, scope: !424)
!424 = distinct !DILexicalBlock(scope: !356, file: !3, line: 194, column: 7)
!425 = !DILocation(line: 194, column: 19, scope: !424)
!426 = !DILocation(line: 194, column: 17, scope: !424)
!427 = !DILocation(line: 194, column: 32, scope: !424)
!428 = !DILocation(line: 194, column: 30, scope: !424)
!429 = !DILocation(line: 194, column: 50, scope: !424)
!430 = !DILocation(line: 194, column: 48, scope: !424)
!431 = !DILocation(line: 194, column: 63, scope: !424)
!432 = !DILocation(line: 194, column: 7, scope: !356)
!433 = !DILocation(line: 195, column: 5, scope: !424)
!434 = !DILocalVariable(name: "default_format", scope: !356, file: !3, line: 197, type: !27)
!435 = !DILocation(line: 197, column: 8, scope: !356)
!436 = !DILocation(line: 197, column: 28, scope: !356)
!437 = !DILocation(line: 198, column: 28, scope: !356)
!438 = !DILocation(line: 198, column: 31, scope: !356)
!439 = !DILocation(line: 199, column: 28, scope: !356)
!440 = !DILocation(line: 199, column: 31, scope: !356)
!441 = !DILocation(line: 200, column: 28, scope: !356)
!442 = !DILocation(line: 200, column: 31, scope: !356)
!443 = !DILocation(line: 197, column: 25, scope: !356)
!444 = !DILocation(line: 202, column: 7, scope: !445)
!445 = distinct !DILexicalBlock(scope: !356, file: !3, line: 202, column: 7)
!446 = !DILocation(line: 202, column: 22, scope: !445)
!447 = !DILocation(line: 202, column: 26, scope: !445)
!448 = !DILocation(line: 202, column: 35, scope: !445)
!449 = !DILocation(line: 202, column: 38, scope: !445)
!450 = !DILocation(line: 202, column: 7, scope: !356)
!451 = !DILocation(line: 203, column: 5, scope: !445)
!452 = !DILocation(line: 206, column: 7, scope: !453)
!453 = distinct !DILexicalBlock(scope: !356, file: !3, line: 206, column: 7)
!454 = !DILocation(line: 206, column: 22, scope: !453)
!455 = !DILocation(line: 206, column: 25, scope: !453)
!456 = !DILocation(line: 206, column: 7, scope: !356)
!457 = !DILocation(line: 207, column: 5, scope: !453)
!458 = !DILocation(line: 215, column: 7, scope: !459)
!459 = distinct !DILexicalBlock(scope: !356, file: !3, line: 215, column: 7)
!460 = !DILocation(line: 215, column: 13, scope: !459)
!461 = !DILocation(line: 216, column: 11, scope: !459)
!462 = !DILocation(line: 217, column: 11, scope: !459)
!463 = !DILocation(line: 217, column: 15, scope: !459)
!464 = !DILocation(line: 217, column: 30, scope: !459)
!465 = !DILocation(line: 217, column: 35, scope: !459)
!466 = !DILocation(line: 215, column: 7, scope: !356)
!467 = !DILocation(line: 220, column: 12, scope: !468)
!468 = distinct !DILexicalBlock(scope: !469, file: !3, line: 220, column: 11)
!469 = distinct !DILexicalBlock(scope: !459, file: !3, line: 218, column: 5)
!470 = !DILocation(line: 220, column: 28, scope: !468)
!471 = !DILocation(line: 220, column: 31, scope: !468)
!472 = !DILocation(line: 220, column: 49, scope: !468)
!473 = !DILocation(line: 220, column: 52, scope: !468)
!474 = !DILocation(line: 221, column: 11, scope: !468)
!475 = !DILocation(line: 221, column: 15, scope: !468)
!476 = !DILocation(line: 222, column: 15, scope: !468)
!477 = !DILocation(line: 222, column: 18, scope: !468)
!478 = !DILocation(line: 222, column: 55, scope: !468)
!479 = !DILocation(line: 223, column: 15, scope: !468)
!480 = !DILocation(line: 223, column: 18, scope: !468)
!481 = !DILocation(line: 220, column: 11, scope: !469)
!482 = !DILocation(line: 224, column: 9, scope: !468)
!483 = !DILocation(line: 225, column: 5, scope: !469)
!484 = !DILocation(line: 227, column: 7, scope: !485)
!485 = distinct !DILexicalBlock(scope: !356, file: !3, line: 227, column: 7)
!486 = !DILocation(line: 227, column: 13, scope: !485)
!487 = !DILocation(line: 227, column: 7, scope: !356)
!488 = !DILocation(line: 229, column: 24, scope: !489)
!489 = distinct !DILexicalBlock(scope: !485, file: !3, line: 228, column: 5)
!490 = !DILocation(line: 229, column: 30, scope: !489)
!491 = !DILocation(line: 229, column: 22, scope: !489)
!492 = !DILocation(line: 234, column: 16, scope: !489)
!493 = !DILocation(line: 234, column: 13, scope: !489)
!494 = !DILocation(line: 236, column: 7, scope: !489)
!495 = !DILocation(line: 236, column: 14, scope: !496)
!496 = distinct !DILexicalBlock(scope: !497, file: !3, line: 236, column: 7)
!497 = distinct !DILexicalBlock(scope: !489, file: !3, line: 236, column: 7)
!498 = !DILocation(line: 236, column: 23, scope: !496)
!499 = !DILocation(line: 236, column: 21, scope: !496)
!500 = !DILocation(line: 236, column: 7, scope: !497)
!501 = !DILocalVariable(name: "pwd", scope: !502, file: !3, line: 238, type: !503)
!502 = distinct !DILexicalBlock(scope: !496, file: !3, line: 237, column: 9)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !505, line: 49, size: 384, elements: !506)
!505 = !DIFile(filename: "/usr/include/pwd.h", directory: "")
!506 = !{!507, !508, !509, !510, !511, !512, !513}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !504, file: !505, line: 51, baseType: !6, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !504, file: !505, line: 52, baseType: !6, size: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !504, file: !505, line: 54, baseType: !14, size: 32, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !504, file: !505, line: 55, baseType: !22, size: 32, offset: 160)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !504, file: !505, line: 56, baseType: !6, size: 64, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !504, file: !505, line: 57, baseType: !6, size: 64, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !504, file: !505, line: 58, baseType: !6, size: 64, offset: 320)
!514 = !DILocation(line: 238, column: 26, scope: !502)
!515 = !DILocalVariable(name: "spec", scope: !502, file: !3, line: 239, type: !69)
!516 = !DILocation(line: 239, column: 23, scope: !502)
!517 = !DILocation(line: 239, column: 30, scope: !502)
!518 = !DILocation(line: 239, column: 35, scope: !502)
!519 = !DILocation(line: 243, column: 16, scope: !520)
!520 = distinct !DILexicalBlock(scope: !502, file: !3, line: 243, column: 15)
!521 = !DILocation(line: 243, column: 15, scope: !520)
!522 = !DILocation(line: 243, column: 15, scope: !502)
!523 = !DILocation(line: 245, column: 36, scope: !524)
!524 = distinct !DILexicalBlock(scope: !525, file: !3, line: 245, column: 19)
!525 = distinct !DILexicalBlock(scope: !520, file: !3, line: 244, column: 13)
!526 = !DILocation(line: 245, column: 19, scope: !524)
!527 = !DILocation(line: 245, column: 67, scope: !524)
!528 = !DILocation(line: 245, column: 19, scope: !525)
!529 = !DILocation(line: 250, column: 35, scope: !530)
!530 = distinct !DILexicalBlock(scope: !524, file: !3, line: 246, column: 17)
!531 = !DILocation(line: 250, column: 25, scope: !530)
!532 = !DILocation(line: 250, column: 23, scope: !530)
!533 = !DILocation(line: 251, column: 17, scope: !530)
!534 = !DILocation(line: 252, column: 13, scope: !525)
!535 = !DILocation(line: 253, column: 15, scope: !536)
!536 = distinct !DILexicalBlock(scope: !502, file: !3, line: 253, column: 15)
!537 = !DILocation(line: 253, column: 19, scope: !536)
!538 = !DILocation(line: 253, column: 15, scope: !502)
!539 = !DILocation(line: 255, column: 25, scope: !540)
!540 = distinct !DILexicalBlock(scope: !536, file: !3, line: 254, column: 13)
!541 = !DILocation(line: 255, column: 32, scope: !540)
!542 = !DILocation(line: 255, column: 62, scope: !540)
!543 = !DILocation(line: 255, column: 67, scope: !540)
!544 = !DILocation(line: 255, column: 55, scope: !540)
!545 = !DILocation(line: 255, column: 15, scope: !540)
!546 = !DILocation(line: 256, column: 18, scope: !540)
!547 = !DILocation(line: 257, column: 15, scope: !540)
!548 = !DILocation(line: 259, column: 30, scope: !502)
!549 = !DILocation(line: 259, column: 35, scope: !502)
!550 = !DILocation(line: 259, column: 21, scope: !502)
!551 = !DILocation(line: 259, column: 19, scope: !502)
!552 = !DILocation(line: 260, column: 25, scope: !502)
!553 = !DILocation(line: 260, column: 30, scope: !502)
!554 = !DILocation(line: 260, column: 23, scope: !502)
!555 = !DILocation(line: 260, column: 16, scope: !502)
!556 = !DILocation(line: 261, column: 25, scope: !502)
!557 = !DILocation(line: 261, column: 30, scope: !502)
!558 = !DILocation(line: 261, column: 23, scope: !502)
!559 = !DILocation(line: 261, column: 16, scope: !502)
!560 = !DILocation(line: 262, column: 24, scope: !502)
!561 = !DILocation(line: 262, column: 11, scope: !502)
!562 = !DILocation(line: 263, column: 17, scope: !502)
!563 = !DILocation(line: 263, column: 11, scope: !502)
!564 = !DILocation(line: 264, column: 9, scope: !502)
!565 = !DILocation(line: 236, column: 36, scope: !496)
!566 = !DILocation(line: 236, column: 7, scope: !496)
!567 = distinct !{!567, !500, !568}
!568 = !DILocation(line: 264, column: 9, scope: !497)
!569 = !DILocation(line: 265, column: 5, scope: !489)
!570 = !DILocalVariable(name: "NO_UID", scope: !571, file: !3, line: 271, type: !12)
!571 = distinct !DILexicalBlock(scope: !485, file: !3, line: 267, column: 5)
!572 = !DILocation(line: 271, column: 13, scope: !571)
!573 = !DILocalVariable(name: "NO_GID", scope: !571, file: !3, line: 272, type: !21)
!574 = !DILocation(line: 272, column: 13, scope: !571)
!575 = !DILocation(line: 274, column: 11, scope: !576)
!576 = distinct !DILexicalBlock(scope: !571, file: !3, line: 274, column: 11)
!577 = !DILocation(line: 274, column: 11, scope: !571)
!578 = !DILocation(line: 274, column: 24, scope: !576)
!579 = !DILocation(line: 275, column: 14, scope: !576)
!580 = !DILocation(line: 275, column: 25, scope: !576)
!581 = !DILocation(line: 275, column: 29, scope: !576)
!582 = !DILocation(line: 275, column: 45, scope: !576)
!583 = !DILocation(line: 275, column: 49, scope: !576)
!584 = !DILocation(line: 277, column: 11, scope: !585)
!585 = distinct !DILexicalBlock(scope: !576, file: !3, line: 276, column: 9)
!586 = !DILocation(line: 277, column: 17, scope: !585)
!587 = !DILocation(line: 278, column: 18, scope: !585)
!588 = !DILocation(line: 278, column: 16, scope: !585)
!589 = !DILocation(line: 279, column: 15, scope: !590)
!590 = distinct !DILexicalBlock(scope: !585, file: !3, line: 279, column: 15)
!591 = !DILocation(line: 279, column: 23, scope: !590)
!592 = !DILocation(line: 279, column: 20, scope: !590)
!593 = !DILocation(line: 279, column: 30, scope: !590)
!594 = !DILocation(line: 279, column: 33, scope: !590)
!595 = !DILocation(line: 279, column: 15, scope: !585)
!596 = !DILocation(line: 280, column: 13, scope: !590)
!597 = !DILocation(line: 281, column: 9, scope: !585)
!598 = !DILocation(line: 283, column: 11, scope: !599)
!599 = distinct !DILexicalBlock(scope: !571, file: !3, line: 283, column: 11)
!600 = !DILocation(line: 283, column: 11, scope: !571)
!601 = !DILocation(line: 283, column: 23, scope: !599)
!602 = !DILocation(line: 284, column: 14, scope: !599)
!603 = !DILocation(line: 284, column: 25, scope: !599)
!604 = !DILocation(line: 284, column: 29, scope: !599)
!605 = !DILocation(line: 284, column: 45, scope: !599)
!606 = !DILocation(line: 284, column: 49, scope: !599)
!607 = !DILocation(line: 286, column: 11, scope: !608)
!608 = distinct !DILexicalBlock(scope: !599, file: !3, line: 285, column: 9)
!609 = !DILocation(line: 286, column: 17, scope: !608)
!610 = !DILocation(line: 287, column: 18, scope: !608)
!611 = !DILocation(line: 287, column: 16, scope: !608)
!612 = !DILocation(line: 288, column: 15, scope: !613)
!613 = distinct !DILexicalBlock(scope: !608, file: !3, line: 288, column: 15)
!614 = !DILocation(line: 288, column: 23, scope: !613)
!615 = !DILocation(line: 288, column: 20, scope: !613)
!616 = !DILocation(line: 288, column: 30, scope: !613)
!617 = !DILocation(line: 288, column: 33, scope: !613)
!618 = !DILocation(line: 288, column: 15, scope: !608)
!619 = !DILocation(line: 289, column: 13, scope: !613)
!620 = !DILocation(line: 290, column: 9, scope: !608)
!621 = !DILocation(line: 292, column: 12, scope: !622)
!622 = distinct !DILexicalBlock(scope: !571, file: !3, line: 292, column: 11)
!623 = !DILocation(line: 292, column: 22, scope: !622)
!624 = !DILocation(line: 292, column: 26, scope: !622)
!625 = !DILocation(line: 292, column: 37, scope: !622)
!626 = !DILocation(line: 292, column: 40, scope: !622)
!627 = !DILocation(line: 292, column: 56, scope: !622)
!628 = !DILocation(line: 292, column: 60, scope: !622)
!629 = !DILocation(line: 292, column: 11, scope: !571)
!630 = !DILocation(line: 294, column: 11, scope: !631)
!631 = distinct !DILexicalBlock(scope: !622, file: !3, line: 293, column: 9)
!632 = !DILocation(line: 294, column: 17, scope: !631)
!633 = !DILocation(line: 295, column: 18, scope: !631)
!634 = !DILocation(line: 295, column: 16, scope: !631)
!635 = !DILocation(line: 296, column: 15, scope: !636)
!636 = distinct !DILexicalBlock(scope: !631, file: !3, line: 296, column: 15)
!637 = !DILocation(line: 296, column: 23, scope: !636)
!638 = !DILocation(line: 296, column: 20, scope: !636)
!639 = !DILocation(line: 296, column: 30, scope: !636)
!640 = !DILocation(line: 296, column: 33, scope: !636)
!641 = !DILocation(line: 296, column: 15, scope: !631)
!642 = !DILocation(line: 297, column: 13, scope: !636)
!643 = !DILocation(line: 299, column: 11, scope: !631)
!644 = !DILocation(line: 299, column: 17, scope: !631)
!645 = !DILocation(line: 300, column: 18, scope: !631)
!646 = !DILocation(line: 300, column: 16, scope: !631)
!647 = !DILocation(line: 301, column: 15, scope: !648)
!648 = distinct !DILexicalBlock(scope: !631, file: !3, line: 301, column: 15)
!649 = !DILocation(line: 301, column: 23, scope: !648)
!650 = !DILocation(line: 301, column: 20, scope: !648)
!651 = !DILocation(line: 301, column: 30, scope: !648)
!652 = !DILocation(line: 301, column: 33, scope: !648)
!653 = !DILocation(line: 301, column: 15, scope: !631)
!654 = !DILocation(line: 302, column: 13, scope: !648)
!655 = !DILocation(line: 303, column: 9, scope: !631)
!656 = !DILocation(line: 304, column: 22, scope: !571)
!657 = !DILocation(line: 304, column: 9, scope: !571)
!658 = !DILocation(line: 307, column: 10, scope: !356)
!659 = !DILocation(line: 307, column: 3, scope: !356)
!660 = !DILocalVariable(name: "spec", scope: !661, file: !3, line: 239, type: !69)
!661 = distinct !DILexicalBlock(scope: !662, file: !3, line: 237, column: 9)
!662 = distinct !DILexicalBlock(scope: !663, file: !3, line: 236, column: 7)
!663 = distinct !DILexicalBlock(scope: !664, file: !3, line: 236, column: 7)
!664 = distinct !DILexicalBlock(scope: !665, file: !3, line: 228, column: 5)
!665 = distinct !DILexicalBlock(scope: !666, file: !3, line: 227, column: 7)
!666 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 125, type: !357, scopeLine: 126, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !667, retainedNodes: !4)
!667 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !668, nameTableKind: None)
!668 = !{!669, !671, !673, !675, !677, !687, !689, !691, !693, !695, !697, !699, !701, !703, !705, !707, !710}
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "ruid", scope: !667, file: !3, line: 64, type: !12, isLocal: true, isDefinition: true)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(name: "euid", scope: !667, file: !3, line: 64, type: !12, isLocal: true, isDefinition: true)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "rgid", scope: !667, file: !3, line: 65, type: !21, isLocal: true, isDefinition: true)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "egid", scope: !667, file: !3, line: 65, type: !21, isLocal: true, isDefinition: true)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(name: "longopts", scope: !667, file: !3, line: 75, type: !679, isLocal: true, isDefinition: true)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !680, size: 2560, elements: !76)
!680 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !681)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !66, line: 50, size: 256, elements: !682)
!682 = !{!683, !684, !685, !686}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !681, file: !66, line: 52, baseType: !69, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !681, file: !66, line: 55, baseType: !72, size: 32, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !681, file: !66, line: 56, baseType: !74, size: 64, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !681, file: !66, line: 57, baseType: !72, size: 32, offset: 192)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "just_context", scope: !667, file: !3, line: 45, type: !27, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "just_group", scope: !667, file: !3, line: 51, type: !27, isLocal: true, isDefinition: true)
!691 = !DIGlobalVariableExpression(var: !692, expr: !DIExpression())
!692 = distinct !DIGlobalVariable(name: "use_name", scope: !667, file: !3, line: 61, type: !27, isLocal: true, isDefinition: true)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(name: "use_real", scope: !667, file: !3, line: 53, type: !27, isLocal: true, isDefinition: true)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(name: "just_user", scope: !667, file: !3, line: 55, type: !27, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "opt_zero", scope: !667, file: !3, line: 47, type: !27, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(name: "just_group_list", scope: !667, file: !3, line: 49, type: !27, isLocal: true, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(name: "context", scope: !667, file: !3, line: 69, type: !6, isLocal: true, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "multiple_users", scope: !667, file: !3, line: 59, type: !27, isLocal: true, isDefinition: true)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "ok", scope: !667, file: !3, line: 57, type: !27, isLocal: true, isDefinition: true)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(name: "buf", scope: !709, file: !3, line: 327, type: !53, isLocal: true, isDefinition: true)
!709 = distinct !DISubprogram(name: "uidtostr_ptr", scope: !3, file: !3, line: 325, type: !49, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !667, retainedNodes: !4)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(name: "buf", scope: !712, file: !3, line: 316, type: !53, isLocal: true, isDefinition: true)
!712 = distinct !DISubprogram(name: "gidtostr_ptr", scope: !3, file: !3, line: 314, type: !59, scopeLine: 315, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !667, retainedNodes: !4)
!713 = distinct !DISubprogram(name: "is_smack_enabled", scope: !714, file: !714, line: 39, type: !715, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!714 = !DIFile(filename: "./lib/smack.h", directory: "/home/newton/cfiles/coreutils/coreutils-8.32")
!715 = !DISubroutineType(types: !716)
!716 = !{!27}
!717 = !DILocation(line: 44, column: 3, scope: !713)
!718 = distinct !DISubprogram(name: "smack_new_label_from_self", scope: !714, file: !714, line: 26, type: !719, scopeLine: 27, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!719 = !DISubroutineType(types: !720)
!720 = !{!721, !184}
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !722, line: 77, baseType: !723)
!722 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !15, line: 193, baseType: !724)
!724 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!725 = !DILocalVariable(name: "label", arg: 1, scope: !718, file: !714, line: 26, type: !184)
!726 = !DILocation(line: 26, column: 35, scope: !718)
!727 = !DILocation(line: 28, column: 3, scope: !718)
!728 = distinct !DISubprogram(name: "print_stuff", scope: !3, file: !3, line: 432, type: !295, scopeLine: 433, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!729 = !DILocalVariable(name: "pw_name", arg: 1, scope: !728, file: !3, line: 432, type: !69)
!730 = !DILocation(line: 432, column: 26, scope: !728)
!731 = !DILocation(line: 434, column: 7, scope: !732)
!732 = distinct !DILexicalBlock(scope: !728, file: !3, line: 434, column: 7)
!733 = !DILocation(line: 434, column: 7, scope: !728)
!734 = !DILocation(line: 435, column: 19, scope: !732)
!735 = !DILocation(line: 435, column: 30, scope: !732)
!736 = !DILocation(line: 435, column: 37, scope: !732)
!737 = !DILocation(line: 435, column: 7, scope: !732)
!738 = !DILocation(line: 442, column: 12, scope: !739)
!739 = distinct !DILexicalBlock(scope: !732, file: !3, line: 442, column: 12)
!740 = !DILocation(line: 442, column: 12, scope: !732)
!741 = !DILocation(line: 443, column: 24, scope: !739)
!742 = !DILocation(line: 443, column: 35, scope: !739)
!743 = !DILocation(line: 443, column: 42, scope: !739)
!744 = !DILocation(line: 443, column: 48, scope: !739)
!745 = !DILocation(line: 443, column: 11, scope: !739)
!746 = !DILocation(line: 443, column: 8, scope: !739)
!747 = !DILocation(line: 443, column: 5, scope: !739)
!748 = !DILocation(line: 444, column: 12, scope: !749)
!749 = distinct !DILexicalBlock(scope: !739, file: !3, line: 444, column: 12)
!750 = !DILocation(line: 444, column: 12, scope: !739)
!751 = !DILocation(line: 445, column: 29, scope: !749)
!752 = !DILocation(line: 445, column: 38, scope: !749)
!753 = !DILocation(line: 445, column: 44, scope: !749)
!754 = !DILocation(line: 445, column: 50, scope: !749)
!755 = !DILocation(line: 446, column: 29, scope: !749)
!756 = !DILocation(line: 446, column: 39, scope: !749)
!757 = !DILocation(line: 445, column: 11, scope: !749)
!758 = !DILocation(line: 445, column: 8, scope: !749)
!759 = !DILocation(line: 445, column: 5, scope: !749)
!760 = !DILocation(line: 447, column: 12, scope: !761)
!761 = distinct !DILexicalBlock(scope: !749, file: !3, line: 447, column: 12)
!762 = !DILocation(line: 447, column: 12, scope: !749)
!763 = !DILocation(line: 448, column: 5, scope: !761)
!764 = !DILocation(line: 450, column: 22, scope: !761)
!765 = !DILocation(line: 450, column: 5, scope: !761)
!766 = !DILocation(line: 455, column: 7, scope: !767)
!767 = distinct !DILexicalBlock(scope: !728, file: !3, line: 455, column: 7)
!768 = !DILocation(line: 455, column: 16, scope: !767)
!769 = !DILocation(line: 455, column: 19, scope: !767)
!770 = !DILocation(line: 455, column: 35, scope: !767)
!771 = !DILocation(line: 455, column: 38, scope: !767)
!772 = !DILocation(line: 455, column: 7, scope: !728)
!773 = !DILocation(line: 457, column: 7, scope: !774)
!774 = distinct !DILexicalBlock(scope: !767, file: !3, line: 456, column: 5)
!775 = !DILocation(line: 458, column: 7, scope: !774)
!776 = !DILocation(line: 459, column: 5, scope: !774)
!777 = !DILocation(line: 462, column: 7, scope: !778)
!778 = distinct !DILexicalBlock(scope: !767, file: !3, line: 461, column: 5)
!779 = !DILocation(line: 464, column: 1, scope: !728)
!780 = distinct !DISubprogram(name: "print_user", scope: !3, file: !3, line: 335, type: !781, scopeLine: 336, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!781 = !DISubroutineType(types: !782)
!782 = !{null, !12}
!783 = !DILocalVariable(name: "uid", arg: 1, scope: !780, file: !3, line: 335, type: !12)
!784 = !DILocation(line: 335, column: 19, scope: !780)
!785 = !DILocalVariable(name: "pwd", scope: !780, file: !3, line: 337, type: !503)
!786 = !DILocation(line: 337, column: 18, scope: !780)
!787 = !DILocation(line: 339, column: 7, scope: !788)
!788 = distinct !DILexicalBlock(scope: !780, file: !3, line: 339, column: 7)
!789 = !DILocation(line: 339, column: 7, scope: !780)
!790 = !DILocation(line: 341, column: 23, scope: !791)
!791 = distinct !DILexicalBlock(scope: !788, file: !3, line: 340, column: 5)
!792 = !DILocation(line: 341, column: 13, scope: !791)
!793 = !DILocation(line: 341, column: 11, scope: !791)
!794 = !DILocation(line: 342, column: 11, scope: !795)
!795 = distinct !DILexicalBlock(scope: !791, file: !3, line: 342, column: 11)
!796 = !DILocation(line: 342, column: 15, scope: !795)
!797 = !DILocation(line: 342, column: 11, scope: !791)
!798 = !DILocation(line: 344, column: 24, scope: !799)
!799 = distinct !DILexicalBlock(scope: !795, file: !3, line: 343, column: 9)
!800 = !DILocation(line: 345, column: 18, scope: !799)
!801 = !DILocation(line: 344, column: 11, scope: !799)
!802 = !DILocation(line: 346, column: 14, scope: !799)
!803 = !DILocation(line: 347, column: 9, scope: !799)
!804 = !DILocation(line: 348, column: 5, scope: !791)
!805 = !DILocalVariable(name: "s", scope: !780, file: !3, line: 350, type: !6)
!806 = !DILocation(line: 350, column: 9, scope: !780)
!807 = !DILocation(line: 350, column: 13, scope: !780)
!808 = !DILocation(line: 350, column: 19, scope: !780)
!809 = !DILocation(line: 350, column: 24, scope: !780)
!810 = !DILocation(line: 350, column: 34, scope: !780)
!811 = !DILocation(line: 351, column: 3, scope: !780)
!812 = !DILocation(line: 352, column: 1, scope: !780)
!813 = distinct !DISubprogram(name: "print_full_info", scope: !3, file: !3, line: 357, type: !295, scopeLine: 358, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!814 = !DILocalVariable(name: "username", arg: 1, scope: !813, file: !3, line: 357, type: !69)
!815 = !DILocation(line: 357, column: 30, scope: !813)
!816 = !DILocalVariable(name: "pwd", scope: !813, file: !3, line: 359, type: !503)
!817 = !DILocation(line: 359, column: 18, scope: !813)
!818 = !DILocalVariable(name: "grp", scope: !813, file: !3, line: 360, type: !819)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !821, line: 42, size: 256, elements: !822)
!821 = !DIFile(filename: "/usr/include/grp.h", directory: "")
!822 = !{!823, !824, !825, !826}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !820, file: !821, line: 44, baseType: !6, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !820, file: !821, line: 45, baseType: !6, size: 64, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !820, file: !821, line: 46, baseType: !22, size: 32, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !820, file: !821, line: 47, baseType: !184, size: 64, offset: 192)
!827 = !DILocation(line: 360, column: 17, scope: !813)
!828 = !DILocation(line: 362, column: 11, scope: !813)
!829 = !DILocation(line: 362, column: 24, scope: !813)
!830 = !DILocation(line: 362, column: 3, scope: !813)
!831 = !DILocation(line: 363, column: 19, scope: !813)
!832 = !DILocation(line: 363, column: 9, scope: !813)
!833 = !DILocation(line: 363, column: 7, scope: !813)
!834 = !DILocation(line: 364, column: 7, scope: !835)
!835 = distinct !DILexicalBlock(scope: !813, file: !3, line: 364, column: 7)
!836 = !DILocation(line: 364, column: 7, scope: !813)
!837 = !DILocation(line: 365, column: 21, scope: !835)
!838 = !DILocation(line: 365, column: 26, scope: !835)
!839 = !DILocation(line: 365, column: 5, scope: !835)
!840 = !DILocation(line: 367, column: 11, scope: !813)
!841 = !DILocation(line: 367, column: 25, scope: !813)
!842 = !DILocation(line: 367, column: 3, scope: !813)
!843 = !DILocation(line: 368, column: 19, scope: !813)
!844 = !DILocation(line: 368, column: 9, scope: !813)
!845 = !DILocation(line: 368, column: 7, scope: !813)
!846 = !DILocation(line: 369, column: 7, scope: !847)
!847 = distinct !DILexicalBlock(scope: !813, file: !3, line: 369, column: 7)
!848 = !DILocation(line: 369, column: 7, scope: !813)
!849 = !DILocation(line: 370, column: 21, scope: !847)
!850 = !DILocation(line: 370, column: 26, scope: !847)
!851 = !DILocation(line: 370, column: 5, scope: !847)
!852 = !DILocation(line: 372, column: 7, scope: !853)
!853 = distinct !DILexicalBlock(scope: !813, file: !3, line: 372, column: 7)
!854 = !DILocation(line: 372, column: 15, scope: !853)
!855 = !DILocation(line: 372, column: 12, scope: !853)
!856 = !DILocation(line: 372, column: 7, scope: !813)
!857 = !DILocation(line: 374, column: 15, scope: !858)
!858 = distinct !DILexicalBlock(scope: !853, file: !3, line: 373, column: 5)
!859 = !DILocation(line: 374, column: 30, scope: !858)
!860 = !DILocation(line: 374, column: 7, scope: !858)
!861 = !DILocation(line: 375, column: 23, scope: !858)
!862 = !DILocation(line: 375, column: 13, scope: !858)
!863 = !DILocation(line: 375, column: 11, scope: !858)
!864 = !DILocation(line: 376, column: 11, scope: !865)
!865 = distinct !DILexicalBlock(scope: !858, file: !3, line: 376, column: 11)
!866 = !DILocation(line: 376, column: 11, scope: !858)
!867 = !DILocation(line: 377, column: 25, scope: !865)
!868 = !DILocation(line: 377, column: 30, scope: !865)
!869 = !DILocation(line: 377, column: 9, scope: !865)
!870 = !DILocation(line: 378, column: 5, scope: !858)
!871 = !DILocation(line: 380, column: 7, scope: !872)
!872 = distinct !DILexicalBlock(scope: !813, file: !3, line: 380, column: 7)
!873 = !DILocation(line: 380, column: 15, scope: !872)
!874 = !DILocation(line: 380, column: 12, scope: !872)
!875 = !DILocation(line: 380, column: 7, scope: !813)
!876 = !DILocation(line: 382, column: 15, scope: !877)
!877 = distinct !DILexicalBlock(scope: !872, file: !3, line: 381, column: 5)
!878 = !DILocation(line: 382, column: 30, scope: !877)
!879 = !DILocation(line: 382, column: 7, scope: !877)
!880 = !DILocation(line: 383, column: 23, scope: !877)
!881 = !DILocation(line: 383, column: 13, scope: !877)
!882 = !DILocation(line: 383, column: 11, scope: !877)
!883 = !DILocation(line: 384, column: 11, scope: !884)
!884 = distinct !DILexicalBlock(scope: !877, file: !3, line: 384, column: 11)
!885 = !DILocation(line: 384, column: 11, scope: !877)
!886 = !DILocation(line: 385, column: 25, scope: !884)
!887 = !DILocation(line: 385, column: 30, scope: !884)
!888 = !DILocation(line: 385, column: 9, scope: !884)
!889 = !DILocation(line: 386, column: 5, scope: !877)
!890 = !DILocalVariable(name: "groups", scope: !891, file: !3, line: 389, type: !183)
!891 = distinct !DILexicalBlock(scope: !813, file: !3, line: 388, column: 3)
!892 = !DILocation(line: 389, column: 12, scope: !891)
!893 = !DILocalVariable(name: "primary_group", scope: !891, file: !3, line: 391, type: !21)
!894 = !DILocation(line: 391, column: 11, scope: !891)
!895 = !DILocation(line: 392, column: 9, scope: !896)
!896 = distinct !DILexicalBlock(scope: !891, file: !3, line: 392, column: 9)
!897 = !DILocation(line: 392, column: 9, scope: !891)
!898 = !DILocation(line: 393, column: 23, scope: !896)
!899 = !DILocation(line: 393, column: 29, scope: !896)
!900 = !DILocation(line: 393, column: 34, scope: !896)
!901 = !DILocation(line: 393, column: 21, scope: !896)
!902 = !DILocation(line: 393, column: 7, scope: !896)
!903 = !DILocation(line: 395, column: 23, scope: !896)
!904 = !DILocation(line: 395, column: 21, scope: !896)
!905 = !DILocalVariable(name: "n_groups", scope: !891, file: !3, line: 397, type: !72)
!906 = !DILocation(line: 397, column: 9, scope: !891)
!907 = !DILocation(line: 397, column: 32, scope: !891)
!908 = !DILocation(line: 397, column: 42, scope: !891)
!909 = !DILocation(line: 397, column: 20, scope: !891)
!910 = !DILocation(line: 398, column: 9, scope: !911)
!911 = distinct !DILexicalBlock(scope: !891, file: !3, line: 398, column: 9)
!912 = !DILocation(line: 398, column: 18, scope: !911)
!913 = !DILocation(line: 398, column: 9, scope: !891)
!914 = !DILocation(line: 400, column: 13, scope: !915)
!915 = distinct !DILexicalBlock(scope: !916, file: !3, line: 400, column: 13)
!916 = distinct !DILexicalBlock(scope: !911, file: !3, line: 399, column: 7)
!917 = !DILocation(line: 400, column: 13, scope: !916)
!918 = !DILocation(line: 401, column: 21, scope: !915)
!919 = !DILocation(line: 401, column: 28, scope: !915)
!920 = !DILocation(line: 402, column: 25, scope: !915)
!921 = !DILocation(line: 402, column: 18, scope: !915)
!922 = !DILocation(line: 401, column: 11, scope: !915)
!923 = !DILocation(line: 404, column: 21, scope: !915)
!924 = !DILocation(line: 404, column: 28, scope: !915)
!925 = !DILocation(line: 404, column: 11, scope: !915)
!926 = !DILocation(line: 405, column: 12, scope: !916)
!927 = !DILocation(line: 406, column: 9, scope: !916)
!928 = !DILocation(line: 409, column: 9, scope: !929)
!929 = distinct !DILexicalBlock(scope: !891, file: !3, line: 409, column: 9)
!930 = !DILocation(line: 409, column: 18, scope: !929)
!931 = !DILocation(line: 409, column: 9, scope: !891)
!932 = !DILocation(line: 410, column: 7, scope: !929)
!933 = !DILocalVariable(name: "i", scope: !934, file: !3, line: 411, type: !72)
!934 = distinct !DILexicalBlock(scope: !891, file: !3, line: 411, column: 5)
!935 = !DILocation(line: 411, column: 14, scope: !934)
!936 = !DILocation(line: 411, column: 10, scope: !934)
!937 = !DILocation(line: 411, column: 21, scope: !938)
!938 = distinct !DILexicalBlock(scope: !934, file: !3, line: 411, column: 5)
!939 = !DILocation(line: 411, column: 25, scope: !938)
!940 = !DILocation(line: 411, column: 23, scope: !938)
!941 = !DILocation(line: 411, column: 5, scope: !934)
!942 = !DILocation(line: 413, column: 13, scope: !943)
!943 = distinct !DILexicalBlock(scope: !944, file: !3, line: 413, column: 13)
!944 = distinct !DILexicalBlock(scope: !938, file: !3, line: 412, column: 7)
!945 = !DILocation(line: 413, column: 15, scope: !943)
!946 = !DILocation(line: 413, column: 13, scope: !944)
!947 = !DILocation(line: 414, column: 11, scope: !943)
!948 = !DILocation(line: 415, column: 9, scope: !944)
!949 = !DILocation(line: 416, column: 25, scope: !944)
!950 = !DILocation(line: 416, column: 32, scope: !944)
!951 = !DILocation(line: 416, column: 15, scope: !944)
!952 = !DILocation(line: 416, column: 13, scope: !944)
!953 = !DILocation(line: 417, column: 13, scope: !954)
!954 = distinct !DILexicalBlock(scope: !944, file: !3, line: 417, column: 13)
!955 = !DILocation(line: 417, column: 13, scope: !944)
!956 = !DILocation(line: 418, column: 27, scope: !954)
!957 = !DILocation(line: 418, column: 32, scope: !954)
!958 = !DILocation(line: 418, column: 11, scope: !954)
!959 = !DILocation(line: 419, column: 7, scope: !944)
!960 = !DILocation(line: 411, column: 36, scope: !938)
!961 = !DILocation(line: 411, column: 5, scope: !938)
!962 = distinct !{!962, !941, !963}
!963 = !DILocation(line: 419, column: 7, scope: !934)
!964 = !DILocation(line: 420, column: 11, scope: !891)
!965 = !DILocation(line: 420, column: 5, scope: !891)
!966 = !DILocation(line: 425, column: 7, scope: !967)
!967 = distinct !DILexicalBlock(scope: !813, file: !3, line: 425, column: 7)
!968 = !DILocation(line: 425, column: 7, scope: !813)
!969 = !DILocation(line: 426, column: 13, scope: !967)
!970 = !DILocation(line: 426, column: 31, scope: !967)
!971 = !DILocation(line: 426, column: 5, scope: !967)
!972 = !DILocation(line: 427, column: 1, scope: !813)
!973 = !DILocalVariable(name: "username", arg: 1, scope: !974, file: !3, line: 357, type: !69)
!974 = distinct !DISubprogram(name: "print_full_info", scope: !3, file: !3, line: 357, type: !295, scopeLine: 358, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !975, retainedNodes: !4)
!975 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !976, nameTableKind: None)
!976 = !{!977, !979, !981, !983, !985, !995, !997, !999, !1001, !1003, !1005, !1007, !1009, !1011, !1013, !1015, !1018}
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(name: "ruid", scope: !975, file: !3, line: 64, type: !12, isLocal: true, isDefinition: true)
!979 = !DIGlobalVariableExpression(var: !980, expr: !DIExpression())
!980 = distinct !DIGlobalVariable(name: "euid", scope: !975, file: !3, line: 64, type: !12, isLocal: true, isDefinition: true)
!981 = !DIGlobalVariableExpression(var: !982, expr: !DIExpression())
!982 = distinct !DIGlobalVariable(name: "rgid", scope: !975, file: !3, line: 65, type: !21, isLocal: true, isDefinition: true)
!983 = !DIGlobalVariableExpression(var: !984, expr: !DIExpression())
!984 = distinct !DIGlobalVariable(name: "egid", scope: !975, file: !3, line: 65, type: !21, isLocal: true, isDefinition: true)
!985 = !DIGlobalVariableExpression(var: !986, expr: !DIExpression())
!986 = distinct !DIGlobalVariable(name: "longopts", scope: !975, file: !3, line: 75, type: !987, isLocal: true, isDefinition: true)
!987 = !DICompositeType(tag: DW_TAG_array_type, baseType: !988, size: 2560, elements: !76)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !989)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "option", file: !66, line: 50, size: 256, elements: !990)
!990 = !{!991, !992, !993, !994}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !989, file: !66, line: 52, baseType: !69, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "has_arg", scope: !989, file: !66, line: 55, baseType: !72, size: 32, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !989, file: !66, line: 56, baseType: !74, size: 64, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !989, file: !66, line: 57, baseType: !72, size: 32, offset: 192)
!995 = !DIGlobalVariableExpression(var: !996, expr: !DIExpression())
!996 = distinct !DIGlobalVariable(name: "just_context", scope: !975, file: !3, line: 45, type: !27, isLocal: true, isDefinition: true)
!997 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression())
!998 = distinct !DIGlobalVariable(name: "just_group", scope: !975, file: !3, line: 51, type: !27, isLocal: true, isDefinition: true)
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(name: "use_name", scope: !975, file: !3, line: 61, type: !27, isLocal: true, isDefinition: true)
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression())
!1002 = distinct !DIGlobalVariable(name: "use_real", scope: !975, file: !3, line: 53, type: !27, isLocal: true, isDefinition: true)
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression())
!1004 = distinct !DIGlobalVariable(name: "just_user", scope: !975, file: !3, line: 55, type: !27, isLocal: true, isDefinition: true)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(name: "opt_zero", scope: !975, file: !3, line: 47, type: !27, isLocal: true, isDefinition: true)
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(name: "just_group_list", scope: !975, file: !3, line: 49, type: !27, isLocal: true, isDefinition: true)
!1009 = !DIGlobalVariableExpression(var: !1010, expr: !DIExpression())
!1010 = distinct !DIGlobalVariable(name: "context", scope: !975, file: !3, line: 69, type: !6, isLocal: true, isDefinition: true)
!1011 = !DIGlobalVariableExpression(var: !1012, expr: !DIExpression())
!1012 = distinct !DIGlobalVariable(name: "multiple_users", scope: !975, file: !3, line: 59, type: !27, isLocal: true, isDefinition: true)
!1013 = !DIGlobalVariableExpression(var: !1014, expr: !DIExpression())
!1014 = distinct !DIGlobalVariable(name: "ok", scope: !975, file: !3, line: 57, type: !27, isLocal: true, isDefinition: true)
!1015 = !DIGlobalVariableExpression(var: !1016, expr: !DIExpression())
!1016 = distinct !DIGlobalVariable(name: "buf", scope: !1017, file: !3, line: 327, type: !53, isLocal: true, isDefinition: true)
!1017 = distinct !DISubprogram(name: "uidtostr_ptr", scope: !3, file: !3, line: 325, type: !49, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !975, retainedNodes: !4)
!1018 = !DIGlobalVariableExpression(var: !1019, expr: !DIExpression())
!1019 = distinct !DIGlobalVariable(name: "buf", scope: !1020, file: !3, line: 316, type: !53, isLocal: true, isDefinition: true)
!1020 = distinct !DISubprogram(name: "gidtostr_ptr", scope: !3, file: !3, line: 314, type: !59, scopeLine: 315, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !975, retainedNodes: !4)
!1021 = !DILocalVariable(name: "pwd", scope: !974, file: !3, line: 359, type: !1022)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !505, line: 49, size: 384, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028, !1029, !1030, !1031}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !1023, file: !505, line: 51, baseType: !6, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !1023, file: !505, line: 52, baseType: !6, size: 64, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !1023, file: !505, line: 54, baseType: !14, size: 32, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !1023, file: !505, line: 55, baseType: !22, size: 32, offset: 160)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !1023, file: !505, line: 56, baseType: !6, size: 64, offset: 192)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !1023, file: !505, line: 57, baseType: !6, size: 64, offset: 256)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !1023, file: !505, line: 58, baseType: !6, size: 64, offset: 320)
!1032 = !DILocalVariable(name: "grp", scope: !974, file: !3, line: 360, type: !1033)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !821, line: 42, size: 256, elements: !1035)
!1035 = !{!1036, !1037, !1038, !1039}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !1034, file: !821, line: 44, baseType: !6, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !1034, file: !821, line: 45, baseType: !6, size: 64, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !1034, file: !821, line: 46, baseType: !22, size: 32, offset: 128)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !1034, file: !821, line: 47, baseType: !184, size: 64, offset: 192)
!1040 = !DILocalVariable(name: "uid", arg: 1, scope: !48, file: !3, line: 325, type: !51)
!1041 = !DILocation(line: 325, column: 28, scope: !48)
!1042 = !DILocation(line: 328, column: 22, scope: !48)
!1043 = !DILocation(line: 328, column: 21, scope: !48)
!1044 = !DILocation(line: 328, column: 10, scope: !48)
!1045 = !DILocation(line: 328, column: 3, scope: !48)
!1046 = !DILocalVariable(name: "gid", arg: 1, scope: !58, file: !3, line: 314, type: !61)
!1047 = !DILocation(line: 314, column: 28, scope: !58)
!1048 = !DILocation(line: 317, column: 22, scope: !58)
!1049 = !DILocation(line: 317, column: 21, scope: !58)
!1050 = !DILocation(line: 317, column: 10, scope: !58)
!1051 = !DILocation(line: 317, column: 3, scope: !58)
!1052 = distinct !DISubprogram(name: "print_group_list", scope: !81, file: !81, line: 36, type: !1053, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !82, retainedNodes: !4)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!27, !69, !12, !21, !21, !27, !7}
!1055 = !DILocalVariable(name: "username", arg: 1, scope: !1052, file: !81, line: 36, type: !69)
!1056 = !DILocation(line: 36, column: 31, scope: !1052)
!1057 = !DILocalVariable(name: "ruid", arg: 2, scope: !1052, file: !81, line: 37, type: !12)
!1058 = !DILocation(line: 37, column: 25, scope: !1052)
!1059 = !DILocalVariable(name: "rgid", arg: 3, scope: !1052, file: !81, line: 37, type: !21)
!1060 = !DILocation(line: 37, column: 37, scope: !1052)
!1061 = !DILocalVariable(name: "egid", arg: 4, scope: !1052, file: !81, line: 37, type: !21)
!1062 = !DILocation(line: 37, column: 49, scope: !1052)
!1063 = !DILocalVariable(name: "use_names", arg: 5, scope: !1052, file: !81, line: 38, type: !27)
!1064 = !DILocation(line: 38, column: 24, scope: !1052)
!1065 = !DILocalVariable(name: "delim", arg: 6, scope: !1052, file: !81, line: 38, type: !7)
!1066 = !DILocation(line: 38, column: 40, scope: !1052)
!1067 = !DILocalVariable(name: "ok", scope: !1052, file: !81, line: 40, type: !27)
!1068 = !DILocation(line: 40, column: 8, scope: !1052)
!1069 = !DILocalVariable(name: "pwd", scope: !1052, file: !81, line: 41, type: !1070)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !505, line: 49, size: 384, elements: !1072)
!1072 = !{!1073, !1074, !1075, !1076, !1077, !1078, !1079}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !1071, file: !505, line: 51, baseType: !6, size: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !1071, file: !505, line: 52, baseType: !6, size: 64, offset: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !1071, file: !505, line: 54, baseType: !14, size: 32, offset: 128)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !1071, file: !505, line: 55, baseType: !22, size: 32, offset: 160)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !1071, file: !505, line: 56, baseType: !6, size: 64, offset: 192)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !1071, file: !505, line: 57, baseType: !6, size: 64, offset: 256)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !1071, file: !505, line: 58, baseType: !6, size: 64, offset: 320)
!1080 = !DILocation(line: 41, column: 18, scope: !1052)
!1081 = !DILocation(line: 43, column: 7, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1052, file: !81, line: 43, column: 7)
!1083 = !DILocation(line: 43, column: 7, scope: !1052)
!1084 = !DILocation(line: 45, column: 23, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1082, file: !81, line: 44, column: 5)
!1086 = !DILocation(line: 45, column: 13, scope: !1085)
!1087 = !DILocation(line: 45, column: 11, scope: !1085)
!1088 = !DILocation(line: 46, column: 11, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !1085, file: !81, line: 46, column: 11)
!1090 = !DILocation(line: 46, column: 15, scope: !1089)
!1091 = !DILocation(line: 46, column: 11, scope: !1085)
!1092 = !DILocation(line: 47, column: 12, scope: !1089)
!1093 = !DILocation(line: 47, column: 9, scope: !1089)
!1094 = !DILocation(line: 48, column: 5, scope: !1085)
!1095 = !DILocation(line: 50, column: 21, scope: !1096)
!1096 = distinct !DILexicalBlock(scope: !1052, file: !81, line: 50, column: 7)
!1097 = !DILocation(line: 50, column: 27, scope: !1096)
!1098 = !DILocation(line: 50, column: 8, scope: !1096)
!1099 = !DILocation(line: 50, column: 7, scope: !1052)
!1100 = !DILocation(line: 51, column: 8, scope: !1096)
!1101 = !DILocation(line: 51, column: 5, scope: !1096)
!1102 = !DILocation(line: 53, column: 7, scope: !1103)
!1103 = distinct !DILexicalBlock(scope: !1052, file: !81, line: 53, column: 7)
!1104 = !DILocation(line: 53, column: 15, scope: !1103)
!1105 = !DILocation(line: 53, column: 12, scope: !1103)
!1106 = !DILocation(line: 53, column: 7, scope: !1052)
!1107 = !DILocation(line: 55, column: 7, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1103, file: !81, line: 54, column: 5)
!1109 = !DILocation(line: 56, column: 25, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1108, file: !81, line: 56, column: 11)
!1111 = !DILocation(line: 56, column: 31, scope: !1110)
!1112 = !DILocation(line: 56, column: 12, scope: !1110)
!1113 = !DILocation(line: 56, column: 11, scope: !1108)
!1114 = !DILocation(line: 57, column: 12, scope: !1110)
!1115 = !DILocation(line: 57, column: 9, scope: !1110)
!1116 = !DILocation(line: 58, column: 5, scope: !1108)
!1117 = !DILocalVariable(name: "groups", scope: !1118, file: !81, line: 61, type: !183)
!1118 = distinct !DILexicalBlock(scope: !1052, file: !81, line: 60, column: 3)
!1119 = !DILocation(line: 61, column: 12, scope: !1118)
!1120 = !DILocalVariable(name: "n_groups", scope: !1118, file: !81, line: 63, type: !72)
!1121 = !DILocation(line: 63, column: 9, scope: !1118)
!1122 = !DILocation(line: 63, column: 32, scope: !1118)
!1123 = !DILocation(line: 63, column: 43, scope: !1118)
!1124 = !DILocation(line: 63, column: 49, scope: !1118)
!1125 = !DILocation(line: 63, column: 54, scope: !1118)
!1126 = !DILocation(line: 63, column: 63, scope: !1118)
!1127 = !DILocation(line: 63, column: 20, scope: !1118)
!1128 = !DILocation(line: 64, column: 9, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1118, file: !81, line: 64, column: 9)
!1130 = !DILocation(line: 64, column: 18, scope: !1129)
!1131 = !DILocation(line: 64, column: 9, scope: !1118)
!1132 = !DILocation(line: 66, column: 13, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1134, file: !81, line: 66, column: 13)
!1134 = distinct !DILexicalBlock(scope: !1129, file: !81, line: 65, column: 7)
!1135 = !DILocation(line: 66, column: 13, scope: !1134)
!1136 = !DILocation(line: 68, column: 23, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1133, file: !81, line: 67, column: 11)
!1138 = !DILocation(line: 68, column: 30, scope: !1137)
!1139 = !DILocation(line: 69, column: 27, scope: !1137)
!1140 = !DILocation(line: 69, column: 20, scope: !1137)
!1141 = !DILocation(line: 68, column: 13, scope: !1137)
!1142 = !DILocation(line: 70, column: 11, scope: !1137)
!1143 = !DILocation(line: 73, column: 23, scope: !1144)
!1144 = distinct !DILexicalBlock(scope: !1133, file: !81, line: 72, column: 11)
!1145 = !DILocation(line: 73, column: 30, scope: !1144)
!1146 = !DILocation(line: 73, column: 13, scope: !1144)
!1147 = !DILocation(line: 75, column: 9, scope: !1134)
!1148 = !DILocalVariable(name: "i", scope: !1149, file: !81, line: 78, type: !72)
!1149 = distinct !DILexicalBlock(scope: !1118, file: !81, line: 78, column: 5)
!1150 = !DILocation(line: 78, column: 14, scope: !1149)
!1151 = !DILocation(line: 78, column: 10, scope: !1149)
!1152 = !DILocation(line: 78, column: 21, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !1149, file: !81, line: 78, column: 5)
!1154 = !DILocation(line: 78, column: 25, scope: !1153)
!1155 = !DILocation(line: 78, column: 23, scope: !1153)
!1156 = !DILocation(line: 78, column: 5, scope: !1149)
!1157 = !DILocation(line: 79, column: 11, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1153, file: !81, line: 79, column: 11)
!1159 = !DILocation(line: 79, column: 18, scope: !1158)
!1160 = !DILocation(line: 79, column: 24, scope: !1158)
!1161 = !DILocation(line: 79, column: 21, scope: !1158)
!1162 = !DILocation(line: 79, column: 29, scope: !1158)
!1163 = !DILocation(line: 79, column: 32, scope: !1158)
!1164 = !DILocation(line: 79, column: 39, scope: !1158)
!1165 = !DILocation(line: 79, column: 45, scope: !1158)
!1166 = !DILocation(line: 79, column: 42, scope: !1158)
!1167 = !DILocation(line: 79, column: 11, scope: !1153)
!1168 = !DILocation(line: 81, column: 11, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !1158, file: !81, line: 80, column: 9)
!1170 = !DILocation(line: 82, column: 29, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !1169, file: !81, line: 82, column: 15)
!1172 = !DILocation(line: 82, column: 36, scope: !1171)
!1173 = !DILocation(line: 82, column: 40, scope: !1171)
!1174 = !DILocation(line: 82, column: 16, scope: !1171)
!1175 = !DILocation(line: 82, column: 15, scope: !1169)
!1176 = !DILocation(line: 83, column: 16, scope: !1171)
!1177 = !DILocation(line: 83, column: 13, scope: !1171)
!1178 = !DILocation(line: 84, column: 9, scope: !1169)
!1179 = !DILocation(line: 78, column: 36, scope: !1153)
!1180 = !DILocation(line: 78, column: 5, scope: !1153)
!1181 = distinct !{!1181, !1156, !1182}
!1182 = !DILocation(line: 84, column: 9, scope: !1149)
!1183 = !DILocation(line: 85, column: 11, scope: !1118)
!1184 = !DILocation(line: 85, column: 5, scope: !1118)
!1185 = !DILocation(line: 87, column: 10, scope: !1052)
!1186 = !DILocation(line: 87, column: 3, scope: !1052)
!1187 = !DILocation(line: 88, column: 1, scope: !1052)
!1188 = !DILocalVariable(name: "username", arg: 1, scope: !1189, file: !81, line: 36, type: !69)
!1189 = distinct !DISubprogram(name: "print_group_list", scope: !81, file: !81, line: 36, type: !1053, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1190, retainedNodes: !4)
!1190 = distinct !DICompileUnit(language: DW_LANG_C99, file: !81, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !83, globals: !1191, nameTableKind: None)
!1191 = !{!1192}
!1192 = !DIGlobalVariableExpression(var: !1193, expr: !DIExpression())
!1193 = distinct !DIGlobalVariable(name: "buf", scope: !1194, file: !81, line: 96, type: !53, isLocal: true, isDefinition: true)
!1194 = distinct !DISubprogram(name: "gidtostr_ptr", scope: !81, file: !81, line: 94, type: !59, scopeLine: 95, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1190, retainedNodes: !4)
!1195 = !DILocalVariable(name: "ruid", arg: 2, scope: !1189, file: !81, line: 37, type: !12)
!1196 = !DILocalVariable(name: "rgid", arg: 3, scope: !1189, file: !81, line: 37, type: !21)
!1197 = !DILocalVariable(name: "egid", arg: 4, scope: !1189, file: !81, line: 37, type: !21)
!1198 = !DILocalVariable(name: "use_names", arg: 5, scope: !1189, file: !81, line: 38, type: !27)
!1199 = !DILocalVariable(name: "delim", arg: 6, scope: !1189, file: !81, line: 38, type: !7)
!1200 = !DILocalVariable(name: "ok", scope: !1189, file: !81, line: 40, type: !27)
!1201 = !DILocalVariable(name: "pwd", scope: !1189, file: !81, line: 41, type: !1202)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !505, line: 49, size: 384, elements: !1204)
!1204 = !{!1205, !1206, !1207, !1208, !1209, !1210, !1211}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !1203, file: !505, line: 51, baseType: !6, size: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !1203, file: !505, line: 52, baseType: !6, size: 64, offset: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !1203, file: !505, line: 54, baseType: !14, size: 32, offset: 128)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !1203, file: !505, line: 55, baseType: !22, size: 32, offset: 160)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !1203, file: !505, line: 56, baseType: !6, size: 64, offset: 192)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !1203, file: !505, line: 57, baseType: !6, size: 64, offset: 256)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !1203, file: !505, line: 58, baseType: !6, size: 64, offset: 320)
!1212 = distinct !DISubprogram(name: "print_group", scope: !81, file: !81, line: 103, type: !1213, scopeLine: 104, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !82, retainedNodes: !4)
!1213 = !DISubroutineType(types: !1214)
!1214 = !{!27, !21, !27}
!1215 = !DILocalVariable(name: "gid", arg: 1, scope: !1212, file: !81, line: 103, type: !21)
!1216 = !DILocation(line: 103, column: 20, scope: !1212)
!1217 = !DILocalVariable(name: "use_name", arg: 2, scope: !1212, file: !81, line: 103, type: !27)
!1218 = !DILocation(line: 103, column: 30, scope: !1212)
!1219 = !DILocalVariable(name: "grp", scope: !1212, file: !81, line: 105, type: !1220)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !821, line: 42, size: 256, elements: !1222)
!1222 = !{!1223, !1224, !1225, !1226}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !1221, file: !821, line: 44, baseType: !6, size: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !1221, file: !821, line: 45, baseType: !6, size: 64, offset: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !1221, file: !821, line: 46, baseType: !22, size: 32, offset: 128)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !1221, file: !821, line: 47, baseType: !184, size: 64, offset: 192)
!1227 = !DILocation(line: 105, column: 17, scope: !1212)
!1228 = !DILocalVariable(name: "ok", scope: !1212, file: !81, line: 106, type: !27)
!1229 = !DILocation(line: 106, column: 8, scope: !1212)
!1230 = !DILocation(line: 108, column: 7, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !1212, file: !81, line: 108, column: 7)
!1232 = !DILocation(line: 108, column: 7, scope: !1212)
!1233 = !DILocation(line: 110, column: 23, scope: !1234)
!1234 = distinct !DILexicalBlock(scope: !1231, file: !81, line: 109, column: 5)
!1235 = !DILocation(line: 110, column: 13, scope: !1234)
!1236 = !DILocation(line: 110, column: 11, scope: !1234)
!1237 = !DILocation(line: 111, column: 11, scope: !1238)
!1238 = distinct !DILexicalBlock(scope: !1234, file: !81, line: 111, column: 11)
!1239 = !DILocation(line: 111, column: 15, scope: !1238)
!1240 = !DILocation(line: 111, column: 11, scope: !1234)
!1241 = !DILocation(line: 113, column: 24, scope: !1242)
!1242 = distinct !DILexicalBlock(scope: !1238, file: !81, line: 112, column: 9)
!1243 = !DILocation(line: 114, column: 38, scope: !1242)
!1244 = !DILocation(line: 114, column: 18, scope: !1242)
!1245 = !DILocation(line: 113, column: 11, scope: !1242)
!1246 = !DILocation(line: 115, column: 14, scope: !1242)
!1247 = !DILocation(line: 116, column: 9, scope: !1242)
!1248 = !DILocation(line: 117, column: 5, scope: !1234)
!1249 = !DILocalVariable(name: "s", scope: !1212, file: !81, line: 119, type: !6)
!1250 = !DILocation(line: 119, column: 9, scope: !1212)
!1251 = !DILocation(line: 119, column: 13, scope: !1212)
!1252 = !DILocation(line: 119, column: 19, scope: !1212)
!1253 = !DILocation(line: 119, column: 24, scope: !1212)
!1254 = !DILocation(line: 119, column: 34, scope: !1212)
!1255 = !DILocation(line: 120, column: 3, scope: !1212)
!1256 = !DILocation(line: 121, column: 10, scope: !1212)
!1257 = !DILocation(line: 121, column: 3, scope: !1212)
!1258 = !DILocalVariable(name: "gid", arg: 1, scope: !1259, file: !81, line: 103, type: !21)
!1259 = distinct !DISubprogram(name: "print_group", scope: !81, file: !81, line: 103, type: !1213, scopeLine: 104, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1260, retainedNodes: !4)
!1260 = distinct !DICompileUnit(language: DW_LANG_C99, file: !81, producer: "clang version 9.0.1-12 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !83, globals: !1261, nameTableKind: None)
!1261 = !{!1262}
!1262 = !DIGlobalVariableExpression(var: !1263, expr: !DIExpression())
!1263 = distinct !DIGlobalVariable(name: "buf", scope: !1264, file: !81, line: 96, type: !53, isLocal: true, isDefinition: true)
!1264 = distinct !DISubprogram(name: "gidtostr_ptr", scope: !81, file: !81, line: 94, type: !59, scopeLine: 95, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !1260, retainedNodes: !4)
!1265 = !DILocalVariable(name: "use_name", arg: 2, scope: !1259, file: !81, line: 103, type: !27)
!1266 = !DILocalVariable(name: "grp", scope: !1259, file: !81, line: 105, type: !1267)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !821, line: 42, size: 256, elements: !1269)
!1269 = !{!1270, !1271, !1272, !1273}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !1268, file: !821, line: 44, baseType: !6, size: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !1268, file: !821, line: 45, baseType: !6, size: 64, offset: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !1268, file: !821, line: 46, baseType: !22, size: 32, offset: 128)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !1268, file: !821, line: 47, baseType: !184, size: 64, offset: 192)
!1274 = !DILocalVariable(name: "ok", scope: !1259, file: !81, line: 106, type: !27)
!1275 = !DILocalVariable(name: "gid", arg: 1, scope: !80, file: !81, line: 94, type: !61)
!1276 = !DILocation(line: 94, column: 28, scope: !80)
!1277 = !DILocation(line: 97, column: 22, scope: !80)
!1278 = !DILocation(line: 97, column: 21, scope: !80)
!1279 = !DILocation(line: 97, column: 10, scope: !80)
!1280 = !DILocation(line: 97, column: 3, scope: !80)
!1281 = distinct !DISubprogram(name: "close_stdout", scope: !98, file: !98, line: 117, type: !1282, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !93, retainedNodes: !4)
!1282 = !DISubroutineType(types: !1283)
!1283 = !{null}
!1284 = !DILocation(line: 119, column: 21, scope: !1285)
!1285 = distinct !DILexicalBlock(scope: !1281, file: !98, line: 119, column: 7)
!1286 = !DILocation(line: 119, column: 7, scope: !1285)
!1287 = !DILocation(line: 119, column: 29, scope: !1285)
!1288 = !DILocation(line: 120, column: 7, scope: !1285)
!1289 = !DILocation(line: 120, column: 12, scope: !1285)
!1290 = !DILocation(line: 120, column: 25, scope: !1285)
!1291 = !DILocation(line: 120, column: 28, scope: !1285)
!1292 = !DILocation(line: 120, column: 34, scope: !1285)
!1293 = !DILocation(line: 119, column: 7, scope: !1281)
